; ModuleID = 'src/htsalias.c'
source_filename = "src/htsalias.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.String = type { ptr, i64, i64 }

@.str = private unnamed_addr constant [5 x i8] c"path\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"-O\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [7 x i8] c"param1\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [12 x i8] c"output path\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [7 x i8] c"mirror\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [3 x i8] c"-w\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [7 x i8] c"single\00", align 1, !dbg !26
@.str.7 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !28
@.str.8 = private unnamed_addr constant [14 x i8] c"mirror-wizard\00", align 1, !dbg !33
@.str.9 = private unnamed_addr constant [3 x i8] c"-W\00", align 1, !dbg !38
@.str.10 = private unnamed_addr constant [10 x i8] c"get-files\00", align 1, !dbg !40
@.str.11 = private unnamed_addr constant [3 x i8] c"-g\00", align 1, !dbg !45
@.str.12 = private unnamed_addr constant [6 x i8] c"quiet\00", align 1, !dbg !47
@.str.13 = private unnamed_addr constant [3 x i8] c"-q\00", align 1, !dbg !52
@.str.14 = private unnamed_addr constant [12 x i8] c"mirrorlinks\00", align 1, !dbg !54

!1299 = !DILocation(line: 417, column: 30, scope: !1297)
!1300 = !DILocation(line: 418, column: 7, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1297, file: !2, line: 418, column: 7)
!1302 = !DILocation(line: 418, column: 16, scope: !1301)
!1303 = !DILocation(line: 418, column: 7, scope: !1297)
!1304 = !DILocalVariable(name: "i", scope: !1305, file: !2, line: 419, type: !770)
!1305 = distinct !DILexicalBlock(scope: !1301, file: !2, line: 418, column: 25)
!1306 = !DILocation(line: 419, column: 9, scope: !1305)
!1307 = !DILocation(line: 421, column: 5, scope: !1305)
!1308 = !DILocation(line: 421, column: 24, scope: !1305)
!1309 = !DILocation(line: 421, column: 11, scope: !1305)
!1310 = !DILocation(line: 421, column: 33, scope: !1305)
!1311 = !DILocation(line: 422, column: 18, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !2, line: 422, column: 11)
!1313 = distinct !DILexicalBlock(scope: !1305, file: !2, line: 421, column: 42)
!1314 = !DILocation(line: 422, column: 38, scope: !1312)
!1315 = !DILocation(line: 422, column: 25, scope: !1312)
!1316 = !DILocation(line: 422, column: 11, scope: !1312)
!1317 = !DILocation(line: 422, column: 45, scope: !1312)
!1318 = !DILocation(line: 422, column: 11, scope: !1313)
!1319 = !DILocation(line: 423, column: 16, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1312, file: !2, line: 422, column: 51)
!1321 = !DILocation(line: 423, column: 9, scope: !1320)
!1322 = !DILocation(line: 425, column: 8, scope: !1313)
!1323 = distinct !{!1323, !1307, !1324, !1275}
!1324 = !DILocation(line: 426, column: 5, scope: !1305)
!1325 = !DILocation(line: 427, column: 3, scope: !1305)
!1326 = !DILocation(line: 428, column: 3, scope: !1297)
!1327 = !DILocation(line: 429, column: 1, scope: !1297)
!1328 = distinct !DISubprogram(name: "optreal_value", scope: !2, file: !2, line: 431, type: !1329, scopeLine: 431, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !765, retainedNodes: !906)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!774, !770}
!1331 = !DILocalVariable(name: "p", arg: 1, scope: !1328, file: !2, line: 431, type: !770)
!1332 = !DILocation(line: 431, column: 31, scope: !1328)
!1333 = !DILocation(line: 432, column: 23, scope: !1328)
!1334 = !DILocation(line: 432, column: 10, scope: !1328)
!1335 = !DILocation(line: 432, column: 3, scope: !1328)
!1336 = distinct !DISubprogram(name: "optalias_value", scope: !2, file: !2, line: 434, type: !1329, scopeLine: 434, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !765, retainedNodes: !906)
!1337 = !DILocalVariable(name: "p", arg: 1, scope: !1336, file: !2, line: 434, type: !770)
!1338 = !DILocation(line: 434, column: 32, scope: !1336)
!1339 = !DILocation(line: 435, column: 23, scope: !1336)
!1340 = !DILocation(line: 435, column: 10, scope: !1336)
!1341 = !DILocation(line: 435, column: 3, scope: !1336)
!1342 = distinct !DISubprogram(name: "opttype_value", scope: !2, file: !2, line: 437, type: !1329, scopeLine: 437, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !765, retainedNodes: !906)
!1343 = !DILocalVariable(name: "p", arg: 1, scope: !1342, file: !2, line: 437, type: !770)
!1344 = !DILocation(line: 437, column: 31, scope: !1342)
!1345 = !DILocation(line: 438, column: 23, scope: !1342)
!1346 = !DILocation(line: 438, column: 10, scope: !1342)
!1347 = !DILocation(line: 438, column: 3, scope: !1342)
!1348 = distinct !DISubprogram(name: "opthelp_value", scope: !2, file: !2, line: 440, type: !1329, scopeLine: 440, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !765, retainedNodes: !906)
!1349 = !DILocalVariable(name: "p", arg: 1, scope: !1348, file: !2, line: 440, type: !770)
!1350 = !DILocation(line: 440, column: 31, scope: !1348)
!1351 = !DILocation(line: 441, column: 23, scope: !1348)
!1352 = !DILocation(line: 441, column: 10, scope: !1348)
!1353 = !DILocation(line: 441, column: 3, scope: !1348)
!1354 = distinct !DISubprogram(name: "optinclude_file", scope: !2, file: !2, line: 462, type: !1355, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !765, retainedNodes: !906)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!770, !774, !904, !905, !776, !904}
!1357 = !DILocalVariable(name: "name", arg: 1, scope: !1354, file: !2, line: 462, type: !774)
!1358 = !DILocation(line: 462, column: 33, scope: !1354)
!1359 = !DILocalVariable(name: "argc", arg: 2, scope: !1354, file: !2, line: 462, type: !904)
!1360 = !DILocation(line: 462, column: 44, scope: !1354)
!1361 = !DILocalVariable(name: "argv", arg: 3, scope: !1354, file: !2, line: 462, type: !905)
!1362 = !DILocation(line: 462, column: 57, scope: !1354)
!1363 = !DILocalVariable(name: "x_argvblk", arg: 4, scope: !1354, file: !2, line: 462, type: !776)
!1364 = !DILocation(line: 462, column: 69, scope: !1354)
!1365 = !DILocalVariable(name: "x_ptr", arg: 5, scope: !1354, file: !2, line: 463, type: !904)
!1366 = !DILocation(line: 463, column: 26, scope: !1354)
!1367 = !DILocalVariable(name: "fp", scope: !1354, file: !2, line: 464, type: !1368)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1370, line: 7, baseType: !1371)
!1370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1372, line: 49, size: 1728, elements: !1373)
!1372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1373 = !{!1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1389, !1391, !1392, !1393, !1397, !1399, !1401, !1402, !1405, !1407, !1410, !1413, !1414, !1415, !1416, !1417}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1371, file: !1372, line: 51, baseType: !770, size: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1371, file: !1372, line: 54, baseType: !776, size: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1371, file: !1372, line: 55, baseType: !776, size: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1371, file: !1372, line: 56, baseType: !776, size: 64, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1371, file: !1372, line: 57, baseType: !776, size: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1371, file: !1372, line: 58, baseType: !776, size: 64, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1371, file: !1372, line: 59, baseType: !776, size: 64, offset: 384)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1371, file: !1372, line: 60, baseType: !776, size: 64, offset: 448)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1371, file: !1372, line: 61, baseType: !776, size: 64, offset: 512)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1371, file: !1372, line: 64, baseType: !776, size: 64, offset: 576)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1371, file: !1372, line: 65, baseType: !776, size: 64, offset: 640)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1371, file: !1372, line: 66, baseType: !776, size: 64, offset: 704)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1371, file: !1372, line: 68, baseType: !1387, size: 64, offset: 768)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1372, line: 36, flags: DIFlagFwdDecl)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1371, file: !1372, line: 70, baseType: !1390, size: 64, offset: 832)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1371, file: !1372, line: 72, baseType: !770, size: 32, offset: 896)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1371, file: !1372, line: 73, baseType: !770, size: 32, offset: 928)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1371, file: !1372, line: 74, baseType: !1394, size: 64, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1395, line: 152, baseType: !1396)
!1395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!1396 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1371, file: !1372, line: 77, baseType: !1398, size: 16, offset: 1024)
!1398 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1371, file: !1372, line: 78, baseType: !1400, size: 8, offset: 1040)
!1400 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1371, file: !1372, line: 79, baseType: !30, size: 8, offset: 1048)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1371, file: !1372, line: 81, baseType: !1403, size: 64, offset: 1088)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1372, line: 43, baseType: null)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1371, file: !1372, line: 89, baseType: !1406, size: 64, offset: 1152)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1395, line: 153, baseType: !1396)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1371, file: !1372, line: 91, baseType: !1408, size: 64, offset: 1216)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1372, line: 37, flags: DIFlagFwdDecl)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1371, file: !1372, line: 92, baseType: !1411, size: 64, offset: 1280)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1372, line: 38, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1371, file: !1372, line: 93, baseType: !1390, size: 64, offset: 1344)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1371, file: !1372, line: 94, baseType: !771, size: 64, offset: 1408)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1371, file: !1372, line: 95, baseType: !767, size: 64, offset: 1472)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1371, file: !1372, line: 96, baseType: !770, size: 32, offset: 1536)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1371, file: !1372, line: 98, baseType: !332, size: 160, offset: 1568)
!1418 = !DILocation(line: 464, column: 9, scope: !1354)
!1419 = !DILocation(line: 466, column: 14, scope: !1354)
!1420 = !DILocation(line: 466, column: 8, scope: !1354)
!1421 = !DILocation(line: 466, column: 6, scope: !1354)
!1422 = !DILocation(line: 467, column: 7, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1354, file: !2, line: 467, column: 7)
!1424 = !DILocation(line: 467, column: 7, scope: !1354)
!1425 = !DILocalVariable(name: "line", scope: !1426, file: !2, line: 468, type: !942)
!1426 = distinct !DILexicalBlock(scope: !1423, file: !2, line: 467, column: 11)
!1427 = !DILocation(line: 468, column: 10, scope: !1426)
!1428 = !DILocalVariable(name: "insert_after", scope: !1426, file: !2, line: 469, type: !770)
!1429 = !DILocation(line: 469, column: 9, scope: !1426)
!1430 = !DILocation(line: 471, column: 5, scope: !1426)
!1431 = !DILocation(line: 471, column: 17, scope: !1426)
!1432 = !DILocation(line: 471, column: 12, scope: !1426)
!1433 = !DILocation(line: 471, column: 11, scope: !1426)
!1434 = !DILocalVariable(name: "a", scope: !1435, file: !2, line: 472, type: !776)
!1435 = distinct !DILexicalBlock(scope: !1426, file: !2, line: 471, column: 22)
!1436 = !DILocation(line: 472, column: 13, scope: !1435)
!1437 = !DILocalVariable(name: "b", scope: !1435, file: !2, line: 472, type: !776)
!1438 = !DILocation(line: 472, column: 17, scope: !1435)
!1439 = !DILocalVariable(name: "result", scope: !1435, file: !2, line: 473, type: !770)
!1440 = !DILocation(line: 473, column: 11, scope: !1435)
!1441 = !DILocation(line: 476, column: 14, scope: !1435)
!1442 = !DILocation(line: 476, column: 18, scope: !1435)
!1443 = !DILocation(line: 476, column: 7, scope: !1435)
!1444 = !DILocation(line: 477, column: 19, scope: !1435)
!1445 = !DILocation(line: 477, column: 7, scope: !1435)
!1446 = !DILocation(line: 478, column: 11, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1435, file: !2, line: 478, column: 11)
!1448 = !DILocation(line: 478, column: 11, scope: !1435)
!1449 = !DILocation(line: 480, column: 27, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1451, file: !2, line: 480, column: 13)
!1451 = distinct !DILexicalBlock(scope: !1447, file: !2, line: 478, column: 30)
!1452 = !DILocation(line: 480, column: 13, scope: !1450)
!1453 = !DILocation(line: 480, column: 36, scope: !1450)
!1454 = !DILocation(line: 480, column: 13, scope: !1451)
!1455 = !DILocation(line: 482, column: 15, scope: !1456)
!1456 = distinct !DILexicalBlock(scope: !1450, file: !2, line: 480, column: 45)
!1457 = !DILocation(line: 482, column: 29, scope: !1456)
!1458 = !DILocation(line: 482, column: 22, scope: !1456)
!1459 = !DILocation(line: 482, column: 20, scope: !1456)
!1460 = !DILocation(line: 482, column: 35, scope: !1456)
!1461 = !DILocation(line: 482, column: 13, scope: !1456)
!1462 = !DILocation(line: 483, column: 11, scope: !1456)
!1463 = !DILocation(line: 483, column: 17, scope: !1456)
!1464 = !DILocation(line: 484, column: 16, scope: !1456)
!1465 = !DILocation(line: 484, column: 20, scope: !1456)
!1466 = distinct !{!1466, !1462, !1467, !1275}
!1467 = !DILocation(line: 484, column: 22, scope: !1456)
!1468 = !DILocation(line: 486, column: 15, scope: !1456)
!1469 = !DILocation(line: 486, column: 13, scope: !1456)
!1470 = !DILocation(line: 487, column: 11, scope: !1456)
!1471 = !DILocation(line: 487, column: 17, scope: !1456)
!1472 = !DILocation(line: 488, column: 14, scope: !1456)
!1473 = distinct !{!1473, !1470, !1472, !1275}
!1474 = !DILocation(line: 489, column: 23, scope: !1475)
!1475 = distinct !DILexicalBlock(scope: !1456, file: !2, line: 489, column: 15)
!1476 = !DILocation(line: 489, column: 15, scope: !1475)
!1477 = !DILocation(line: 489, column: 36, scope: !1475)
!1478 = !DILocation(line: 489, column: 15, scope: !1456)
!1479 = !DILocation(line: 490, column: 17, scope: !1480)
!1480 = distinct !DILexicalBlock(scope: !1481, file: !2, line: 490, column: 17)
!1481 = distinct !DILexicalBlock(scope: !1475, file: !2, line: 489, column: 42)
!1482 = !DILocation(line: 490, column: 17, scope: !1481)
!1483 = !DILocation(line: 491, column: 17, scope: !1484)
!1484 = distinct !DILexicalBlock(scope: !1480, file: !2, line: 490, column: 41)
!1485 = !DILocation(line: 492, column: 13, scope: !1484)
!1486 = !DILocation(line: 493, column: 11, scope: !1481)
!1487 = !DILocation(line: 494, column: 11, scope: !1456)
!1488 = !DILocation(line: 494, column: 17, scope: !1456)
!1489 = !DILocation(line: 495, column: 14, scope: !1456)
!1490 = distinct !{!1490, !1487, !1489, !1275}
!1491 = !DILocation(line: 497, column: 27, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1456, file: !2, line: 497, column: 15)
!1493 = !DILocation(line: 497, column: 20, scope: !1492)
!1494 = !DILocation(line: 497, column: 18, scope: !1492)
!1495 = !DILocation(line: 497, column: 15, scope: !1456)
!1496 = !DILocation(line: 498, column: 14, scope: !1492)
!1497 = !DILocation(line: 498, column: 16, scope: !1492)
!1498 = !DILocation(line: 498, column: 13, scope: !1492)
!1499 = !DILocation(line: 501, column: 15, scope: !1456)
!1500 = !DILocation(line: 501, column: 13, scope: !1456)
!1501 = !DILocation(line: 502, column: 11, scope: !1456)
!1502 = !DILocation(line: 502, column: 19, scope: !1456)
!1503 = !DILocation(line: 502, column: 37, scope: !1456)
!1504 = !DILocation(line: 502, column: 42, scope: !1456)
!1505 = !DILocation(line: 502, column: 41, scope: !1456)
!1506 = !DILocation(line: 502, column: 40, scope: !1456)
!1507 = !DILocation(line: 0, scope: !1456)
!1508 = !DILocation(line: 503, column: 14, scope: !1456)
!1509 = distinct !{!1509, !1501, !1508, !1275}
!1510 = !DILocation(line: 504, column: 16, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1456, file: !2, line: 504, column: 15)
!1512 = !DILocation(line: 504, column: 15, scope: !1511)
!1513 = !DILocation(line: 504, column: 15, scope: !1456)
!1514 = !DILocation(line: 505, column: 14, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1511, file: !2, line: 504, column: 19)
!1516 = !DILocation(line: 505, column: 16, scope: !1515)
!1517 = !DILocation(line: 506, column: 14, scope: !1515)
!1518 = !DILocation(line: 507, column: 11, scope: !1515)
!1519 = !DILocalVariable(name: "return_argc", scope: !1520, file: !2, line: 511, type: !770)
!1520 = distinct !DILexicalBlock(scope: !1456, file: !2, line: 510, column: 11)
!1521 = !DILocation(line: 511, column: 17, scope: !1520)
!1522 = !DILocalVariable(name: "return_error", scope: !1520, file: !2, line: 512, type: !942)
!1523 = !DILocation(line: 512, column: 18, scope: !1520)
!1524 = !DILocalVariable(name: "_tmp_argv", scope: !1520, file: !2, line: 513, type: !1525)
!1525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1526)
!1526 = !{!73, !1527}
!1527 = !DISubrange(count: 1024)
!1528 = !DILocation(line: 513, column: 18, scope: !1520)
!1529 = !DILocalVariable(name: "tmp_argv", scope: !1520, file: !2, line: 514, type: !1530)
!1530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 256, elements: !72)
!1531 = !DILocation(line: 514, column: 19, scope: !1520)
!1532 = !DILocation(line: 516, column: 27, scope: !1520)
!1533 = !DILocation(line: 516, column: 13, scope: !1520)
!1534 = !DILocation(line: 516, column: 25, scope: !1520)
!1535 = !DILocation(line: 517, column: 27, scope: !1520)
!1536 = !DILocation(line: 517, column: 13, scope: !1520)
!1537 = !DILocation(line: 517, column: 25, scope: !1520)
!1538 = !DILocation(line: 518, column: 27, scope: !1520)
!1539 = !DILocation(line: 518, column: 13, scope: !1520)
!1540 = !DILocation(line: 518, column: 25, scope: !1520)
!1541 = !DILocation(line: 519, column: 27, scope: !1520)
!1542 = !DILocation(line: 519, column: 13, scope: !1520)
!1543 = !DILocation(line: 519, column: 25, scope: !1520)
!1544 = !DILocation(line: 520, column: 13, scope: !1520)
!1545 = !DILocation(line: 521, column: 13, scope: !1520)
!1546 = !DILocation(line: 522, column: 13, scope: !1520)
!1547 = !DILocation(line: 525, column: 55, scope: !1520)
!1548 = !DILocation(line: 526, column: 31, scope: !1520)
!1549 = !DILocation(line: 526, column: 40, scope: !1520)
!1550 = !DILocation(line: 526, column: 46, scope: !1520)
!1551 = !DILocation(line: 525, column: 15, scope: !1520)
!1552 = !DILocation(line: 524, column: 20, scope: !1520)
!1553 = !DILocation(line: 527, column: 18, scope: !1554)
!1554 = distinct !DILexicalBlock(scope: !1520, file: !2, line: 527, column: 17)
!1555 = !DILocation(line: 527, column: 17, scope: !1520)
!1556 = !DILocation(line: 528, column: 30, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1554, file: !2, line: 527, column: 26)
!1558 = !DILocation(line: 528, column: 15, scope: !1557)
!1559 = !DILocation(line: 529, column: 13, scope: !1557)
!1560 = !DILocalVariable(name: "insert_after_argc", scope: !1561, file: !2, line: 530, type: !770)
!1561 = distinct !DILexicalBlock(scope: !1554, file: !2, line: 529, column: 20)
!1562 = !DILocation(line: 530, column: 19, scope: !1561)
!1563 = !DILocation(line: 534, column: 37, scope: !1561)
!1564 = !DILocation(line: 534, column: 36, scope: !1561)
!1565 = !DILocation(line: 534, column: 45, scope: !1561)
!1566 = !DILocation(line: 534, column: 43, scope: !1561)
!1567 = !DILocation(line: 534, column: 33, scope: !1561)
!1568 = !DILocalVariable(name: "i", scope: !1569, file: !2, line: 535, type: !770)
!1569 = distinct !DILexicalBlock(scope: !1561, file: !2, line: 535, column: 15)
!1570 = !DILocation(line: 535, column: 15, scope: !1569)
!1571 = !DILocation(line: 535, column: 15, scope: !1572)
!1572 = distinct !DILexicalBlock(scope: !1569, file: !2, line: 535, column: 15)
!1573 = !DILocation(line: 535, column: 15, scope: !1574)
!1574 = distinct !DILexicalBlock(scope: !1572, file: !2, line: 535, column: 15)
!1575 = distinct !{!1575, !1571, !1571, !1275}
!1576 = !DILocation(line: 535, column: 15, scope: !1561)
!1577 = !DILocation(line: 537, column: 23, scope: !1561)
!1578 = !DILocation(line: 537, column: 43, scope: !1561)
!1579 = !DILocation(line: 537, column: 41, scope: !1561)
!1580 = !DILocation(line: 537, column: 16, scope: !1561)
!1581 = !DILocation(line: 537, column: 21, scope: !1561)
!1582 = !DILocation(line: 538, column: 27, scope: !1561)
!1583 = !DILocation(line: 540, column: 19, scope: !1584)
!1584 = distinct !DILexicalBlock(scope: !1561, file: !2, line: 540, column: 19)
!1585 = !DILocation(line: 540, column: 31, scope: !1584)
!1586 = !DILocation(line: 540, column: 19, scope: !1561)
!1587 = !DILocation(line: 541, column: 39, scope: !1588)
!1588 = distinct !DILexicalBlock(scope: !1584, file: !2, line: 540, column: 36)
!1589 = !DILocation(line: 541, column: 38, scope: !1588)
!1590 = !DILocation(line: 541, column: 47, scope: !1588)
!1591 = !DILocation(line: 541, column: 45, scope: !1588)
!1592 = !DILocation(line: 541, column: 35, scope: !1588)
!1593 = !DILocalVariable(name: "i", scope: !1594, file: !2, line: 542, type: !770)
!1594 = distinct !DILexicalBlock(scope: !1588, file: !2, line: 542, column: 17)
!1595 = !DILocation(line: 542, column: 17, scope: !1594)
!1596 = !DILocation(line: 542, column: 17, scope: !1597)
!1597 = distinct !DILexicalBlock(scope: !1594, file: !2, line: 542, column: 17)
!1598 = !DILocation(line: 542, column: 17, scope: !1599)
!1599 = distinct !DILexicalBlock(scope: !1597, file: !2, line: 542, column: 17)
!1600 = distinct !{!1600, !1596, !1596, !1275}
!1601 = !DILocation(line: 542, column: 17, scope: !1588)
!1602 = !DILocation(line: 544, column: 25, scope: !1588)
!1603 = !DILocation(line: 544, column: 45, scope: !1588)
!1604 = !DILocation(line: 544, column: 43, scope: !1588)
!1605 = !DILocation(line: 544, column: 18, scope: !1588)
!1606 = !DILocation(line: 544, column: 23, scope: !1588)
!1607 = !DILocation(line: 545, column: 29, scope: !1588)
!1608 = !DILocation(line: 546, column: 15, scope: !1588)
!1609 = !DILocation(line: 551, column: 9, scope: !1456)
!1610 = !DILocation(line: 553, column: 7, scope: !1451)
!1611 = distinct !{!1611, !1430, !1612, !1275}
!1612 = !DILocation(line: 554, column: 5, scope: !1426)
!1613 = !DILocation(line: 555, column: 12, scope: !1426)
!1614 = !DILocation(line: 555, column: 5, scope: !1426)
!1615 = !DILocation(line: 556, column: 5, scope: !1426)
!1616 = !DILocation(line: 558, column: 3, scope: !1354)
!1617 = !DILocation(line: 559, column: 1, scope: !1354)
!1618 = distinct !DISubprogram(name: "hts_gethome", scope: !2, file: !2, line: 563, type: !1619, scopeLine: 563, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !765, retainedNodes: !906)
!1619 = !DISubroutineType(types: !1620)
!1620 = !{!774}
!1621 = !DILocalVariable(name: "home", scope: !1618, file: !2, line: 564, type: !774)
!1622 = !DILocation(line: 564, column: 15, scope: !1618)
!1623 = !DILocation(line: 564, column: 22, scope: !1618)
!1624 = !DILocation(line: 566, column: 7, scope: !1625)
!1625 = distinct !DILexicalBlock(scope: !1618, file: !2, line: 566, column: 7)
!1626 = !DILocation(line: 566, column: 7, scope: !1618)
!1627 = !DILocation(line: 567, column: 12, scope: !1625)
!1628 = !DILocation(line: 567, column: 5, scope: !1625)
!1629 = !DILocation(line: 569, column: 5, scope: !1625)
!1630 = !DILocation(line: 570, column: 1, scope: !1618)
!1631 = distinct !DISubprogram(name: "expand_home", scope: !2, file: !2, line: 573, type: !1632, scopeLine: 573, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !765, retainedNodes: !906)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{null, !1634}
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !1636, line: 57, baseType: !1637)
!1636 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !1636, line: 61, size: 192, elements: !1638)
!1638 = !{!1639, !1640, !1641}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !1637, file: !1636, line: 62, baseType: !776, size: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !1637, file: !1636, line: 63, baseType: !767, size: 64, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !1637, file: !1636, line: 64, baseType: !767, size: 64, offset: 128)
!1642 = !DILocalVariable(name: "str", arg: 1, scope: !1631, file: !2, line: 573, type: !1634)
!1643 = !DILocation(line: 573, column: 27, scope: !1631)
!1644 = !DILocation(line: 574, column: 7, scope: !1645)
!1645 = distinct !DILexicalBlock(scope: !1631, file: !2, line: 574, column: 7)
!1646 = !DILocation(line: 574, column: 26, scope: !1645)
!1647 = !DILocation(line: 574, column: 7, scope: !1631)
!1648 = !DILocalVariable(name: "tempo", scope: !1649, file: !2, line: 575, type: !1650)
!1649 = distinct !DILexicalBlock(scope: !1645, file: !2, line: 574, column: 34)
!1650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !1651)
!1651 = !{!1652}
!1652 = !DISubrange(count: 2048)
!1653 = !DILocation(line: 575, column: 17, scope: !1649)
!1654 = !DILocation(line: 577, column: 5, scope: !1649)
!1655 = !DILocation(line: 578, column: 5, scope: !1649)
!1656 = !DILocation(line: 579, column: 5, scope: !1649)
!1657 = !DILocalVariable(name: "str__", scope: !1658, file: !2, line: 579, type: !774)
!1658 = distinct !DILexicalBlock(scope: !1649, file: !2, line: 579, column: 5)
!1659 = !DILocation(line: 579, column: 5, scope: !1658)
!1660 = !DILocation(line: 579, column: 5, scope: !1661)
!1661 = distinct !DILexicalBlock(scope: !1658, file: !2, line: 579, column: 5)
!1662 = !DILocalVariable(name: "size__", scope: !1663, file: !2, line: 579, type: !767)
!1663 = distinct !DILexicalBlock(scope: !1661, file: !2, line: 579, column: 5)
!1664 = !DILocation(line: 579, column: 5, scope: !1663)
!1665 = !DILocation(line: 579, column: 5, scope: !1666)
!1666 = distinct !DILexicalBlock(scope: !1663, file: !2, line: 579, column: 5)
!1667 = !DILocalVariable(name: "str_mc_", scope: !1668, file: !2, line: 579, type: !774)
!1668 = distinct !DILexicalBlock(scope: !1666, file: !2, line: 579, column: 5)
!1669 = !DILocation(line: 579, column: 5, scope: !1668)
!1670 = !DILocalVariable(name: "size_mc_", scope: !1668, file: !2, line: 579, type: !1161)
!1671 = !DILocalVariable(name: "capacity_", scope: !1672, file: !2, line: 579, type: !1161)
!1672 = distinct !DILexicalBlock(scope: !1668, file: !2, line: 579, column: 5)
!1673 = !DILocation(line: 579, column: 5, scope: !1672)
!1674 = !DILocation(line: 579, column: 5, scope: !1675)
!1675 = distinct !DILexicalBlock(scope: !1676, file: !2, line: 579, column: 5)
!1676 = distinct !DILexicalBlock(scope: !1672, file: !2, line: 579, column: 5)
!1677 = !DILocation(line: 579, column: 5, scope: !1676)
!1678 = !DILocation(line: 579, column: 5, scope: !1679)
!1679 = distinct !DILexicalBlock(scope: !1675, file: !2, line: 579, column: 5)
!1680 = !DILocation(line: 579, column: 5, scope: !1681)
!1681 = distinct !DILexicalBlock(scope: !1675, file: !2, line: 579, column: 5)
!1682 = !DILocation(line: 579, column: 5, scope: !1683)
!1683 = distinct !DILexicalBlock(scope: !1684, file: !2, line: 579, column: 5)
!1684 = distinct !DILexicalBlock(scope: !1676, file: !2, line: 579, column: 5)
!1685 = !DILocation(line: 579, column: 5, scope: !1684)
!1686 = distinct !{!1686, !1673, !1673, !1275}
!1687 = !DILocation(line: 579, column: 5, scope: !1688)
!1688 = distinct !DILexicalBlock(scope: !1668, file: !2, line: 579, column: 5)
!1689 = !DILocation(line: 579, column: 5, scope: !1690)
!1690 = distinct !DILexicalBlock(scope: !1688, file: !2, line: 579, column: 5)
!1691 = !DILocation(line: 579, column: 5, scope: !1692)
!1692 = distinct !DILexicalBlock(scope: !1661, file: !2, line: 579, column: 5)
!1693 = !DILocation(line: 579, column: 5, scope: !1694)
!1694 = distinct !DILexicalBlock(scope: !1692, file: !2, line: 579, column: 5)
!1695 = !DILocalVariable(name: "capacity_", scope: !1696, file: !2, line: 579, type: !1161)
!1696 = distinct !DILexicalBlock(scope: !1694, file: !2, line: 579, column: 5)
!1697 = !DILocation(line: 579, column: 5, scope: !1696)
!1698 = !DILocation(line: 579, column: 5, scope: !1699)
