; ModuleID = 'src/htsback.c'
source_filename = "src/htsback.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hts_stat_struct = type { i64, i64, i64, i64, i64, i32, [2 x i64], [2 x i64], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i64 }
%struct.t_hts_htmlcheck_callbacks = type { %struct.init, %struct.uninit, %struct.start, %struct.end, %struct.chopt, %struct.preprocess, %struct.postprocess, %struct.check_html, %struct.query, %struct.query2, %struct.query3, %struct.loop, %struct.check_link, %struct.check_mime, %struct.pause, %struct.filesave, %struct.filesave2, %struct.linkdetected, %struct.linkdetected2, %struct.xfrstatus, %struct.savename, %struct.sendhead, %struct.receivehead, %struct.detect, %struct.parse, %struct.extsavename }
%struct.init = type { ptr, ptr }
%struct.uninit = type { ptr, ptr }
%struct.start = type { ptr, ptr }
%struct.end = type { ptr, ptr }
%struct.chopt = type { ptr, ptr }
%struct.preprocess = type { ptr, ptr }
%struct.postprocess = type { ptr, ptr }
%struct.check_html = type { ptr, ptr }
%struct.query = type { ptr, ptr }
%struct.query2 = type { ptr, ptr }
%struct.query3 = type { ptr, ptr }
%struct.loop = type { ptr, ptr }
%struct.check_link = type { ptr, ptr }
%struct.check_mime = type { ptr, ptr }
%struct.pause = type { ptr, ptr }
%struct.filesave = type { ptr, ptr }
%struct.filesave2 = type { ptr, ptr }

!853 = !DIEnumerator(name: "STATUSCODE_TIMEOUT", value: -2)
!854 = !DIEnumerator(name: "STATUSCODE_SLOW", value: -3)
!855 = !DIEnumerator(name: "STATUSCODE_CONNERROR", value: -4)
!856 = !DIEnumerator(name: "STATUSCODE_NON_FATAL", value: -5)
!857 = !DIEnumerator(name: "STATUSCODE_SSL_HANDSHAKE", value: -6)
!858 = !DIEnumerator(name: "STATUSCODE_TOO_BIG", value: -7)
!859 = !DIEnumerator(name: "STATUSCODE_TEST_OK", value: -10)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HTTPStatusCode", file: !823, line: 90, baseType: !840, size: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!862 = !DIEnumerator(name: "HTTP_CONTINUE", value: 100)
!863 = !DIEnumerator(name: "HTTP_SWITCHING_PROTOCOLS", value: 101)
!864 = !DIEnumerator(name: "HTTP_OK", value: 200)
!865 = !DIEnumerator(name: "HTTP_CREATED", value: 201)
!866 = !DIEnumerator(name: "HTTP_ACCEPTED", value: 202)
!867 = !DIEnumerator(name: "HTTP_NON_AUTHORITATIVE_INFORMATION", value: 203)
!868 = !DIEnumerator(name: "HTTP_NO_CONTENT", value: 204)
!869 = !DIEnumerator(name: "HTTP_RESET_CONTENT", value: 205)
!870 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!871 = !DIEnumerator(name: "HTTP_MULTIPLE_CHOICES", value: 300)
!872 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!873 = !DIEnumerator(name: "HTTP_FOUND", value: 302)
!874 = !DIEnumerator(name: "HTTP_SEE_OTHER", value: 303)
!875 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!876 = !DIEnumerator(name: "HTTP_USE_PROXY", value: 305)
!877 = !DIEnumerator(name: "HTTP_TEMPORARY_REDIRECT", value: 307)
!878 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!879 = !DIEnumerator(name: "HTTP_UNAUTHORIZED", value: 401)
!880 = !DIEnumerator(name: "HTTP_PAYMENT_REQUIRED", value: 402)
!881 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!882 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!883 = !DIEnumerator(name: "HTTP_METHOD_NOT_ALLOWED", value: 405)
!884 = !DIEnumerator(name: "HTTP_NOT_ACCEPTABLE", value: 406)
!885 = !DIEnumerator(name: "HTTP_PROXY_AUTHENTICATION_REQUIRED", value: 407)
!886 = !DIEnumerator(name: "HTTP_REQUEST_TIME_OUT", value: 408)
!887 = !DIEnumerator(name: "HTTP_CONFLICT", value: 409)
!888 = !DIEnumerator(name: "HTTP_GONE", value: 410)
!889 = !DIEnumerator(name: "HTTP_LENGTH_REQUIRED", value: 411)
!890 = !DIEnumerator(name: "HTTP_PRECONDITION_FAILED", value: 412)
!891 = !DIEnumerator(name: "HTTP_REQUEST_ENTITY_TOO_LARGE", value: 413)
!892 = !DIEnumerator(name: "HTTP_REQUEST_URI_TOO_LARGE", value: 414)
!893 = !DIEnumerator(name: "HTTP_UNSUPPORTED_MEDIA_TYPE", value: 415)
!894 = !DIEnumerator(name: "HTTP_REQUESTED_RANGE_NOT_SATISFIABLE", value: 416)
!895 = !DIEnumerator(name: "HTTP_EXPECTATION_FAILED", value: 417)
!896 = !DIEnumerator(name: "HTTP_INTERNAL_SERVER_ERROR", value: 500)
!897 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!898 = !DIEnumerator(name: "HTTP_BAD_GATEWAY", value: 502)
!899 = !DIEnumerator(name: "HTTP_SERVICE_UNAVAILABLE", value: 503)
!900 = !DIEnumerator(name: "HTTP_GATEWAY_TIME_OUT", value: 504)
!901 = !DIEnumerator(name: "HTTP_HTTP_VERSION_NOT_SUPPORTED", value: 505)
!902 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_struct_type", file: !903, line: 47, baseType: !840, size: 32, elements: !904)
!903 = !DIFile(filename: "./src/htshash.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "aa49d00442b5a2bfe1a89d2b483709db")
!904 = !{!905, !906, !907}
!905 = !DIEnumerator(name: "HASH_STRUCT_FILENAME", value: 0)
!906 = !DIEnumerator(name: "HASH_STRUCT_ADR_PATH", value: 1)
!907 = !DIEnumerator(name: "HASH_STRUCT_ORIGINAL_ADR_PATH", value: 2)
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !909, line: 46, baseType: !840, size: 32, elements: !910)
!909 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!910 = !{!911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!911 = !DIEnumerator(name: "_ISupper", value: 256)
!912 = !DIEnumerator(name: "_ISlower", value: 512)
!913 = !DIEnumerator(name: "_ISalpha", value: 1024)
!914 = !DIEnumerator(name: "_ISdigit", value: 2048)
!915 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!916 = !DIEnumerator(name: "_ISspace", value: 8192)
!917 = !DIEnumerator(name: "_ISprint", value: 16384)
!918 = !DIEnumerator(name: "_ISgraph", value: 32768)
!919 = !DIEnumerator(name: "_ISblank", value: 1)
!920 = !DIEnumerator(name: "_IScntrl", value: 2)
!921 = !DIEnumerator(name: "_ISpunct", value: 4)
!922 = !DIEnumerator(name: "_ISalnum", value: 8)
!923 = !{!924, !1023, !940, !824, !1126, !1025, !1155, !957, !1158, !1747, !1748, !840, !1755, !1757, !1006}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !926, line: 61, baseType: !927)
!926 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !928, line: 557, size: 135040, elements: !929)
!928 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!929 = !{!930, !934, !935, !936, !937, !938, !939, !941, !942, !946, !947, !948, !949, !950, !954, !955, !956, !958, !959, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !927, file: !928, line: 561, baseType: !931, size: 16384)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 2048)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !927, file: !928, line: 562, baseType: !931, size: 16384, offset: 16384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !927, file: !928, line: 563, baseType: !931, size: 16384, offset: 32768)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !927, file: !928, line: 564, baseType: !931, size: 16384, offset: 49152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !927, file: !928, line: 565, baseType: !931, size: 16384, offset: 65536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !927, file: !928, line: 566, baseType: !931, size: 16384, offset: 81920)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !927, file: !928, line: 567, baseType: !940, size: 64, offset: 98304)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !927, file: !928, line: 568, baseType: !931, size: 16384, offset: 98368)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !927, file: !928, line: 569, baseType: !943, size: 8192, offset: 114752)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 1024)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !927, file: !928, line: 570, baseType: !824, size: 32, offset: 122944)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !927, file: !928, line: 571, baseType: !824, size: 32, offset: 122976)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !927, file: !928, line: 572, baseType: !824, size: 32, offset: 123008)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !927, file: !928, line: 573, baseType: !824, size: 32, offset: 123040)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !927, file: !928, line: 574, baseType: !951, size: 64, offset: 123072)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !952, line: 284, baseType: !953)
!952 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!953 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !927, file: !928, line: 575, baseType: !824, size: 32, offset: 123136)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !927, file: !928, line: 576, baseType: !951, size: 64, offset: 123200)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !927, file: !928, line: 577, baseType: !957, size: 64, offset: 123264)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !952, line: 283, baseType: !953)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !927, file: !928, line: 578, baseType: !957, size: 64, offset: 123328)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !927, file: !928, line: 579, baseType: !960, size: 8960, offset: 123392)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !799, line: 47, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !928, line: 486, size: 8960, elements: !962)
!962 = !{!963, !964, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1040, !1097, !1098, !1099, !1100, !1105, !1106, !1110, !1111, !1112, !1113, !1114, !1115}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !961, file: !928, line: 487, baseType: !824, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !961, file: !928, line: 488, baseType: !965, size: 16, offset: 32)
!965 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !961, file: !928, line: 489, baseType: !965, size: 16, offset: 48)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !961, file: !928, line: 490, baseType: !965, size: 16, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !961, file: !928, line: 491, baseType: !965, size: 16, offset: 80)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !961, file: !928, line: 492, baseType: !965, size: 16, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !961, file: !928, line: 493, baseType: !965, size: 16, offset: 112)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !961, file: !928, line: 494, baseType: !965, size: 16, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !961, file: !928, line: 495, baseType: !824, size: 32, offset: 160)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !961, file: !928, line: 496, baseType: !824, size: 32, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !961, file: !928, line: 497, baseType: !940, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !961, file: !928, line: 498, baseType: !940, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !961, file: !928, line: 499, baseType: !977, size: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !979, line: 7, baseType: !980)
!979 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !981, line: 49, size: 1728, elements: !982)
!981 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !998, !1000, !1001, !1002, !1005, !1007, !1009, !1010, !1013, !1015, !1018, !1021, !1022, !1024, !1028, !1029}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !980, file: !981, line: 51, baseType: !824, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !980, file: !981, line: 54, baseType: !940, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !980, file: !981, line: 55, baseType: !940, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !980, file: !981, line: 56, baseType: !940, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !980, file: !981, line: 57, baseType: !940, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !980, file: !981, line: 58, baseType: !940, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !980, file: !981, line: 59, baseType: !940, size: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !980, file: !981, line: 60, baseType: !940, size: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !980, file: !981, line: 61, baseType: !940, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !980, file: !981, line: 64, baseType: !940, size: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !980, file: !981, line: 65, baseType: !940, size: 64, offset: 640)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !980, file: !981, line: 66, baseType: !940, size: 64, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !980, file: !981, line: 68, baseType: !996, size: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !981, line: 36, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !980, file: !981, line: 70, baseType: !999, size: 64, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !980, file: !981, line: 72, baseType: !824, size: 32, offset: 896)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !980, file: !981, line: 73, baseType: !824, size: 32, offset: 928)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !980, file: !981, line: 74, baseType: !1003, size: 64, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1004, line: 152, baseType: !953)
!1004 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !980, file: !981, line: 77, baseType: !1006, size: 16, offset: 1024)
!1006 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !980, file: !981, line: 78, baseType: !1008, size: 8, offset: 1040)
!1008 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !980, file: !981, line: 79, baseType: !211, size: 8, offset: 1048)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !980, file: !981, line: 81, baseType: !1011, size: 64, offset: 1088)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !981, line: 43, baseType: null)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !980, file: !981, line: 89, baseType: !1014, size: 64, offset: 1152)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1004, line: 153, baseType: !953)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !980, file: !981, line: 91, baseType: !1016, size: 64, offset: 1216)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !981, line: 37, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !980, file: !981, line: 92, baseType: !1019, size: 64, offset: 1280)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !981, line: 38, flags: DIFlagFwdDecl)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !980, file: !981, line: 93, baseType: !999, size: 64, offset: 1344)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !980, file: !981, line: 94, baseType: !1023, size: 64, offset: 1408)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !980, file: !981, line: 95, baseType: !1025, size: 64, offset: 1472)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1026, line: 46, baseType: !1027)
!1026 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!1027 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !980, file: !981, line: 96, baseType: !824, size: 32, offset: 1536)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !980, file: !981, line: 98, baseType: !54, size: 160, offset: 1568)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !961, file: !928, line: 500, baseType: !957, size: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !961, file: !928, line: 501, baseType: !623, size: 640, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !961, file: !928, line: 502, baseType: !355, size: 512, offset: 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !961, file: !928, line: 503, baseType: !355, size: 512, offset: 1664)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !961, file: !928, line: 504, baseType: !355, size: 512, offset: 2176)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !961, file: !928, line: 505, baseType: !940, size: 64, offset: 2688)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !961, file: !928, line: 506, baseType: !957, size: 64, offset: 2752)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !961, file: !928, line: 507, baseType: !965, size: 16, offset: 2816)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !961, file: !928, line: 508, baseType: !1039, size: 32, offset: 2848)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !952, line: 323, baseType: !824)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !961, file: !928, line: 509, baseType: !1041, size: 224, offset: 2880)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !1042, line: 91, baseType: !1043)
!1042 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !1042, line: 93, size: 224, elements: !1044)
!1044 = !{!1045}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !1043, file: !1042, line: 103, baseType: !1046, size: 224)
!1046 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1043, file: !1042, line: 94, size: 224, elements: !1047)
!1047 = !{!1048, !1056, !1076}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1046, file: !1042, line: 96, baseType: !1049, size: 128)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1050, line: 180, size: 128, elements: !1051)
!1050 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1051 = !{!1052, !1055}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1049, file: !1050, line: 182, baseType: !1053, size: 16)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1054, line: 28, baseType: !1006)
!1054 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1049, file: !1050, line: 183, baseType: !66, size: 112, offset: 16)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1046, file: !1042, line: 98, baseType: !1057, size: 128)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1058, line: 245, size: 128, elements: !1059)
!1058 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!1059 = !{!1060, !1061, !1066, !1073}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1057, file: !1058, line: 247, baseType: !1053, size: 16)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1057, file: !1058, line: 248, baseType: !1062, size: 16, offset: 16)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1058, line: 123, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1064, line: 25, baseType: !1065)
!1064 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !1004, line: 40, baseType: !1006)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1057, file: !1058, line: 249, baseType: !1067, size: 32, offset: 32)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1058, line: 31, size: 32, elements: !1068)
!1068 = !{!1069}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1067, file: !1058, line: 33, baseType: !1070, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1058, line: 30, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1064, line: 26, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !1004, line: 42, baseType: !840)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1057, file: !1058, line: 252, baseType: !1074, size: 64, offset: 64)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 64, elements: !79)
!1075 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1046, file: !1042, line: 101, baseType: !1077, size: 224)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1058, line: 260, size: 224, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1096}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1077, file: !1058, line: 262, baseType: !1053, size: 16)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1077, file: !1058, line: 263, baseType: !1062, size: 16, offset: 16)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1077, file: !1058, line: 264, baseType: !1071, size: 32, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1077, file: !1058, line: 265, baseType: !1083, size: 128, offset: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1058, line: 219, size: 128, elements: !1084)
!1084 = !{!1085}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1083, file: !1058, line: 226, baseType: !1086, size: 128)
!1086 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1083, file: !1058, line: 221, size: 128, elements: !1087)
!1087 = !{!1088, !1092, !1094}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1086, file: !1058, line: 223, baseType: !1089, size: 128)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 128, elements: !20)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1064, line: 24, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !1004, line: 38, baseType: !1075)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1086, file: !1058, line: 224, baseType: !1093, size: 128)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 128, elements: !79)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1086, file: !1058, line: 225, baseType: !1095, size: 128)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1071, size: 128, elements: !191)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1077, file: !1058, line: 266, baseType: !1071, size: 32, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !961, file: !928, line: 510, baseType: !824, size: 32, offset: 3104)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !961, file: !928, line: 511, baseType: !977, size: 64, offset: 3136)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !961, file: !928, line: 513, baseType: !965, size: 16, offset: 3200)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !961, file: !928, line: 515, baseType: !1101, size: 64, offset: 3264)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !1103, line: 184, baseType: !1104)
!1103 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !1103, line: 184, flags: DIFlagFwdDecl)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !961, file: !928, line: 517, baseType: !355, size: 512, offset: 3328)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !961, file: !928, line: 518, baseType: !1107, size: 2048, offset: 3840)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !961, file: !928, line: 519, baseType: !1107, size: 2048, offset: 5888)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !961, file: !928, line: 520, baseType: !957, size: 64, offset: 7936)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !961, file: !928, line: 521, baseType: !957, size: 64, offset: 8000)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !961, file: !928, line: 522, baseType: !957, size: 64, offset: 8064)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !961, file: !928, line: 523, baseType: !824, size: 32, offset: 8128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !961, file: !928, line: 525, baseType: !1116, size: 768, offset: 8192)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !799, line: 43, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !928, line: 465, size: 768, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1128, !1129, !1130, !1131, !1132, !1133}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1117, file: !928, line: 466, baseType: !965, size: 16)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1117, file: !928, line: 467, baseType: !965, size: 16, offset: 16)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1117, file: !928, line: 468, baseType: !965, size: 16, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !1117, file: !928, line: 469, baseType: !965, size: 16, offset: 48)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1117, file: !928, line: 470, baseType: !965, size: 16, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !1117, file: !928, line: 471, baseType: !965, size: 16, offset: 80)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1117, file: !928, line: 472, baseType: !1126, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1117, file: !928, line: 473, baseType: !1126, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1117, file: !928, line: 474, baseType: !1126, size: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1117, file: !928, line: 475, baseType: !1126, size: 64, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1117, file: !928, line: 476, baseType: !1126, size: 64, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1117, file: !928, line: 477, baseType: !1126, size: 64, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1117, file: !928, line: 478, baseType: !1134, size: 256, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !928, line: 452, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !928, line: 454, size: 256, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1135, file: !928, line: 455, baseType: !824, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1135, file: !928, line: 456, baseType: !1126, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1135, file: !928, line: 457, baseType: !824, size: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1135, file: !928, line: 458, baseType: !1126, size: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !927, file: !928, line: 580, baseType: !824, size: 32, offset: 132352)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !927, file: !928, line: 581, baseType: !824, size: 32, offset: 132384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !927, file: !928, line: 582, baseType: !957, size: 64, offset: 132416)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !927, file: !928, line: 583, baseType: !951, size: 64, offset: 132480)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !927, file: !928, line: 585, baseType: !824, size: 32, offset: 132544)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !927, file: !928, line: 586, baseType: !824, size: 32, offset: 132576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !927, file: !928, line: 587, baseType: !940, size: 64, offset: 132608)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !927, file: !928, line: 588, baseType: !957, size: 64, offset: 132672)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !927, file: !928, line: 589, baseType: !957, size: 64, offset: 132736)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !927, file: !928, line: 590, baseType: !957, size: 64, offset: 132800)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !927, file: !928, line: 594, baseType: !1107, size: 2048, offset: 132864)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !927, file: !928, line: 595, baseType: !824, size: 32, offset: 134912)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !927, file: !928, line: 596, baseType: !824, size: 32, offset: 134944)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !927, file: !928, line: 597, baseType: !824, size: 32, offset: 134976)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{null, !940}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !1160, line: 164, baseType: !1161)
!1160 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !1160, line: 191, size: 3328, elements: !1162)
!1162 = !{!1163, !1182, !1188, !1531, !1537, !1543, !1553, !1559, !1568, !1577, !1583, !1589, !1629, !1638, !1647, !1656, !1662, !1671, !1680, !1689, !1698, !1707, !1717, !1723, !1735, !1741}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1161, file: !1160, line: 193, baseType: !1164, size: 128)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !1160, line: 193, size: 128, elements: !1165)
!1165 = !{!1166, !1181}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1164, file: !1160, line: 193, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !1160, line: 83, baseType: !1168)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null, !1171}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !1160, line: 60, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !1160, line: 179, size: 192, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !1173, file: !1160, line: 181, baseType: !1023, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1173, file: !1160, line: 187, baseType: !1177, size: 128, offset: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !1160, line: 184, size: 128, elements: !1178)
!1178 = !{!1179, !1180}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1177, file: !1160, line: 185, baseType: !1023, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1177, file: !1160, line: 186, baseType: !1171, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1164, file: !1160, line: 193, baseType: !1171, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1161, file: !1160, line: 194, baseType: !1183, size: 128, offset: 128)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !1160, line: 194, size: 128, elements: !1184)
!1184 = !{!1185, !1187}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1183, file: !1160, line: 194, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !1160, line: 84, baseType: !1168)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1183, file: !1160, line: 194, baseType: !1171, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1161, file: !1160, line: 195, baseType: !1189, size: 128, offset: 256)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !1160, line: 195, size: 128, elements: !1190)
!1190 = !{!1191, !1530}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1189, file: !1160, line: 195, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !1160, line: 85, baseType: !1193)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!824, !1171, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !839, line: 49, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !928, line: 294, size: 1133184, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1228, !1229, !1230, !1231, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1319, !1360, !1363, !1364, !1368, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1412}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !1198, file: !928, line: 295, baseType: !1025, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !1198, file: !928, line: 297, baseType: !824, size: 32, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1198, file: !928, line: 298, baseType: !824, size: 32, offset: 96)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !1198, file: !928, line: 299, baseType: !824, size: 32, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !1198, file: !928, line: 300, baseType: !824, size: 32, offset: 160)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1198, file: !928, line: 301, baseType: !824, size: 32, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !1198, file: !928, line: 302, baseType: !824, size: 32, offset: 224)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !1198, file: !928, line: 303, baseType: !824, size: 32, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !1198, file: !928, line: 304, baseType: !824, size: 32, offset: 288)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1198, file: !928, line: 305, baseType: !824, size: 32, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !1198, file: !928, line: 306, baseType: !824, size: 32, offset: 352)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1198, file: !928, line: 307, baseType: !977, size: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !1198, file: !928, line: 308, baseType: !977, size: 64, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !1198, file: !928, line: 309, baseType: !957, size: 64, offset: 512)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1198, file: !928, line: 310, baseType: !957, size: 64, offset: 576)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1198, file: !928, line: 311, baseType: !957, size: 64, offset: 640)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !1198, file: !928, line: 312, baseType: !824, size: 32, offset: 704)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !1198, file: !928, line: 313, baseType: !957, size: 64, offset: 768)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !1198, file: !928, line: 314, baseType: !824, size: 32, offset: 832)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !1198, file: !928, line: 315, baseType: !824, size: 32, offset: 864)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !1198, file: !928, line: 316, baseType: !824, size: 32, offset: 896)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !1198, file: !928, line: 317, baseType: !824, size: 32, offset: 928)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1198, file: !928, line: 318, baseType: !824, size: 32, offset: 960)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1198, file: !928, line: 319, baseType: !824, size: 32, offset: 992)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !1198, file: !928, line: 320, baseType: !824, size: 32, offset: 1024)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !1198, file: !928, line: 321, baseType: !824, size: 32, offset: 1056)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !1198, file: !928, line: 322, baseType: !1227, size: 32, offset: 1088)
!1227 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !1198, file: !928, line: 323, baseType: !824, size: 32, offset: 1120)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1198, file: !928, line: 324, baseType: !824, size: 32, offset: 1152)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !1198, file: !928, line: 326, baseType: !824, size: 32, offset: 1184)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1198, file: !928, line: 327, baseType: !1232, size: 512, offset: 1216)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !928, line: 89, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !928, line: 91, size: 512, elements: !1234)
!1234 = !{!1235, !1236, !1244, !1245}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1233, file: !928, line: 92, baseType: !824, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1233, file: !928, line: 93, baseType: !1237, size: 192, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !1238, line: 57, baseType: !1239)
!1238 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !1238, line: 61, size: 192, elements: !1240)
!1240 = !{!1241, !1242, !1243}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !1239, file: !1238, line: 62, baseType: !940, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !1239, file: !1238, line: 63, baseType: !1025, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !1239, file: !1238, line: 64, baseType: !1025, size: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1233, file: !928, line: 94, baseType: !824, size: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1233, file: !928, line: 95, baseType: !1237, size: 192, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !1198, file: !928, line: 328, baseType: !824, size: 32, offset: 1728)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !1198, file: !928, line: 329, baseType: !824, size: 32, offset: 1760)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !1198, file: !928, line: 330, baseType: !1237, size: 192, offset: 1792)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !1198, file: !928, line: 331, baseType: !824, size: 32, offset: 1984)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !1198, file: !928, line: 332, baseType: !824, size: 32, offset: 2016)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !1198, file: !928, line: 333, baseType: !824, size: 32, offset: 2048)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1198, file: !928, line: 334, baseType: !824, size: 32, offset: 2080)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1198, file: !928, line: 335, baseType: !1237, size: 192, offset: 2112)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1198, file: !928, line: 336, baseType: !1237, size: 192, offset: 2304)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1198, file: !928, line: 337, baseType: !1237, size: 192, offset: 2496)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !1198, file: !928, line: 338, baseType: !1237, size: 192, offset: 2688)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !1198, file: !928, line: 339, baseType: !1237, size: 192, offset: 2880)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !1198, file: !928, line: 340, baseType: !1237, size: 192, offset: 3072)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !1198, file: !928, line: 341, baseType: !1237, size: 192, offset: 3264)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1198, file: !928, line: 342, baseType: !824, size: 32, offset: 3456)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !1198, file: !928, line: 343, baseType: !824, size: 32, offset: 3488)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !1198, file: !928, line: 344, baseType: !824, size: 32, offset: 3520)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !1198, file: !928, line: 345, baseType: !824, size: 32, offset: 3552)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !1198, file: !928, line: 346, baseType: !824, size: 32, offset: 3584)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !1198, file: !928, line: 347, baseType: !824, size: 32, offset: 3616)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !1198, file: !928, line: 348, baseType: !824, size: 32, offset: 3648)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !1198, file: !928, line: 349, baseType: !824, size: 32, offset: 3680)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !1198, file: !928, line: 350, baseType: !824, size: 32, offset: 3712)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1198, file: !928, line: 351, baseType: !824, size: 32, offset: 3744)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !1198, file: !928, line: 352, baseType: !824, size: 32, offset: 3776)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !1198, file: !928, line: 353, baseType: !824, size: 32, offset: 3808)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !1198, file: !928, line: 354, baseType: !824, size: 32, offset: 3840)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !1198, file: !928, line: 355, baseType: !1237, size: 192, offset: 3904)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !1198, file: !928, line: 356, baseType: !824, size: 32, offset: 4096)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !1198, file: !928, line: 357, baseType: !824, size: 32, offset: 4128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1198, file: !928, line: 358, baseType: !1277, size: 64, offset: 4160)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !1279, line: 53, baseType: !1280)
!1279 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !1279, line: 55, size: 278656, elements: !1281)
!1281 = !{!1282, !1283, !1287}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !1280, file: !1279, line: 56, baseType: !824, size: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1280, file: !1279, line: 57, baseType: !1284, size: 262144, offset: 32)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !1285)
!1285 = !{!1286}
!1286 = !DISubrange(count: 32768)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !1280, file: !1279, line: 58, baseType: !1288, size: 16448, offset: 262208)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !1279, line: 42, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !1279, line: 44, size: 16448, elements: !1290)
!1290 = !{!1291, !1292, !1293}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1289, file: !1279, line: 45, baseType: !943, size: 8192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !1289, file: !1279, line: 46, baseType: !943, size: 8192, offset: 8192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1289, file: !1279, line: 47, baseType: !1294, size: 64, offset: 16384)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !1198, file: !928, line: 359, baseType: !824, size: 32, offset: 4224)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1198, file: !928, line: 360, baseType: !824, size: 32, offset: 4256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1198, file: !928, line: 361, baseType: !824, size: 32, offset: 4288)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !1198, file: !928, line: 362, baseType: !824, size: 32, offset: 4320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !1198, file: !928, line: 363, baseType: !824, size: 32, offset: 4352)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !1198, file: !928, line: 364, baseType: !824, size: 32, offset: 4384)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !1198, file: !928, line: 365, baseType: !824, size: 32, offset: 4416)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !1198, file: !928, line: 366, baseType: !824, size: 32, offset: 4448)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !1198, file: !928, line: 367, baseType: !824, size: 32, offset: 4480)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !1198, file: !928, line: 368, baseType: !824, size: 32, offset: 4512)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1198, file: !928, line: 369, baseType: !1237, size: 192, offset: 4544)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !1198, file: !928, line: 370, baseType: !824, size: 32, offset: 4736)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !1198, file: !928, line: 372, baseType: !824, size: 32, offset: 4768)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !1198, file: !928, line: 373, baseType: !1237, size: 192, offset: 4800)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !1198, file: !928, line: 374, baseType: !1237, size: 192, offset: 4992)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1198, file: !928, line: 375, baseType: !1311, size: 128, offset: 5184)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !928, line: 101, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !928, line: 103, size: 128, elements: !1313)
!1313 = !{!1314, !1317}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1312, file: !928, line: 104, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !1312, file: !928, line: 105, baseType: !1318, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1198, file: !928, line: 376, baseType: !1320, size: 64, offset: 5312)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !926, line: 73, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !926, line: 202, size: 98624, elements: !1323)
!1323 = !{!1324, !1347, !1351, !1352, !1353, !1354, !1355, !1356}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !1322, file: !926, line: 204, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1329)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !926, line: 57, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !928, line: 534, size: 640, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1332, file: !928, line: 535, baseType: !940, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !1332, file: !928, line: 536, baseType: !940, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !1332, file: !928, line: 537, baseType: !940, size: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !1332, file: !928, line: 538, baseType: !940, size: 64, offset: 192)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !1332, file: !928, line: 539, baseType: !940, size: 64, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !1332, file: !928, line: 540, baseType: !940, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !1332, file: !928, line: 542, baseType: !824, size: 32, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !1332, file: !928, line: 543, baseType: !824, size: 32, offset: 416)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1332, file: !928, line: 544, baseType: !824, size: 32, offset: 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !1332, file: !928, line: 545, baseType: !824, size: 32, offset: 480)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !1332, file: !928, line: 546, baseType: !4, size: 8, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1332, file: !928, line: 548, baseType: !824, size: 32, offset: 544)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1332, file: !928, line: 549, baseType: !824, size: 32, offset: 576)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !1322, file: !926, line: 206, baseType: !1348, size: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !928, line: 210, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !928, line: 210, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !1322, file: !926, line: 208, baseType: !1348, size: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !1322, file: !926, line: 210, baseType: !1348, size: 64, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !1322, file: !926, line: 212, baseType: !824, size: 32, offset: 256)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !1322, file: !926, line: 213, baseType: !931, size: 16384, offset: 288)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !1322, file: !926, line: 214, baseType: !931, size: 16384, offset: 16672)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !1322, file: !926, line: 215, baseType: !1357, size: 65536, offset: 33056)
!1357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !1358)
!1358 = !{!1359}
!1359 = !DISubrange(count: 8192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !1198, file: !928, line: 377, baseType: !1361, size: 64, offset: 5376)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !1198, file: !928, line: 378, baseType: !824, size: 32, offset: 5440)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !1198, file: !928, line: 379, baseType: !1365, size: 64, offset: 5504)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !928, line: 286, baseType: !1367)
!1367 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !928, line: 286, flags: DIFlagFwdDecl)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !1198, file: !928, line: 380, baseType: !1369, size: 64, offset: 5568)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !928, line: 61, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !1372, line: 42, size: 33856, elements: !1373)
!1372 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!1373 = !{!1374, !1378, !1382}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1371, file: !1372, line: 43, baseType: !1375, size: 1024)
!1375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !1376)
!1376 = !{!1377}
!1377 = !DISubrange(count: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !1371, file: !1372, line: 44, baseType: !1379, size: 32768, offset: 1024)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1380)
!1380 = !{!1381}
!1381 = !DISubrange(count: 4096)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1371, file: !1372, line: 45, baseType: !1383, size: 64, offset: 33792)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1198, file: !928, line: 381, baseType: !1237, size: 192, offset: 5632)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1198, file: !928, line: 382, baseType: !1237, size: 192, offset: 5824)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1198, file: !928, line: 383, baseType: !1237, size: 192, offset: 6016)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !1198, file: !928, line: 384, baseType: !1237, size: 192, offset: 6208)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !1198, file: !928, line: 385, baseType: !1237, size: 192, offset: 6400)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !1198, file: !928, line: 386, baseType: !824, size: 32, offset: 6592)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !1198, file: !928, line: 388, baseType: !824, size: 32, offset: 6624)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !1198, file: !928, line: 389, baseType: !824, size: 32, offset: 6656)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1198, file: !928, line: 391, baseType: !1126, size: 64, offset: 6720)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !1198, file: !928, line: 393, baseType: !824, size: 32, offset: 6784)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !1198, file: !928, line: 394, baseType: !824, size: 32, offset: 6816)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !1198, file: !928, line: 395, baseType: !824, size: 32, offset: 6848)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !1198, file: !928, line: 396, baseType: !824, size: 32, offset: 6880)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1198, file: !928, line: 398, baseType: !824, size: 32, offset: 6912)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !1198, file: !928, line: 399, baseType: !824, size: 32, offset: 6944)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !1198, file: !928, line: 402, baseType: !1158, size: 64, offset: 6976)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !1198, file: !928, line: 404, baseType: !1401, size: 128, offset: 7040)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !928, line: 260, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !928, line: 270, size: 128, elements: !1403)
!1403 = !{!1404, !1405}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1402, file: !928, line: 271, baseType: !824, size: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1402, file: !928, line: 272, baseType: !1406, size: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !928, line: 264, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !928, line: 266, size: 128, elements: !1409)
!1409 = !{!1410, !1411}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !1408, file: !928, line: 267, baseType: !940, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1408, file: !928, line: 268, baseType: !1023, size: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1198, file: !928, line: 406, baseType: !1413, size: 1126016, offset: 7168)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !928, line: 216, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !928, line: 218, size: 1126016, elements: !1415)
!1415 = !{!1416, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1461, !1473, !1481, !1487, !1494, !1495, !1496, !1497, !1507, !1508, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1526, !1527, !1528, !1529}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1414, file: !928, line: 219, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !928, line: 204, baseType: !1418)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !1420, line: 59, size: 320, elements: !1421)
!1420 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!1421 = !{!1422}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1419, file: !1420, line: 60, baseType: !1423, size: 320)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1424, line: 72, baseType: !1425)
!1424 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!1425 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1424, line: 67, size: 320, elements: !1426)
!1426 = !{!1427, !1446, !1447}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1425, file: !1424, line: 69, baseType: !1428, size: 320)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1429, line: 22, size: 320, elements: !1430)
!1429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!1430 = !{!1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1428, file: !1429, line: 24, baseType: !824, size: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1428, file: !1429, line: 25, baseType: !840, size: 32, offset: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1428, file: !1429, line: 26, baseType: !824, size: 32, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1428, file: !1429, line: 28, baseType: !840, size: 32, offset: 96)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1428, file: !1429, line: 32, baseType: !824, size: 32, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1428, file: !1429, line: 34, baseType: !965, size: 16, offset: 160)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1428, file: !1429, line: 35, baseType: !965, size: 16, offset: 176)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1428, file: !1429, line: 36, baseType: !1439, size: 128, offset: 192)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1440, line: 55, baseType: !1441)
!1440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1440, line: 51, size: 128, elements: !1442)
!1442 = !{!1443, !1445}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1441, file: !1440, line: 53, baseType: !1444, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1441, file: !1440, line: 54, baseType: !1444, size: 64, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1425, file: !1424, line: 70, baseType: !523, size: 320)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1425, file: !1424, line: 71, baseType: !953, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1414, file: !928, line: 221, baseType: !824, size: 32, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !1414, file: !928, line: 222, baseType: !824, size: 32, offset: 96)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !1414, file: !928, line: 223, baseType: !824, size: 32, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !1414, file: !928, line: 225, baseType: !824, size: 32, offset: 160)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !1414, file: !928, line: 226, baseType: !1237, size: 192, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !1414, file: !928, line: 227, baseType: !977, size: 64, offset: 384)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !1414, file: !928, line: 228, baseType: !824, size: 32, offset: 448)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !1414, file: !928, line: 230, baseType: !1456, size: 32832, offset: 512)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !928, line: 121, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !928, line: 123, size: 32832, elements: !1458)
!1458 = !{!1459, !1460}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !1457, file: !928, line: 124, baseType: !977, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1457, file: !928, line: 125, baseType: !1379, size: 32768, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1414, file: !928, line: 232, baseType: !1462, size: 192, offset: 33344)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !928, line: 111, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !928, line: 112, size: 192, elements: !1464)
!1464 = !{!1465, !1466, !1471}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !1463, file: !928, line: 113, baseType: !1023, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !1463, file: !928, line: 114, baseType: !1467, size: 64, offset: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !928, line: 110, baseType: !1468)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!824}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1463, file: !928, line: 115, baseType: !1472, size: 64, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !1414, file: !928, line: 233, baseType: !1474, size: 1048608, offset: 33536)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !928, line: 131, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !928, line: 133, size: 1048608, elements: !1476)
!1476 = !{!1477, !1478}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1475, file: !928, line: 134, baseType: !824, size: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1475, file: !928, line: 135, baseType: !1479, size: 1048576, offset: 32)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !1480)
!1480 = !{!21, !1359}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !1414, file: !928, line: 234, baseType: !1482, size: 16416, offset: 1082144)
!1482 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !928, line: 153, baseType: !1483)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !928, line: 155, size: 16416, elements: !1484)
!1484 = !{!1485, !1486}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !1483, file: !928, line: 156, baseType: !824, size: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !1483, file: !928, line: 157, baseType: !931, size: 16384, offset: 32)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !1414, file: !928, line: 235, baseType: !1488, size: 96, offset: 1098560)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !928, line: 163, baseType: !1489)
!1489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !928, line: 165, size: 96, elements: !1490)
!1490 = !{!1491, !1492, !1493}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1489, file: !928, line: 166, baseType: !824, size: 32)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !1489, file: !928, line: 167, baseType: !824, size: 32, offset: 32)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1489, file: !928, line: 168, baseType: !824, size: 32, offset: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !1414, file: !928, line: 236, baseType: !940, size: 64, offset: 1098688)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !1414, file: !928, line: 237, baseType: !824, size: 32, offset: 1098752)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !1414, file: !928, line: 238, baseType: !824, size: 32, offset: 1098784)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !1414, file: !928, line: 239, baseType: !1498, size: 64, offset: 1098816)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64)
!1499 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !799, line: 51, baseType: !1500)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !799, line: 150, size: 704, elements: !1501)
!1501 = !{!1502, !1504, !1505, !1506}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1500, file: !799, line: 151, baseType: !1503, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !1500, file: !799, line: 152, baseType: !1126, size: 64, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !1500, file: !799, line: 153, baseType: !1025, size: 64, offset: 128)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !1500, file: !799, line: 154, baseType: !355, size: 512, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !1414, file: !928, line: 240, baseType: !824, size: 32, offset: 1098880)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !1414, file: !928, line: 242, baseType: !1509, size: 10240, offset: 1098912)
!1509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 10240, elements: !1510)
!1510 = !{!1511}
!1511 = !DISubrange(count: 1280)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !1414, file: !928, line: 243, baseType: !824, size: 32, offset: 1109152)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !1414, file: !928, line: 244, baseType: !824, size: 32, offset: 1109184)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !1414, file: !928, line: 245, baseType: !824, size: 32, offset: 1109216)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !1414, file: !928, line: 246, baseType: !824, size: 32, offset: 1109248)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !1414, file: !928, line: 247, baseType: !824, size: 32, offset: 1109280)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !1414, file: !928, line: 248, baseType: !1316, size: 64, offset: 1109312)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !1414, file: !928, line: 249, baseType: !824, size: 32, offset: 1109376)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !1414, file: !928, line: 250, baseType: !1520, size: 64, offset: 1109440)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !928, line: 194, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !928, line: 196, size: 128, elements: !1523)
!1523 = !{!1524, !1525}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1522, file: !928, line: 197, baseType: !940, size: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1522, file: !928, line: 198, baseType: !1520, size: 64, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !1414, file: !928, line: 251, baseType: !931, size: 16384, offset: 1109504)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !1414, file: !928, line: 252, baseType: !840, size: 32, offset: 1125888)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !1414, file: !928, line: 253, baseType: !840, size: 32, offset: 1125920)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !1414, file: !928, line: 254, baseType: !824, size: 32, offset: 1125952)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1189, file: !1160, line: 195, baseType: !1171, size: 64, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1161, file: !1160, line: 196, baseType: !1532, size: 128, offset: 384)
!1532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !1160, line: 196, size: 128, elements: !1533)
!1533 = !{!1534, !1536}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1532, file: !1160, line: 196, baseType: !1535, size: 64)
!1535 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !1160, line: 86, baseType: !1193)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1532, file: !1160, line: 196, baseType: !1171, size: 64, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !1161, file: !1160, line: 197, baseType: !1538, size: 128, offset: 512)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !1160, line: 197, size: 128, elements: !1539)
!1539 = !{!1540, !1542}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1538, file: !1160, line: 197, baseType: !1541, size: 64)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !1160, line: 87, baseType: !1193)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1538, file: !1160, line: 197, baseType: !1171, size: 64, offset: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !1161, file: !1160, line: 198, baseType: !1544, size: 128, offset: 640)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !1160, line: 198, size: 128, elements: !1545)
!1545 = !{!1546, !1552}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1544, file: !1160, line: 198, baseType: !1547, size: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !1160, line: 92, baseType: !1548)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !1160, line: 88, baseType: !1549)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!824, !1171, !1196, !1316, !1318, !1126, !1126}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1544, file: !1160, line: 198, baseType: !1171, size: 64, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !1161, file: !1160, line: 199, baseType: !1554, size: 128, offset: 768)
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !1160, line: 199, size: 128, elements: !1555)
!1555 = !{!1556, !1558}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1554, file: !1160, line: 199, baseType: !1557, size: 64)
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !1160, line: 93, baseType: !1548)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1554, file: !1160, line: 199, baseType: !1171, size: 64, offset: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !1161, file: !1160, line: 200, baseType: !1560, size: 128, offset: 896)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !1160, line: 200, size: 128, elements: !1561)
!1561 = !{!1562, !1567}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1560, file: !1160, line: 200, baseType: !1563, size: 64)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !1160, line: 94, baseType: !1564)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!824, !1171, !1196, !940, !824, !1126, !1126}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1560, file: !1160, line: 200, baseType: !1171, size: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !1161, file: !1160, line: 201, baseType: !1569, size: 128, offset: 1024)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !1160, line: 201, size: 128, elements: !1570)
!1570 = !{!1571, !1576}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1569, file: !1160, line: 201, baseType: !1572, size: 64)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !1160, line: 98, baseType: !1573)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!1126, !1171, !1196, !1126}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1569, file: !1160, line: 201, baseType: !1171, size: 64, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !1161, file: !1160, line: 202, baseType: !1578, size: 128, offset: 1152)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !1160, line: 202, size: 128, elements: !1579)
!1579 = !{!1580, !1582}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1578, file: !1160, line: 202, baseType: !1581, size: 64)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !1160, line: 101, baseType: !1573)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1578, file: !1160, line: 202, baseType: !1171, size: 64, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !1161, file: !1160, line: 203, baseType: !1584, size: 128, offset: 1280)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !1160, line: 203, size: 128, elements: !1585)
!1585 = !{!1586, !1588}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1584, file: !1160, line: 203, baseType: !1587, size: 64)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !1160, line: 104, baseType: !1573)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1584, file: !1160, line: 203, baseType: !1171, size: 64, offset: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !1161, file: !1160, line: 204, baseType: !1590, size: 128, offset: 1408)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !1160, line: 204, size: 128, elements: !1591)
!1591 = !{!1592, !1628}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1590, file: !1160, line: 204, baseType: !1593, size: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !1160, line: 107, baseType: !1594)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!824, !1171, !1196, !924, !824, !824, !824, !824, !824, !1597}
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !839, line: 70, baseType: !1599)
!1599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !928, line: 414, size: 1344, elements: !1600)
!1600 = !{!1601, !1602, !1603, !1604, !1605, !1606, !1607, !1609, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !1599, file: !928, line: 415, baseType: !957, size: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !1599, file: !928, line: 416, baseType: !957, size: 64, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !1599, file: !928, line: 418, baseType: !951, size: 64, offset: 128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !1599, file: !928, line: 420, baseType: !957, size: 64, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !1599, file: !928, line: 421, baseType: !957, size: 64, offset: 256)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !1599, file: !928, line: 422, baseType: !824, size: 32, offset: 320)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !1599, file: !928, line: 424, baseType: !1608, size: 128, offset: 384)
!1608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 128, elements: !157)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !1599, file: !928, line: 425, baseType: !1610, size: 128, offset: 512)
!1610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 128, elements: !157)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !1599, file: !928, line: 426, baseType: !951, size: 64, offset: 640)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !1599, file: !928, line: 427, baseType: !824, size: 32, offset: 704)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !1599, file: !928, line: 429, baseType: !824, size: 32, offset: 736)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !1599, file: !928, line: 430, baseType: !824, size: 32, offset: 768)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !1599, file: !928, line: 431, baseType: !824, size: 32, offset: 800)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !1599, file: !928, line: 433, baseType: !824, size: 32, offset: 832)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !1599, file: !928, line: 434, baseType: !824, size: 32, offset: 864)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !1599, file: !928, line: 435, baseType: !824, size: 32, offset: 896)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !1599, file: !928, line: 436, baseType: !824, size: 32, offset: 928)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !1599, file: !928, line: 437, baseType: !824, size: 32, offset: 960)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !1599, file: !928, line: 438, baseType: !824, size: 32, offset: 992)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !1599, file: !928, line: 439, baseType: !824, size: 32, offset: 1024)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !1599, file: !928, line: 440, baseType: !824, size: 32, offset: 1056)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !1599, file: !928, line: 441, baseType: !957, size: 64, offset: 1088)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1599, file: !928, line: 443, baseType: !957, size: 64, offset: 1152)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !1599, file: !928, line: 445, baseType: !951, size: 64, offset: 1216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !1599, file: !928, line: 446, baseType: !951, size: 64, offset: 1280)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1590, file: !1160, line: 204, baseType: !1171, size: 64, offset: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !1161, file: !1160, line: 205, baseType: !1630, size: 128, offset: 1536)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !1160, line: 205, size: 128, elements: !1631)
!1631 = !{!1632, !1637}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1630, file: !1160, line: 205, baseType: !1633, size: 64)
!1633 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !1160, line: 112, baseType: !1634)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!824, !1171, !1196, !1126, !1126, !824}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1630, file: !1160, line: 205, baseType: !1171, size: 64, offset: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !1161, file: !1160, line: 206, baseType: !1639, size: 128, offset: 1664)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !1160, line: 206, size: 128, elements: !1640)
!1640 = !{!1641, !1646}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1639, file: !1160, line: 206, baseType: !1642, size: 64)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !1160, line: 115, baseType: !1643)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!824, !1171, !1196, !1126, !1126, !1126, !824}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1639, file: !1160, line: 206, baseType: !1171, size: 64, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !1161, file: !1160, line: 207, baseType: !1648, size: 128, offset: 1792)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !1160, line: 207, size: 128, elements: !1649)
!1649 = !{!1650, !1655}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1648, file: !1160, line: 207, baseType: !1651, size: 64)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !1160, line: 119, baseType: !1652)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1171, !1196, !1126}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1648, file: !1160, line: 207, baseType: !1171, size: 64, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !1161, file: !1160, line: 208, baseType: !1657, size: 128, offset: 1920)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !1160, line: 208, size: 128, elements: !1658)
!1658 = !{!1659, !1661}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1657, file: !1160, line: 208, baseType: !1660, size: 64)
!1660 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !1160, line: 121, baseType: !1652)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1657, file: !1160, line: 208, baseType: !1171, size: 64, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !1161, file: !1160, line: 209, baseType: !1663, size: 128, offset: 2048)
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !1160, line: 209, size: 128, elements: !1664)
!1664 = !{!1665, !1670}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1663, file: !1160, line: 209, baseType: !1666, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !1160, line: 123, baseType: !1667)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{null, !1171, !1196, !1126, !1126, !1126, !824, !824, !824}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1663, file: !1160, line: 209, baseType: !1171, size: 64, offset: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !1161, file: !1160, line: 210, baseType: !1672, size: 128, offset: 2176)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !1160, line: 210, size: 128, elements: !1673)
!1673 = !{!1674, !1679}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1672, file: !1160, line: 210, baseType: !1675, size: 64)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !1160, line: 128, baseType: !1676)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!824, !1171, !1196, !940}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1672, file: !1160, line: 210, baseType: !1171, size: 64, offset: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !1161, file: !1160, line: 211, baseType: !1681, size: 128, offset: 2304)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !1160, line: 211, size: 128, elements: !1682)
!1682 = !{!1683, !1688}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1681, file: !1160, line: 211, baseType: !1684, size: 64)
!1684 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !1160, line: 130, baseType: !1685)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!824, !1171, !1196, !940, !1126}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1681, file: !1160, line: 211, baseType: !1171, size: 64, offset: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !1161, file: !1160, line: 212, baseType: !1690, size: 128, offset: 2432)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !1160, line: 212, size: 128, elements: !1691)
!1691 = !{!1692, !1697}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1690, file: !1160, line: 212, baseType: !1693, size: 64)
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !1160, line: 133, baseType: !1694)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!824, !1171, !1196, !924}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1690, file: !1160, line: 212, baseType: !1171, size: 64, offset: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !1161, file: !1160, line: 213, baseType: !1699, size: 128, offset: 2560)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !1160, line: 213, size: 128, elements: !1700)
!1700 = !{!1701, !1706}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1699, file: !1160, line: 213, baseType: !1702, size: 64)
!1702 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !1160, line: 135, baseType: !1703)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!824, !1171, !1196, !1126, !1126, !1126, !1126, !940}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1699, file: !1160, line: 213, baseType: !1171, size: 64, offset: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !1161, file: !1160, line: 214, baseType: !1708, size: 128, offset: 2688)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !1160, line: 214, size: 128, elements: !1709)
!1709 = !{!1710, !1716}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1708, file: !1160, line: 214, baseType: !1711, size: 64)
!1711 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !1160, line: 142, baseType: !1712)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64)
!1713 = !DISubroutineType(types: !1714)
!1714 = !{!824, !1171, !1196, !940, !1126, !1126, !1126, !1126, !1715}
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1708, file: !1160, line: 214, baseType: !1171, size: 64, offset: 64)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !1161, file: !1160, line: 215, baseType: !1718, size: 128, offset: 2816)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !1160, line: 215, size: 128, elements: !1719)
!1719 = !{!1720, !1722}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1718, file: !1160, line: 215, baseType: !1721, size: 64)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !1160, line: 148, baseType: !1712)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1718, file: !1160, line: 215, baseType: !1171, size: 64, offset: 64)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !1161, file: !1160, line: 216, baseType: !1724, size: 128, offset: 2944)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !1160, line: 216, size: 128, elements: !1725)
!1725 = !{!1726, !1734}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1724, file: !1160, line: 216, baseType: !1727, size: 64)
!1727 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !1160, line: 156, baseType: !1728)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{!824, !1171, !1196, !1731}
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64)
!1732 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !1160, line: 56, baseType: !1733)
!1733 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !1160, line: 56, flags: DIFlagFwdDecl)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1724, file: !1160, line: 216, baseType: !1171, size: 64, offset: 64)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !1161, file: !1160, line: 217, baseType: !1736, size: 128, offset: 3072)
!1736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !1160, line: 217, size: 128, elements: !1737)
