; ModuleID = 'src/htscoremain.c'
source_filename = "src/htscoremain.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i32, i64, i64 }
%struct.t_hts_htmlcheck_callbacks = type { %struct.init, %struct.uninit, %struct.start, %struct.end, %struct.chopt, %struct.preprocess, %struct.postprocess, %struct.check_html, %struct.query, %struct.query2, %struct.query3, %struct.loop, %struct.check_link, %struct.check_mime, %struct.pause, %struct.filesave, %struct.filesave2, %struct.linkdetected, %struct.linkdetected2, %struct.xfrstatus, %struct.savename, %struct.sendhead, %struct.receivehead, %struct.detect, %struct.parse, %struct.extsavename }
%struct.init = type { ptr, ptr }
%struct.uninit = type { ptr, ptr }
%struct.start = type { ptr, ptr }
%struct.end = type { ptr, ptr }
%struct.chopt = type { ptr, ptr }
%struct.preprocess = type { ptr, ptr }
%struct.postprocess = type { ptr, ptr }
%struct.check_html = type { ptr, ptr }
%struct.query = type { ptr, ptr }
%struct.query2 = type { ptr, ptr }
%struct.query3 = type { ptr, ptr }
%struct.loop = type { ptr, ptr }
%struct.check_link = type { ptr, ptr }
%struct.check_mime = type { ptr, ptr }
%struct.pause = type { ptr, ptr }
%struct.filesave = type { ptr, ptr }
%struct.filesave2 = type { ptr, ptr }
%struct.linkdetected = type { ptr, ptr }
%struct.linkdetected2 = type { ptr, ptr }
%struct.xfrstatus = type { ptr, ptr }

!1086 = !DIFile(filename: "./src/htssafe.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "0a24d1c0939efbe916010d30091bc9cc")
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1086, line: 190, type: !396, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1086, line: 193, type: !190, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !1093, isLocal: true, isDefinition: true)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1136, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 142)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !1086, line: 91, type: !47, isLocal: true, isDefinition: true)
!1098 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1099, retainedTypes: !2032, globals: !2041, splitDebugInlining: false, nameTableKind: None)
!1099 = !{!1100, !1116, !1127, !1134}
!1100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1101, line: 46, baseType: !1102, size: 32, elements: !1103)
!1101 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!1102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115}
!1104 = !DIEnumerator(name: "_ISupper", value: 256)
!1105 = !DIEnumerator(name: "_ISlower", value: 512)
!1106 = !DIEnumerator(name: "_ISalpha", value: 1024)
!1107 = !DIEnumerator(name: "_ISdigit", value: 2048)
!1108 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!1109 = !DIEnumerator(name: "_ISspace", value: 8192)
!1110 = !DIEnumerator(name: "_ISprint", value: 16384)
!1111 = !DIEnumerator(name: "_ISgraph", value: 32768)
!1112 = !DIEnumerator(name: "_ISblank", value: 1)
!1113 = !DIEnumerator(name: "_IScntrl", value: 2)
!1114 = !DIEnumerator(name: "_ISpunct", value: 4)
!1115 = !DIEnumerator(name: "_ISalnum", value: 8)
!1116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hts_log_type", file: !1117, line: 179, baseType: !1102, size: 32, elements: !1118)
!1117 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126}
!1119 = !DIEnumerator(name: "LOG_PANIC", value: 0)
!1120 = !DIEnumerator(name: "LOG_ERROR", value: 1)
!1121 = !DIEnumerator(name: "LOG_WARNING", value: 2)
!1122 = !DIEnumerator(name: "LOG_NOTICE", value: 3)
!1123 = !DIEnumerator(name: "LOG_INFO", value: 4)
!1124 = !DIEnumerator(name: "LOG_DEBUG", value: 5)
!1125 = !DIEnumerator(name: "LOG_TRACE", value: 6)
!1126 = !DIEnumerator(name: "LOG_ERRNO", value: 256)
!1127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "htsparsejava_flags", file: !1117, line: 276, baseType: !1102, size: 32, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133}
!1129 = !DIEnumerator(name: "HTSPARSE_NONE", value: 0)
!1130 = !DIEnumerator(name: "HTSPARSE_DEFAULT", value: 1)
!1131 = !DIEnumerator(name: "HTSPARSE_NO_CLASS", value: 2)
!1132 = !DIEnumerator(name: "HTSPARSE_NO_JAVASCRIPT", value: 4)
!1133 = !DIEnumerator(name: "HTSPARSE_NO_AGGRESSIVE", value: 8)
!1134 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1135, file: !2, line: 2454, baseType: !1102, size: 32, elements: !2024)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1136, file: !2, line: 2453, size: 192, elements: !2020)
!1136 = distinct !DISubprogram(name: "hts_main_internal", scope: !2, file: !2, line: 164, type: !1137, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1098, retainedNodes: !2019)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!1139, !1139, !1140, !1142}
!1139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !1117, line: 292, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !1117, line: 294, size: 1133184, elements: !1145)
!1145 = !{!1146, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1212, !1213, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1230, !1231, !1232, !1233, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1322, !1367, !1370, !1371, !1375, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1888, !1900}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !1144, file: !1117, line: 295, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1148, line: 46, baseType: !1149)
!1148 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!1149 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !1144, file: !1117, line: 297, baseType: !1139, size: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1144, file: !1117, line: 298, baseType: !1139, size: 32, offset: 96)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !1144, file: !1117, line: 299, baseType: !1139, size: 32, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !1144, file: !1117, line: 300, baseType: !1139, size: 32, offset: 160)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1144, file: !1117, line: 301, baseType: !1139, size: 32, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !1144, file: !1117, line: 302, baseType: !1139, size: 32, offset: 224)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !1144, file: !1117, line: 303, baseType: !1139, size: 32, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !1144, file: !1117, line: 304, baseType: !1139, size: 32, offset: 288)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1144, file: !1117, line: 305, baseType: !1139, size: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !1144, file: !1117, line: 306, baseType: !1139, size: 32, offset: 352)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1144, file: !1117, line: 307, baseType: !1161, size: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1163, line: 7, baseType: !1164)
!1163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1165, line: 49, size: 1728, elements: !1166)
!1165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1166 = !{!1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1182, !1184, !1185, !1186, !1190, !1192, !1194, !1195, !1198, !1200, !1203, !1206, !1207, !1209, !1210, !1211}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1164, file: !1165, line: 51, baseType: !1139, size: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1164, file: !1165, line: 54, baseType: !1141, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1164, file: !1165, line: 55, baseType: !1141, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1164, file: !1165, line: 56, baseType: !1141, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1164, file: !1165, line: 57, baseType: !1141, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1164, file: !1165, line: 58, baseType: !1141, size: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1164, file: !1165, line: 59, baseType: !1141, size: 64, offset: 384)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1164, file: !1165, line: 60, baseType: !1141, size: 64, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1164, file: !1165, line: 61, baseType: !1141, size: 64, offset: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1164, file: !1165, line: 64, baseType: !1141, size: 64, offset: 576)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1164, file: !1165, line: 65, baseType: !1141, size: 64, offset: 640)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1164, file: !1165, line: 66, baseType: !1141, size: 64, offset: 704)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1164, file: !1165, line: 68, baseType: !1180, size: 64, offset: 768)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1165, line: 36, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1164, file: !1165, line: 70, baseType: !1183, size: 64, offset: 832)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1164, file: !1165, line: 72, baseType: !1139, size: 32, offset: 896)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1164, file: !1165, line: 73, baseType: !1139, size: 32, offset: 928)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1164, file: !1165, line: 74, baseType: !1187, size: 64, offset: 960)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1188, line: 152, baseType: !1189)
!1188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!1189 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1164, file: !1165, line: 77, baseType: !1191, size: 16, offset: 1024)
!1191 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1164, file: !1165, line: 78, baseType: !1193, size: 8, offset: 1040)
!1193 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1164, file: !1165, line: 79, baseType: !3, size: 8, offset: 1048)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1164, file: !1165, line: 81, baseType: !1196, size: 64, offset: 1088)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1165, line: 43, baseType: null)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1164, file: !1165, line: 89, baseType: !1199, size: 64, offset: 1152)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1188, line: 153, baseType: !1189)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1164, file: !1165, line: 91, baseType: !1201, size: 64, offset: 1216)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1165, line: 37, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1164, file: !1165, line: 92, baseType: !1204, size: 64, offset: 1280)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1165, line: 38, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1164, file: !1165, line: 93, baseType: !1183, size: 64, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1164, file: !1165, line: 94, baseType: !1208, size: 64, offset: 1408)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1164, file: !1165, line: 95, baseType: !1147, size: 64, offset: 1472)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1164, file: !1165, line: 96, baseType: !1139, size: 32, offset: 1536)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1164, file: !1165, line: 98, baseType: !47, size: 160, offset: 1568)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !1144, file: !1117, line: 308, baseType: !1161, size: 64, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !1144, file: !1117, line: 309, baseType: !1214, size: 64, offset: 512)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !1215, line: 283, baseType: !1189)
!1215 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1144, file: !1117, line: 310, baseType: !1214, size: 64, offset: 576)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1144, file: !1117, line: 311, baseType: !1214, size: 64, offset: 640)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !1144, file: !1117, line: 312, baseType: !1139, size: 32, offset: 704)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !1144, file: !1117, line: 313, baseType: !1214, size: 64, offset: 768)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !1144, file: !1117, line: 314, baseType: !1139, size: 32, offset: 832)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !1144, file: !1117, line: 315, baseType: !1139, size: 32, offset: 864)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !1144, file: !1117, line: 316, baseType: !1139, size: 32, offset: 896)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !1144, file: !1117, line: 317, baseType: !1139, size: 32, offset: 928)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1144, file: !1117, line: 318, baseType: !1139, size: 32, offset: 960)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1144, file: !1117, line: 319, baseType: !1139, size: 32, offset: 992)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !1144, file: !1117, line: 320, baseType: !1139, size: 32, offset: 1024)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !1144, file: !1117, line: 321, baseType: !1139, size: 32, offset: 1056)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !1144, file: !1117, line: 322, baseType: !1229, size: 32, offset: 1088)
!1229 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !1144, file: !1117, line: 323, baseType: !1139, size: 32, offset: 1120)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1144, file: !1117, line: 324, baseType: !1139, size: 32, offset: 1152)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !1144, file: !1117, line: 326, baseType: !1139, size: 32, offset: 1184)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1144, file: !1117, line: 327, baseType: !1234, size: 512, offset: 1216)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !1117, line: 89, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !1117, line: 91, size: 512, elements: !1236)
!1236 = !{!1237, !1238, !1245, !1246}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1235, file: !1117, line: 92, baseType: !1139, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1235, file: !1117, line: 93, baseType: !1239, size: 192, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !1117, line: 71, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !1117, line: 75, size: 192, elements: !1241)
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !1240, file: !1117, line: 76, baseType: !1141, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !1240, file: !1117, line: 77, baseType: !1147, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !1240, file: !1117, line: 78, baseType: !1147, size: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1235, file: !1117, line: 94, baseType: !1139, size: 32, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1235, file: !1117, line: 95, baseType: !1239, size: 192, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !1144, file: !1117, line: 328, baseType: !1139, size: 32, offset: 1728)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !1144, file: !1117, line: 329, baseType: !1139, size: 32, offset: 1760)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !1144, file: !1117, line: 330, baseType: !1239, size: 192, offset: 1792)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !1144, file: !1117, line: 331, baseType: !1139, size: 32, offset: 1984)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !1144, file: !1117, line: 332, baseType: !1139, size: 32, offset: 2016)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !1144, file: !1117, line: 333, baseType: !1139, size: 32, offset: 2048)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1144, file: !1117, line: 334, baseType: !1139, size: 32, offset: 2080)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1144, file: !1117, line: 335, baseType: !1239, size: 192, offset: 2112)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1144, file: !1117, line: 336, baseType: !1239, size: 192, offset: 2304)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1144, file: !1117, line: 337, baseType: !1239, size: 192, offset: 2496)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !1144, file: !1117, line: 338, baseType: !1239, size: 192, offset: 2688)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !1144, file: !1117, line: 339, baseType: !1239, size: 192, offset: 2880)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !1144, file: !1117, line: 340, baseType: !1239, size: 192, offset: 3072)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !1144, file: !1117, line: 341, baseType: !1239, size: 192, offset: 3264)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1144, file: !1117, line: 342, baseType: !1139, size: 32, offset: 3456)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !1144, file: !1117, line: 343, baseType: !1139, size: 32, offset: 3488)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !1144, file: !1117, line: 344, baseType: !1139, size: 32, offset: 3520)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !1144, file: !1117, line: 345, baseType: !1139, size: 32, offset: 3552)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !1144, file: !1117, line: 346, baseType: !1139, size: 32, offset: 3584)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !1144, file: !1117, line: 347, baseType: !1139, size: 32, offset: 3616)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !1144, file: !1117, line: 348, baseType: !1139, size: 32, offset: 3648)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !1144, file: !1117, line: 349, baseType: !1139, size: 32, offset: 3680)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !1144, file: !1117, line: 350, baseType: !1139, size: 32, offset: 3712)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1144, file: !1117, line: 351, baseType: !1139, size: 32, offset: 3744)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !1144, file: !1117, line: 352, baseType: !1139, size: 32, offset: 3776)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !1144, file: !1117, line: 353, baseType: !1139, size: 32, offset: 3808)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !1144, file: !1117, line: 354, baseType: !1139, size: 32, offset: 3840)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !1144, file: !1117, line: 355, baseType: !1239, size: 192, offset: 3904)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !1144, file: !1117, line: 356, baseType: !1139, size: 32, offset: 4096)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !1144, file: !1117, line: 357, baseType: !1139, size: 32, offset: 4128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1144, file: !1117, line: 358, baseType: !1278, size: 64, offset: 4160)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !1117, line: 65, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !1281, line: 55, size: 278656, elements: !1282)
!1281 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!1282 = !{!1283, !1284, !1288}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !1280, file: !1281, line: 56, baseType: !1139, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1280, file: !1281, line: 57, baseType: !1285, size: 262144, offset: 32)
!1285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !1286)
!1286 = !{!1287}
!1287 = !DISubrange(count: 32768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !1280, file: !1281, line: 58, baseType: !1289, size: 16448, offset: 262208)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !1281, line: 42, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !1281, line: 44, size: 16448, elements: !1291)
!1291 = !{!1292, !1296, !1297}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1290, file: !1281, line: 45, baseType: !1293, size: 8192)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1294)
!1294 = !{!1295}
!1295 = !DISubrange(count: 1024)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !1290, file: !1281, line: 46, baseType: !1293, size: 8192, offset: 8192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1290, file: !1281, line: 47, baseType: !1298, size: 64, offset: 16384)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !1144, file: !1117, line: 359, baseType: !1139, size: 32, offset: 4224)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1144, file: !1117, line: 360, baseType: !1139, size: 32, offset: 4256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1144, file: !1117, line: 361, baseType: !1139, size: 32, offset: 4288)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !1144, file: !1117, line: 362, baseType: !1139, size: 32, offset: 4320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !1144, file: !1117, line: 363, baseType: !1139, size: 32, offset: 4352)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !1144, file: !1117, line: 364, baseType: !1139, size: 32, offset: 4384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !1144, file: !1117, line: 365, baseType: !1139, size: 32, offset: 4416)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !1144, file: !1117, line: 366, baseType: !1139, size: 32, offset: 4448)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !1144, file: !1117, line: 367, baseType: !1139, size: 32, offset: 4480)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !1144, file: !1117, line: 368, baseType: !1139, size: 32, offset: 4512)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1144, file: !1117, line: 369, baseType: !1239, size: 192, offset: 4544)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !1144, file: !1117, line: 370, baseType: !1139, size: 32, offset: 4736)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !1144, file: !1117, line: 372, baseType: !1139, size: 32, offset: 4768)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !1144, file: !1117, line: 373, baseType: !1239, size: 192, offset: 4800)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !1144, file: !1117, line: 374, baseType: !1239, size: 192, offset: 4992)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1144, file: !1117, line: 375, baseType: !1315, size: 128, offset: 5184)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !1117, line: 101, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !1117, line: 103, size: 128, elements: !1317)
!1317 = !{!1318, !1320}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1316, file: !1117, line: 104, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !1316, file: !1117, line: 105, baseType: !1321, size: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1144, file: !1117, line: 376, baseType: !1323, size: 64, offset: 5312)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !1117, line: 57, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !1326, line: 202, size: 98624, elements: !1327)
!1326 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!1327 = !{!1328, !1351, !1355, !1356, !1357, !1358, !1362, !1363}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !1325, file: !1326, line: 204, baseType: !1329, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1333)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1335)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !1117, line: 174, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !1117, line: 534, size: 640, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1336, file: !1117, line: 535, baseType: !1141, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !1336, file: !1117, line: 536, baseType: !1141, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !1336, file: !1117, line: 537, baseType: !1141, size: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !1336, file: !1117, line: 538, baseType: !1141, size: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !1336, file: !1117, line: 539, baseType: !1141, size: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !1336, file: !1117, line: 540, baseType: !1141, size: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !1336, file: !1117, line: 542, baseType: !1139, size: 32, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !1336, file: !1117, line: 543, baseType: !1139, size: 32, offset: 416)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1336, file: !1117, line: 544, baseType: !1139, size: 32, offset: 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !1336, file: !1117, line: 545, baseType: !1139, size: 32, offset: 480)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !1336, file: !1117, line: 546, baseType: !4, size: 8, offset: 512)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1336, file: !1117, line: 548, baseType: !1139, size: 32, offset: 544)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1336, file: !1117, line: 549, baseType: !1139, size: 32, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !1325, file: !1326, line: 206, baseType: !1352, size: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !1117, line: 210, baseType: !1353)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !1117, line: 210, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !1325, file: !1326, line: 208, baseType: !1352, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !1325, file: !1326, line: 210, baseType: !1352, size: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !1325, file: !1326, line: 212, baseType: !1139, size: 32, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !1325, file: !1326, line: 213, baseType: !1359, size: 16384, offset: 288)
!1359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !1360)
!1360 = !{!1361}
!1361 = !DISubrange(count: 2048)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !1325, file: !1326, line: 214, baseType: !1359, size: 16384, offset: 16672)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !1325, file: !1326, line: 215, baseType: !1364, size: 65536, offset: 33056)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !1365)
!1365 = !{!1366}
!1366 = !DISubrange(count: 8192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !1144, file: !1117, line: 377, baseType: !1368, size: 64, offset: 5376)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !1144, file: !1117, line: 378, baseType: !1139, size: 32, offset: 5440)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !1144, file: !1117, line: 379, baseType: !1372, size: 64, offset: 5504)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !1117, line: 286, baseType: !1374)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !1117, line: 286, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !1144, file: !1117, line: 380, baseType: !1376, size: 64, offset: 5568)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !1117, line: 61, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !1379, line: 42, size: 33856, elements: !1380)
!1379 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!1380 = !{!1381, !1385, !1389}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1378, file: !1379, line: 43, baseType: !1382, size: 1024)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !1383)
!1383 = !{!1384}
!1384 = !DISubrange(count: 128)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !1378, file: !1379, line: 44, baseType: !1386, size: 32768, offset: 1024)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1387)
!1387 = !{!1388}
!1388 = !DISubrange(count: 4096)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1378, file: !1379, line: 45, baseType: !1390, size: 64, offset: 33792)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1144, file: !1117, line: 381, baseType: !1239, size: 192, offset: 5632)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1144, file: !1117, line: 382, baseType: !1239, size: 192, offset: 5824)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1144, file: !1117, line: 383, baseType: !1239, size: 192, offset: 6016)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !1144, file: !1117, line: 384, baseType: !1239, size: 192, offset: 6208)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !1144, file: !1117, line: 385, baseType: !1239, size: 192, offset: 6400)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !1144, file: !1117, line: 386, baseType: !1139, size: 32, offset: 6592)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !1144, file: !1117, line: 388, baseType: !1139, size: 32, offset: 6624)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !1144, file: !1117, line: 389, baseType: !1139, size: 32, offset: 6656)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1144, file: !1117, line: 391, baseType: !1400, size: 64, offset: 6720)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !1144, file: !1117, line: 393, baseType: !1139, size: 32, offset: 6784)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !1144, file: !1117, line: 394, baseType: !1139, size: 32, offset: 6816)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !1144, file: !1117, line: 395, baseType: !1139, size: 32, offset: 6848)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !1144, file: !1117, line: 396, baseType: !1139, size: 32, offset: 6880)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1144, file: !1117, line: 398, baseType: !1139, size: 32, offset: 6912)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !1144, file: !1117, line: 399, baseType: !1139, size: 32, offset: 6944)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !1144, file: !1117, line: 402, baseType: !1408, size: 64, offset: 6976)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !1117, line: 49, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !1411, line: 191, size: 3328, elements: !1412)
!1411 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!1412 = !{!1413, !1432, !1438, !1447, !1453, !1459, !1469, !1475, !1484, !1493, !1499, !1505, !1709, !1718, !1727, !1736, !1742, !1751, !1760, !1769, !1778, !1787, !1797, !1803, !1876, !1882}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1410, file: !1411, line: 193, baseType: !1414, size: 128)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !1411, line: 193, size: 128, elements: !1415)
!1415 = !{!1416, !1431}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1414, file: !1411, line: 193, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !1411, line: 83, baseType: !1418)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{null, !1421}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !1411, line: 60, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !1411, line: 179, size: 192, elements: !1424)
!1424 = !{!1425, !1426}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !1423, file: !1411, line: 181, baseType: !1208, size: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1423, file: !1411, line: 187, baseType: !1427, size: 128, offset: 64)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !1411, line: 184, size: 128, elements: !1428)
!1428 = !{!1429, !1430}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1427, file: !1411, line: 185, baseType: !1208, size: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1427, file: !1411, line: 186, baseType: !1421, size: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1414, file: !1411, line: 193, baseType: !1421, size: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1410, file: !1411, line: 194, baseType: !1433, size: 128, offset: 128)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !1411, line: 194, size: 128, elements: !1434)
!1434 = !{!1435, !1437}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1433, file: !1411, line: 194, baseType: !1436, size: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !1411, line: 84, baseType: !1418)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1433, file: !1411, line: 194, baseType: !1421, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1410, file: !1411, line: 195, baseType: !1439, size: 128, offset: 256)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !1411, line: 195, size: 128, elements: !1440)
!1440 = !{!1441, !1446}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1439, file: !1411, line: 195, baseType: !1442, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !1411, line: 85, baseType: !1443)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!1139, !1421, !1142}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1439, file: !1411, line: 195, baseType: !1421, size: 64, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1410, file: !1411, line: 196, baseType: !1448, size: 128, offset: 384)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !1411, line: 196, size: 128, elements: !1449)
!1449 = !{!1450, !1452}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1448, file: !1411, line: 196, baseType: !1451, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !1411, line: 86, baseType: !1443)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1448, file: !1411, line: 196, baseType: !1421, size: 64, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !1410, file: !1411, line: 197, baseType: !1454, size: 128, offset: 512)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !1411, line: 197, size: 128, elements: !1455)
!1455 = !{!1456, !1458}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1454, file: !1411, line: 197, baseType: !1457, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !1411, line: 87, baseType: !1443)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1454, file: !1411, line: 197, baseType: !1421, size: 64, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !1410, file: !1411, line: 198, baseType: !1460, size: 128, offset: 640)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !1411, line: 198, size: 128, elements: !1461)
!1461 = !{!1462, !1468}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1460, file: !1411, line: 198, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !1411, line: 92, baseType: !1464)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !1411, line: 88, baseType: !1465)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!1139, !1421, !1142, !1140, !1321, !1400, !1400}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1460, file: !1411, line: 198, baseType: !1421, size: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !1410, file: !1411, line: 199, baseType: !1470, size: 128, offset: 768)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !1411, line: 199, size: 128, elements: !1471)
!1471 = !{!1472, !1474}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1470, file: !1411, line: 199, baseType: !1473, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !1411, line: 93, baseType: !1464)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1470, file: !1411, line: 199, baseType: !1421, size: 64, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !1410, file: !1411, line: 200, baseType: !1476, size: 128, offset: 896)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !1411, line: 200, size: 128, elements: !1477)
!1477 = !{!1478, !1483}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1476, file: !1411, line: 200, baseType: !1479, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !1411, line: 94, baseType: !1480)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!1139, !1421, !1142, !1141, !1139, !1400, !1400}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1476, file: !1411, line: 200, baseType: !1421, size: 64, offset: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !1410, file: !1411, line: 201, baseType: !1485, size: 128, offset: 1024)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !1411, line: 201, size: 128, elements: !1486)
!1486 = !{!1487, !1492}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1485, file: !1411, line: 201, baseType: !1488, size: 64)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !1411, line: 98, baseType: !1489)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!1400, !1421, !1142, !1400}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1485, file: !1411, line: 201, baseType: !1421, size: 64, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !1410, file: !1411, line: 202, baseType: !1494, size: 128, offset: 1152)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !1411, line: 202, size: 128, elements: !1495)
!1495 = !{!1496, !1498}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1494, file: !1411, line: 202, baseType: !1497, size: 64)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !1411, line: 101, baseType: !1489)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1494, file: !1411, line: 202, baseType: !1421, size: 64, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !1410, file: !1411, line: 203, baseType: !1500, size: 128, offset: 1280)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !1411, line: 203, size: 128, elements: !1501)
!1501 = !{!1502, !1504}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1500, file: !1411, line: 203, baseType: !1503, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !1411, line: 104, baseType: !1489)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1500, file: !1411, line: 203, baseType: !1421, size: 64, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !1410, file: !1411, line: 204, baseType: !1506, size: 128, offset: 1408)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !1411, line: 204, size: 128, elements: !1507)
!1507 = !{!1508, !1708}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1506, file: !1411, line: 204, baseType: !1509, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !1411, line: 107, baseType: !1510)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!1139, !1421, !1142, !1513, !1139, !1139, !1139, !1139, !1139, !1677}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !1117, line: 555, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !1117, line: 557, size: 135040, elements: !1516)
!1516 = !{!1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1532, !1533, !1534, !1535, !1536, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !1515, file: !1117, line: 561, baseType: !1359, size: 16384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !1515, file: !1117, line: 562, baseType: !1359, size: 16384, offset: 16384)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !1515, file: !1117, line: 563, baseType: !1359, size: 16384, offset: 32768)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !1515, file: !1117, line: 564, baseType: !1359, size: 16384, offset: 49152)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !1515, file: !1117, line: 565, baseType: !1359, size: 16384, offset: 65536)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !1515, file: !1117, line: 566, baseType: !1359, size: 16384, offset: 81920)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1515, file: !1117, line: 567, baseType: !1141, size: 64, offset: 98304)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !1515, file: !1117, line: 568, baseType: !1359, size: 16384, offset: 98368)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !1515, file: !1117, line: 569, baseType: !1293, size: 8192, offset: 114752)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1515, file: !1117, line: 570, baseType: !1139, size: 32, offset: 122944)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !1515, file: !1117, line: 571, baseType: !1139, size: 32, offset: 122976)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1515, file: !1117, line: 572, baseType: !1139, size: 32, offset: 123008)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1515, file: !1117, line: 573, baseType: !1139, size: 32, offset: 123040)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !1515, file: !1117, line: 574, baseType: !1531, size: 64, offset: 123072)
!1531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !1215, line: 284, baseType: !1189)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1515, file: !1117, line: 575, baseType: !1139, size: 32, offset: 123136)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !1515, file: !1117, line: 576, baseType: !1531, size: 64, offset: 123200)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1515, file: !1117, line: 577, baseType: !1214, size: 64, offset: 123264)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1515, file: !1117, line: 578, baseType: !1214, size: 64, offset: 123328)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1515, file: !1117, line: 579, baseType: !1537, size: 8960, offset: 123392)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !1117, line: 484, baseType: !1538)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !1117, line: 486, size: 8960, elements: !1539)
!1539 = !{!1540, !1541, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1564, !1621, !1622, !1623, !1624, !1629, !1630, !1634, !1635, !1636, !1637, !1638, !1639}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !1538, file: !1117, line: 487, baseType: !1139, size: 32)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !1538, file: !1117, line: 488, baseType: !1542, size: 16, offset: 32)
!1542 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !1538, file: !1117, line: 489, baseType: !1542, size: 16, offset: 48)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1538, file: !1117, line: 490, baseType: !1542, size: 16, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !1538, file: !1117, line: 491, baseType: !1542, size: 16, offset: 80)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !1538, file: !1117, line: 492, baseType: !1542, size: 16, offset: 96)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !1538, file: !1117, line: 493, baseType: !1542, size: 16, offset: 112)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !1538, file: !1117, line: 494, baseType: !1542, size: 16, offset: 128)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !1538, file: !1117, line: 495, baseType: !1139, size: 32, offset: 160)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !1538, file: !1117, line: 496, baseType: !1139, size: 32, offset: 192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1538, file: !1117, line: 497, baseType: !1141, size: 64, offset: 256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1538, file: !1117, line: 498, baseType: !1141, size: 64, offset: 320)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1538, file: !1117, line: 499, baseType: !1161, size: 64, offset: 384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1538, file: !1117, line: 500, baseType: !1214, size: 64, offset: 448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !1538, file: !1117, line: 501, baseType: !86, size: 640, offset: 512)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !1538, file: !1117, line: 502, baseType: !359, size: 512, offset: 1152)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !1538, file: !1117, line: 503, baseType: !359, size: 512, offset: 1664)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !1538, file: !1117, line: 504, baseType: !359, size: 512, offset: 2176)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1538, file: !1117, line: 505, baseType: !1141, size: 64, offset: 2688)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !1538, file: !1117, line: 506, baseType: !1214, size: 64, offset: 2752)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !1538, file: !1117, line: 507, baseType: !1542, size: 16, offset: 2816)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !1538, file: !1117, line: 508, baseType: !1563, size: 32, offset: 2848)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !1215, line: 323, baseType: !1139)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1538, file: !1117, line: 509, baseType: !1565, size: 224, offset: 2880)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !1566, line: 91, baseType: !1567)
!1566 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !1566, line: 93, size: 224, elements: !1568)
!1568 = !{!1569}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !1567, file: !1566, line: 103, baseType: !1570, size: 224)
!1570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1567, file: !1566, line: 94, size: 224, elements: !1571)
!1571 = !{!1572, !1580, !1600}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1570, file: !1566, line: 96, baseType: !1573, size: 128)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1574, line: 180, size: 128, elements: !1575)
!1574 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1575 = !{!1576, !1579}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1573, file: !1574, line: 182, baseType: !1577, size: 16)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1578, line: 28, baseType: !1191)
!1578 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1573, file: !1574, line: 183, baseType: !234, size: 112, offset: 16)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1570, file: !1566, line: 98, baseType: !1581, size: 128)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1582, line: 245, size: 128, elements: !1583)
!1582 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!1583 = !{!1584, !1585, !1590, !1597}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1581, file: !1582, line: 247, baseType: !1577, size: 16)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1581, file: !1582, line: 248, baseType: !1586, size: 16, offset: 16)
!1586 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1582, line: 123, baseType: !1587)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1588, line: 25, baseType: !1589)
!1588 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !1188, line: 40, baseType: !1191)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1581, file: !1582, line: 249, baseType: !1591, size: 32, offset: 32)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1582, line: 31, size: 32, elements: !1592)
!1592 = !{!1593}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1591, file: !1582, line: 33, baseType: !1594, size: 32)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1582, line: 30, baseType: !1595)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1588, line: 26, baseType: !1596)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !1188, line: 42, baseType: !1102)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1581, file: !1582, line: 252, baseType: !1598, size: 64, offset: 64)
!1598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1599, size: 64, elements: !718)
!1599 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1570, file: !1566, line: 101, baseType: !1601, size: 224)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1582, line: 260, size: 224, elements: !1602)
!1602 = !{!1603, !1604, !1605, !1606, !1620}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1601, file: !1582, line: 262, baseType: !1577, size: 16)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1601, file: !1582, line: 263, baseType: !1586, size: 16, offset: 16)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1601, file: !1582, line: 264, baseType: !1595, size: 32, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1601, file: !1582, line: 265, baseType: !1607, size: 128, offset: 64)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1582, line: 219, size: 128, elements: !1608)
!1608 = !{!1609}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1607, file: !1582, line: 226, baseType: !1610, size: 128)
!1610 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1607, file: !1582, line: 221, size: 128, elements: !1611)
!1611 = !{!1612, !1616, !1618}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1610, file: !1582, line: 223, baseType: !1613, size: 128)
!1613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1614, size: 128, elements: !274)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1588, line: 24, baseType: !1615)
!1615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !1188, line: 38, baseType: !1599)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1610, file: !1582, line: 224, baseType: !1617, size: 128)
!1617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1587, size: 128, elements: !718)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1610, file: !1582, line: 225, baseType: !1619, size: 128)
!1619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1595, size: 128, elements: !99)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1601, file: !1582, line: 266, baseType: !1595, size: 32, offset: 192)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !1538, file: !1117, line: 510, baseType: !1139, size: 32, offset: 3104)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !1538, file: !1117, line: 511, baseType: !1161, size: 64, offset: 3136)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !1538, file: !1117, line: 513, baseType: !1542, size: 16, offset: 3200)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !1538, file: !1117, line: 515, baseType: !1625, size: 64, offset: 3264)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64)
!1626 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !1627, line: 184, baseType: !1628)
!1627 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1628 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !1627, line: 184, flags: DIFlagFwdDecl)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !1538, file: !1117, line: 517, baseType: !359, size: 512, offset: 3328)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !1538, file: !1117, line: 518, baseType: !1631, size: 2048, offset: 3840)
!1631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1632)
!1632 = !{!1633}
!1633 = !DISubrange(count: 256)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !1538, file: !1117, line: 519, baseType: !1631, size: 2048, offset: 5888)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !1538, file: !1117, line: 520, baseType: !1214, size: 64, offset: 7936)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !1538, file: !1117, line: 521, baseType: !1214, size: 64, offset: 8000)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !1538, file: !1117, line: 522, baseType: !1214, size: 64, offset: 8064)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !1538, file: !1117, line: 523, baseType: !1139, size: 32, offset: 8128)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !1538, file: !1117, line: 525, baseType: !1640, size: 768, offset: 8192)
!1640 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !1117, line: 463, baseType: !1641)
!1641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !1117, line: 465, size: 768, elements: !1642)
!1642 = !{!1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1641, file: !1117, line: 466, baseType: !1542, size: 16)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1641, file: !1117, line: 467, baseType: !1542, size: 16, offset: 16)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1641, file: !1117, line: 468, baseType: !1542, size: 16, offset: 32)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !1641, file: !1117, line: 469, baseType: !1542, size: 16, offset: 48)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1641, file: !1117, line: 470, baseType: !1542, size: 16, offset: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !1641, file: !1117, line: 471, baseType: !1542, size: 16, offset: 80)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1641, file: !1117, line: 472, baseType: !1400, size: 64, offset: 128)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1641, file: !1117, line: 473, baseType: !1400, size: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1641, file: !1117, line: 474, baseType: !1400, size: 64, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1641, file: !1117, line: 475, baseType: !1400, size: 64, offset: 320)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1641, file: !1117, line: 476, baseType: !1400, size: 64, offset: 384)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1641, file: !1117, line: 477, baseType: !1400, size: 64, offset: 448)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1641, file: !1117, line: 478, baseType: !1656, size: 256, offset: 512)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !1117, line: 452, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !1117, line: 454, size: 256, elements: !1658)
!1658 = !{!1659, !1660, !1661, !1662}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1657, file: !1117, line: 455, baseType: !1139, size: 32)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1657, file: !1117, line: 456, baseType: !1400, size: 64, offset: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1657, file: !1117, line: 457, baseType: !1139, size: 32, offset: 128)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1657, file: !1117, line: 458, baseType: !1400, size: 64, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1515, file: !1117, line: 580, baseType: !1139, size: 32, offset: 132352)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !1515, file: !1117, line: 581, baseType: !1139, size: 32, offset: 132384)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !1515, file: !1117, line: 582, baseType: !1214, size: 64, offset: 132416)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !1515, file: !1117, line: 583, baseType: !1531, size: 64, offset: 132480)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1515, file: !1117, line: 585, baseType: !1139, size: 32, offset: 132544)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1515, file: !1117, line: 586, baseType: !1139, size: 32, offset: 132576)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !1515, file: !1117, line: 587, baseType: !1141, size: 64, offset: 132608)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1515, file: !1117, line: 588, baseType: !1214, size: 64, offset: 132672)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !1515, file: !1117, line: 589, baseType: !1214, size: 64, offset: 132736)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !1515, file: !1117, line: 590, baseType: !1214, size: 64, offset: 132800)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1515, file: !1117, line: 594, baseType: !1631, size: 2048, offset: 132864)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !1515, file: !1117, line: 595, baseType: !1139, size: 32, offset: 134912)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !1515, file: !1117, line: 596, baseType: !1139, size: 32, offset: 134944)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !1515, file: !1117, line: 597, baseType: !1139, size: 32, offset: 134976)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !1117, line: 412, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !1117, line: 414, size: 1344, elements: !1680)
!1680 = !{!1681, !1682, !1683, !1684, !1685, !1686, !1687, !1689, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !1679, file: !1117, line: 415, baseType: !1214, size: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !1679, file: !1117, line: 416, baseType: !1214, size: 64, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !1679, file: !1117, line: 418, baseType: !1531, size: 64, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !1679, file: !1117, line: 420, baseType: !1214, size: 64, offset: 192)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !1679, file: !1117, line: 421, baseType: !1214, size: 64, offset: 256)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !1679, file: !1117, line: 422, baseType: !1139, size: 32, offset: 320)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !1679, file: !1117, line: 424, baseType: !1688, size: 128, offset: 384)
!1688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1531, size: 128, elements: !26)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !1679, file: !1117, line: 425, baseType: !1690, size: 128, offset: 512)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 128, elements: !26)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !1679, file: !1117, line: 426, baseType: !1531, size: 64, offset: 640)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !1679, file: !1117, line: 427, baseType: !1139, size: 32, offset: 704)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !1679, file: !1117, line: 429, baseType: !1139, size: 32, offset: 736)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !1679, file: !1117, line: 430, baseType: !1139, size: 32, offset: 768)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !1679, file: !1117, line: 431, baseType: !1139, size: 32, offset: 800)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !1679, file: !1117, line: 433, baseType: !1139, size: 32, offset: 832)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !1679, file: !1117, line: 434, baseType: !1139, size: 32, offset: 864)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !1679, file: !1117, line: 435, baseType: !1139, size: 32, offset: 896)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !1679, file: !1117, line: 436, baseType: !1139, size: 32, offset: 928)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !1679, file: !1117, line: 437, baseType: !1139, size: 32, offset: 960)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !1679, file: !1117, line: 438, baseType: !1139, size: 32, offset: 992)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !1679, file: !1117, line: 439, baseType: !1139, size: 32, offset: 1024)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !1679, file: !1117, line: 440, baseType: !1139, size: 32, offset: 1056)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !1679, file: !1117, line: 441, baseType: !1214, size: 64, offset: 1088)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1679, file: !1117, line: 443, baseType: !1214, size: 64, offset: 1152)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !1679, file: !1117, line: 445, baseType: !1531, size: 64, offset: 1216)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !1679, file: !1117, line: 446, baseType: !1531, size: 64, offset: 1280)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1506, file: !1411, line: 204, baseType: !1421, size: 64, offset: 64)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !1410, file: !1411, line: 205, baseType: !1710, size: 128, offset: 1536)
!1710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !1411, line: 205, size: 128, elements: !1711)
!1711 = !{!1712, !1717}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1710, file: !1411, line: 205, baseType: !1713, size: 64)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !1411, line: 112, baseType: !1714)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!1139, !1421, !1142, !1400, !1400, !1139}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1710, file: !1411, line: 205, baseType: !1421, size: 64, offset: 64)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !1410, file: !1411, line: 206, baseType: !1719, size: 128, offset: 1664)
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !1411, line: 206, size: 128, elements: !1720)
!1720 = !{!1721, !1726}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1719, file: !1411, line: 206, baseType: !1722, size: 64)
!1722 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !1411, line: 115, baseType: !1723)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{!1139, !1421, !1142, !1400, !1400, !1400, !1139}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1719, file: !1411, line: 206, baseType: !1421, size: 64, offset: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !1410, file: !1411, line: 207, baseType: !1728, size: 128, offset: 1792)
!1728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !1411, line: 207, size: 128, elements: !1729)
!1729 = !{!1730, !1735}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1728, file: !1411, line: 207, baseType: !1731, size: 64)
!1731 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !1411, line: 119, baseType: !1732)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{null, !1421, !1142, !1400}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1728, file: !1411, line: 207, baseType: !1421, size: 64, offset: 64)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !1410, file: !1411, line: 208, baseType: !1737, size: 128, offset: 1920)
!1737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !1411, line: 208, size: 128, elements: !1738)
!1738 = !{!1739, !1741}
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1737, file: !1411, line: 208, baseType: !1740, size: 64)
!1740 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !1411, line: 121, baseType: !1732)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1737, file: !1411, line: 208, baseType: !1421, size: 64, offset: 64)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !1410, file: !1411, line: 209, baseType: !1743, size: 128, offset: 2048)
!1743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !1411, line: 209, size: 128, elements: !1744)
!1744 = !{!1745, !1750}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1743, file: !1411, line: 209, baseType: !1746, size: 64)
!1746 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !1411, line: 123, baseType: !1747)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64)
!1748 = !DISubroutineType(types: !1749)
!1749 = !{null, !1421, !1142, !1400, !1400, !1400, !1139, !1139, !1139}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1743, file: !1411, line: 209, baseType: !1421, size: 64, offset: 64)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !1410, file: !1411, line: 210, baseType: !1752, size: 128, offset: 2176)
!1752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !1411, line: 210, size: 128, elements: !1753)
!1753 = !{!1754, !1759}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1752, file: !1411, line: 210, baseType: !1755, size: 64)
!1755 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !1411, line: 128, baseType: !1756)
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1757, size: 64)
!1757 = !DISubroutineType(types: !1758)
!1758 = !{!1139, !1421, !1142, !1141}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1752, file: !1411, line: 210, baseType: !1421, size: 64, offset: 64)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !1410, file: !1411, line: 211, baseType: !1761, size: 128, offset: 2304)
!1761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !1411, line: 211, size: 128, elements: !1762)
!1762 = !{!1763, !1768}
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1761, file: !1411, line: 211, baseType: !1764, size: 64)
!1764 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !1411, line: 130, baseType: !1765)
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1766, size: 64)
!1766 = !DISubroutineType(types: !1767)
!1767 = !{!1139, !1421, !1142, !1141, !1400}
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1761, file: !1411, line: 211, baseType: !1421, size: 64, offset: 64)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !1410, file: !1411, line: 212, baseType: !1770, size: 128, offset: 2432)
!1770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !1411, line: 212, size: 128, elements: !1771)
!1771 = !{!1772, !1777}
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1770, file: !1411, line: 212, baseType: !1773, size: 64)
!1773 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !1411, line: 133, baseType: !1774)
!1774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1775, size: 64)
!1775 = !DISubroutineType(types: !1776)
!1776 = !{!1139, !1421, !1142, !1513}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1770, file: !1411, line: 212, baseType: !1421, size: 64, offset: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !1410, file: !1411, line: 213, baseType: !1779, size: 128, offset: 2560)
!1779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !1411, line: 213, size: 128, elements: !1780)
!1780 = !{!1781, !1786}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1779, file: !1411, line: 213, baseType: !1782, size: 64)
!1782 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !1411, line: 135, baseType: !1783)
!1783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1784, size: 64)
!1784 = !DISubroutineType(types: !1785)
!1785 = !{!1139, !1421, !1142, !1400, !1400, !1400, !1400, !1141}
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1779, file: !1411, line: 213, baseType: !1421, size: 64, offset: 64)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !1410, file: !1411, line: 214, baseType: !1788, size: 128, offset: 2688)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !1411, line: 214, size: 128, elements: !1789)
!1789 = !{!1790, !1796}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1788, file: !1411, line: 214, baseType: !1791, size: 64)
!1791 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !1411, line: 142, baseType: !1792)
!1792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1793, size: 64)
!1793 = !DISubroutineType(types: !1794)
!1794 = !{!1139, !1421, !1142, !1141, !1400, !1400, !1400, !1400, !1795}
!1795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1788, file: !1411, line: 214, baseType: !1421, size: 64, offset: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !1410, file: !1411, line: 215, baseType: !1798, size: 128, offset: 2816)
!1798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !1411, line: 215, size: 128, elements: !1799)
!1799 = !{!1800, !1802}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1798, file: !1411, line: 215, baseType: !1801, size: 64)
!1801 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !1411, line: 148, baseType: !1792)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1798, file: !1411, line: 215, baseType: !1421, size: 64, offset: 64)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !1410, file: !1411, line: 216, baseType: !1804, size: 128, offset: 2944)
!1804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !1411, line: 216, size: 128, elements: !1805)
!1805 = !{!1806, !1875}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1804, file: !1411, line: 216, baseType: !1807, size: 64)
!1807 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !1411, line: 156, baseType: !1808)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64)
!1809 = !DISubroutineType(types: !1810)
!1810 = !{!1139, !1421, !1142, !1811}
!1811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1812, size: 64)
!1812 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !1411, line: 56, baseType: !1813)
!1813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !1814, line: 71, size: 1216, elements: !1815)
!1814 = !DIFile(filename: "./src/htsmodules.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "65f13e42a0265151bd8524490683afa8")
!1815 = !{!1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1829, !1830, !1831, !1832, !1833, !1842, !1871, !1872, !1873, !1874}
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1813, file: !1814, line: 73, baseType: !1400, size: 64)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1813, file: !1814, line: 74, baseType: !1139, size: 32, offset: 64)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "mime", scope: !1813, file: !1814, line: 75, baseType: !1400, size: 64, offset: 128)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "url_host", scope: !1813, file: !1814, line: 76, baseType: !1400, size: 64, offset: 192)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "url_file", scope: !1813, file: !1814, line: 77, baseType: !1400, size: 64, offset: 256)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1813, file: !1814, line: 80, baseType: !1400, size: 64, offset: 320)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !1813, file: !1814, line: 81, baseType: !1141, size: 64, offset: 384)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "relativeToHtmlLink", scope: !1813, file: !1814, line: 84, baseType: !1139, size: 32, offset: 448)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "addLink", scope: !1813, file: !1814, line: 89, baseType: !1825, size: 64, offset: 512)
!1825 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_htsAddLink", file: !1814, line: 68, baseType: !1826)
!1826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1827, size: 64)
!1827 = !DISubroutineType(types: !1828)
!1828 = !{!1139, !1811, !1141}
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "localLink", scope: !1813, file: !1814, line: 94, baseType: !1141, size: 64, offset: 576)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "localLinkSize", scope: !1813, file: !1814, line: 97, baseType: !1139, size: 32, offset: 640)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !1813, file: !1814, line: 100, baseType: !1208, size: 64, offset: 704)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !1813, file: !1814, line: 104, baseType: !1142, size: 64, offset: 768)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "sback", scope: !1813, file: !1814, line: 107, baseType: !1834, size: 64, offset: 832)
!1834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1835, size: 64)
!1835 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_back", file: !1326, line: 65, baseType: !1836)
!1836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_back", file: !1326, line: 156, size: 256, elements: !1837)
!1837 = !{!1838, !1839, !1840, !1841}
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "lnk", scope: !1836, file: !1326, line: 157, baseType: !1513, size: 64)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1836, file: !1326, line: 158, baseType: !1139, size: 32, offset: 64)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !1836, file: !1326, line: 159, baseType: !1352, size: 64, offset: 128)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "ready_size_bytes", scope: !1836, file: !1326, line: 160, baseType: !1214, size: 64, offset: 192)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1813, file: !1814, line: 108, baseType: !1843, size: 64, offset: 896)
!1843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1844, size: 64)
!1844 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_back", file: !1326, line: 69, baseType: !1845)
!1845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_back", file: !1326, line: 170, size: 3136, elements: !1846)
!1846 = !{!1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1869, !1870}
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1845, file: !1326, line: 171, baseType: !1139, size: 32)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1845, file: !1326, line: 173, baseType: !1139, size: 32, offset: 32)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "ro", scope: !1845, file: !1326, line: 174, baseType: !1139, size: 32, offset: 64)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "dat", scope: !1845, file: !1326, line: 175, baseType: !1161, size: 64, offset: 128)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "ndx", scope: !1845, file: !1326, line: 175, baseType: !1161, size: 64, offset: 192)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "olddat", scope: !1845, file: !1326, line: 175, baseType: !1161, size: 64, offset: 256)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1845, file: !1326, line: 176, baseType: !1141, size: 64, offset: 320)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !1845, file: !1326, line: 177, baseType: !1161, size: 64, offset: 384)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "txt", scope: !1845, file: !1326, line: 178, baseType: !1161, size: 64, offset: 448)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !1845, file: !1326, line: 179, baseType: !1631, size: 2048, offset: 512)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !1845, file: !1326, line: 181, baseType: !1352, size: 64, offset: 2560)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "cached_tests", scope: !1845, file: !1326, line: 183, baseType: !1352, size: 64, offset: 2624)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1845, file: !1326, line: 185, baseType: !1161, size: 64, offset: 2688)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !1845, file: !1326, line: 186, baseType: !1161, size: 64, offset: 2752)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_ant", scope: !1845, file: !1326, line: 188, baseType: !1139, size: 32, offset: 2816)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_last", scope: !1845, file: !1326, line: 189, baseType: !1139, size: 32, offset: 2848)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "zipInput", scope: !1845, file: !1326, line: 191, baseType: !1208, size: 64, offset: 2880)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "zipOutput", scope: !1845, file: !1326, line: 192, baseType: !1208, size: 64, offset: 2944)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "zipEntries", scope: !1845, file: !1326, line: 193, baseType: !1866, size: 64, offset: 3008)
!1866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1867, size: 64)
!1867 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_back_zip_entry", file: !1326, line: 163, baseType: !1868)
!1868 = !DICompositeType(tag: DW_TAG_structure_type, name: "cache_back_zip_entry", file: !1326, line: 163, flags: DIFlagFwdDecl)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "zipEntriesOffs", scope: !1845, file: !1326, line: 194, baseType: !1139, size: 32, offset: 3072)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "zipEntriesCapa", scope: !1845, file: !1326, line: 195, baseType: !1139, size: 32, offset: 3104)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "hashptr", scope: !1813, file: !1814, line: 109, baseType: !1323, size: 64, offset: 960)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "numero_passe", scope: !1813, file: !1814, line: 110, baseType: !1139, size: 32, offset: 1024)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_", scope: !1813, file: !1814, line: 112, baseType: !1321, size: 64, offset: 1088)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "page_charset_", scope: !1813, file: !1814, line: 113, baseType: !1400, size: 64, offset: 1152)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1804, file: !1411, line: 216, baseType: !1421, size: 64, offset: 64)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !1410, file: !1411, line: 217, baseType: !1877, size: 128, offset: 3072)
!1877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !1411, line: 217, size: 128, elements: !1878)
!1878 = !{!1879, !1881}
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1877, file: !1411, line: 217, baseType: !1880, size: 64)
!1880 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !1411, line: 158, baseType: !1808)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1877, file: !1411, line: 217, baseType: !1421, size: 64, offset: 64)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !1410, file: !1411, line: 219, baseType: !1883, size: 128, offset: 3200)
!1883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !1411, line: 219, size: 128, elements: !1884)
!1884 = !{!1885, !1887}
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1883, file: !1411, line: 219, baseType: !1886, size: 64)
!1886 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !1411, line: 141, baseType: !1782)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1883, file: !1411, line: 219, baseType: !1421, size: 64, offset: 64)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !1144, file: !1117, line: 404, baseType: !1889, size: 128, offset: 7040)
!1889 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !1117, line: 260, baseType: !1890)
!1890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !1117, line: 270, size: 128, elements: !1891)
!1891 = !{!1892, !1893}
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1890, file: !1117, line: 271, baseType: !1139, size: 32)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1890, file: !1117, line: 272, baseType: !1894, size: 64, offset: 64)
!1894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1895, size: 64)
!1895 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !1117, line: 264, baseType: !1896)
!1896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !1117, line: 266, size: 128, elements: !1897)
!1897 = !{!1898, !1899}
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !1896, file: !1117, line: 267, baseType: !1141, size: 64)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1896, file: !1117, line: 268, baseType: !1208, size: 64, offset: 64)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1144, file: !1117, line: 406, baseType: !1901, size: 1126016, offset: 7168)
!1901 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !1117, line: 216, baseType: !1902)
!1902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !1117, line: 218, size: 1126016, elements: !1903)
!1903 = !{!1904, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1949, !1961, !1969, !1975, !1982, !1983, !1984, !1985, !1996, !1997, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2015, !2016, !2017, !2018}
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1902, file: !1117, line: 219, baseType: !1905, size: 64)
!1905 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !1117, line: 204, baseType: !1906)
!1906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1907, size: 64)
!1907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !1908, line: 59, size: 320, elements: !1909)
!1908 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!1909 = !{!1910}
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1907, file: !1908, line: 60, baseType: !1911, size: 320)
!1911 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1912, line: 72, baseType: !1913)
!1912 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!1913 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1912, line: 67, size: 320, elements: !1914)
!1914 = !{!1915, !1934, !1935}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1913, file: !1912, line: 69, baseType: !1916, size: 320)
!1916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1917, line: 22, size: 320, elements: !1918)
!1917 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!1918 = !{!1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1916, file: !1917, line: 24, baseType: !1139, size: 32)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1916, file: !1917, line: 25, baseType: !1102, size: 32, offset: 32)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1916, file: !1917, line: 26, baseType: !1139, size: 32, offset: 64)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1916, file: !1917, line: 28, baseType: !1102, size: 32, offset: 96)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1916, file: !1917, line: 32, baseType: !1139, size: 32, offset: 128)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1916, file: !1917, line: 34, baseType: !1542, size: 16, offset: 160)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1916, file: !1917, line: 35, baseType: !1542, size: 16, offset: 176)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1916, file: !1917, line: 36, baseType: !1927, size: 128, offset: 192)
!1927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1928, line: 55, baseType: !1929)
!1928 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!1929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1928, line: 51, size: 128, elements: !1930)
!1930 = !{!1931, !1933}
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1929, file: !1928, line: 53, baseType: !1932, size: 64)
!1932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1929, size: 64)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1929, file: !1928, line: 54, baseType: !1932, size: 64, offset: 64)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1913, file: !1912, line: 70, baseType: !699, size: 320)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1913, file: !1912, line: 71, baseType: !1189, size: 64)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1902, file: !1117, line: 221, baseType: !1139, size: 32, offset: 64)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !1902, file: !1117, line: 222, baseType: !1139, size: 32, offset: 96)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !1902, file: !1117, line: 223, baseType: !1139, size: 32, offset: 128)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !1902, file: !1117, line: 225, baseType: !1139, size: 32, offset: 160)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !1902, file: !1117, line: 226, baseType: !1239, size: 192, offset: 192)
