; ModuleID = 'src/htscore.c'
source_filename = "src/htscore.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hts_stat_struct = type { i64, i64, i64, i64, i64, i32, [2 x i64], [2 x i64], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i64 }
%struct.t_hts_htmlcheck_callbacks = type { %struct.init, %struct.uninit, %struct.start, %struct.end, %struct.chopt, %struct.preprocess, %struct.postprocess, %struct.check_html, %struct.query, %struct.query2, %struct.query3, %struct.loop, %struct.check_link, %struct.check_mime, %struct.pause, %struct.filesave, %struct.filesave2, %struct.linkdetected, %struct.linkdetected2, %struct.xfrstatus, %struct.savename, %struct.sendhead, %struct.receivehead, %struct.detect, %struct.parse, %struct.extsavename }
%struct.init = type { ptr, ptr }
%struct.uninit = type { ptr, ptr }
%struct.start = type { ptr, ptr }
%struct.end = type { ptr, ptr }
%struct.chopt = type { ptr, ptr }
%struct.preprocess = type { ptr, ptr }
%struct.postprocess = type { ptr, ptr }
%struct.check_html = type { ptr, ptr }
%struct.query = type { ptr, ptr }
%struct.query2 = type { ptr, ptr }
%struct.query3 = type { ptr, ptr }
%struct.loop = type { ptr, ptr }
%struct.check_link = type { ptr, ptr }
%struct.check_mime = type { ptr, ptr }
%struct.pause = type { ptr, ptr }
%struct.filesave = type { ptr, ptr }
%struct.filesave2 = type { ptr, ptr }

!623 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!624 = !DIEnumerator(name: "HTTP_USE_PROXY", value: 305)
!625 = !DIEnumerator(name: "HTTP_TEMPORARY_REDIRECT", value: 307)
!626 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!627 = !DIEnumerator(name: "HTTP_UNAUTHORIZED", value: 401)
!628 = !DIEnumerator(name: "HTTP_PAYMENT_REQUIRED", value: 402)
!629 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!630 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!631 = !DIEnumerator(name: "HTTP_METHOD_NOT_ALLOWED", value: 405)
!632 = !DIEnumerator(name: "HTTP_NOT_ACCEPTABLE", value: 406)
!633 = !DIEnumerator(name: "HTTP_PROXY_AUTHENTICATION_REQUIRED", value: 407)
!634 = !DIEnumerator(name: "HTTP_REQUEST_TIME_OUT", value: 408)
!635 = !DIEnumerator(name: "HTTP_CONFLICT", value: 409)
!636 = !DIEnumerator(name: "HTTP_GONE", value: 410)
!637 = !DIEnumerator(name: "HTTP_LENGTH_REQUIRED", value: 411)
!638 = !DIEnumerator(name: "HTTP_PRECONDITION_FAILED", value: 412)
!639 = !DIEnumerator(name: "HTTP_REQUEST_ENTITY_TOO_LARGE", value: 413)
!640 = !DIEnumerator(name: "HTTP_REQUEST_URI_TOO_LARGE", value: 414)
!641 = !DIEnumerator(name: "HTTP_UNSUPPORTED_MEDIA_TYPE", value: 415)
!642 = !DIEnumerator(name: "HTTP_REQUESTED_RANGE_NOT_SATISFIABLE", value: 416)
!643 = !DIEnumerator(name: "HTTP_EXPECTATION_FAILED", value: 417)
!644 = !DIEnumerator(name: "HTTP_INTERNAL_SERVER_ERROR", value: 500)
!645 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!646 = !DIEnumerator(name: "HTTP_BAD_GATEWAY", value: 502)
!647 = !DIEnumerator(name: "HTTP_SERVICE_UNAVAILABLE", value: 503)
!648 = !DIEnumerator(name: "HTTP_GATEWAY_TIME_OUT", value: 504)
!649 = !DIEnumerator(name: "HTTP_HTTP_VERSION_NOT_SUPPORTED", value: 505)
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "htsparsejava_flags", file: !651, line: 276, baseType: !582, size: 32, elements: !652)
!651 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!652 = !{!653, !654, !655, !656, !657}
!653 = !DIEnumerator(name: "HTSPARSE_NONE", value: 0)
!654 = !DIEnumerator(name: "HTSPARSE_DEFAULT", value: 1)
!655 = !DIEnumerator(name: "HTSPARSE_NO_CLASS", value: 2)
!656 = !DIEnumerator(name: "HTSPARSE_NO_JAVASCRIPT", value: 4)
!657 = !DIEnumerator(name: "HTSPARSE_NO_AGGRESSIVE", value: 8)
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BackStatusCode", file: !608, line: 134, baseType: !659, size: 32, elements: !660)
!659 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668}
!661 = !DIEnumerator(name: "STATUSCODE_INVALID", value: -1)
!662 = !DIEnumerator(name: "STATUSCODE_TIMEOUT", value: -2)
!663 = !DIEnumerator(name: "STATUSCODE_SLOW", value: -3)
!664 = !DIEnumerator(name: "STATUSCODE_CONNERROR", value: -4)
!665 = !DIEnumerator(name: "STATUSCODE_NON_FATAL", value: -5)
!666 = !DIEnumerator(name: "STATUSCODE_SSL_HANDSHAKE", value: -6)
!667 = !DIEnumerator(name: "STATUSCODE_TOO_BIG", value: -7)
!668 = !DIEnumerator(name: "STATUSCODE_TEST_OK", value: -10)
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_struct_type", file: !670, line: 47, baseType: !582, size: 32, elements: !671)
!670 = !DIFile(filename: "./src/htshash.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "aa49d00442b5a2bfe1a89d2b483709db")
!671 = !{!672, !673, !674}
!672 = !DIEnumerator(name: "HASH_STRUCT_FILENAME", value: 0)
!673 = !DIEnumerator(name: "HASH_STRUCT_ADR_PATH", value: 1)
!674 = !DIEnumerator(name: "HASH_STRUCT_ORIGINAL_ADR_PATH", value: 2)
!675 = !{!676, !677, !678, !679, !683, !911, !659, !682, !1313, !769, !726, !1602, !582, !794, !1246, !901, !1603, !1277, !721, !1548, !1557, !905, !951, !1605}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!677 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !685, line: 164, baseType: !686)
!685 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !685, line: 191, size: 3328, elements: !687)
!687 = !{!688, !707, !713, !1162, !1168, !1174, !1184, !1190, !1199, !1208, !1214, !1220, !1423, !1432, !1441, !1450, !1456, !1465, !1474, !1483, !1492, !1501, !1511, !1517, !1590, !1596}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !686, file: !685, line: 193, baseType: !689, size: 128)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !685, line: 193, size: 128, elements: !690)
!690 = !{!691, !706}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !689, file: !685, line: 193, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !685, line: 83, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !685, line: 60, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !685, line: 179, size: 192, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !698, file: !685, line: 181, baseType: !676, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !698, file: !685, line: 187, baseType: !702, size: 128, offset: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !685, line: 184, size: 128, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !702, file: !685, line: 185, baseType: !676, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !702, file: !685, line: 186, baseType: !696, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !689, file: !685, line: 193, baseType: !696, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !686, file: !685, line: 194, baseType: !708, size: 128, offset: 128)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !685, line: 194, size: 128, elements: !709)
!709 = !{!710, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !708, file: !685, line: 194, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !685, line: 84, baseType: !693)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !708, file: !685, line: 194, baseType: !696, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !686, file: !685, line: 195, baseType: !714, size: 128, offset: 256)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !685, line: 195, size: 128, elements: !715)
!715 = !{!716, !1161}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !714, file: !685, line: 195, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !685, line: 85, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!659, !696, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !581, line: 49, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !651, line: 294, size: 1133184, elements: !724)
!724 = !{!725, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !792, !793, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !810, !811, !812, !813, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !904, !949, !952, !953, !994, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1038}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !723, file: !651, line: 295, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !727, line: 46, baseType: !728)
!727 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!728 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !723, file: !651, line: 297, baseType: !659, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !723, file: !651, line: 298, baseType: !659, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !723, file: !651, line: 299, baseType: !659, size: 32, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !723, file: !651, line: 300, baseType: !659, size: 32, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !723, file: !651, line: 301, baseType: !659, size: 32, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !723, file: !651, line: 302, baseType: !659, size: 32, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !723, file: !651, line: 303, baseType: !659, size: 32, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !723, file: !651, line: 304, baseType: !659, size: 32, offset: 288)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !723, file: !651, line: 305, baseType: !659, size: 32, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !723, file: !651, line: 306, baseType: !659, size: 32, offset: 352)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !723, file: !651, line: 307, baseType: !740, size: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !742, line: 7, baseType: !743)
!742 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !744, line: 49, size: 1728, elements: !745)
!744 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !761, !763, !764, !765, !768, !770, !772, !773, !776, !778, !781, !784, !785, !786, !787, !788}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !743, file: !744, line: 51, baseType: !659, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !743, file: !744, line: 54, baseType: !682, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !743, file: !744, line: 55, baseType: !682, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !743, file: !744, line: 56, baseType: !682, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !743, file: !744, line: 57, baseType: !682, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !743, file: !744, line: 58, baseType: !682, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !743, file: !744, line: 59, baseType: !682, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !743, file: !744, line: 60, baseType: !682, size: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !743, file: !744, line: 61, baseType: !682, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !743, file: !744, line: 64, baseType: !682, size: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !743, file: !744, line: 65, baseType: !682, size: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !743, file: !744, line: 66, baseType: !682, size: 64, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !743, file: !744, line: 68, baseType: !759, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !744, line: 36, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !743, file: !744, line: 70, baseType: !762, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !743, file: !744, line: 72, baseType: !659, size: 32, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !743, file: !744, line: 73, baseType: !659, size: 32, offset: 928)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !743, file: !744, line: 74, baseType: !766, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !767, line: 152, baseType: !677)
!767 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !743, file: !744, line: 77, baseType: !769, size: 16, offset: 1024)
!769 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !743, file: !744, line: 78, baseType: !771, size: 8, offset: 1040)
!771 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !743, file: !744, line: 79, baseType: !24, size: 8, offset: 1048)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !743, file: !744, line: 81, baseType: !774, size: 64, offset: 1088)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !744, line: 43, baseType: null)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !743, file: !744, line: 89, baseType: !777, size: 64, offset: 1152)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !767, line: 153, baseType: !677)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !743, file: !744, line: 91, baseType: !779, size: 64, offset: 1216)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !744, line: 37, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !743, file: !744, line: 92, baseType: !782, size: 64, offset: 1280)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !744, line: 38, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !743, file: !744, line: 93, baseType: !762, size: 64, offset: 1344)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !743, file: !744, line: 94, baseType: !676, size: 64, offset: 1408)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !743, file: !744, line: 95, baseType: !726, size: 64, offset: 1472)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !743, file: !744, line: 96, baseType: !659, size: 32, offset: 1536)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !743, file: !744, line: 98, baseType: !789, size: 160, offset: 1568)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 20)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !723, file: !651, line: 308, baseType: !740, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !723, file: !651, line: 309, baseType: !794, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !795, line: 283, baseType: !677)
!795 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!796 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !723, file: !651, line: 310, baseType: !794, size: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !723, file: !651, line: 311, baseType: !794, size: 64, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !723, file: !651, line: 312, baseType: !659, size: 32, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !723, file: !651, line: 313, baseType: !794, size: 64, offset: 768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !723, file: !651, line: 314, baseType: !659, size: 32, offset: 832)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !723, file: !651, line: 315, baseType: !659, size: 32, offset: 864)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !723, file: !651, line: 316, baseType: !659, size: 32, offset: 896)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !723, file: !651, line: 317, baseType: !659, size: 32, offset: 928)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !723, file: !651, line: 318, baseType: !659, size: 32, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !723, file: !651, line: 319, baseType: !659, size: 32, offset: 992)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !723, file: !651, line: 320, baseType: !659, size: 32, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !723, file: !651, line: 321, baseType: !659, size: 32, offset: 1056)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !723, file: !651, line: 322, baseType: !809, size: 32, offset: 1088)
!809 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !723, file: !651, line: 323, baseType: !659, size: 32, offset: 1120)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !723, file: !651, line: 324, baseType: !659, size: 32, offset: 1152)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !723, file: !651, line: 326, baseType: !659, size: 32, offset: 1184)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !723, file: !651, line: 327, baseType: !814, size: 512, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !651, line: 89, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !651, line: 91, size: 512, elements: !816)
!816 = !{!817, !818, !826, !827}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !815, file: !651, line: 92, baseType: !659, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !651, line: 93, baseType: !819, size: 192, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !820, line: 57, baseType: !821)
!820 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !820, line: 61, size: 192, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !821, file: !820, line: 62, baseType: !682, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !821, file: !820, line: 63, baseType: !726, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !821, file: !820, line: 64, baseType: !726, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !815, file: !651, line: 94, baseType: !659, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !815, file: !651, line: 95, baseType: !819, size: 192, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !723, file: !651, line: 328, baseType: !659, size: 32, offset: 1728)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !723, file: !651, line: 329, baseType: !659, size: 32, offset: 1760)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !723, file: !651, line: 330, baseType: !819, size: 192, offset: 1792)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !723, file: !651, line: 331, baseType: !659, size: 32, offset: 1984)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !723, file: !651, line: 332, baseType: !659, size: 32, offset: 2016)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !723, file: !651, line: 333, baseType: !659, size: 32, offset: 2048)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !723, file: !651, line: 334, baseType: !659, size: 32, offset: 2080)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !723, file: !651, line: 335, baseType: !819, size: 192, offset: 2112)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !723, file: !651, line: 336, baseType: !819, size: 192, offset: 2304)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !723, file: !651, line: 337, baseType: !819, size: 192, offset: 2496)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !723, file: !651, line: 338, baseType: !819, size: 192, offset: 2688)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !723, file: !651, line: 339, baseType: !819, size: 192, offset: 2880)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !723, file: !651, line: 340, baseType: !819, size: 192, offset: 3072)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !723, file: !651, line: 341, baseType: !819, size: 192, offset: 3264)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !723, file: !651, line: 342, baseType: !659, size: 32, offset: 3456)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !723, file: !651, line: 343, baseType: !659, size: 32, offset: 3488)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !723, file: !651, line: 344, baseType: !659, size: 32, offset: 3520)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !723, file: !651, line: 345, baseType: !659, size: 32, offset: 3552)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !723, file: !651, line: 346, baseType: !659, size: 32, offset: 3584)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !723, file: !651, line: 347, baseType: !659, size: 32, offset: 3616)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !723, file: !651, line: 348, baseType: !659, size: 32, offset: 3648)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !723, file: !651, line: 349, baseType: !659, size: 32, offset: 3680)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !723, file: !651, line: 350, baseType: !659, size: 32, offset: 3712)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !723, file: !651, line: 351, baseType: !659, size: 32, offset: 3744)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !723, file: !651, line: 352, baseType: !659, size: 32, offset: 3776)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !723, file: !651, line: 353, baseType: !659, size: 32, offset: 3808)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !723, file: !651, line: 354, baseType: !659, size: 32, offset: 3840)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !723, file: !651, line: 355, baseType: !819, size: 192, offset: 3904)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !723, file: !651, line: 356, baseType: !659, size: 32, offset: 4096)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !723, file: !651, line: 357, baseType: !659, size: 32, offset: 4128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !723, file: !651, line: 358, baseType: !859, size: 64, offset: 4160)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !861, line: 53, baseType: !862)
!861 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !861, line: 55, size: 278656, elements: !863)
!863 = !{!864, !865, !869}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !862, file: !861, line: 56, baseType: !659, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !862, file: !861, line: 57, baseType: !866, size: 262144, offset: 32)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 32768)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !862, file: !861, line: 58, baseType: !870, size: 16448, offset: 262208)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !861, line: 42, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !861, line: 44, size: 16448, elements: !872)
!872 = !{!873, !877, !878}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !871, file: !861, line: 45, baseType: !874, size: 8192)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 1024)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !871, file: !861, line: 46, baseType: !874, size: 8192, offset: 8192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !861, line: 47, baseType: !879, size: 64, offset: 16384)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !723, file: !651, line: 359, baseType: !659, size: 32, offset: 4224)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !723, file: !651, line: 360, baseType: !659, size: 32, offset: 4256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !723, file: !651, line: 361, baseType: !659, size: 32, offset: 4288)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !723, file: !651, line: 362, baseType: !659, size: 32, offset: 4320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !723, file: !651, line: 363, baseType: !659, size: 32, offset: 4352)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !723, file: !651, line: 364, baseType: !659, size: 32, offset: 4384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !723, file: !651, line: 365, baseType: !659, size: 32, offset: 4416)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !723, file: !651, line: 366, baseType: !659, size: 32, offset: 4448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !723, file: !651, line: 367, baseType: !659, size: 32, offset: 4480)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !723, file: !651, line: 368, baseType: !659, size: 32, offset: 4512)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !723, file: !651, line: 369, baseType: !819, size: 192, offset: 4544)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !723, file: !651, line: 370, baseType: !659, size: 32, offset: 4736)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !723, file: !651, line: 372, baseType: !659, size: 32, offset: 4768)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !723, file: !651, line: 373, baseType: !819, size: 192, offset: 4800)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !723, file: !651, line: 374, baseType: !819, size: 192, offset: 4992)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !723, file: !651, line: 375, baseType: !896, size: 128, offset: 5184)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !651, line: 101, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !651, line: 103, size: 128, elements: !898)
!898 = !{!899, !902}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !897, file: !651, line: 104, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !897, file: !651, line: 105, baseType: !903, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !723, file: !651, line: 376, baseType: !905, size: 64, offset: 5312)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !907, line: 73, baseType: !908)
!907 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !907, line: 202, size: 98624, elements: !909)
!909 = !{!910, !933, !937, !938, !939, !940, !944, !945}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !908, file: !907, line: 204, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !907, line: 57, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !651, line: 534, size: 640, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !918, file: !651, line: 535, baseType: !682, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !918, file: !651, line: 536, baseType: !682, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !918, file: !651, line: 537, baseType: !682, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !918, file: !651, line: 538, baseType: !682, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !918, file: !651, line: 539, baseType: !682, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !918, file: !651, line: 540, baseType: !682, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !918, file: !651, line: 542, baseType: !659, size: 32, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !918, file: !651, line: 543, baseType: !659, size: 32, offset: 416)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !918, file: !651, line: 544, baseType: !659, size: 32, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !918, file: !651, line: 545, baseType: !659, size: 32, offset: 480)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !918, file: !651, line: 546, baseType: !4, size: 8, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !918, file: !651, line: 548, baseType: !659, size: 32, offset: 544)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !918, file: !651, line: 549, baseType: !659, size: 32, offset: 576)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !908, file: !907, line: 206, baseType: !934, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !651, line: 210, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !651, line: 210, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !908, file: !907, line: 208, baseType: !934, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !908, file: !907, line: 210, baseType: !934, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !908, file: !907, line: 212, baseType: !659, size: 32, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !908, file: !907, line: 213, baseType: !941, size: 16384, offset: 288)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 2048)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !908, file: !907, line: 214, baseType: !941, size: 16384, offset: 16672)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !908, file: !907, line: 215, baseType: !946, size: 65536, offset: 33056)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 8192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !723, file: !651, line: 377, baseType: !950, size: 64, offset: 5376)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !723, file: !651, line: 378, baseType: !659, size: 32, offset: 5440)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !723, file: !651, line: 379, baseType: !954, size: 64, offset: 5504)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !651, line: 286, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !2, line: 163, size: 960, elements: !957)
!957 = !{!958, !968, !969, !970, !971, !981, !982, !983, !984}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !956, file: !2, line: 166, baseType: !959, size: 192)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !956, file: !2, line: 166, size: 192, elements: !960)
!960 = !{!961, !966, !967}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !959, file: !2, line: 166, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !959, file: !2, line: 166, size: 64, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !962, file: !2, line: 166, baseType: !950, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !962, file: !2, line: 166, baseType: !676, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !959, file: !2, line: 166, baseType: !726, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !959, file: !2, line: 166, baseType: !726, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "string_buffer", scope: !956, file: !2, line: 168, baseType: !682, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "string_buffer_size", scope: !956, file: !2, line: 169, baseType: !726, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "string_buffer_capa", scope: !956, file: !2, line: 170, baseType: !726, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "string_buffers", scope: !956, file: !2, line: 171, baseType: !972, size: 192, offset: 384)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !956, file: !2, line: 171, size: 192, elements: !973)
!973 = !{!974, !979, !980}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !972, file: !2, line: 171, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !972, file: !2, line: 171, size: 64, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !975, file: !2, line: 171, baseType: !901, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !975, file: !2, line: 171, baseType: !676, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !972, file: !2, line: 171, baseType: !726, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !972, file: !2, line: 171, baseType: !726, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lien_buffer", scope: !956, file: !2, line: 173, baseType: !951, size: 64, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lien_buffer_size", scope: !956, file: !2, line: 174, baseType: !726, size: 64, offset: 640)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lien_buffer_capa", scope: !956, file: !2, line: 175, baseType: !726, size: 64, offset: 704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lien_buffers", scope: !956, file: !2, line: 176, baseType: !985, size: 192, offset: 768)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !956, file: !2, line: 176, size: 192, elements: !986)
!986 = !{!987, !992, !993}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !985, file: !2, line: 176, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !985, file: !2, line: 176, size: 64, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !988, file: !2, line: 176, baseType: !950, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !988, file: !2, line: 176, baseType: !676, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !985, file: !2, line: 176, baseType: !726, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "capa", scope: !985, file: !2, line: 176, baseType: !726, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !723, file: !651, line: 380, baseType: !995, size: 64, offset: 5568)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !651, line: 61, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !998, line: 42, size: 33856, elements: !999)
!998 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!999 = !{!1000, !1004, !1008}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !997, file: !998, line: 43, baseType: !1001, size: 1024)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !997, file: !998, line: 44, baseType: !1005, size: 32768, offset: 1024)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 4096)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !997, file: !998, line: 45, baseType: !1009, size: 64, offset: 33792)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !723, file: !651, line: 381, baseType: !819, size: 192, offset: 5632)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !723, file: !651, line: 382, baseType: !819, size: 192, offset: 5824)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !723, file: !651, line: 383, baseType: !819, size: 192, offset: 6016)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !723, file: !651, line: 384, baseType: !819, size: 192, offset: 6208)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !723, file: !651, line: 385, baseType: !819, size: 192, offset: 6400)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !723, file: !651, line: 386, baseType: !659, size: 32, offset: 6592)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !723, file: !651, line: 388, baseType: !659, size: 32, offset: 6624)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !723, file: !651, line: 389, baseType: !659, size: 32, offset: 6656)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !723, file: !651, line: 391, baseType: !678, size: 64, offset: 6720)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !723, file: !651, line: 393, baseType: !659, size: 32, offset: 6784)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !723, file: !651, line: 394, baseType: !659, size: 32, offset: 6816)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !723, file: !651, line: 395, baseType: !659, size: 32, offset: 6848)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !723, file: !651, line: 396, baseType: !659, size: 32, offset: 6880)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !723, file: !651, line: 398, baseType: !659, size: 32, offset: 6912)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !723, file: !651, line: 399, baseType: !659, size: 32, offset: 6944)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !723, file: !651, line: 402, baseType: !683, size: 64, offset: 6976)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !723, file: !651, line: 404, baseType: !1027, size: 128, offset: 7040)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !651, line: 260, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !651, line: 270, size: 128, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1028, file: !651, line: 271, baseType: !659, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1028, file: !651, line: 272, baseType: !1032, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !651, line: 264, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !651, line: 266, size: 128, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !1034, file: !651, line: 267, baseType: !682, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1034, file: !651, line: 268, baseType: !676, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !723, file: !651, line: 406, baseType: !1039, size: 1126016, offset: 7168)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !651, line: 216, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !651, line: 218, size: 1126016, elements: !1041)
!1041 = !{!1042, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1088, !1100, !1108, !1114, !1121, !1122, !1123, !1124, !1138, !1139, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1157, !1158, !1159, !1160}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1040, file: !651, line: 219, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !651, line: 204, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !1046, line: 59, size: 320, elements: !1047)
!1046 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!1047 = !{!1048}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1045, file: !1046, line: 60, baseType: !1049, size: 320)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1050, line: 72, baseType: !1051)
!1050 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!1051 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1050, line: 67, size: 320, elements: !1052)
!1052 = !{!1053, !1073, !1074}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1051, file: !1050, line: 69, baseType: !1054, size: 320)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1055, line: 22, size: 320, elements: !1056)
!1055 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1064, !1065}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1054, file: !1055, line: 24, baseType: !659, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1054, file: !1055, line: 25, baseType: !582, size: 32, offset: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1054, file: !1055, line: 26, baseType: !659, size: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1054, file: !1055, line: 28, baseType: !582, size: 32, offset: 96)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1054, file: !1055, line: 32, baseType: !659, size: 32, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1054, file: !1055, line: 34, baseType: !1063, size: 16, offset: 160)
!1063 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1054, file: !1055, line: 35, baseType: !1063, size: 16, offset: 176)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1054, file: !1055, line: 36, baseType: !1066, size: 128, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1067, line: 55, baseType: !1068)
!1067 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1067, line: 51, size: 128, elements: !1069)
!1069 = !{!1070, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1068, file: !1067, line: 53, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1068, file: !1067, line: 54, baseType: !1071, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1051, file: !1050, line: 70, baseType: !475, size: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1051, file: !1050, line: 71, baseType: !677, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1040, file: !651, line: 221, baseType: !659, size: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !1040, file: !651, line: 222, baseType: !659, size: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !1040, file: !651, line: 223, baseType: !659, size: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !1040, file: !651, line: 225, baseType: !659, size: 32, offset: 160)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !1040, file: !651, line: 226, baseType: !819, size: 192, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !1040, file: !651, line: 227, baseType: !740, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !1040, file: !651, line: 228, baseType: !659, size: 32, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !1040, file: !651, line: 230, baseType: !1083, size: 32832, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !651, line: 121, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !651, line: 123, size: 32832, elements: !1085)
!1085 = !{!1086, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !1084, file: !651, line: 124, baseType: !740, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1084, file: !651, line: 125, baseType: !1005, size: 32768, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1040, file: !651, line: 232, baseType: !1089, size: 192, offset: 33344)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !651, line: 111, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !651, line: 112, size: 192, elements: !1091)
!1091 = !{!1092, !1093, !1098}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !1090, file: !651, line: 113, baseType: !676, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !1090, file: !651, line: 114, baseType: !1094, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !651, line: 110, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!659}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !651, line: 115, baseType: !1099, size: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !1040, file: !651, line: 233, baseType: !1101, size: 1048608, offset: 33536)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !651, line: 131, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !651, line: 133, size: 1048608, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1102, file: !651, line: 134, baseType: !659, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1102, file: !651, line: 135, baseType: !1106, size: 1048576, offset: 32)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !1107)
!1107 = !{!77, !948}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !1040, file: !651, line: 234, baseType: !1109, size: 16416, offset: 1082144)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !651, line: 153, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !651, line: 155, size: 16416, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !1110, file: !651, line: 156, baseType: !659, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !1110, file: !651, line: 157, baseType: !941, size: 16384, offset: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !1040, file: !651, line: 235, baseType: !1115, size: 96, offset: 1098560)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !651, line: 163, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !651, line: 165, size: 96, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1116, file: !651, line: 166, baseType: !659, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !1116, file: !651, line: 167, baseType: !659, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1116, file: !651, line: 168, baseType: !659, size: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !1040, file: !651, line: 236, baseType: !682, size: 64, offset: 1098688)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !1040, file: !651, line: 237, baseType: !659, size: 32, offset: 1098752)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !1040, file: !651, line: 238, baseType: !659, size: 32, offset: 1098784)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !1040, file: !651, line: 239, baseType: !1125, size: 64, offset: 1098816)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !1127, line: 51, baseType: !1128)
!1127 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !1127, line: 150, size: 704, elements: !1129)
!1129 = !{!1130, !1132, !1133, !1134}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1128, file: !1127, line: 151, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !1128, file: !1127, line: 152, baseType: !678, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !1128, file: !1127, line: 153, baseType: !726, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !1128, file: !1127, line: 154, baseType: !1135, size: 512, offset: 192)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !1040, file: !651, line: 240, baseType: !659, size: 32, offset: 1098880)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !1040, file: !651, line: 242, baseType: !1140, size: 10240, offset: 1098912)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 10240, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 1280)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !1040, file: !651, line: 243, baseType: !659, size: 32, offset: 1109152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !1040, file: !651, line: 244, baseType: !659, size: 32, offset: 1109184)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !1040, file: !651, line: 245, baseType: !659, size: 32, offset: 1109216)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !1040, file: !651, line: 246, baseType: !659, size: 32, offset: 1109248)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !1040, file: !651, line: 247, baseType: !659, size: 32, offset: 1109280)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !1040, file: !651, line: 248, baseType: !901, size: 64, offset: 1109312)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !1040, file: !651, line: 249, baseType: !659, size: 32, offset: 1109376)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !1040, file: !651, line: 250, baseType: !1151, size: 64, offset: 1109440)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !651, line: 194, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !651, line: 196, size: 128, elements: !1154)
!1154 = !{!1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1153, file: !651, line: 197, baseType: !682, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1153, file: !651, line: 198, baseType: !1151, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !1040, file: !651, line: 251, baseType: !941, size: 16384, offset: 1109504)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !1040, file: !651, line: 252, baseType: !582, size: 32, offset: 1125888)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !1040, file: !651, line: 253, baseType: !582, size: 32, offset: 1125920)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !1040, file: !651, line: 254, baseType: !659, size: 32, offset: 1125952)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !714, file: !685, line: 195, baseType: !696, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !686, file: !685, line: 196, baseType: !1163, size: 128, offset: 384)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !685, line: 196, size: 128, elements: !1164)
!1164 = !{!1165, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1163, file: !685, line: 196, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !685, line: 86, baseType: !718)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1163, file: !685, line: 196, baseType: !696, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !686, file: !685, line: 197, baseType: !1169, size: 128, offset: 512)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !685, line: 197, size: 128, elements: !1170)
!1170 = !{!1171, !1173}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1169, file: !685, line: 197, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !685, line: 87, baseType: !718)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1169, file: !685, line: 197, baseType: !696, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !686, file: !685, line: 198, baseType: !1175, size: 128, offset: 640)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !685, line: 198, size: 128, elements: !1176)
!1176 = !{!1177, !1183}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1175, file: !685, line: 198, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !685, line: 92, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !685, line: 88, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!659, !696, !721, !901, !903, !678, !678}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1175, file: !685, line: 198, baseType: !696, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !686, file: !685, line: 199, baseType: !1185, size: 128, offset: 768)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !685, line: 199, size: 128, elements: !1186)
!1186 = !{!1187, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1185, file: !685, line: 199, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !685, line: 93, baseType: !1179)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1185, file: !685, line: 199, baseType: !696, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !686, file: !685, line: 200, baseType: !1191, size: 128, offset: 896)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !685, line: 200, size: 128, elements: !1192)
!1192 = !{!1193, !1198}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1191, file: !685, line: 200, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !685, line: 94, baseType: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!659, !696, !721, !682, !659, !678, !678}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1191, file: !685, line: 200, baseType: !696, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !686, file: !685, line: 201, baseType: !1200, size: 128, offset: 1024)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !685, line: 201, size: 128, elements: !1201)
!1201 = !{!1202, !1207}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1200, file: !685, line: 201, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !685, line: 98, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!678, !696, !721, !678}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1200, file: !685, line: 201, baseType: !696, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !686, file: !685, line: 202, baseType: !1209, size: 128, offset: 1152)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !685, line: 202, size: 128, elements: !1210)
!1210 = !{!1211, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1209, file: !685, line: 202, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !685, line: 101, baseType: !1204)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1209, file: !685, line: 202, baseType: !696, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !686, file: !685, line: 203, baseType: !1215, size: 128, offset: 1280)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !685, line: 203, size: 128, elements: !1216)
!1216 = !{!1217, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1215, file: !685, line: 203, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !685, line: 104, baseType: !1204)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1215, file: !685, line: 203, baseType: !696, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !686, file: !685, line: 204, baseType: !1221, size: 128, offset: 1408)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !685, line: 204, size: 128, elements: !1222)
!1222 = !{!1223, !1422}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1221, file: !685, line: 204, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !685, line: 107, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!659, !696, !721, !1228, !659, !659, !659, !659, !659, !1391}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !907, line: 61, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !651, line: 557, size: 135040, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1247, !1248, !1249, !1250, !1251, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !1230, file: !651, line: 561, baseType: !941, size: 16384)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !1230, file: !651, line: 562, baseType: !941, size: 16384, offset: 16384)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !1230, file: !651, line: 563, baseType: !941, size: 16384, offset: 32768)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !1230, file: !651, line: 564, baseType: !941, size: 16384, offset: 49152)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !1230, file: !651, line: 565, baseType: !941, size: 16384, offset: 65536)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !1230, file: !651, line: 566, baseType: !941, size: 16384, offset: 81920)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1230, file: !651, line: 567, baseType: !682, size: 64, offset: 98304)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !1230, file: !651, line: 568, baseType: !941, size: 16384, offset: 98368)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !1230, file: !651, line: 569, baseType: !874, size: 8192, offset: 114752)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1230, file: !651, line: 570, baseType: !659, size: 32, offset: 122944)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !1230, file: !651, line: 571, baseType: !659, size: 32, offset: 122976)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1230, file: !651, line: 572, baseType: !659, size: 32, offset: 123008)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1230, file: !651, line: 573, baseType: !659, size: 32, offset: 123040)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !1230, file: !651, line: 574, baseType: !1246, size: 64, offset: 123072)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !795, line: 284, baseType: !677)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1230, file: !651, line: 575, baseType: !659, size: 32, offset: 123136)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !1230, file: !651, line: 576, baseType: !1246, size: 64, offset: 123200)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1230, file: !651, line: 577, baseType: !794, size: 64, offset: 123264)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1230, file: !651, line: 578, baseType: !794, size: 64, offset: 123328)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1230, file: !651, line: 579, baseType: !1252, size: 8960, offset: 123392)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !1127, line: 47, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !651, line: 486, size: 8960, elements: !1254)
!1254 = !{!1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1278, !1335, !1336, !1337, !1338, !1343, !1344, !1348, !1349, !1350, !1351, !1352, !1353}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !1253, file: !651, line: 487, baseType: !659, size: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !1253, file: !651, line: 488, baseType: !1063, size: 16, offset: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !1253, file: !651, line: 489, baseType: !1063, size: 16, offset: 48)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1253, file: !651, line: 490, baseType: !1063, size: 16, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !1253, file: !651, line: 491, baseType: !1063, size: 16, offset: 80)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !1253, file: !651, line: 492, baseType: !1063, size: 16, offset: 96)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !1253, file: !651, line: 493, baseType: !1063, size: 16, offset: 112)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !1253, file: !651, line: 494, baseType: !1063, size: 16, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !1253, file: !651, line: 495, baseType: !659, size: 32, offset: 160)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !1253, file: !651, line: 496, baseType: !659, size: 32, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1253, file: !651, line: 497, baseType: !682, size: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1253, file: !651, line: 498, baseType: !682, size: 64, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1253, file: !651, line: 499, baseType: !740, size: 64, offset: 384)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1253, file: !651, line: 500, baseType: !794, size: 64, offset: 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !1253, file: !651, line: 501, baseType: !231, size: 640, offset: 512)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !1253, file: !651, line: 502, baseType: !1135, size: 512, offset: 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !1253, file: !651, line: 503, baseType: !1135, size: 512, offset: 1664)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !1253, file: !651, line: 504, baseType: !1135, size: 512, offset: 2176)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1253, file: !651, line: 505, baseType: !682, size: 64, offset: 2688)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !1253, file: !651, line: 506, baseType: !794, size: 64, offset: 2752)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !1253, file: !651, line: 507, baseType: !1063, size: 16, offset: 2816)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !1253, file: !651, line: 508, baseType: !1277, size: 32, offset: 2848)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !795, line: 323, baseType: !659)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1253, file: !651, line: 509, baseType: !1279, size: 224, offset: 2880)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !1280, line: 91, baseType: !1281)
!1280 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !1280, line: 93, size: 224, elements: !1282)
!1282 = !{!1283}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !1281, file: !1280, line: 103, baseType: !1284, size: 224)
!1284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1281, file: !1280, line: 94, size: 224, elements: !1285)
!1285 = !{!1286, !1294, !1314}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1284, file: !1280, line: 96, baseType: !1287, size: 128)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1288, line: 180, size: 128, elements: !1289)
!1288 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1289 = !{!1290, !1293}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1287, file: !1288, line: 182, baseType: !1291, size: 16)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1292, line: 28, baseType: !769)
!1292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1287, file: !1288, line: 183, baseType: !9, size: 112, offset: 16)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1284, file: !1280, line: 98, baseType: !1295, size: 128)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1296, line: 245, size: 128, elements: !1297)
!1296 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!1297 = !{!1298, !1299, !1304, !1311}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1295, file: !1296, line: 247, baseType: !1291, size: 16)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1295, file: !1296, line: 248, baseType: !1300, size: 16, offset: 16)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1296, line: 123, baseType: !1301)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1302, line: 25, baseType: !1303)
!1302 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !767, line: 40, baseType: !769)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1295, file: !1296, line: 249, baseType: !1305, size: 32, offset: 32)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1296, line: 31, size: 32, elements: !1306)
!1306 = !{!1307}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1305, file: !1296, line: 33, baseType: !1308, size: 32)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1296, line: 30, baseType: !1309)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1302, line: 26, baseType: !1310)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !767, line: 42, baseType: !582)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1295, file: !1296, line: 252, baseType: !1312, size: 64, offset: 64)
!1312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1313, size: 64, elements: !115)
!1313 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1284, file: !1280, line: 101, baseType: !1315, size: 224)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1296, line: 260, size: 224, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1334}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1315, file: !1296, line: 262, baseType: !1291, size: 16)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1315, file: !1296, line: 263, baseType: !1300, size: 16, offset: 16)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1315, file: !1296, line: 264, baseType: !1309, size: 32, offset: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1315, file: !1296, line: 265, baseType: !1321, size: 128, offset: 64)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1296, line: 219, size: 128, elements: !1322)
!1322 = !{!1323}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1321, file: !1296, line: 226, baseType: !1324, size: 128)
!1324 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1321, file: !1296, line: 221, size: 128, elements: !1325)
!1325 = !{!1326, !1330, !1332}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1324, file: !1296, line: 223, baseType: !1327, size: 128)
!1327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1328, size: 128, elements: !76)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1302, line: 24, baseType: !1329)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !767, line: 38, baseType: !1313)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1324, file: !1296, line: 224, baseType: !1331, size: 128)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 128, elements: !115)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1324, file: !1296, line: 225, baseType: !1333, size: 128)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1309, size: 128, elements: !437)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1315, file: !1296, line: 266, baseType: !1309, size: 32, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !1253, file: !651, line: 510, baseType: !659, size: 32, offset: 3104)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !1253, file: !651, line: 511, baseType: !740, size: 64, offset: 3136)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !1253, file: !651, line: 513, baseType: !1063, size: 16, offset: 3200)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !1253, file: !651, line: 515, baseType: !1339, size: 64, offset: 3264)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !1341, line: 184, baseType: !1342)
!1341 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1342 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !1341, line: 184, flags: DIFlagFwdDecl)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !1253, file: !651, line: 517, baseType: !1135, size: 512, offset: 3328)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !1253, file: !651, line: 518, baseType: !1345, size: 2048, offset: 3840)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1346)
!1346 = !{!1347}
!1347 = !DISubrange(count: 256)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !1253, file: !651, line: 519, baseType: !1345, size: 2048, offset: 5888)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !1253, file: !651, line: 520, baseType: !794, size: 64, offset: 7936)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !1253, file: !651, line: 521, baseType: !794, size: 64, offset: 8000)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !1253, file: !651, line: 522, baseType: !794, size: 64, offset: 8064)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !1253, file: !651, line: 523, baseType: !659, size: 32, offset: 8128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !1253, file: !651, line: 525, baseType: !1354, size: 768, offset: 8192)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !1127, line: 43, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !651, line: 465, size: 768, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1355, file: !651, line: 466, baseType: !1063, size: 16)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1355, file: !651, line: 467, baseType: !1063, size: 16, offset: 16)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1355, file: !651, line: 468, baseType: !1063, size: 16, offset: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !1355, file: !651, line: 469, baseType: !1063, size: 16, offset: 48)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1355, file: !651, line: 470, baseType: !1063, size: 16, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !1355, file: !651, line: 471, baseType: !1063, size: 16, offset: 80)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1355, file: !651, line: 472, baseType: !678, size: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1355, file: !651, line: 473, baseType: !678, size: 64, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1355, file: !651, line: 474, baseType: !678, size: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1355, file: !651, line: 475, baseType: !678, size: 64, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1355, file: !651, line: 476, baseType: !678, size: 64, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1355, file: !651, line: 477, baseType: !678, size: 64, offset: 448)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1355, file: !651, line: 478, baseType: !1370, size: 256, offset: 512)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !651, line: 452, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !651, line: 454, size: 256, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1371, file: !651, line: 455, baseType: !659, size: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1371, file: !651, line: 456, baseType: !678, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1371, file: !651, line: 457, baseType: !659, size: 32, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1371, file: !651, line: 458, baseType: !678, size: 64, offset: 192)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1230, file: !651, line: 580, baseType: !659, size: 32, offset: 132352)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !1230, file: !651, line: 581, baseType: !659, size: 32, offset: 132384)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !1230, file: !651, line: 582, baseType: !794, size: 64, offset: 132416)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !1230, file: !651, line: 583, baseType: !1246, size: 64, offset: 132480)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1230, file: !651, line: 585, baseType: !659, size: 32, offset: 132544)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1230, file: !651, line: 586, baseType: !659, size: 32, offset: 132576)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !1230, file: !651, line: 587, baseType: !682, size: 64, offset: 132608)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1230, file: !651, line: 588, baseType: !794, size: 64, offset: 132672)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !1230, file: !651, line: 589, baseType: !794, size: 64, offset: 132736)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !1230, file: !651, line: 590, baseType: !794, size: 64, offset: 132800)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1230, file: !651, line: 594, baseType: !1345, size: 2048, offset: 132864)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !1230, file: !651, line: 595, baseType: !659, size: 32, offset: 134912)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !1230, file: !651, line: 596, baseType: !659, size: 32, offset: 134944)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !1230, file: !651, line: 597, baseType: !659, size: 32, offset: 134976)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !581, line: 70, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !651, line: 414, size: 1344, elements: !1394)
!1394 = !{!1395, !1396, !1397, !1398, !1399, !1400, !1401, !1403, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !1393, file: !651, line: 415, baseType: !794, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !1393, file: !651, line: 416, baseType: !794, size: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !1393, file: !651, line: 418, baseType: !1246, size: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !1393, file: !651, line: 420, baseType: !794, size: 64, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !1393, file: !651, line: 421, baseType: !794, size: 64, offset: 256)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !1393, file: !651, line: 422, baseType: !659, size: 32, offset: 320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !1393, file: !651, line: 424, baseType: !1402, size: 128, offset: 384)
!1402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 128, elements: !83)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !1393, file: !651, line: 425, baseType: !1404, size: 128, offset: 512)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 128, elements: !83)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !1393, file: !651, line: 426, baseType: !1246, size: 64, offset: 640)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !1393, file: !651, line: 427, baseType: !659, size: 32, offset: 704)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !1393, file: !651, line: 429, baseType: !659, size: 32, offset: 736)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !1393, file: !651, line: 430, baseType: !659, size: 32, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !1393, file: !651, line: 431, baseType: !659, size: 32, offset: 800)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !1393, file: !651, line: 433, baseType: !659, size: 32, offset: 832)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !1393, file: !651, line: 434, baseType: !659, size: 32, offset: 864)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !1393, file: !651, line: 435, baseType: !659, size: 32, offset: 896)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !1393, file: !651, line: 436, baseType: !659, size: 32, offset: 928)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !1393, file: !651, line: 437, baseType: !659, size: 32, offset: 960)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !1393, file: !651, line: 438, baseType: !659, size: 32, offset: 992)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !1393, file: !651, line: 439, baseType: !659, size: 32, offset: 1024)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !1393, file: !651, line: 440, baseType: !659, size: 32, offset: 1056)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !1393, file: !651, line: 441, baseType: !794, size: 64, offset: 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1393, file: !651, line: 443, baseType: !794, size: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !1393, file: !651, line: 445, baseType: !1246, size: 64, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !1393, file: !651, line: 446, baseType: !1246, size: 64, offset: 1280)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1221, file: !685, line: 204, baseType: !696, size: 64, offset: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !686, file: !685, line: 205, baseType: !1424, size: 128, offset: 1536)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !685, line: 205, size: 128, elements: !1425)
!1425 = !{!1426, !1431}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1424, file: !685, line: 205, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !685, line: 112, baseType: !1428)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!659, !696, !721, !678, !678, !659}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1424, file: !685, line: 205, baseType: !696, size: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !686, file: !685, line: 206, baseType: !1433, size: 128, offset: 1664)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !685, line: 206, size: 128, elements: !1434)
!1434 = !{!1435, !1440}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1433, file: !685, line: 206, baseType: !1436, size: 64)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !685, line: 115, baseType: !1437)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{!659, !696, !721, !678, !678, !678, !659}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1433, file: !685, line: 206, baseType: !696, size: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !686, file: !685, line: 207, baseType: !1442, size: 128, offset: 1792)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !685, line: 207, size: 128, elements: !1443)
!1443 = !{!1444, !1449}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1442, file: !685, line: 207, baseType: !1445, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !685, line: 119, baseType: !1446)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{null, !696, !721, !678}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1442, file: !685, line: 207, baseType: !696, size: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !686, file: !685, line: 208, baseType: !1451, size: 128, offset: 1920)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !685, line: 208, size: 128, elements: !1452)
!1452 = !{!1453, !1455}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1451, file: !685, line: 208, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !685, line: 121, baseType: !1446)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1451, file: !685, line: 208, baseType: !696, size: 64, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !686, file: !685, line: 209, baseType: !1457, size: 128, offset: 2048)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !685, line: 209, size: 128, elements: !1458)
!1458 = !{!1459, !1464}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1457, file: !685, line: 209, baseType: !1460, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !685, line: 123, baseType: !1461)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{null, !696, !721, !678, !678, !678, !659, !659, !659}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1457, file: !685, line: 209, baseType: !696, size: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !686, file: !685, line: 210, baseType: !1466, size: 128, offset: 2176)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !685, line: 210, size: 128, elements: !1467)
!1467 = !{!1468, !1473}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1466, file: !685, line: 210, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !685, line: 128, baseType: !1470)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!659, !696, !721, !682}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1466, file: !685, line: 210, baseType: !696, size: 64, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !686, file: !685, line: 211, baseType: !1475, size: 128, offset: 2304)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !685, line: 211, size: 128, elements: !1476)
!1476 = !{!1477, !1482}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1475, file: !685, line: 211, baseType: !1478, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !685, line: 130, baseType: !1479)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!659, !696, !721, !682, !678}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1475, file: !685, line: 211, baseType: !696, size: 64, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !686, file: !685, line: 212, baseType: !1484, size: 128, offset: 2432)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !685, line: 212, size: 128, elements: !1485)
!1485 = !{!1486, !1491}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1484, file: !685, line: 212, baseType: !1487, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !685, line: 133, baseType: !1488)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!659, !696, !721, !1228}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1484, file: !685, line: 212, baseType: !696, size: 64, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !686, file: !685, line: 213, baseType: !1493, size: 128, offset: 2560)
!1493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !685, line: 213, size: 128, elements: !1494)
!1494 = !{!1495, !1500}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1493, file: !685, line: 213, baseType: !1496, size: 64)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !685, line: 135, baseType: !1497)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!659, !696, !721, !678, !678, !678, !678, !682}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1493, file: !685, line: 213, baseType: !696, size: 64, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !686, file: !685, line: 214, baseType: !1502, size: 128, offset: 2688)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !685, line: 214, size: 128, elements: !1503)
!1503 = !{!1504, !1510}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1502, file: !685, line: 214, baseType: !1505, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !685, line: 142, baseType: !1506)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64)
!1507 = !DISubroutineType(types: !1508)
