; ModuleID = 'src/htscatchurl.c'
source_filename = "src/htscatchurl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SOCaddr = type { %union.anon }
%union.anon = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon.0 }
%union.anon.0 = type { [4 x i32] }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.lien_adrfil = type { [2048 x i8], [2048 x i8] }
%struct.htsblk = type { i32, i16, i16, i16, i16, i16, i16, i16, i32, i32, ptr, ptr, ptr, i64, [80 x i8], [64 x i8], [64 x i8], [64 x i8], ptr, i64, i16, i32, %struct.SOCaddr, i32, ptr, i16, ptr, [64 x i8], [256 x i8], [256 x i8], i64, i64, i64, i32, %struct.htsrequest }
%struct.htsrequest = type { i16, i16, i16, i16, i16, i16, ptr, ptr, ptr, ptr, ptr, ptr, %struct.htsrequest_proxy }
%struct.htsrequest_proxy = type { i32, ptr, i32, ptr }

@__const.catch_url_init_std.try_to_listen_to = private unnamed_addr constant [10 x i32] [i32 8080, i32 3128, i32 80, i32 81, i32 82, i32 8081, i32 3129, i32 31337, i32 0, i32 -1], align 16
@.str = private unnamed_addr constant [18 x i8] c"src/htscatchurl.c\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"%s:%d\00", align 1, !dbg !7

!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !81, line: 40, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!84 = !{!0, !7, !12, !17, !22, !27, !32, !38, !43, !49, !54}
!85 = !{i32 7, !"Dwarf Version", i32 5}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{i32 1, !"wchar_size", i32 4}
!88 = !{i32 8, !"PIC Level", i32 2}
!89 = !{i32 7, !"PIE Level", i32 2}
!90 = !{i32 7, !"uwtable", i32 2}
!91 = !{i32 7, !"frame-pointer", i32 2}
!92 = !{!"clang version 16.0.0"}
!93 = distinct !DISubprogram(name: "catch_url_init_std", scope: !2, file: !2, line: 65, type: !94, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !97)
!94 = !DISubroutineType(types: !95)
!95 = !{!73, !96, !83}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!97 = !{}
!98 = !DILocalVariable(name: "port_prox", arg: 1, scope: !93, file: !2, line: 65, type: !96)
!99 = !DILocation(line: 65, column: 42, scope: !93)
!100 = !DILocalVariable(name: "adr_prox", arg: 2, scope: !93, file: !2, line: 65, type: !83)
!101 = !DILocation(line: 65, column: 59, scope: !93)
!102 = !DILocalVariable(name: "soc", scope: !93, file: !2, line: 66, type: !73)
!103 = !DILocation(line: 66, column: 9, scope: !93)
!104 = !DILocalVariable(name: "try_to_listen_to", scope: !93, file: !2, line: 67, type: !105)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 320, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 10)
!108 = !DILocation(line: 67, column: 7, scope: !93)
!109 = !DILocalVariable(name: "i", scope: !93, file: !2, line: 68, type: !75)
!110 = !DILocation(line: 68, column: 7, scope: !93)
!111 = !DILocation(line: 70, column: 3, scope: !93)
!112 = !DILocation(line: 71, column: 44, scope: !113)
!113 = distinct !DILexicalBlock(scope: !93, file: !2, line: 70, column: 6)
!114 = !DILocation(line: 71, column: 27, scope: !113)
!115 = !DILocation(line: 71, column: 48, scope: !113)
!116 = !DILocation(line: 71, column: 11, scope: !113)
!117 = !DILocation(line: 71, column: 9, scope: !113)
!118 = !DILocation(line: 72, column: 35, scope: !113)
!119 = !DILocation(line: 72, column: 18, scope: !113)
!120 = !DILocation(line: 72, column: 6, scope: !113)
!121 = !DILocation(line: 72, column: 16, scope: !113)
!122 = !DILocation(line: 73, column: 6, scope: !113)
!123 = !DILocation(line: 74, column: 3, scope: !113)
!124 = !DILocation(line: 74, column: 12, scope: !93)
!125 = !DILocation(line: 74, column: 16, scope: !93)
!126 = !DILocation(line: 74, column: 35, scope: !93)
!127 = !DILocation(line: 74, column: 56, scope: !93)
!128 = !DILocation(line: 74, column: 39, scope: !93)
!129 = !DILocation(line: 74, column: 59, scope: !93)
!130 = !DILocation(line: 0, scope: !93)
!131 = distinct !{!131, !111, !132, !133}
!132 = !DILocation(line: 74, column: 64, scope: !93)
!133 = !{!"llvm.loop.mustprogress"}
!134 = !DILocation(line: 75, column: 10, scope: !93)
!135 = !DILocation(line: 75, column: 3, scope: !93)
!136 = distinct !DISubprogram(name: "catch_url_init", scope: !2, file: !2, line: 81, type: !94, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !97)
!137 = !DILocalVariable(name: "port", arg: 1, scope: !136, file: !2, line: 81, type: !96)
!138 = !DILocation(line: 81, column: 38, scope: !136)
!139 = !DILocalVariable(name: "adr", arg: 2, scope: !136, file: !2, line: 81, type: !83)
!140 = !DILocation(line: 81, column: 66, scope: !136)
!141 = !DILocalVariable(name: "soc", scope: !136, file: !2, line: 82, type: !73)
!142 = !DILocation(line: 82, column: 9, scope: !136)
!143 = !DILocalVariable(name: "h_loc", scope: !136, file: !2, line: 83, type: !144)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 256)
!147 = !DILocation(line: 83, column: 8, scope: !136)
!148 = !DILocation(line: 85, column: 19, scope: !149)
!149 = distinct !DILexicalBlock(scope: !136, file: !2, line: 85, column: 7)
!150 = !DILocation(line: 85, column: 7, scope: !149)
!151 = !DILocation(line: 85, column: 41, scope: !149)
!152 = !DILocation(line: 85, column: 7, scope: !136)
!153 = !DILocalVariable(name: "server", scope: !154, file: !2, line: 86, type: !155)
!154 = distinct !DILexicalBlock(scope: !149, file: !2, line: 85, column: 47)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !34, line: 91, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !34, line: 93, size: 224, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !156, file: !34, line: 103, baseType: !159, size: 224)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !156, file: !34, line: 94, size: 224, elements: !160)
!160 = !{!161, !172, !189}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !159, file: !34, line: 96, baseType: !162, size: 128)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !163, line: 180, size: 128, elements: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!164 = !{!165, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !162, file: !163, line: 182, baseType: !166, size: 16)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !167, line: 28, baseType: !82)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !162, file: !163, line: 183, baseType: !169, size: 112, offset: 16)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 14)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !159, file: !34, line: 98, baseType: !173, size: 128)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !77, line: 245, size: 128, elements: !174)
!174 = !{!175, !176, !177, !184}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !173, file: !77, line: 247, baseType: !166, size: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !173, file: !77, line: 248, baseType: !76, size: 16, offset: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !173, file: !77, line: 249, baseType: !178, size: 32, offset: 32)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !77, line: 31, size: 32, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !178, file: !77, line: 33, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !77, line: 30, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !79, line: 26, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !81, line: 42, baseType: !60)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !173, file: !77, line: 252, baseType: !185, size: 64, offset: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 64, elements: !187)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !159, file: !34, line: 101, baseType: !190, size: 224)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !77, line: 260, size: 224, elements: !191)
!191 = !{!192, !193, !194, !195, !211}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !190, file: !77, line: 262, baseType: !166, size: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !190, file: !77, line: 263, baseType: !76, size: 16, offset: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !190, file: !77, line: 264, baseType: !182, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !190, file: !77, line: 265, baseType: !196, size: 128, offset: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !77, line: 219, size: 128, elements: !197)
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !196, file: !77, line: 226, baseType: !199, size: 128)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !196, file: !77, line: 221, size: 128, elements: !200)
!200 = !{!201, !205, !207}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !199, file: !77, line: 223, baseType: !202, size: 128)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !52)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !79, line: 24, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !81, line: 38, baseType: !186)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !199, file: !77, line: 224, baseType: !206, size: 128)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !187)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !199, file: !77, line: 225, baseType: !208, size: 128)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 128, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 4)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !190, file: !77, line: 266, baseType: !182, size: 32, offset: 192)
!212 = !DILocation(line: 86, column: 13, scope: !154)
!213 = !DILocation(line: 87, column: 33, scope: !214)
!214 = distinct !DILexicalBlock(scope: !154, file: !2, line: 87, column: 9)
!215 = !DILocation(line: 87, column: 9, scope: !214)
!216 = !DILocation(line: 87, column: 49, scope: !214)
!217 = !DILocation(line: 87, column: 9, scope: !154)
!218 = !DILocation(line: 89, column: 27, scope: !219)
!219 = distinct !DILexicalBlock(scope: !220, file: !2, line: 88, column: 11)
!220 = distinct !DILexicalBlock(scope: !214, file: !2, line: 87, column: 58)
!221 = !DILocation(line: 89, column: 20, scope: !219)
!222 = !DILocation(line: 88, column: 16, scope: !219)
!223 = !DILocation(line: 90, column: 31, scope: !219)
!224 = !DILocation(line: 88, column: 11, scope: !220)
!225 = !DILocation(line: 91, column: 9, scope: !226)
!226 = distinct !DILexicalBlock(scope: !219, file: !2, line: 90, column: 50)
!227 = !DILocation(line: 91, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !226, file: !2, line: 91, column: 9)
!229 = !DILocation(line: 92, column: 18, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !2, line: 92, column: 13)
!231 = !DILocation(line: 92, column: 24, scope: !230)
!232 = !DILocation(line: 92, column: 50, scope: !230)
!233 = !DILocation(line: 92, column: 13, scope: !230)
!234 = !DILocation(line: 92, column: 72, scope: !230)
!235 = !DILocation(line: 92, column: 13, scope: !226)
!236 = !DILocalVariable(name: "server2", scope: !237, file: !2, line: 93, type: !155)
!237 = distinct !DILexicalBlock(scope: !230, file: !2, line: 92, column: 78)
!238 = !DILocation(line: 93, column: 19, scope: !237)
!239 = !DILocalVariable(name: "len", scope: !237, file: !2, line: 94, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOClen", file: !34, line: 258, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !242, line: 274, baseType: !243)
!242 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !81, line: 210, baseType: !60)
!244 = !DILocation(line: 94, column: 18, scope: !237)
!245 = !DILocation(line: 96, column: 27, scope: !246)
!246 = distinct !DILexicalBlock(scope: !237, file: !2, line: 96, column: 15)
!247 = !DILocation(line: 96, column: 33, scope: !246)
!248 = !DILocation(line: 96, column: 15, scope: !246)
!249 = !DILocation(line: 96, column: 66, scope: !246)
!250 = !DILocation(line: 96, column: 15, scope: !237)
!251 = !DILocation(line: 97, column: 27, scope: !252)
!252 = distinct !DILexicalBlock(scope: !246, file: !2, line: 96, column: 72)
!253 = !DILocation(line: 97, column: 21, scope: !252)
!254 = !DILocation(line: 97, column: 14, scope: !252)
!255 = !DILocation(line: 97, column: 19, scope: !252)
!256 = !DILocation(line: 98, column: 24, scope: !257)
!257 = distinct !DILexicalBlock(scope: !252, file: !2, line: 98, column: 17)
!258 = !DILocation(line: 98, column: 17, scope: !257)
!259 = !DILocation(line: 98, column: 32, scope: !257)
!260 = !DILocation(line: 98, column: 17, scope: !252)
!261 = !DILocation(line: 99, column: 15, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !2, line: 98, column: 38)
!263 = !DILocation(line: 100, column: 13, scope: !262)
!264 = !DILocation(line: 104, column: 21, scope: !265)
!265 = distinct !DILexicalBlock(scope: !257, file: !2, line: 100, column: 20)
!266 = !DILocation(line: 104, column: 15, scope: !265)
!267 = !DILocation(line: 106, column: 19, scope: !265)
!268 = !DILocation(line: 109, column: 11, scope: !252)
!269 = !DILocation(line: 113, column: 19, scope: !270)
!270 = distinct !DILexicalBlock(scope: !246, file: !2, line: 109, column: 18)
!271 = !DILocation(line: 113, column: 13, scope: !270)
!272 = !DILocation(line: 115, column: 17, scope: !270)
!273 = !DILocation(line: 118, column: 9, scope: !237)
!274 = !DILocation(line: 122, column: 17, scope: !275)
!275 = distinct !DILexicalBlock(scope: !230, file: !2, line: 118, column: 16)
!276 = !DILocation(line: 122, column: 11, scope: !275)
!277 = !DILocation(line: 124, column: 15, scope: !275)
!278 = !DILocation(line: 126, column: 7, scope: !226)
!279 = !DILocation(line: 127, column: 5, scope: !220)
!280 = !DILocation(line: 128, column: 3, scope: !154)
!281 = !DILocation(line: 129, column: 10, scope: !136)
!282 = !DILocation(line: 129, column: 3, scope: !136)
!283 = distinct !DISubprogram(name: "SOCaddr_sinport_", scope: !34, file: !34, line: 106, type: !284, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !56, retainedNodes: !97)
!284 = !DISubroutineType(types: !285)
!285 = !{!286, !287, !289, !291}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!292 = !DILocalVariable(name: "addr", arg: 1, scope: !283, file: !34, line: 106, type: !287)
!293 = !DILocation(line: 106, column: 73, scope: !283)
!294 = !DILocalVariable(name: "file", arg: 2, scope: !283, file: !34, line: 107, type: !289)
!295 = !DILocation(line: 107, column: 70, scope: !283)
!296 = !DILocalVariable(name: "line", arg: 3, scope: !283, file: !34, line: 107, type: !291)
!297 = !DILocation(line: 107, column: 86, scope: !283)
!298 = !DILocation(line: 108, column: 3, scope: !283)
!299 = !DILocation(line: 109, column: 10, scope: !283)
!300 = !DILocation(line: 109, column: 16, scope: !283)
!301 = !DILocation(line: 109, column: 26, scope: !283)
!302 = !DILocation(line: 109, column: 3, scope: !283)
!303 = !DILocation(line: 111, column: 13, scope: !304)
!304 = distinct !DILexicalBlock(scope: !283, file: !34, line: 109, column: 37)
!305 = !DILocation(line: 111, column: 19, scope: !304)
!306 = !DILocation(line: 111, column: 29, scope: !304)
!307 = !DILocation(line: 111, column: 5, scope: !304)
!308 = !DILocation(line: 115, column: 13, scope: !304)
!309 = !DILocation(line: 115, column: 19, scope: !304)
!310 = !DILocation(line: 115, column: 30, scope: !304)
!311 = !DILocation(line: 115, column: 5, scope: !304)
!312 = !DILocation(line: 119, column: 5, scope: !304)
!313 = !DILocation(line: 120, column: 5, scope: !304)
!314 = !DILocation(line: 123, column: 1, scope: !283)
!315 = distinct !DISubprogram(name: "SOCaddr_size_", scope: !34, file: !34, line: 125, type: !316, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !56, retainedNodes: !97)
!316 = !DISubroutineType(types: !317)
!317 = !{!241, !318, !289, !291}
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!321 = !DILocalVariable(name: "addr", arg: 1, scope: !315, file: !34, line: 125, type: !318)
!322 = !DILocation(line: 125, column: 74, scope: !315)
!323 = !DILocalVariable(name: "file", arg: 2, scope: !315, file: !34, line: 126, type: !289)
!324 = !DILocation(line: 126, column: 66, scope: !315)
!325 = !DILocalVariable(name: "line", arg: 3, scope: !315, file: !34, line: 126, type: !291)
!326 = !DILocation(line: 126, column: 82, scope: !315)
!327 = !DILocation(line: 127, column: 3, scope: !315)
!328 = !DILocation(line: 128, column: 10, scope: !315)
!329 = !DILocation(line: 128, column: 16, scope: !315)
!330 = !DILocation(line: 128, column: 26, scope: !315)
!331 = !DILocation(line: 128, column: 3, scope: !315)
!332 = !DILocation(line: 130, column: 5, scope: !333)
!333 = distinct !DILexicalBlock(scope: !315, file: !34, line: 128, column: 37)
!334 = !DILocation(line: 134, column: 5, scope: !333)
!335 = !DILocation(line: 138, column: 5, scope: !333)
!336 = !DILocation(line: 141, column: 1, scope: !315)
!337 = distinct !DISubprogram(name: "SOCaddr_inetntoa_", scope: !34, file: !34, line: 231, type: !338, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !56, retainedNodes: !97)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !83, !340, !287, !289, !291}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !341, line: 46, baseType: !342)
!341 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!342 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!343 = !DILocalVariable(name: "namebuf", arg: 1, scope: !337, file: !34, line: 231, type: !83)
!344 = !DILocation(line: 231, column: 48, scope: !337)
!345 = !DILocalVariable(name: "namebuflen", arg: 2, scope: !337, file: !34, line: 231, type: !340)
!346 = !DILocation(line: 231, column: 64, scope: !337)
!347 = !DILocalVariable(name: "ss", arg: 3, scope: !337, file: !34, line: 232, type: !287)
!348 = !DILocation(line: 232, column: 57, scope: !337)
!349 = !DILocalVariable(name: "file", arg: 4, scope: !337, file: !34, line: 233, type: !289)
!350 = !DILocation(line: 233, column: 54, scope: !337)
!351 = !DILocalVariable(name: "line", arg: 5, scope: !337, file: !34, line: 233, type: !291)
!352 = !DILocation(line: 233, column: 70, scope: !337)
!353 = !DILocation(line: 234, column: 3, scope: !337)
!354 = !DILocation(line: 235, column: 3, scope: !337)
!355 = !DILocation(line: 237, column: 20, scope: !356)
!356 = distinct !DILexicalBlock(scope: !337, file: !34, line: 237, column: 7)
!357 = !DILocation(line: 237, column: 24, scope: !356)
!358 = !DILocation(line: 238, column: 19, scope: !356)
!359 = !DILocation(line: 238, column: 28, scope: !356)
!360 = !DILocation(line: 237, column: 7, scope: !356)
!361 = !DILocation(line: 240, column: 35, scope: !356)
!362 = !DILocation(line: 237, column: 7, scope: !337)
!363 = !DILocalVariable(name: "pos", scope: !364, file: !34, line: 242, type: !365)
!364 = distinct !DILexicalBlock(scope: !356, file: !34, line: 240, column: 41)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!366 = !DILocation(line: 242, column: 17, scope: !364)
!367 = !DILocation(line: 242, column: 30, scope: !364)
!368 = !DILocation(line: 242, column: 23, scope: !364)
!369 = !DILocation(line: 243, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !364, file: !34, line: 243, column: 9)
!371 = !DILocation(line: 243, column: 13, scope: !370)
!372 = !DILocation(line: 243, column: 9, scope: !364)
!373 = !DILocation(line: 244, column: 8, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !34, line: 243, column: 22)
!375 = !DILocation(line: 244, column: 12, scope: !374)
!376 = !DILocation(line: 245, column: 5, scope: !374)
!377 = !DILocation(line: 246, column: 3, scope: !364)
!378 = !DILocation(line: 247, column: 5, scope: !379)
!379 = distinct !DILexicalBlock(scope: !356, file: !34, line: 246, column: 10)
!380 = !DILocation(line: 247, column: 16, scope: !379)
!381 = !DILocation(line: 249, column: 1, scope: !337)
!382 = distinct !DISubprogram(name: "catch_url", scope: !2, file: !2, line: 138, type: !383, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !97)
!383 = !DISubroutineType(types: !384)
!384 = !{!75, !73, !83, !83, !83}
!385 = !DILocalVariable(name: "soc", arg: 1, scope: !382, file: !2, line: 138, type: !73)
!386 = !DILocation(line: 138, column: 32, scope: !382)
!387 = !DILocalVariable(name: "url", arg: 2, scope: !382, file: !2, line: 138, type: !83)
!388 = !DILocation(line: 138, column: 43, scope: !382)
!389 = !DILocalVariable(name: "method", arg: 3, scope: !382, file: !2, line: 138, type: !83)
!390 = !DILocation(line: 138, column: 54, scope: !382)
!391 = !DILocalVariable(name: "data", arg: 4, scope: !382, file: !2, line: 138, type: !83)
!392 = !DILocation(line: 138, column: 68, scope: !382)
!393 = !DILocalVariable(name: "retour", scope: !382, file: !2, line: 139, type: !75)
!394 = !DILocation(line: 139, column: 7, scope: !382)
!395 = !DILocation(line: 142, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !382, file: !2, line: 142, column: 7)
!397 = !DILocation(line: 142, column: 11, scope: !396)
!398 = !DILocation(line: 142, column: 7, scope: !382)
!399 = !DILocalVariable(name: "soc2", scope: !400, file: !2, line: 143, type: !73)
!400 = distinct !DILexicalBlock(scope: !396, file: !2, line: 142, column: 30)
!401 = !DILocation(line: 143, column: 11, scope: !400)
!402 = !DILocation(line: 145, column: 5, scope: !400)
!403 = !DILocation(line: 145, column: 34, scope: !400)
!404 = !DILocation(line: 145, column: 27, scope: !400)
!405 = !DILocation(line: 145, column: 17, scope: !400)
!406 = !DILocation(line: 145, column: 52, scope: !400)
!407 = distinct !{!407, !402, !408, !133}
!408 = !DILocation(line: 145, column: 71, scope: !400)
!409 = !DILocation(line: 153, column: 11, scope: !400)
!410 = !DILocation(line: 153, column: 9, scope: !400)
!411 = !DILocalVariable(name: "server2", scope: !412, file: !2, line: 156, type: !155)
!412 = distinct !DILexicalBlock(scope: !400, file: !2, line: 155, column: 5)
!413 = !DILocation(line: 156, column: 15, scope: !412)
!414 = !DILocalVariable(name: "len", scope: !412, file: !2, line: 157, type: !240)
!415 = !DILocation(line: 157, column: 14, scope: !412)
!416 = !DILocation(line: 159, column: 23, scope: !417)
!417 = distinct !DILexicalBlock(scope: !412, file: !2, line: 159, column: 11)
!418 = !DILocation(line: 159, column: 29, scope: !417)
!419 = !DILocation(line: 159, column: 11, scope: !417)
!420 = !DILocation(line: 159, column: 62, scope: !417)
!421 = !DILocation(line: 159, column: 11, scope: !412)
!422 = !DILocalVariable(name: "dot", scope: !423, file: !2, line: 160, type: !424)
!423 = distinct !DILexicalBlock(scope: !417, file: !2, line: 159, column: 68)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2064, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 258)
!427 = !DILocation(line: 160, column: 14, scope: !423)
!428 = !DILocation(line: 162, column: 9, scope: !423)
!429 = !DILocation(line: 163, column: 17, scope: !423)
!430 = !DILocation(line: 163, column: 31, scope: !423)
!431 = !DILocation(line: 163, column: 42, scope: !423)
!432 = !DILocation(line: 163, column: 36, scope: !423)
!433 = !DILocation(line: 163, column: 9, scope: !423)
!434 = !DILocation(line: 164, column: 7, scope: !423)
!435 = !DILocation(line: 169, column: 9, scope: !436)
!436 = distinct !DILexicalBlock(scope: !400, file: !2, line: 169, column: 9)
!437 = !DILocation(line: 169, column: 13, scope: !436)
!438 = !DILocation(line: 169, column: 9, scope: !400)
!439 = !DILocalVariable(name: "line", scope: !440, file: !2, line: 170, type: !441)
!440 = distinct !DILexicalBlock(scope: !436, file: !2, line: 169, column: 32)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8000, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 1000)
!444 = !DILocation(line: 170, column: 12, scope: !440)
!445 = !DILocalVariable(name: "protocol", scope: !440, file: !2, line: 171, type: !144)
!446 = !DILocation(line: 171, column: 12, scope: !440)
!447 = !DILocation(line: 173, column: 17, scope: !440)
!448 = !DILocation(line: 173, column: 29, scope: !440)
!449 = !DILocation(line: 173, column: 7, scope: !440)
!450 = !DILocation(line: 173, column: 15, scope: !440)
!451 = !DILocation(line: 175, column: 16, scope: !440)
!452 = !DILocation(line: 175, column: 21, scope: !440)
!453 = !DILocation(line: 175, column: 7, scope: !440)
!454 = !DILocation(line: 176, column: 11, scope: !455)
!455 = distinct !DILexicalBlock(scope: !440, file: !2, line: 176, column: 11)
!456 = !DILocation(line: 176, column: 11, scope: !440)
!457 = !DILocation(line: 177, column: 20, scope: !458)
!458 = distinct !DILexicalBlock(scope: !459, file: !2, line: 177, column: 13)
!459 = distinct !DILexicalBlock(scope: !455, file: !2, line: 176, column: 30)
!460 = !DILocation(line: 177, column: 38, scope: !458)
!461 = !DILocation(line: 177, column: 46, scope: !458)
!462 = !DILocation(line: 177, column: 51, scope: !458)
!463 = !DILocation(line: 177, column: 13, scope: !458)
!464 = !DILocation(line: 177, column: 61, scope: !458)
!465 = !DILocation(line: 177, column: 13, scope: !459)
!466 = !DILocalVariable(name: "af", scope: !467, file: !2, line: 178, type: !468)
!467 = distinct !DILexicalBlock(scope: !458, file: !2, line: 177, column: 67)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_adrfil", file: !469, line: 55, baseType: !470)
!469 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_adrfil", file: !471, line: 137, size: 32768, elements: !472)
!471 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!472 = !{!473, !477}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !470, file: !471, line: 138, baseType: !474, size: 16384)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 2048)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !470, file: !471, line: 139, baseType: !474, size: 16384, offset: 16384)
!478 = !DILocation(line: 178, column: 23, scope: !467)
!479 = !DILocalVariable(name: "i", scope: !467, file: !2, line: 181, type: !340)
!480 = !DILocation(line: 181, column: 18, scope: !467)
!481 = !DILocalVariable(name: "r", scope: !467, file: !2, line: 182, type: !75)
!482 = !DILocation(line: 182, column: 15, scope: !467)
!483 = !DILocation(line: 184, column: 26, scope: !467)
!484 = !DILocation(line: 184, column: 23, scope: !467)
!485 = !DILocation(line: 184, column: 33, scope: !467)
!486 = !DILocation(line: 184, column: 14, scope: !467)
!487 = !DILocation(line: 184, column: 11, scope: !467)
!488 = !DILocation(line: 184, column: 21, scope: !467)
!489 = !DILocation(line: 186, column: 17, scope: !490)
!490 = distinct !DILexicalBlock(scope: !467, file: !2, line: 186, column: 11)
!491 = !DILocation(line: 186, column: 15, scope: !490)
!492 = !DILocation(line: 186, column: 22, scope: !493)
!493 = distinct !DILexicalBlock(scope: !490, file: !2, line: 186, column: 11)
!494 = !DILocation(line: 186, column: 29, scope: !493)
!495 = !DILocation(line: 186, column: 32, scope: !493)
!496 = !DILocation(line: 186, column: 11, scope: !490)
!497 = !DILocation(line: 187, column: 18, scope: !498)
!498 = distinct !DILexicalBlock(scope: !499, file: !2, line: 187, column: 17)
!499 = distinct !DILexicalBlock(scope: !493, file: !2, line: 186, column: 46)
!500 = !DILocation(line: 187, column: 25, scope: !498)
!501 = !DILocation(line: 187, column: 28, scope: !498)
!502 = !DILocation(line: 187, column: 36, scope: !498)
!503 = !DILocation(line: 187, column: 40, scope: !498)
!504 = !DILocation(line: 187, column: 47, scope: !498)
!505 = !DILocation(line: 187, column: 50, scope: !498)
!506 = !DILocation(line: 187, column: 17, scope: !499)
!507 = !DILocation(line: 188, column: 15, scope: !498)
!508 = !DILocation(line: 188, column: 22, scope: !498)
!509 = !DILocation(line: 188, column: 25, scope: !498)
!510 = !DILocation(line: 189, column: 11, scope: !499)
!511 = !DILocation(line: 186, column: 42, scope: !493)
!512 = !DILocation(line: 186, column: 11, scope: !493)
!513 = distinct !{!513, !496, !514, !133}
!514 = !DILocation(line: 189, column: 11, scope: !490)
!515 = !DILocation(line: 191, column: 34, scope: !516)
!516 = distinct !DILexicalBlock(scope: !467, file: !2, line: 191, column: 15)
!517 = !DILocation(line: 191, column: 15, scope: !516)
!518 = !DILocation(line: 191, column: 44, scope: !516)
!519 = !DILocation(line: 191, column: 15, scope: !467)
!520 = !DILocalVariable(name: "loc", scope: !521, file: !2, line: 193, type: !474)
!521 = distinct !DILexicalBlock(scope: !516, file: !2, line: 191, column: 50)
!522 = !DILocation(line: 193, column: 25, scope: !521)
!523 = !DILocalVariable(name: "blkretour", scope: !521, file: !2, line: 194, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !469, line: 47, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !526, line: 486, size: 8960, elements: !527)
!526 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!527 = !{!528, !529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !593, !595, !599, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !618, !619, !620, !621, !622, !623, !624, !625}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !525, file: !526, line: 487, baseType: !75, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !525, file: !526, line: 488, baseType: !530, size: 16, offset: 32)
!530 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !525, file: !526, line: 489, baseType: !530, size: 16, offset: 48)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !525, file: !526, line: 490, baseType: !530, size: 16, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !525, file: !526, line: 491, baseType: !530, size: 16, offset: 80)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !525, file: !526, line: 492, baseType: !530, size: 16, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !525, file: !526, line: 493, baseType: !530, size: 16, offset: 112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !525, file: !526, line: 494, baseType: !530, size: 16, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !525, file: !526, line: 495, baseType: !75, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !525, file: !526, line: 496, baseType: !75, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !525, file: !526, line: 497, baseType: !83, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !525, file: !526, line: 498, baseType: !83, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !525, file: !526, line: 499, baseType: !542, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !544, line: 7, baseType: !545)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !546, line: 49, size: 1728, elements: !547)
!546 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !563, !565, !566, !567, !570, !571, !573, !577, !580, !582, !585, !588, !589, !590, !591, !592}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !545, file: !546, line: 51, baseType: !75, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !545, file: !546, line: 54, baseType: !83, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !545, file: !546, line: 55, baseType: !83, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !545, file: !546, line: 56, baseType: !83, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !545, file: !546, line: 57, baseType: !83, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !545, file: !546, line: 58, baseType: !83, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !545, file: !546, line: 59, baseType: !83, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !545, file: !546, line: 60, baseType: !83, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !545, file: !546, line: 61, baseType: !83, size: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !545, file: !546, line: 64, baseType: !83, size: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !545, file: !546, line: 65, baseType: !83, size: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !545, file: !546, line: 66, baseType: !83, size: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !545, file: !546, line: 68, baseType: !561, size: 64, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !546, line: 36, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !545, file: !546, line: 70, baseType: !564, size: 64, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !545, file: !546, line: 72, baseType: !75, size: 32, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !545, file: !546, line: 73, baseType: !75, size: 32, offset: 928)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !545, file: !546, line: 74, baseType: !568, size: 64, offset: 960)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !81, line: 152, baseType: !569)
!569 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !545, file: !546, line: 77, baseType: !82, size: 16, offset: 1024)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !545, file: !546, line: 78, baseType: !572, size: 8, offset: 1040)
!572 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !545, file: !546, line: 79, baseType: !574, size: 8, offset: 1048)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 1)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !545, file: !546, line: 81, baseType: !578, size: 64, offset: 1088)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !546, line: 43, baseType: null)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !545, file: !546, line: 89, baseType: !581, size: 64, offset: 1152)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !81, line: 153, baseType: !569)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !545, file: !546, line: 91, baseType: !583, size: 64, offset: 1216)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !546, line: 37, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !545, file: !546, line: 92, baseType: !586, size: 64, offset: 1280)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !546, line: 38, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !545, file: !546, line: 93, baseType: !564, size: 64, offset: 1344)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !545, file: !546, line: 94, baseType: !72, size: 64, offset: 1408)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !545, file: !546, line: 95, baseType: !340, size: 64, offset: 1472)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !545, file: !546, line: 96, baseType: !75, size: 32, offset: 1536)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !545, file: !546, line: 98, baseType: !46, size: 160, offset: 1568)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !525, file: !526, line: 500, baseType: !594, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !74, line: 283, baseType: !569)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !525, file: !526, line: 501, baseType: !596, size: 640, offset: 512)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 80)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !525, file: !526, line: 502, baseType: !600, size: 512, offset: 1152)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !525, file: !526, line: 503, baseType: !600, size: 512, offset: 1664)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !525, file: !526, line: 504, baseType: !600, size: 512, offset: 2176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !525, file: !526, line: 505, baseType: !83, size: 64, offset: 2688)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !525, file: !526, line: 506, baseType: !594, size: 64, offset: 2752)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !525, file: !526, line: 507, baseType: !530, size: 16, offset: 2816)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !525, file: !526, line: 508, baseType: !73, size: 32, offset: 2848)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !525, file: !526, line: 509, baseType: !155, size: 224, offset: 2880)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !525, file: !526, line: 510, baseType: !75, size: 32, offset: 3104)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !525, file: !526, line: 511, baseType: !542, size: 64, offset: 3136)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !525, file: !526, line: 513, baseType: !530, size: 16, offset: 3200)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !525, file: !526, line: 515, baseType: !614, size: 64, offset: 3264)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !616, line: 184, baseType: !617)
!616 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !616, line: 184, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !525, file: !526, line: 517, baseType: !600, size: 512, offset: 3328)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !525, file: !526, line: 518, baseType: !144, size: 2048, offset: 3840)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !525, file: !526, line: 519, baseType: !144, size: 2048, offset: 5888)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !525, file: !526, line: 520, baseType: !594, size: 64, offset: 7936)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !525, file: !526, line: 521, baseType: !594, size: 64, offset: 8000)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !525, file: !526, line: 522, baseType: !594, size: 64, offset: 8064)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !525, file: !526, line: 523, baseType: !75, size: 32, offset: 8128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !525, file: !526, line: 525, baseType: !626, size: 768, offset: 8192)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !469, line: 43, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !526, line: 465, size: 768, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !627, file: !526, line: 466, baseType: !530, size: 16)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !627, file: !526, line: 467, baseType: !530, size: 16, offset: 16)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !627, file: !526, line: 468, baseType: !530, size: 16, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !627, file: !526, line: 469, baseType: !530, size: 16, offset: 48)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !627, file: !526, line: 470, baseType: !530, size: 16, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !627, file: !526, line: 471, baseType: !530, size: 16, offset: 80)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !627, file: !526, line: 472, baseType: !289, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !627, file: !526, line: 473, baseType: !289, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !627, file: !526, line: 474, baseType: !289, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !627, file: !526, line: 475, baseType: !289, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !627, file: !526, line: 476, baseType: !289, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !627, file: !526, line: 477, baseType: !289, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !627, file: !526, line: 478, baseType: !642, size: 256, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !526, line: 452, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !526, line: 454, size: 256, elements: !644)
!644 = !{!645, !646, !647, !648}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !643, file: !526, line: 455, baseType: !75, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !526, line: 456, baseType: !289, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !643, file: !526, line: 457, baseType: !75, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !643, file: !526, line: 458, baseType: !289, size: 64, offset: 192)
!649 = !DILocation(line: 194, column: 20, scope: !521)
!650 = !DILocation(line: 196, column: 13, scope: !521)
!651 = !DILocation(line: 198, column: 34, scope: !521)
!652 = !DILocation(line: 198, column: 23, scope: !521)
!653 = !DILocation(line: 198, column: 32, scope: !521)
!654 = !DILocation(line: 200, column: 21, scope: !521)
!655 = !DILocation(line: 200, column: 43, scope: !521)
!656 = !DILocation(line: 200, column: 54, scope: !521)
!657 = !DILocation(line: 200, column: 51, scope: !521)
!658 = !DILocation(line: 200, column: 59, scope: !521)
!659 = !DILocation(line: 200, column: 13, scope: !521)
!660 = !DILocation(line: 201, column: 13, scope: !521)
!661 = !DILocation(line: 201, column: 19, scope: !521)
!662 = !DILocation(line: 202, column: 24, scope: !663)
!663 = distinct !DILexicalBlock(scope: !521, file: !2, line: 201, column: 38)
!664 = !DILocation(line: 202, column: 29, scope: !663)
!665 = !DILocation(line: 202, column: 15, scope: !663)
!666 = !DILocation(line: 203, column: 55, scope: !663)
!667 = !DILocation(line: 203, column: 15, scope: !663)
!668 = !DILocation(line: 204, column: 15, scope: !663)
!669 = !DILocation(line: 205, column: 15, scope: !663)
!670 = distinct !{!670, !660, !671, !133}
!671 = !DILocation(line: 206, column: 13, scope: !521)
!672 = !DILocation(line: 209, column: 27, scope: !673)
!673 = distinct !DILexicalBlock(scope: !521, file: !2, line: 209, column: 17)
!674 = !DILocation(line: 209, column: 37, scope: !673)
!675 = !DILocation(line: 209, column: 17, scope: !521)
!676 = !DILocalVariable(name: "len", scope: !677, file: !2, line: 210, type: !75)
!677 = distinct !DILexicalBlock(scope: !673, file: !2, line: 209, column: 42)
!678 = !DILocation(line: 210, column: 19, scope: !677)
!679 = !DILocation(line: 210, column: 31, scope: !677)
!680 = !DILocation(line: 210, column: 25, scope: !677)
!681 = !DILocalVariable(name: "pos", scope: !677, file: !2, line: 211, type: !75)
!682 = !DILocation(line: 211, column: 19, scope: !677)
!683 = !DILocation(line: 211, column: 38, scope: !677)
!684 = !DILocation(line: 211, column: 31, scope: !677)
!685 = !DILocation(line: 211, column: 25, scope: !677)
!686 = !DILocation(line: 214, column: 15, scope: !677)
!687 = !DILocation(line: 214, column: 22, scope: !677)
!688 = !DILocation(line: 214, column: 26, scope: !677)
!689 = !DILocation(line: 215, column: 21, scope: !677)
!690 = !DILocation(line: 215, column: 35, scope: !677)
!691 = !DILocation(line: 215, column: 49, scope: !677)
!692 = !DILocation(line: 215, column: 56, scope: !677)
!693 = !DILocation(line: 215, column: 54, scope: !677)
!694 = !DILocation(line: 215, column: 61, scope: !677)
!695 = !DILocation(line: 215, column: 30, scope: !677)
!696 = !DILocation(line: 215, column: 28, scope: !677)
!697 = !DILocation(line: 215, column: 70, scope: !677)
!698 = !DILocation(line: 0, scope: !677)
!699 = !DILocation(line: 216, column: 24, scope: !700)
!700 = distinct !DILexicalBlock(scope: !677, file: !2, line: 215, column: 76)
!701 = !DILocation(line: 216, column: 21, scope: !700)
!702 = !DILocation(line: 217, column: 24, scope: !700)
!703 = !DILocation(line: 217, column: 21, scope: !700)
!704 = !DILocation(line: 218, column: 17, scope: !700)
!705 = !DILocation(line: 218, column: 22, scope: !700)
!706 = !DILocation(line: 218, column: 27, scope: !700)
!707 = distinct !{!707, !686, !708, !133}
!708 = !DILocation(line: 219, column: 15, scope: !677)
!709 = !DILocation(line: 220, column: 13, scope: !677)
!710 = !DILocation(line: 222, column: 21, scope: !521)
!711 = !DILocation(line: 222, column: 13, scope: !521)
!712 = !DILocation(line: 223, column: 18, scope: !521)
!713 = !DILocation(line: 223, column: 23, scope: !521)
!714 = !DILocation(line: 223, column: 42, scope: !521)
!715 = !DILocation(line: 223, column: 35, scope: !521)
!716 = !DILocation(line: 223, column: 29, scope: !521)
