; ModuleID = 'src/htscache.c'
source_filename = "src/htscache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.httrackp = type { i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i64, i64, i64, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, %struct.t_proxy, i32, i32, %struct.String, i32, i32, i32, i32, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, %struct.String, %struct.String, %struct.htsfilters, ptr, ptr, i32, ptr, ptr, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, ptr, %struct.htslibhandles, %struct.htsoptstate }
%struct.t_proxy = type { i32, %struct.String, i32, %struct.String }
%struct.htsfilters = type { ptr, ptr }
%struct.String = type { ptr, i64, i64 }
%struct.htslibhandles = type { i32, ptr }
%struct.htsoptstate = type { ptr, i32, i32, i32, i32, %struct.String, ptr, i32, %struct.filenote_strc, %struct.htscallbacks, %struct.concat_strc, %struct.usercommand_strc, %struct.fspc_strc, ptr, i32, i32, ptr, i32, [1280 x i8], i32, i32, i32, i32, i32, ptr, i32, ptr, [2048 x i8], i32, i32, i32 }

!603 = !DIEnumerator(name: "STATUSCODE_SLOW", value: -3)
!604 = !DIEnumerator(name: "STATUSCODE_CONNERROR", value: -4)
!605 = !DIEnumerator(name: "STATUSCODE_NON_FATAL", value: -5)
!606 = !DIEnumerator(name: "STATUSCODE_SSL_HANDSHAKE", value: -6)
!607 = !DIEnumerator(name: "STATUSCODE_TOO_BIG", value: -7)
!608 = !DIEnumerator(name: "STATUSCODE_TEST_OK", value: -10)
!609 = !{!610, !611, !613, !599, !617, !620, !625, !627, !629, !624, !616, !632, !634, !635}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !618, line: 46, baseType: !619)
!618 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!619 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !621, line: 267, baseType: !622)
!621 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !623, line: 207, baseType: !624)
!623 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!624 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !626, line: 283, baseType: !624)
!626 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !628, line: 393, baseType: !545)
!628 = !DIFile(filename: "/usr/include/zconf.h", directory: "", checksumkind: CSK_MD5, checksum: "95e83c46958f6395f746c80cc6799e76")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "zipFile", file: !630, line: 69, baseType: !631)
!630 = !DIFile(filename: "./src/minizip/zip.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "e2067124d539336fa48f8e1adc0a9592")
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidp", file: !628, line: 410, baseType: !610)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "unzFile", file: !633, line: 70, baseType: !631)
!633 = !DIFile(filename: "./src/minizip/unzip.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "11ae6a9d654c95c47da55fe16772a1e5")
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTsys", file: !626, line: 311, baseType: !599)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !628, line: 394, baseType: !619)
!636 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !84, !89, !94, !99, !101, !103, !108, !113, !115, !120, !122, !127, !129, !134, !139, !144, !146, !148, !153, !155, !157, !162, !164, !169, !171, !173, !175, !177, !182, !184, !186, !188, !190, !192, !194, !196, !198, !203, !208, !210, !212, !217, !222, !224, !229, !231, !236, !238, !240, !242, !244, !249, !251, !253, !255, !257, !262, !267, !272, !274, !276, !278, !280, !282, !287, !289, !291, !296, !301, !306, !311, !313, !316, !318, !321, !323, !328, !330, !332, !334, !336, !338, !340, !342, !347, !349, !351, !353, !355, !357, !362, !367, !369, !374, !376, !378, !380, !385, !390, !395, !397, !399, !401, !406, !408, !410, !415, !417, !419, !424, !426, !428, !433, !438, !440, !442, !447, !449, !454, !456, !461, !463, !468, !470, !475, !477, !479, !481, !483, !485, !490, !492, !497, !499, !504, !509, !511, !513, !515, !517, !519, !521, !523, !528, !530, !535, !537, !539}
!637 = !{i32 7, !"Dwarf Version", i32 5}
!638 = !{i32 2, !"Debug Info Version", i32 3}
!639 = !{i32 1, !"wchar_size", i32 4}
!640 = !{i32 8, !"PIC Level", i32 2}
!641 = !{i32 7, !"PIE Level", i32 2}
!642 = !{i32 7, !"uwtable", i32 2}
!643 = !{i32 7, !"frame-pointer", i32 2}
!644 = !{!"clang version 16.0.0"}
!645 = distinct !DISubprogram(name: "cache_mayadd", scope: !2, file: !2, line: 104, type: !646, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !541, retainedNodes: !1493)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !648, !1461, !1299, !611, !611, !611}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !650, line: 47, baseType: !651)
!650 = !DIFile(filename: "./src/htscache.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "d2e7ca5f9d705510ffa12fc3184c91a1")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !652, line: 294, size: 1133184, elements: !653)
!652 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !730, !731, !732, !733, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !824, !869, !872, !873, !877, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !1331, !1343}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !651, file: !652, line: 295, baseType: !617, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !651, file: !652, line: 297, baseType: !599, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !651, file: !652, line: 298, baseType: !599, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !651, file: !652, line: 299, baseType: !599, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !651, file: !652, line: 300, baseType: !599, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !651, file: !652, line: 301, baseType: !599, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !651, file: !652, line: 302, baseType: !599, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !651, file: !652, line: 303, baseType: !599, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !651, file: !652, line: 304, baseType: !599, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !651, file: !652, line: 305, baseType: !599, size: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !651, file: !652, line: 306, baseType: !599, size: 32, offset: 352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !651, file: !652, line: 307, baseType: !666, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !668, line: 7, baseType: !669)
!668 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !670, line: 49, size: 1728, elements: !671)
!670 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !687, !689, !690, !691, !693, !695, !697, !698, !701, !703, !706, !709, !710, !711, !712, !713}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !669, file: !670, line: 51, baseType: !599, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !669, file: !670, line: 54, baseType: !616, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !669, file: !670, line: 55, baseType: !616, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !669, file: !670, line: 56, baseType: !616, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !669, file: !670, line: 57, baseType: !616, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !669, file: !670, line: 58, baseType: !616, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !669, file: !670, line: 59, baseType: !616, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !669, file: !670, line: 60, baseType: !616, size: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !669, file: !670, line: 61, baseType: !616, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !669, file: !670, line: 64, baseType: !616, size: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !669, file: !670, line: 65, baseType: !616, size: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !669, file: !670, line: 66, baseType: !616, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !669, file: !670, line: 68, baseType: !685, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !670, line: 36, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !669, file: !670, line: 70, baseType: !688, size: 64, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !669, file: !670, line: 72, baseType: !599, size: 32, offset: 896)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !669, file: !670, line: 73, baseType: !599, size: 32, offset: 928)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !669, file: !670, line: 74, baseType: !692, size: 64, offset: 960)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !623, line: 152, baseType: !624)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !669, file: !670, line: 77, baseType: !694, size: 16, offset: 1024)
!694 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !669, file: !670, line: 78, baseType: !696, size: 8, offset: 1040)
!696 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !669, file: !670, line: 79, baseType: !91, size: 8, offset: 1048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !669, file: !670, line: 81, baseType: !699, size: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !670, line: 43, baseType: null)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !669, file: !670, line: 89, baseType: !702, size: 64, offset: 1152)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !623, line: 153, baseType: !624)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !669, file: !670, line: 91, baseType: !704, size: 64, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !670, line: 37, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !669, file: !670, line: 92, baseType: !707, size: 64, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !670, line: 38, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !669, file: !670, line: 93, baseType: !688, size: 64, offset: 1344)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !669, file: !670, line: 94, baseType: !610, size: 64, offset: 1408)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !669, file: !670, line: 95, baseType: !617, size: 64, offset: 1472)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !669, file: !670, line: 96, baseType: !599, size: 32, offset: 1536)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !669, file: !670, line: 98, baseType: !117, size: 160, offset: 1568)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !651, file: !652, line: 308, baseType: !666, size: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !651, file: !652, line: 309, baseType: !625, size: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !651, file: !652, line: 310, baseType: !625, size: 64, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !651, file: !652, line: 311, baseType: !625, size: 64, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !651, file: !652, line: 312, baseType: !599, size: 32, offset: 704)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !651, file: !652, line: 313, baseType: !625, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !651, file: !652, line: 314, baseType: !599, size: 32, offset: 832)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !651, file: !652, line: 315, baseType: !599, size: 32, offset: 864)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !651, file: !652, line: 316, baseType: !599, size: 32, offset: 896)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !651, file: !652, line: 317, baseType: !599, size: 32, offset: 928)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !651, file: !652, line: 318, baseType: !599, size: 32, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !651, file: !652, line: 319, baseType: !599, size: 32, offset: 992)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !651, file: !652, line: 320, baseType: !599, size: 32, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !651, file: !652, line: 321, baseType: !599, size: 32, offset: 1056)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !651, file: !652, line: 322, baseType: !729, size: 32, offset: 1088)
!729 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !651, file: !652, line: 323, baseType: !599, size: 32, offset: 1120)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !651, file: !652, line: 324, baseType: !599, size: 32, offset: 1152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !651, file: !652, line: 326, baseType: !599, size: 32, offset: 1184)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !651, file: !652, line: 327, baseType: !734, size: 512, offset: 1216)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !652, line: 89, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !652, line: 91, size: 512, elements: !736)
!736 = !{!737, !738, !746, !747}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !735, file: !652, line: 92, baseType: !599, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !735, file: !652, line: 93, baseType: !739, size: 192, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !740, line: 57, baseType: !741)
!740 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !740, line: 61, size: 192, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !741, file: !740, line: 62, baseType: !616, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !741, file: !740, line: 63, baseType: !617, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !741, file: !740, line: 64, baseType: !617, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !735, file: !652, line: 94, baseType: !599, size: 32, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !735, file: !652, line: 95, baseType: !739, size: 192, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !651, file: !652, line: 328, baseType: !599, size: 32, offset: 1728)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !651, file: !652, line: 329, baseType: !599, size: 32, offset: 1760)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !651, file: !652, line: 330, baseType: !739, size: 192, offset: 1792)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !651, file: !652, line: 331, baseType: !599, size: 32, offset: 1984)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !651, file: !652, line: 332, baseType: !599, size: 32, offset: 2016)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !651, file: !652, line: 333, baseType: !599, size: 32, offset: 2048)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !651, file: !652, line: 334, baseType: !599, size: 32, offset: 2080)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !651, file: !652, line: 335, baseType: !739, size: 192, offset: 2112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !651, file: !652, line: 336, baseType: !739, size: 192, offset: 2304)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !651, file: !652, line: 337, baseType: !739, size: 192, offset: 2496)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !651, file: !652, line: 338, baseType: !739, size: 192, offset: 2688)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !651, file: !652, line: 339, baseType: !739, size: 192, offset: 2880)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !651, file: !652, line: 340, baseType: !739, size: 192, offset: 3072)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !651, file: !652, line: 341, baseType: !739, size: 192, offset: 3264)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !651, file: !652, line: 342, baseType: !599, size: 32, offset: 3456)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !651, file: !652, line: 343, baseType: !599, size: 32, offset: 3488)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !651, file: !652, line: 344, baseType: !599, size: 32, offset: 3520)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !651, file: !652, line: 345, baseType: !599, size: 32, offset: 3552)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !651, file: !652, line: 346, baseType: !599, size: 32, offset: 3584)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !651, file: !652, line: 347, baseType: !599, size: 32, offset: 3616)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !651, file: !652, line: 348, baseType: !599, size: 32, offset: 3648)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !651, file: !652, line: 349, baseType: !599, size: 32, offset: 3680)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !651, file: !652, line: 350, baseType: !599, size: 32, offset: 3712)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !651, file: !652, line: 351, baseType: !599, size: 32, offset: 3744)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !651, file: !652, line: 352, baseType: !599, size: 32, offset: 3776)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !651, file: !652, line: 353, baseType: !599, size: 32, offset: 3808)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !651, file: !652, line: 354, baseType: !599, size: 32, offset: 3840)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !651, file: !652, line: 355, baseType: !739, size: 192, offset: 3904)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !651, file: !652, line: 356, baseType: !599, size: 32, offset: 4096)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !651, file: !652, line: 357, baseType: !599, size: 32, offset: 4128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !651, file: !652, line: 358, baseType: !779, size: 64, offset: 4160)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !781, line: 53, baseType: !782)
!781 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !781, line: 55, size: 278656, elements: !783)
!783 = !{!784, !785, !789}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !782, file: !781, line: 56, baseType: !599, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !782, file: !781, line: 57, baseType: !786, size: 262144, offset: 32)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 32768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !782, file: !781, line: 58, baseType: !790, size: 16448, offset: 262208)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !781, line: 42, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !781, line: 44, size: 16448, elements: !792)
!792 = !{!793, !797, !798}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !791, file: !781, line: 45, baseType: !794, size: 8192)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 1024)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !791, file: !781, line: 46, baseType: !794, size: 8192, offset: 8192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !791, file: !781, line: 47, baseType: !799, size: 64, offset: 16384)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !651, file: !652, line: 359, baseType: !599, size: 32, offset: 4224)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !651, file: !652, line: 360, baseType: !599, size: 32, offset: 4256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !651, file: !652, line: 361, baseType: !599, size: 32, offset: 4288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !651, file: !652, line: 362, baseType: !599, size: 32, offset: 4320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !651, file: !652, line: 363, baseType: !599, size: 32, offset: 4352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !651, file: !652, line: 364, baseType: !599, size: 32, offset: 4384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !651, file: !652, line: 365, baseType: !599, size: 32, offset: 4416)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !651, file: !652, line: 366, baseType: !599, size: 32, offset: 4448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !651, file: !652, line: 367, baseType: !599, size: 32, offset: 4480)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !651, file: !652, line: 368, baseType: !599, size: 32, offset: 4512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !651, file: !652, line: 369, baseType: !739, size: 192, offset: 4544)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !651, file: !652, line: 370, baseType: !599, size: 32, offset: 4736)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !651, file: !652, line: 372, baseType: !599, size: 32, offset: 4768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !651, file: !652, line: 373, baseType: !739, size: 192, offset: 4800)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !651, file: !652, line: 374, baseType: !739, size: 192, offset: 4992)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !651, file: !652, line: 375, baseType: !816, size: 128, offset: 5184)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !652, line: 101, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !652, line: 103, size: 128, elements: !818)
!818 = !{!819, !822}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !817, file: !652, line: 104, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !817, file: !652, line: 105, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !651, file: !652, line: 376, baseType: !825, size: 64, offset: 5312)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !827, line: 73, baseType: !828)
!827 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !827, line: 202, size: 98624, elements: !829)
!829 = !{!830, !853, !857, !858, !859, !860, !864, !865}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !828, file: !827, line: 204, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !827, line: 57, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !652, line: 534, size: 640, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !838, file: !652, line: 535, baseType: !616, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !838, file: !652, line: 536, baseType: !616, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !838, file: !652, line: 537, baseType: !616, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !838, file: !652, line: 538, baseType: !616, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !838, file: !652, line: 539, baseType: !616, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !838, file: !652, line: 540, baseType: !616, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !838, file: !652, line: 542, baseType: !599, size: 32, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !838, file: !652, line: 543, baseType: !599, size: 32, offset: 416)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !838, file: !652, line: 544, baseType: !599, size: 32, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !838, file: !652, line: 545, baseType: !599, size: 32, offset: 480)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !838, file: !652, line: 546, baseType: !4, size: 8, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !838, file: !652, line: 548, baseType: !599, size: 32, offset: 544)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !838, file: !652, line: 549, baseType: !599, size: 32, offset: 576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !828, file: !827, line: 206, baseType: !854, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !652, line: 210, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !652, line: 210, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !828, file: !827, line: 208, baseType: !854, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !828, file: !827, line: 210, baseType: !854, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !828, file: !827, line: 212, baseType: !599, size: 32, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !828, file: !827, line: 213, baseType: !861, size: 16384, offset: 288)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 2048)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !828, file: !827, line: 214, baseType: !861, size: 16384, offset: 16672)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !828, file: !827, line: 215, baseType: !866, size: 65536, offset: 33056)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 8192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !651, file: !652, line: 377, baseType: !870, size: 64, offset: 5376)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !651, file: !652, line: 378, baseType: !599, size: 32, offset: 5440)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !651, file: !652, line: 379, baseType: !874, size: 64, offset: 5504)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !652, line: 286, baseType: !876)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !652, line: 286, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !651, file: !652, line: 380, baseType: !878, size: 64, offset: 5568)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !652, line: 61, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !881, line: 42, size: 33856, elements: !882)
!881 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!882 = !{!883, !887, !891}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !880, file: !881, line: 43, baseType: !884, size: 1024)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !880, file: !881, line: 44, baseType: !888, size: 32768, offset: 1024)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 4096)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !880, file: !881, line: 45, baseType: !892, size: 64, offset: 33792)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !651, file: !652, line: 381, baseType: !739, size: 192, offset: 5632)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !651, file: !652, line: 382, baseType: !739, size: 192, offset: 5824)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !651, file: !652, line: 383, baseType: !739, size: 192, offset: 6016)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !651, file: !652, line: 384, baseType: !739, size: 192, offset: 6208)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !651, file: !652, line: 385, baseType: !739, size: 192, offset: 6400)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !651, file: !652, line: 386, baseType: !599, size: 32, offset: 6592)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !651, file: !652, line: 388, baseType: !599, size: 32, offset: 6624)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !651, file: !652, line: 389, baseType: !599, size: 32, offset: 6656)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !651, file: !652, line: 391, baseType: !611, size: 64, offset: 6720)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !651, file: !652, line: 393, baseType: !599, size: 32, offset: 6784)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !651, file: !652, line: 394, baseType: !599, size: 32, offset: 6816)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !651, file: !652, line: 395, baseType: !599, size: 32, offset: 6848)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !651, file: !652, line: 396, baseType: !599, size: 32, offset: 6880)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !651, file: !652, line: 398, baseType: !599, size: 32, offset: 6912)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !651, file: !652, line: 399, baseType: !599, size: 32, offset: 6944)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !651, file: !652, line: 402, baseType: !909, size: 64, offset: 6976)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !911, line: 164, baseType: !912)
!911 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !911, line: 191, size: 3328, elements: !913)
!913 = !{!914, !933, !939, !948, !954, !960, !970, !976, !985, !994, !1000, !1006, !1213, !1222, !1231, !1240, !1246, !1255, !1264, !1273, !1282, !1291, !1301, !1307, !1319, !1325}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !912, file: !911, line: 193, baseType: !915, size: 128)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !911, line: 193, size: 128, elements: !916)
!916 = !{!917, !932}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !915, file: !911, line: 193, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !911, line: 83, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !922}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !911, line: 60, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !911, line: 179, size: 192, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !924, file: !911, line: 181, baseType: !610, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !924, file: !911, line: 187, baseType: !928, size: 128, offset: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !911, line: 184, size: 128, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !928, file: !911, line: 185, baseType: !610, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !928, file: !911, line: 186, baseType: !922, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !915, file: !911, line: 193, baseType: !922, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !912, file: !911, line: 194, baseType: !934, size: 128, offset: 128)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !911, line: 194, size: 128, elements: !935)
!935 = !{!936, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !934, file: !911, line: 194, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !911, line: 84, baseType: !919)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !934, file: !911, line: 194, baseType: !922, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !912, file: !911, line: 195, baseType: !940, size: 128, offset: 256)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !911, line: 195, size: 128, elements: !941)
!941 = !{!942, !947}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !940, file: !911, line: 195, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !911, line: 85, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!599, !922, !648}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !940, file: !911, line: 195, baseType: !922, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !912, file: !911, line: 196, baseType: !949, size: 128, offset: 384)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !911, line: 196, size: 128, elements: !950)
!950 = !{!951, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !949, file: !911, line: 196, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !911, line: 86, baseType: !944)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !949, file: !911, line: 196, baseType: !922, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !912, file: !911, line: 197, baseType: !955, size: 128, offset: 512)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !911, line: 197, size: 128, elements: !956)
!956 = !{!957, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !955, file: !911, line: 197, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !911, line: 87, baseType: !944)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !955, file: !911, line: 197, baseType: !922, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !912, file: !911, line: 198, baseType: !961, size: 128, offset: 640)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !911, line: 198, size: 128, elements: !962)
!962 = !{!963, !969}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !961, file: !911, line: 198, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !911, line: 92, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !911, line: 88, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!599, !922, !648, !821, !823, !611, !611}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !961, file: !911, line: 198, baseType: !922, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !912, file: !911, line: 199, baseType: !971, size: 128, offset: 768)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !911, line: 199, size: 128, elements: !972)
!972 = !{!973, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !971, file: !911, line: 199, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !911, line: 93, baseType: !965)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !971, file: !911, line: 199, baseType: !922, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !912, file: !911, line: 200, baseType: !977, size: 128, offset: 896)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !911, line: 200, size: 128, elements: !978)
!978 = !{!979, !984}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !977, file: !911, line: 200, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !911, line: 94, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!599, !922, !648, !616, !599, !611, !611}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !977, file: !911, line: 200, baseType: !922, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !912, file: !911, line: 201, baseType: !986, size: 128, offset: 1024)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !911, line: 201, size: 128, elements: !987)
!987 = !{!988, !993}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !986, file: !911, line: 201, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !911, line: 98, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!611, !922, !648, !611}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !986, file: !911, line: 201, baseType: !922, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !912, file: !911, line: 202, baseType: !995, size: 128, offset: 1152)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !911, line: 202, size: 128, elements: !996)
!996 = !{!997, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !995, file: !911, line: 202, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !911, line: 101, baseType: !990)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !995, file: !911, line: 202, baseType: !922, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !912, file: !911, line: 203, baseType: !1001, size: 128, offset: 1280)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !911, line: 203, size: 128, elements: !1002)
!1002 = !{!1003, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1001, file: !911, line: 203, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !911, line: 104, baseType: !990)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1001, file: !911, line: 203, baseType: !922, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !912, file: !911, line: 204, baseType: !1007, size: 128, offset: 1408)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !911, line: 204, size: 128, elements: !1008)
!1008 = !{!1009, !1212}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1007, file: !911, line: 204, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !911, line: 107, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!599, !922, !648, !1014, !599, !599, !599, !599, !599, !1181}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !827, line: 61, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !652, line: 557, size: 135040, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1033, !1034, !1035, !1036, !1037, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !1016, file: !652, line: 561, baseType: !861, size: 16384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !1016, file: !652, line: 562, baseType: !861, size: 16384, offset: 16384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !1016, file: !652, line: 563, baseType: !861, size: 16384, offset: 32768)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !1016, file: !652, line: 564, baseType: !861, size: 16384, offset: 49152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !1016, file: !652, line: 565, baseType: !861, size: 16384, offset: 65536)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !1016, file: !652, line: 566, baseType: !861, size: 16384, offset: 81920)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1016, file: !652, line: 567, baseType: !616, size: 64, offset: 98304)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !1016, file: !652, line: 568, baseType: !861, size: 16384, offset: 98368)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !1016, file: !652, line: 569, baseType: !794, size: 8192, offset: 114752)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1016, file: !652, line: 570, baseType: !599, size: 32, offset: 122944)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !1016, file: !652, line: 571, baseType: !599, size: 32, offset: 122976)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1016, file: !652, line: 572, baseType: !599, size: 32, offset: 123008)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1016, file: !652, line: 573, baseType: !599, size: 32, offset: 123040)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !1016, file: !652, line: 574, baseType: !1032, size: 64, offset: 123072)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !626, line: 284, baseType: !624)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1016, file: !652, line: 575, baseType: !599, size: 32, offset: 123136)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !1016, file: !652, line: 576, baseType: !1032, size: 64, offset: 123200)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1016, file: !652, line: 577, baseType: !625, size: 64, offset: 123264)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1016, file: !652, line: 578, baseType: !625, size: 64, offset: 123328)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1016, file: !652, line: 579, baseType: !1038, size: 8960, offset: 123392)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !650, line: 55, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !652, line: 486, size: 8960, elements: !1040)
!1040 = !{!1041, !1042, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1061, !1062, !1063, !1064, !1065, !1066, !1068, !1125, !1126, !1127, !1128, !1133, !1134, !1138, !1139, !1140, !1141, !1142, !1143}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !1039, file: !652, line: 487, baseType: !599, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !1039, file: !652, line: 488, baseType: !1043, size: 16, offset: 32)
!1043 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !1039, file: !652, line: 489, baseType: !1043, size: 16, offset: 48)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1039, file: !652, line: 490, baseType: !1043, size: 16, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !1039, file: !652, line: 491, baseType: !1043, size: 16, offset: 80)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !1039, file: !652, line: 492, baseType: !1043, size: 16, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !1039, file: !652, line: 493, baseType: !1043, size: 16, offset: 112)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !1039, file: !652, line: 494, baseType: !1043, size: 16, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !1039, file: !652, line: 495, baseType: !599, size: 32, offset: 160)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !1039, file: !652, line: 496, baseType: !599, size: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1039, file: !652, line: 497, baseType: !616, size: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1039, file: !652, line: 498, baseType: !616, size: 64, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1039, file: !652, line: 499, baseType: !666, size: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1039, file: !652, line: 500, baseType: !625, size: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !1039, file: !652, line: 501, baseType: !403, size: 640, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !1039, file: !652, line: 502, baseType: !1058, size: 512, offset: 1152)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !1039, file: !652, line: 503, baseType: !1058, size: 512, offset: 1664)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !1039, file: !652, line: 504, baseType: !1058, size: 512, offset: 2176)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1039, file: !652, line: 505, baseType: !616, size: 64, offset: 2688)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !1039, file: !652, line: 506, baseType: !625, size: 64, offset: 2752)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !1039, file: !652, line: 507, baseType: !1043, size: 16, offset: 2816)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !1039, file: !652, line: 508, baseType: !1067, size: 32, offset: 2848)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !626, line: 323, baseType: !599)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1039, file: !652, line: 509, baseType: !1069, size: 224, offset: 2880)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !1070, line: 91, baseType: !1071)
!1070 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !1070, line: 93, size: 224, elements: !1072)
!1072 = !{!1073}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !1071, file: !1070, line: 103, baseType: !1074, size: 224)
!1074 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1071, file: !1070, line: 94, size: 224, elements: !1075)
!1075 = !{!1076, !1084, !1104}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1074, file: !1070, line: 96, baseType: !1077, size: 128)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1078, line: 180, size: 128, elements: !1079)
!1078 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1079 = !{!1080, !1083}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1077, file: !1078, line: 182, baseType: !1081, size: 16)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1082, line: 28, baseType: !694)
!1082 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1077, file: !1078, line: 183, baseType: !105, size: 112, offset: 16)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1074, file: !1070, line: 98, baseType: !1085, size: 128)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1086, line: 245, size: 128, elements: !1087)
!1086 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!1087 = !{!1088, !1089, !1094, !1101}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1085, file: !1086, line: 247, baseType: !1081, size: 16)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1085, file: !1086, line: 248, baseType: !1090, size: 16, offset: 16)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1086, line: 123, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1092, line: 25, baseType: !1093)
!1092 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !623, line: 40, baseType: !694)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1085, file: !1086, line: 249, baseType: !1095, size: 32, offset: 32)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1086, line: 31, size: 32, elements: !1096)
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1095, file: !1086, line: 33, baseType: !1098, size: 32)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1086, line: 30, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1092, line: 26, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !623, line: 42, baseType: !545)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1085, file: !1086, line: 252, baseType: !1102, size: 64, offset: 64)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 64, elements: !132)
!1103 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1074, file: !1070, line: 101, baseType: !1105, size: 224)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1086, line: 260, size: 224, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1124}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1105, file: !1086, line: 262, baseType: !1081, size: 16)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1105, file: !1086, line: 263, baseType: !1090, size: 16, offset: 16)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1105, file: !1086, line: 264, baseType: !1099, size: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1105, file: !1086, line: 265, baseType: !1111, size: 128, offset: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1086, line: 219, size: 128, elements: !1112)
!1112 = !{!1113}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1111, file: !1086, line: 226, baseType: !1114, size: 128)
!1114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1111, file: !1086, line: 221, size: 128, elements: !1115)
!1115 = !{!1116, !1120, !1122}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1114, file: !1086, line: 223, baseType: !1117, size: 128)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1118, size: 128, elements: !87)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1092, line: 24, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !623, line: 38, baseType: !1103)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1114, file: !1086, line: 224, baseType: !1121, size: 128)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 128, elements: !132)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1114, file: !1086, line: 225, baseType: !1123, size: 128)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 128, elements: !167)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1105, file: !1086, line: 266, baseType: !1099, size: 32, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !1039, file: !652, line: 510, baseType: !599, size: 32, offset: 3104)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !1039, file: !652, line: 511, baseType: !666, size: 64, offset: 3136)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !1039, file: !652, line: 513, baseType: !1043, size: 16, offset: 3200)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !1039, file: !652, line: 515, baseType: !1129, size: 64, offset: 3264)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !1131, line: 184, baseType: !1132)
!1131 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !1131, line: 184, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !1039, file: !652, line: 517, baseType: !1058, size: 512, offset: 3328)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !1039, file: !652, line: 518, baseType: !1135, size: 2048, offset: 3840)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !1039, file: !652, line: 519, baseType: !1135, size: 2048, offset: 5888)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !1039, file: !652, line: 520, baseType: !625, size: 64, offset: 7936)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !1039, file: !652, line: 521, baseType: !625, size: 64, offset: 8000)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !1039, file: !652, line: 522, baseType: !625, size: 64, offset: 8064)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !1039, file: !652, line: 523, baseType: !599, size: 32, offset: 8128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !1039, file: !652, line: 525, baseType: !1144, size: 768, offset: 8192)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !320, line: 43, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !652, line: 465, size: 768, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1145, file: !652, line: 466, baseType: !1043, size: 16)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1145, file: !652, line: 467, baseType: !1043, size: 16, offset: 16)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1145, file: !652, line: 468, baseType: !1043, size: 16, offset: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !1145, file: !652, line: 469, baseType: !1043, size: 16, offset: 48)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1145, file: !652, line: 470, baseType: !1043, size: 16, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !1145, file: !652, line: 471, baseType: !1043, size: 16, offset: 80)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1145, file: !652, line: 472, baseType: !611, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1145, file: !652, line: 473, baseType: !611, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1145, file: !652, line: 474, baseType: !611, size: 64, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1145, file: !652, line: 475, baseType: !611, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1145, file: !652, line: 476, baseType: !611, size: 64, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1145, file: !652, line: 477, baseType: !611, size: 64, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1145, file: !652, line: 478, baseType: !1160, size: 256, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !652, line: 452, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !652, line: 454, size: 256, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1161, file: !652, line: 455, baseType: !599, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1161, file: !652, line: 456, baseType: !611, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1161, file: !652, line: 457, baseType: !599, size: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1161, file: !652, line: 458, baseType: !611, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1016, file: !652, line: 580, baseType: !599, size: 32, offset: 132352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !1016, file: !652, line: 581, baseType: !599, size: 32, offset: 132384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !1016, file: !652, line: 582, baseType: !625, size: 64, offset: 132416)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !1016, file: !652, line: 583, baseType: !1032, size: 64, offset: 132480)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1016, file: !652, line: 585, baseType: !599, size: 32, offset: 132544)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1016, file: !652, line: 586, baseType: !599, size: 32, offset: 132576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !1016, file: !652, line: 587, baseType: !616, size: 64, offset: 132608)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1016, file: !652, line: 588, baseType: !625, size: 64, offset: 132672)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !1016, file: !652, line: 589, baseType: !625, size: 64, offset: 132736)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !1016, file: !652, line: 590, baseType: !625, size: 64, offset: 132800)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1016, file: !652, line: 594, baseType: !1135, size: 2048, offset: 132864)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !1016, file: !652, line: 595, baseType: !599, size: 32, offset: 134912)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !1016, file: !652, line: 596, baseType: !599, size: 32, offset: 134944)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !1016, file: !652, line: 597, baseType: !599, size: 32, offset: 134976)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !544, line: 70, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !652, line: 414, size: 1344, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190, !1191, !1193, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !1183, file: !652, line: 415, baseType: !625, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !1183, file: !652, line: 416, baseType: !625, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !1183, file: !652, line: 418, baseType: !1032, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !1183, file: !652, line: 420, baseType: !625, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !1183, file: !652, line: 421, baseType: !625, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !1183, file: !652, line: 422, baseType: !599, size: 32, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !1183, file: !652, line: 424, baseType: !1192, size: 128, offset: 384)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 128, elements: !30)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !1183, file: !652, line: 425, baseType: !1194, size: 128, offset: 512)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 128, elements: !30)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !1183, file: !652, line: 426, baseType: !1032, size: 64, offset: 640)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !1183, file: !652, line: 427, baseType: !599, size: 32, offset: 704)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !1183, file: !652, line: 429, baseType: !599, size: 32, offset: 736)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !1183, file: !652, line: 430, baseType: !599, size: 32, offset: 768)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !1183, file: !652, line: 431, baseType: !599, size: 32, offset: 800)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !1183, file: !652, line: 433, baseType: !599, size: 32, offset: 832)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !1183, file: !652, line: 434, baseType: !599, size: 32, offset: 864)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !1183, file: !652, line: 435, baseType: !599, size: 32, offset: 896)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !1183, file: !652, line: 436, baseType: !599, size: 32, offset: 928)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !1183, file: !652, line: 437, baseType: !599, size: 32, offset: 960)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !1183, file: !652, line: 438, baseType: !599, size: 32, offset: 992)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !1183, file: !652, line: 439, baseType: !599, size: 32, offset: 1024)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !1183, file: !652, line: 440, baseType: !599, size: 32, offset: 1056)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !1183, file: !652, line: 441, baseType: !625, size: 64, offset: 1088)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1183, file: !652, line: 443, baseType: !625, size: 64, offset: 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !1183, file: !652, line: 445, baseType: !1032, size: 64, offset: 1216)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !1183, file: !652, line: 446, baseType: !1032, size: 64, offset: 1280)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1007, file: !911, line: 204, baseType: !922, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !912, file: !911, line: 205, baseType: !1214, size: 128, offset: 1536)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !911, line: 205, size: 128, elements: !1215)
!1215 = !{!1216, !1221}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1214, file: !911, line: 205, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !911, line: 112, baseType: !1218)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!599, !922, !648, !611, !611, !599}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1214, file: !911, line: 205, baseType: !922, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !912, file: !911, line: 206, baseType: !1223, size: 128, offset: 1664)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !911, line: 206, size: 128, elements: !1224)
!1224 = !{!1225, !1230}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1223, file: !911, line: 206, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !911, line: 115, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!599, !922, !648, !611, !611, !611, !599}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1223, file: !911, line: 206, baseType: !922, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !912, file: !911, line: 207, baseType: !1232, size: 128, offset: 1792)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !911, line: 207, size: 128, elements: !1233)
!1233 = !{!1234, !1239}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1232, file: !911, line: 207, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !911, line: 119, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !922, !648, !611}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1232, file: !911, line: 207, baseType: !922, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !912, file: !911, line: 208, baseType: !1241, size: 128, offset: 1920)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !911, line: 208, size: 128, elements: !1242)
!1242 = !{!1243, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1241, file: !911, line: 208, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !911, line: 121, baseType: !1236)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1241, file: !911, line: 208, baseType: !922, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !912, file: !911, line: 209, baseType: !1247, size: 128, offset: 2048)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !911, line: 209, size: 128, elements: !1248)
!1248 = !{!1249, !1254}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1247, file: !911, line: 209, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !911, line: 123, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{null, !922, !648, !611, !611, !611, !599, !599, !599}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1247, file: !911, line: 209, baseType: !922, size: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !912, file: !911, line: 210, baseType: !1256, size: 128, offset: 2176)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !911, line: 210, size: 128, elements: !1257)
!1257 = !{!1258, !1263}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1256, file: !911, line: 210, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !911, line: 128, baseType: !1260)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!599, !922, !648, !616}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1256, file: !911, line: 210, baseType: !922, size: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !912, file: !911, line: 211, baseType: !1265, size: 128, offset: 2304)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !911, line: 211, size: 128, elements: !1266)
!1266 = !{!1267, !1272}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1265, file: !911, line: 211, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !911, line: 130, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!599, !922, !648, !616, !611}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1265, file: !911, line: 211, baseType: !922, size: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !912, file: !911, line: 212, baseType: !1274, size: 128, offset: 2432)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !911, line: 212, size: 128, elements: !1275)
!1275 = !{!1276, !1281}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1274, file: !911, line: 212, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !911, line: 133, baseType: !1278)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!599, !922, !648, !1014}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1274, file: !911, line: 212, baseType: !922, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !912, file: !911, line: 213, baseType: !1283, size: 128, offset: 2560)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !911, line: 213, size: 128, elements: !1284)
!1284 = !{!1285, !1290}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1283, file: !911, line: 213, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !911, line: 135, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!599, !922, !648, !611, !611, !611, !611, !616}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1283, file: !911, line: 213, baseType: !922, size: 64, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !912, file: !911, line: 214, baseType: !1292, size: 128, offset: 2688)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !911, line: 214, size: 128, elements: !1293)
!1293 = !{!1294, !1300}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1292, file: !911, line: 214, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !911, line: 142, baseType: !1296)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!599, !922, !648, !616, !611, !611, !611, !611, !1299}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1292, file: !911, line: 214, baseType: !922, size: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !912, file: !911, line: 215, baseType: !1302, size: 128, offset: 2816)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !911, line: 215, size: 128, elements: !1303)
!1303 = !{!1304, !1306}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1302, file: !911, line: 215, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !911, line: 148, baseType: !1296)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1302, file: !911, line: 215, baseType: !922, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !912, file: !911, line: 216, baseType: !1308, size: 128, offset: 2944)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !911, line: 216, size: 128, elements: !1309)
!1309 = !{!1310, !1318}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1308, file: !911, line: 216, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !911, line: 156, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!599, !922, !648, !1315}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !911, line: 56, baseType: !1317)
!1317 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !911, line: 56, flags: DIFlagFwdDecl)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1308, file: !911, line: 216, baseType: !922, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !912, file: !911, line: 217, baseType: !1320, size: 128, offset: 3072)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !911, line: 217, size: 128, elements: !1321)
!1321 = !{!1322, !1324}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1320, file: !911, line: 217, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !911, line: 158, baseType: !1312)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1320, file: !911, line: 217, baseType: !922, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !912, file: !911, line: 219, baseType: !1326, size: 128, offset: 3200)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !911, line: 219, size: 128, elements: !1327)
!1327 = !{!1328, !1330}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1326, file: !911, line: 219, baseType: !1329, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !911, line: 141, baseType: !1286)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1326, file: !911, line: 219, baseType: !922, size: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !651, file: !652, line: 404, baseType: !1332, size: 128, offset: 7040)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !652, line: 260, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !652, line: 270, size: 128, elements: !1334)
!1334 = !{!1335, !1336}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1333, file: !652, line: 271, baseType: !599, size: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1333, file: !652, line: 272, baseType: !1337, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !652, line: 264, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !652, line: 266, size: 128, elements: !1340)
!1340 = !{!1341, !1342}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !1339, file: !652, line: 267, baseType: !616, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1339, file: !652, line: 268, baseType: !610, size: 64, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !651, file: !652, line: 406, baseType: !1344, size: 1126016, offset: 7168)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !652, line: 216, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !652, line: 218, size: 1126016, elements: !1346)
!1346 = !{!1347, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1392, !1404, !1412, !1418, !1425, !1426, !1427, !1428, !1438, !1439, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1457, !1458, !1459, !1460}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1345, file: !652, line: 219, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !652, line: 204, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !1351, line: 59, size: 320, elements: !1352)
!1351 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!1352 = !{!1353}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1350, file: !1351, line: 60, baseType: !1354, size: 320)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1355, line: 72, baseType: !1356)
!1355 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!1356 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1355, line: 67, size: 320, elements: !1357)
!1357 = !{!1358, !1377, !1378}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1356, file: !1355, line: 69, baseType: !1359, size: 320)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1360, line: 22, size: 320, elements: !1361)
!1360 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!1361 = !{!1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1359, file: !1360, line: 24, baseType: !599, size: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1359, file: !1360, line: 25, baseType: !545, size: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1359, file: !1360, line: 26, baseType: !599, size: 32, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1359, file: !1360, line: 28, baseType: !545, size: 32, offset: 96)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1359, file: !1360, line: 32, baseType: !599, size: 32, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1359, file: !1360, line: 34, baseType: !1043, size: 16, offset: 160)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1359, file: !1360, line: 35, baseType: !1043, size: 16, offset: 176)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1359, file: !1360, line: 36, baseType: !1370, size: 128, offset: 192)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1371, line: 55, baseType: !1372)
!1371 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1371, line: 51, size: 128, elements: !1373)
!1373 = !{!1374, !1376}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1372, file: !1371, line: 53, baseType: !1375, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1372, file: !1371, line: 54, baseType: !1375, size: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1356, file: !1355, line: 70, baseType: !49, size: 320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1356, file: !1355, line: 71, baseType: !624, size: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1345, file: !652, line: 221, baseType: !599, size: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !1345, file: !652, line: 222, baseType: !599, size: 32, offset: 96)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !1345, file: !652, line: 223, baseType: !599, size: 32, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !1345, file: !652, line: 225, baseType: !599, size: 32, offset: 160)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !1345, file: !652, line: 226, baseType: !739, size: 192, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !1345, file: !652, line: 227, baseType: !666, size: 64, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !1345, file: !652, line: 228, baseType: !599, size: 32, offset: 448)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !1345, file: !652, line: 230, baseType: !1387, size: 32832, offset: 512)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !652, line: 121, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !652, line: 123, size: 32832, elements: !1389)
!1389 = !{!1390, !1391}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !1388, file: !652, line: 124, baseType: !666, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1388, file: !652, line: 125, baseType: !888, size: 32768, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1345, file: !652, line: 232, baseType: !1393, size: 192, offset: 33344)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !652, line: 111, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !652, line: 112, size: 192, elements: !1395)
!1395 = !{!1396, !1397, !1402}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !1394, file: !652, line: 113, baseType: !610, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !1394, file: !652, line: 114, baseType: !1398, size: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !652, line: 110, baseType: !1399)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!599}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1394, file: !652, line: 115, baseType: !1403, size: 64, offset: 128)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !1345, file: !652, line: 233, baseType: !1405, size: 1048608, offset: 33536)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !652, line: 131, baseType: !1406)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !652, line: 133, size: 1048608, elements: !1407)
!1407 = !{!1408, !1409}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1406, file: !652, line: 134, baseType: !599, size: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1406, file: !652, line: 135, baseType: !1410, size: 1048576, offset: 32)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !1411)
!1411 = !{!88, !868}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !1345, file: !652, line: 234, baseType: !1413, size: 16416, offset: 1082144)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !652, line: 153, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !652, line: 155, size: 16416, elements: !1415)
!1415 = !{!1416, !1417}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !1414, file: !652, line: 156, baseType: !599, size: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !1414, file: !652, line: 157, baseType: !861, size: 16384, offset: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !1345, file: !652, line: 235, baseType: !1419, size: 96, offset: 1098560)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !652, line: 163, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !652, line: 165, size: 96, elements: !1421)
!1421 = !{!1422, !1423, !1424}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1420, file: !652, line: 166, baseType: !599, size: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !1420, file: !652, line: 167, baseType: !599, size: 32, offset: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1420, file: !652, line: 168, baseType: !599, size: 32, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !1345, file: !652, line: 236, baseType: !616, size: 64, offset: 1098688)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !1345, file: !652, line: 237, baseType: !599, size: 32, offset: 1098752)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !1345, file: !652, line: 238, baseType: !599, size: 32, offset: 1098784)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !1345, file: !652, line: 239, baseType: !1429, size: 64, offset: 1098816)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !320, line: 51, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !320, line: 150, size: 704, elements: !1432)
!1432 = !{!1433, !1435, !1436, !1437}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1431, file: !320, line: 151, baseType: !1434, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !1431, file: !320, line: 152, baseType: !611, size: 64, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !1431, file: !320, line: 153, baseType: !617, size: 64, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !1431, file: !320, line: 154, baseType: !1058, size: 512, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !1345, file: !652, line: 240, baseType: !599, size: 32, offset: 1098880)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !1345, file: !652, line: 242, baseType: !1440, size: 10240, offset: 1098912)
!1440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 10240, elements: !1441)
!1441 = !{!1442}
!1442 = !DISubrange(count: 1280)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !1345, file: !652, line: 243, baseType: !599, size: 32, offset: 1109152)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !1345, file: !652, line: 244, baseType: !599, size: 32, offset: 1109184)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !1345, file: !652, line: 245, baseType: !599, size: 32, offset: 1109216)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !1345, file: !652, line: 246, baseType: !599, size: 32, offset: 1109248)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !1345, file: !652, line: 247, baseType: !599, size: 32, offset: 1109280)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !1345, file: !652, line: 248, baseType: !821, size: 64, offset: 1109312)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !1345, file: !652, line: 249, baseType: !599, size: 32, offset: 1109376)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !1345, file: !652, line: 250, baseType: !1451, size: 64, offset: 1109440)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !652, line: 194, baseType: !1453)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !652, line: 196, size: 128, elements: !1454)
!1454 = !{!1455, !1456}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1453, file: !652, line: 197, baseType: !616, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1453, file: !652, line: 198, baseType: !1451, size: 64, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !1345, file: !652, line: 251, baseType: !861, size: 16384, offset: 1109504)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !1345, file: !652, line: 252, baseType: !545, size: 32, offset: 1125888)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !1345, file: !652, line: 253, baseType: !545, size: 32, offset: 1125920)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !1345, file: !652, line: 254, baseType: !599, size: 32, offset: 1125952)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_back", file: !650, line: 51, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_back", file: !827, line: 170, size: 3136, elements: !1464)
!1464 = !{!1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1491, !1492}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1463, file: !827, line: 171, baseType: !599, size: 32)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1463, file: !827, line: 173, baseType: !599, size: 32, offset: 32)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "ro", scope: !1463, file: !827, line: 174, baseType: !599, size: 32, offset: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "dat", scope: !1463, file: !827, line: 175, baseType: !666, size: 64, offset: 128)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "ndx", scope: !1463, file: !827, line: 175, baseType: !666, size: 64, offset: 192)
