; ModuleID = 'src/htsftp.c'
source_filename = "src/htsftp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hts_stat_struct = type { i64, i64, i64, i64, i64, i32, [2 x i64], [2 x i64], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i64 }
%struct.FTPDownloadStruct = type { ptr, ptr }
%struct.lien_back = type { [2048 x i8], [2048 x i8], [2048 x i8], [2048 x i8], [2048 x i8], [2048 x i8], ptr, [2048 x i8], [1024 x i8], i32, i32, i32, i32, i64, i32, i64, i64, i64, %struct.htsblk, i32, i32, i64, i64, i32, i32, ptr, i64, i64, i64, [256 x i8], i32, i32, i32 }
%struct.htsblk = type { i32, i16, i16, i16, i16, i16, i16, i16, i32, i32, ptr, ptr, ptr, i64, [80 x i8], [64 x i8], [64 x i8], [64 x i8], ptr, i64, i16, i32, %struct.SOCaddr, i32, ptr, i16, ptr, [64 x i8], [256 x i8], [256 x i8], i64, i64, i64, i32, %struct.htsrequest }
%struct.SOCaddr = type { %union.anon }
%union.anon = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon.0 }
%union.anon.0 = type { [4 x i32] }
%struct.htsrequest = type { i16, i16, i16, i16, i16, i16, ptr, ptr, ptr, ptr, ptr, ptr, %struct.htsrequest_proxy }
%struct.htsrequest_proxy = type { i32, ptr, i32, ptr }
%struct.sockaddr = type { i16, [14 x i8] }

!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384}
!376 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!377 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!378 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!379 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!380 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!381 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!382 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!383 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!384 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !386, line: 46, baseType: !374, size: 32, elements: !387)
!386 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!388 = !DIEnumerator(name: "_ISupper", value: 256)
!389 = !DIEnumerator(name: "_ISlower", value: 512)
!390 = !DIEnumerator(name: "_ISalpha", value: 1024)
!391 = !DIEnumerator(name: "_ISdigit", value: 2048)
!392 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!393 = !DIEnumerator(name: "_ISspace", value: 8192)
!394 = !DIEnumerator(name: "_ISprint", value: 16384)
!395 = !DIEnumerator(name: "_ISgraph", value: 32768)
!396 = !DIEnumerator(name: "_ISblank", value: 1)
!397 = !DIEnumerator(name: "_IScntrl", value: 2)
!398 = !DIEnumerator(name: "_ISpunct", value: 4)
!399 = !DIEnumerator(name: "_ISalnum", value: 8)
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HTTPStatusCode", file: !347, line: 90, baseType: !374, size: 32, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!402 = !DIEnumerator(name: "HTTP_CONTINUE", value: 100)
!403 = !DIEnumerator(name: "HTTP_SWITCHING_PROTOCOLS", value: 101)
!404 = !DIEnumerator(name: "HTTP_OK", value: 200)
!405 = !DIEnumerator(name: "HTTP_CREATED", value: 201)
!406 = !DIEnumerator(name: "HTTP_ACCEPTED", value: 202)
!407 = !DIEnumerator(name: "HTTP_NON_AUTHORITATIVE_INFORMATION", value: 203)
!408 = !DIEnumerator(name: "HTTP_NO_CONTENT", value: 204)
!409 = !DIEnumerator(name: "HTTP_RESET_CONTENT", value: 205)
!410 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!411 = !DIEnumerator(name: "HTTP_MULTIPLE_CHOICES", value: 300)
!412 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!413 = !DIEnumerator(name: "HTTP_FOUND", value: 302)
!414 = !DIEnumerator(name: "HTTP_SEE_OTHER", value: 303)
!415 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!416 = !DIEnumerator(name: "HTTP_USE_PROXY", value: 305)
!417 = !DIEnumerator(name: "HTTP_TEMPORARY_REDIRECT", value: 307)
!418 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!419 = !DIEnumerator(name: "HTTP_UNAUTHORIZED", value: 401)
!420 = !DIEnumerator(name: "HTTP_PAYMENT_REQUIRED", value: 402)
!421 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!422 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!423 = !DIEnumerator(name: "HTTP_METHOD_NOT_ALLOWED", value: 405)
!424 = !DIEnumerator(name: "HTTP_NOT_ACCEPTABLE", value: 406)
!425 = !DIEnumerator(name: "HTTP_PROXY_AUTHENTICATION_REQUIRED", value: 407)
!426 = !DIEnumerator(name: "HTTP_REQUEST_TIME_OUT", value: 408)
!427 = !DIEnumerator(name: "HTTP_CONFLICT", value: 409)
!428 = !DIEnumerator(name: "HTTP_GONE", value: 410)
!429 = !DIEnumerator(name: "HTTP_LENGTH_REQUIRED", value: 411)
!430 = !DIEnumerator(name: "HTTP_PRECONDITION_FAILED", value: 412)
!431 = !DIEnumerator(name: "HTTP_REQUEST_ENTITY_TOO_LARGE", value: 413)
!432 = !DIEnumerator(name: "HTTP_REQUEST_URI_TOO_LARGE", value: 414)
!433 = !DIEnumerator(name: "HTTP_UNSUPPORTED_MEDIA_TYPE", value: 415)
!434 = !DIEnumerator(name: "HTTP_REQUESTED_RANGE_NOT_SATISFIABLE", value: 416)
!435 = !DIEnumerator(name: "HTTP_EXPECTATION_FAILED", value: 417)
!436 = !DIEnumerator(name: "HTTP_INTERNAL_SERVER_ERROR", value: 500)
!437 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!438 = !DIEnumerator(name: "HTTP_BAD_GATEWAY", value: 502)
!439 = !DIEnumerator(name: "HTTP_SERVICE_UNAVAILABLE", value: 503)
!440 = !DIEnumerator(name: "HTTP_GATEWAY_TIME_OUT", value: 504)
!441 = !DIEnumerator(name: "HTTP_HTTP_VERSION_NOT_SUPPORTED", value: 505)
!442 = !{!443, !548, !348, !550, !567, !589, !531, !481, !1276, !602, !1277, !475}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTPDownloadStruct", file: !445, line: 53, baseType: !446)
!445 = !DIFile(filename: "./src/htsftp.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6637ebbc37af77092af7f737495271fb")
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FTPDownloadStruct", file: !445, line: 55, size: 128, elements: !447)
!447 = !{!448, !682}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pBack", scope: !446, file: !445, line: 56, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !445, line: 43, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !452, line: 557, size: 135040, elements: !453)
!452 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!453 = !{!454, !458, !459, !460, !461, !462, !463, !465, !466, !470, !471, !472, !473, !474, !478, !479, !480, !482, !483, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !451, file: !452, line: 561, baseType: !455, size: 16384)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 2048)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !451, file: !452, line: 562, baseType: !455, size: 16384, offset: 16384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !451, file: !452, line: 563, baseType: !455, size: 16384, offset: 32768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !451, file: !452, line: 564, baseType: !455, size: 16384, offset: 49152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !451, file: !452, line: 565, baseType: !455, size: 16384, offset: 65536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !451, file: !452, line: 566, baseType: !455, size: 16384, offset: 81920)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !451, file: !452, line: 567, baseType: !464, size: 64, offset: 98304)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !451, file: !452, line: 568, baseType: !455, size: 16384, offset: 98368)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !451, file: !452, line: 569, baseType: !467, size: 8192, offset: 114752)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !451, file: !452, line: 570, baseType: !348, size: 32, offset: 122944)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !451, file: !452, line: 571, baseType: !348, size: 32, offset: 122976)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !451, file: !452, line: 572, baseType: !348, size: 32, offset: 123008)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !451, file: !452, line: 573, baseType: !348, size: 32, offset: 123040)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !451, file: !452, line: 574, baseType: !475, size: 64, offset: 123072)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !476, line: 284, baseType: !477)
!476 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!477 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !451, file: !452, line: 575, baseType: !348, size: 32, offset: 123136)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !451, file: !452, line: 576, baseType: !475, size: 64, offset: 123200)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !451, file: !452, line: 577, baseType: !481, size: 64, offset: 123264)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !476, line: 283, baseType: !477)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !451, file: !452, line: 578, baseType: !481, size: 64, offset: 123328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !451, file: !452, line: 579, baseType: !484, size: 8960, offset: 123392)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !485, line: 47, baseType: !486)
!485 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !452, line: 486, size: 8960, elements: !487)
!487 = !{!488, !489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !555, !556, !560, !561, !562, !563, !564, !565, !566, !568, !624, !625, !626, !627, !632, !633, !637, !638, !639, !640, !641, !642}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !486, file: !452, line: 487, baseType: !348, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !486, file: !452, line: 488, baseType: !490, size: 16, offset: 32)
!490 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !486, file: !452, line: 489, baseType: !490, size: 16, offset: 48)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !486, file: !452, line: 490, baseType: !490, size: 16, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !486, file: !452, line: 491, baseType: !490, size: 16, offset: 80)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !486, file: !452, line: 492, baseType: !490, size: 16, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !486, file: !452, line: 493, baseType: !490, size: 16, offset: 112)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !486, file: !452, line: 494, baseType: !490, size: 16, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !486, file: !452, line: 495, baseType: !348, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !486, file: !452, line: 496, baseType: !348, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !486, file: !452, line: 497, baseType: !464, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !486, file: !452, line: 498, baseType: !464, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !486, file: !452, line: 499, baseType: !502, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !504, line: 7, baseType: !505)
!504 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !506, line: 49, size: 1728, elements: !507)
!506 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !523, !525, !526, !527, !530, !532, !534, !535, !538, !540, !543, !546, !547, !549, !553, !554}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !505, file: !506, line: 51, baseType: !348, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !505, file: !506, line: 54, baseType: !464, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !505, file: !506, line: 55, baseType: !464, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !505, file: !506, line: 56, baseType: !464, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !505, file: !506, line: 57, baseType: !464, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !505, file: !506, line: 58, baseType: !464, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !505, file: !506, line: 59, baseType: !464, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !505, file: !506, line: 60, baseType: !464, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !505, file: !506, line: 61, baseType: !464, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !505, file: !506, line: 64, baseType: !464, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !505, file: !506, line: 65, baseType: !464, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !505, file: !506, line: 66, baseType: !464, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !505, file: !506, line: 68, baseType: !521, size: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !506, line: 36, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !505, file: !506, line: 70, baseType: !524, size: 64, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !505, file: !506, line: 72, baseType: !348, size: 32, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !505, file: !506, line: 73, baseType: !348, size: 32, offset: 928)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !505, file: !506, line: 74, baseType: !528, size: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !529, line: 152, baseType: !477)
!529 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !505, file: !506, line: 77, baseType: !531, size: 16, offset: 1024)
!531 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !505, file: !506, line: 78, baseType: !533, size: 8, offset: 1040)
!533 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !505, file: !506, line: 79, baseType: !3, size: 8, offset: 1048)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !505, file: !506, line: 81, baseType: !536, size: 64, offset: 1088)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !506, line: 43, baseType: null)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !505, file: !506, line: 89, baseType: !539, size: 64, offset: 1152)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !529, line: 153, baseType: !477)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !505, file: !506, line: 91, baseType: !541, size: 64, offset: 1216)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !506, line: 37, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !505, file: !506, line: 92, baseType: !544, size: 64, offset: 1280)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !506, line: 38, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !505, file: !506, line: 93, baseType: !524, size: 64, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !505, file: !506, line: 94, baseType: !548, size: 64, offset: 1408)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !505, file: !506, line: 95, baseType: !550, size: 64, offset: 1472)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !551, line: 46, baseType: !552)
!551 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!552 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !505, file: !506, line: 96, baseType: !348, size: 32, offset: 1536)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !505, file: !506, line: 98, baseType: !173, size: 160, offset: 1568)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !452, line: 500, baseType: !481, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !486, file: !452, line: 501, baseType: !557, size: 640, offset: 512)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 80)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !486, file: !452, line: 502, baseType: !266, size: 512, offset: 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !486, file: !452, line: 503, baseType: !266, size: 512, offset: 1664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !486, file: !452, line: 504, baseType: !266, size: 512, offset: 2176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !486, file: !452, line: 505, baseType: !464, size: 64, offset: 2688)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !486, file: !452, line: 506, baseType: !481, size: 64, offset: 2752)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !486, file: !452, line: 507, baseType: !490, size: 16, offset: 2816)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !486, file: !452, line: 508, baseType: !567, size: 32, offset: 2848)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !476, line: 323, baseType: !348)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !486, file: !452, line: 509, baseType: !569, size: 224, offset: 2880)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !326, line: 91, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !326, line: 93, size: 224, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !570, file: !326, line: 103, baseType: !573, size: 224)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !570, file: !326, line: 94, size: 224, elements: !574)
!574 = !{!575, !583, !603}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !573, file: !326, line: 96, baseType: !576, size: 128)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !577, line: 180, size: 128, elements: !578)
!577 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!578 = !{!579, !582}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !576, file: !577, line: 182, baseType: !580, size: 16)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !581, line: 28, baseType: !531)
!581 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !576, file: !577, line: 183, baseType: !46, size: 112, offset: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !573, file: !326, line: 98, baseType: !584, size: 128)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !585, line: 245, size: 128, elements: !586)
!585 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!586 = !{!587, !588, !593, !600}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !584, file: !585, line: 247, baseType: !580, size: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !584, file: !585, line: 248, baseType: !589, size: 16, offset: 16)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !585, line: 123, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !591, line: 25, baseType: !592)
!591 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !529, line: 40, baseType: !531)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !584, file: !585, line: 249, baseType: !594, size: 32, offset: 32)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !585, line: 31, size: 32, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !594, file: !585, line: 33, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !585, line: 30, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !591, line: 26, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !529, line: 42, baseType: !374)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !584, file: !585, line: 252, baseType: !601, size: 64, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !30)
!602 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !573, file: !326, line: 101, baseType: !604, size: 224)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !585, line: 260, size: 224, elements: !605)
!605 = !{!606, !607, !608, !609, !623}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !604, file: !585, line: 262, baseType: !580, size: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !604, file: !585, line: 263, baseType: !589, size: 16, offset: 16)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !604, file: !585, line: 264, baseType: !598, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !604, file: !585, line: 265, baseType: !610, size: 128, offset: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !585, line: 219, size: 128, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !610, file: !585, line: 226, baseType: !613, size: 128)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !585, line: 221, size: 128, elements: !614)
!614 = !{!615, !619, !621}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !613, file: !585, line: 223, baseType: !616, size: 128)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 128, elements: !297)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !591, line: 24, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !529, line: 38, baseType: !602)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !613, file: !585, line: 224, baseType: !620, size: 128)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 128, elements: !30)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !613, file: !585, line: 225, baseType: !622, size: 128)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 128, elements: !187)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !604, file: !585, line: 266, baseType: !598, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !486, file: !452, line: 510, baseType: !348, size: 32, offset: 3104)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !486, file: !452, line: 511, baseType: !502, size: 64, offset: 3136)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !486, file: !452, line: 513, baseType: !490, size: 16, offset: 3200)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !486, file: !452, line: 515, baseType: !628, size: 64, offset: 3264)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !630, line: 184, baseType: !631)
!630 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !630, line: 184, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !486, file: !452, line: 517, baseType: !266, size: 512, offset: 3328)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !486, file: !452, line: 518, baseType: !634, size: 2048, offset: 3840)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !486, file: !452, line: 519, baseType: !634, size: 2048, offset: 5888)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !486, file: !452, line: 520, baseType: !481, size: 64, offset: 7936)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !486, file: !452, line: 521, baseType: !481, size: 64, offset: 8000)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !486, file: !452, line: 522, baseType: !481, size: 64, offset: 8064)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !486, file: !452, line: 523, baseType: !348, size: 32, offset: 8128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !486, file: !452, line: 525, baseType: !643, size: 768, offset: 8192)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !485, line: 43, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !452, line: 465, size: 768, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !655, !656, !657, !658, !659, !660}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !644, file: !452, line: 466, baseType: !490, size: 16)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !644, file: !452, line: 467, baseType: !490, size: 16, offset: 16)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !644, file: !452, line: 468, baseType: !490, size: 16, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !644, file: !452, line: 469, baseType: !490, size: 16, offset: 48)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !644, file: !452, line: 470, baseType: !490, size: 16, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !644, file: !452, line: 471, baseType: !490, size: 16, offset: 80)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !644, file: !452, line: 472, baseType: !653, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !644, file: !452, line: 473, baseType: !653, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !644, file: !452, line: 474, baseType: !653, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !644, file: !452, line: 475, baseType: !653, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !644, file: !452, line: 476, baseType: !653, size: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !644, file: !452, line: 477, baseType: !653, size: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !644, file: !452, line: 478, baseType: !661, size: 256, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !452, line: 452, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !452, line: 454, size: 256, elements: !663)
!663 = !{!664, !665, !666, !667}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !662, file: !452, line: 455, baseType: !348, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !452, line: 456, baseType: !653, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !662, file: !452, line: 457, baseType: !348, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !662, file: !452, line: 458, baseType: !653, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !451, file: !452, line: 580, baseType: !348, size: 32, offset: 132352)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !451, file: !452, line: 581, baseType: !348, size: 32, offset: 132384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !451, file: !452, line: 582, baseType: !481, size: 64, offset: 132416)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !451, file: !452, line: 583, baseType: !475, size: 64, offset: 132480)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !451, file: !452, line: 585, baseType: !348, size: 32, offset: 132544)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !451, file: !452, line: 586, baseType: !348, size: 32, offset: 132576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !451, file: !452, line: 587, baseType: !464, size: 64, offset: 132608)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !451, file: !452, line: 588, baseType: !481, size: 64, offset: 132672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !451, file: !452, line: 589, baseType: !481, size: 64, offset: 132736)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !451, file: !452, line: 590, baseType: !481, size: 64, offset: 132800)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !451, file: !452, line: 594, baseType: !634, size: 2048, offset: 132864)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !451, file: !452, line: 595, baseType: !348, size: 32, offset: 134912)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !451, file: !452, line: 596, baseType: !348, size: 32, offset: 134944)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !451, file: !452, line: 597, baseType: !348, size: 32, offset: 134976)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pOpt", scope: !446, file: !445, line: 57, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !445, line: 47, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !452, line: 294, size: 1133184, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !715, !716, !717, !718, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !806, !848, !851, !852, !856, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !1146, !1158}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !685, file: !452, line: 295, baseType: !550, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !685, file: !452, line: 297, baseType: !348, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !685, file: !452, line: 298, baseType: !348, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !685, file: !452, line: 299, baseType: !348, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !685, file: !452, line: 300, baseType: !348, size: 32, offset: 160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !685, file: !452, line: 301, baseType: !348, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !685, file: !452, line: 302, baseType: !348, size: 32, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !685, file: !452, line: 303, baseType: !348, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !685, file: !452, line: 304, baseType: !348, size: 32, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !685, file: !452, line: 305, baseType: !348, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !685, file: !452, line: 306, baseType: !348, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !685, file: !452, line: 307, baseType: !502, size: 64, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !685, file: !452, line: 308, baseType: !502, size: 64, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !685, file: !452, line: 309, baseType: !481, size: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !685, file: !452, line: 310, baseType: !481, size: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !685, file: !452, line: 311, baseType: !481, size: 64, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !685, file: !452, line: 312, baseType: !348, size: 32, offset: 704)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !685, file: !452, line: 313, baseType: !481, size: 64, offset: 768)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !685, file: !452, line: 314, baseType: !348, size: 32, offset: 832)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !685, file: !452, line: 315, baseType: !348, size: 32, offset: 864)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !685, file: !452, line: 316, baseType: !348, size: 32, offset: 896)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !685, file: !452, line: 317, baseType: !348, size: 32, offset: 928)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !685, file: !452, line: 318, baseType: !348, size: 32, offset: 960)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !685, file: !452, line: 319, baseType: !348, size: 32, offset: 992)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !685, file: !452, line: 320, baseType: !348, size: 32, offset: 1024)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !685, file: !452, line: 321, baseType: !348, size: 32, offset: 1056)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !685, file: !452, line: 322, baseType: !714, size: 32, offset: 1088)
!714 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !685, file: !452, line: 323, baseType: !348, size: 32, offset: 1120)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !685, file: !452, line: 324, baseType: !348, size: 32, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !685, file: !452, line: 326, baseType: !348, size: 32, offset: 1184)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !685, file: !452, line: 327, baseType: !719, size: 512, offset: 1216)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !452, line: 89, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !452, line: 91, size: 512, elements: !721)
!721 = !{!722, !723, !731, !732}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !720, file: !452, line: 92, baseType: !348, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !452, line: 93, baseType: !724, size: 192, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !725, line: 57, baseType: !726)
!725 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !725, line: 61, size: 192, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !726, file: !725, line: 62, baseType: !464, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !726, file: !725, line: 63, baseType: !550, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !726, file: !725, line: 64, baseType: !550, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !720, file: !452, line: 94, baseType: !348, size: 32, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !720, file: !452, line: 95, baseType: !724, size: 192, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !685, file: !452, line: 328, baseType: !348, size: 32, offset: 1728)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !685, file: !452, line: 329, baseType: !348, size: 32, offset: 1760)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !685, file: !452, line: 330, baseType: !724, size: 192, offset: 1792)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !685, file: !452, line: 331, baseType: !348, size: 32, offset: 1984)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !685, file: !452, line: 332, baseType: !348, size: 32, offset: 2016)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !685, file: !452, line: 333, baseType: !348, size: 32, offset: 2048)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !685, file: !452, line: 334, baseType: !348, size: 32, offset: 2080)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !685, file: !452, line: 335, baseType: !724, size: 192, offset: 2112)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !685, file: !452, line: 336, baseType: !724, size: 192, offset: 2304)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !685, file: !452, line: 337, baseType: !724, size: 192, offset: 2496)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !685, file: !452, line: 338, baseType: !724, size: 192, offset: 2688)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !685, file: !452, line: 339, baseType: !724, size: 192, offset: 2880)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !685, file: !452, line: 340, baseType: !724, size: 192, offset: 3072)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !685, file: !452, line: 341, baseType: !724, size: 192, offset: 3264)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !685, file: !452, line: 342, baseType: !348, size: 32, offset: 3456)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !685, file: !452, line: 343, baseType: !348, size: 32, offset: 3488)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !685, file: !452, line: 344, baseType: !348, size: 32, offset: 3520)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !685, file: !452, line: 345, baseType: !348, size: 32, offset: 3552)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !685, file: !452, line: 346, baseType: !348, size: 32, offset: 3584)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !685, file: !452, line: 347, baseType: !348, size: 32, offset: 3616)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !685, file: !452, line: 348, baseType: !348, size: 32, offset: 3648)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !685, file: !452, line: 349, baseType: !348, size: 32, offset: 3680)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !685, file: !452, line: 350, baseType: !348, size: 32, offset: 3712)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !685, file: !452, line: 351, baseType: !348, size: 32, offset: 3744)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !685, file: !452, line: 352, baseType: !348, size: 32, offset: 3776)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !685, file: !452, line: 353, baseType: !348, size: 32, offset: 3808)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !685, file: !452, line: 354, baseType: !348, size: 32, offset: 3840)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !685, file: !452, line: 355, baseType: !724, size: 192, offset: 3904)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !685, file: !452, line: 356, baseType: !348, size: 32, offset: 4096)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !685, file: !452, line: 357, baseType: !348, size: 32, offset: 4128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !685, file: !452, line: 358, baseType: !764, size: 64, offset: 4160)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !766, line: 53, baseType: !767)
!766 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !766, line: 55, size: 278656, elements: !768)
!768 = !{!769, !770, !774}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !767, file: !766, line: 56, baseType: !348, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !766, line: 57, baseType: !771, size: 262144, offset: 32)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 32768)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !767, file: !766, line: 58, baseType: !775, size: 16448, offset: 262208)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !766, line: 42, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !766, line: 44, size: 16448, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !776, file: !766, line: 45, baseType: !467, size: 8192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !776, file: !766, line: 46, baseType: !467, size: 8192, offset: 8192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !766, line: 47, baseType: !781, size: 64, offset: 16384)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !685, file: !452, line: 359, baseType: !348, size: 32, offset: 4224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !685, file: !452, line: 360, baseType: !348, size: 32, offset: 4256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !685, file: !452, line: 361, baseType: !348, size: 32, offset: 4288)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !685, file: !452, line: 362, baseType: !348, size: 32, offset: 4320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !685, file: !452, line: 363, baseType: !348, size: 32, offset: 4352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !685, file: !452, line: 364, baseType: !348, size: 32, offset: 4384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !685, file: !452, line: 365, baseType: !348, size: 32, offset: 4416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !685, file: !452, line: 366, baseType: !348, size: 32, offset: 4448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !685, file: !452, line: 367, baseType: !348, size: 32, offset: 4480)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !685, file: !452, line: 368, baseType: !348, size: 32, offset: 4512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !685, file: !452, line: 369, baseType: !724, size: 192, offset: 4544)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !685, file: !452, line: 370, baseType: !348, size: 32, offset: 4736)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !685, file: !452, line: 372, baseType: !348, size: 32, offset: 4768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !685, file: !452, line: 373, baseType: !724, size: 192, offset: 4800)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !685, file: !452, line: 374, baseType: !724, size: 192, offset: 4992)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !685, file: !452, line: 375, baseType: !798, size: 128, offset: 5184)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !452, line: 101, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !452, line: 103, size: 128, elements: !800)
!800 = !{!801, !804}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !799, file: !452, line: 104, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !799, file: !452, line: 105, baseType: !805, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !685, file: !452, line: 376, baseType: !807, size: 64, offset: 5312)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !809, line: 73, baseType: !810)
!809 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !809, line: 202, size: 98624, elements: !811)
!811 = !{!812, !835, !839, !840, !841, !842, !843, !844}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !810, file: !809, line: 204, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !809, line: 57, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !452, line: 534, size: 640, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !820, file: !452, line: 535, baseType: !464, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !820, file: !452, line: 536, baseType: !464, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !820, file: !452, line: 537, baseType: !464, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !820, file: !452, line: 538, baseType: !464, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !820, file: !452, line: 539, baseType: !464, size: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !820, file: !452, line: 540, baseType: !464, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !820, file: !452, line: 542, baseType: !348, size: 32, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !820, file: !452, line: 543, baseType: !348, size: 32, offset: 416)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !820, file: !452, line: 544, baseType: !348, size: 32, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !820, file: !452, line: 545, baseType: !348, size: 32, offset: 480)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !820, file: !452, line: 546, baseType: !4, size: 8, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !820, file: !452, line: 548, baseType: !348, size: 32, offset: 544)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !820, file: !452, line: 549, baseType: !348, size: 32, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !810, file: !809, line: 206, baseType: !836, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !452, line: 210, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !452, line: 210, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !810, file: !809, line: 208, baseType: !836, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !810, file: !809, line: 210, baseType: !836, size: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !810, file: !809, line: 212, baseType: !348, size: 32, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !810, file: !809, line: 213, baseType: !455, size: 16384, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !810, file: !809, line: 214, baseType: !455, size: 16384, offset: 16672)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !810, file: !809, line: 215, baseType: !845, size: 65536, offset: 33056)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 8192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !685, file: !452, line: 377, baseType: !849, size: 64, offset: 5376)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !685, file: !452, line: 378, baseType: !348, size: 32, offset: 5440)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !685, file: !452, line: 379, baseType: !853, size: 64, offset: 5504)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !452, line: 286, baseType: !855)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !452, line: 286, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !685, file: !452, line: 380, baseType: !857, size: 64, offset: 5568)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !452, line: 61, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !860, line: 42, size: 33856, elements: !861)
!860 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!861 = !{!862, !866, !870}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !859, file: !860, line: 43, baseType: !863, size: 1024)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !859, file: !860, line: 44, baseType: !867, size: 32768, offset: 1024)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 4096)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !859, file: !860, line: 45, baseType: !871, size: 64, offset: 33792)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !685, file: !452, line: 381, baseType: !724, size: 192, offset: 5632)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !685, file: !452, line: 382, baseType: !724, size: 192, offset: 5824)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !685, file: !452, line: 383, baseType: !724, size: 192, offset: 6016)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !685, file: !452, line: 384, baseType: !724, size: 192, offset: 6208)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !685, file: !452, line: 385, baseType: !724, size: 192, offset: 6400)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !685, file: !452, line: 386, baseType: !348, size: 32, offset: 6592)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !685, file: !452, line: 388, baseType: !348, size: 32, offset: 6624)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !685, file: !452, line: 389, baseType: !348, size: 32, offset: 6656)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !685, file: !452, line: 391, baseType: !653, size: 64, offset: 6720)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !685, file: !452, line: 393, baseType: !348, size: 32, offset: 6784)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !685, file: !452, line: 394, baseType: !348, size: 32, offset: 6816)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !685, file: !452, line: 395, baseType: !348, size: 32, offset: 6848)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !685, file: !452, line: 396, baseType: !348, size: 32, offset: 6880)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !685, file: !452, line: 398, baseType: !348, size: 32, offset: 6912)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !685, file: !452, line: 399, baseType: !348, size: 32, offset: 6944)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !685, file: !452, line: 402, baseType: !888, size: 64, offset: 6976)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !890, line: 164, baseType: !891)
!890 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !890, line: 191, size: 3328, elements: !892)
!892 = !{!893, !912, !918, !927, !933, !939, !949, !955, !964, !973, !979, !985, !1028, !1037, !1046, !1055, !1061, !1070, !1079, !1088, !1097, !1106, !1116, !1122, !1134, !1140}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !891, file: !890, line: 193, baseType: !894, size: 128)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !890, line: 193, size: 128, elements: !895)
!895 = !{!896, !911}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !894, file: !890, line: 193, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !890, line: 83, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !890, line: 60, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !890, line: 179, size: 192, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !903, file: !890, line: 181, baseType: !548, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !903, file: !890, line: 187, baseType: !907, size: 128, offset: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !890, line: 184, size: 128, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !907, file: !890, line: 185, baseType: !548, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !907, file: !890, line: 186, baseType: !901, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !894, file: !890, line: 193, baseType: !901, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !891, file: !890, line: 194, baseType: !913, size: 128, offset: 128)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !890, line: 194, size: 128, elements: !914)
!914 = !{!915, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !913, file: !890, line: 194, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !890, line: 84, baseType: !898)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !913, file: !890, line: 194, baseType: !901, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !891, file: !890, line: 195, baseType: !919, size: 128, offset: 256)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !890, line: 195, size: 128, elements: !920)
!920 = !{!921, !926}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !919, file: !890, line: 195, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !890, line: 85, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!348, !901, !683}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !919, file: !890, line: 195, baseType: !901, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !891, file: !890, line: 196, baseType: !928, size: 128, offset: 384)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !890, line: 196, size: 128, elements: !929)
!929 = !{!930, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !928, file: !890, line: 196, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !890, line: 86, baseType: !923)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !928, file: !890, line: 196, baseType: !901, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !891, file: !890, line: 197, baseType: !934, size: 128, offset: 512)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !890, line: 197, size: 128, elements: !935)
!935 = !{!936, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !934, file: !890, line: 197, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !890, line: 87, baseType: !923)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !934, file: !890, line: 197, baseType: !901, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !891, file: !890, line: 198, baseType: !940, size: 128, offset: 640)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !890, line: 198, size: 128, elements: !941)
!941 = !{!942, !948}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !940, file: !890, line: 198, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !890, line: 92, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !890, line: 88, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!348, !901, !683, !803, !805, !653, !653}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !940, file: !890, line: 198, baseType: !901, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !891, file: !890, line: 199, baseType: !950, size: 128, offset: 768)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !890, line: 199, size: 128, elements: !951)
!951 = !{!952, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !950, file: !890, line: 199, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !890, line: 93, baseType: !944)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !950, file: !890, line: 199, baseType: !901, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !891, file: !890, line: 200, baseType: !956, size: 128, offset: 896)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !890, line: 200, size: 128, elements: !957)
!957 = !{!958, !963}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !956, file: !890, line: 200, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !890, line: 94, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!348, !901, !683, !464, !348, !653, !653}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !956, file: !890, line: 200, baseType: !901, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !891, file: !890, line: 201, baseType: !965, size: 128, offset: 1024)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !890, line: 201, size: 128, elements: !966)
!966 = !{!967, !972}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !965, file: !890, line: 201, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !890, line: 98, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!653, !901, !683, !653}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !965, file: !890, line: 201, baseType: !901, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !891, file: !890, line: 202, baseType: !974, size: 128, offset: 1152)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !890, line: 202, size: 128, elements: !975)
!975 = !{!976, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !974, file: !890, line: 202, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !890, line: 101, baseType: !969)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !974, file: !890, line: 202, baseType: !901, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !891, file: !890, line: 203, baseType: !980, size: 128, offset: 1280)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !890, line: 203, size: 128, elements: !981)
!981 = !{!982, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !980, file: !890, line: 203, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !890, line: 104, baseType: !969)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !980, file: !890, line: 203, baseType: !901, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !891, file: !890, line: 204, baseType: !986, size: 128, offset: 1408)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !890, line: 204, size: 128, elements: !987)
!987 = !{!988, !1027}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !986, file: !890, line: 204, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !890, line: 107, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!348, !901, !683, !449, !348, !348, !348, !348, !348, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !995, line: 70, baseType: !996)
!995 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !452, line: 414, size: 1344, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1008, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !996, file: !452, line: 415, baseType: !481, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !996, file: !452, line: 416, baseType: !481, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !996, file: !452, line: 418, baseType: !475, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !996, file: !452, line: 420, baseType: !481, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !996, file: !452, line: 421, baseType: !481, size: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !996, file: !452, line: 422, baseType: !348, size: 32, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !996, file: !452, line: 424, baseType: !1005, size: 128, offset: 384)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 128, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 2)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !996, file: !452, line: 425, baseType: !1009, size: 128, offset: 512)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 128, elements: !1006)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !996, file: !452, line: 426, baseType: !475, size: 64, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !996, file: !452, line: 427, baseType: !348, size: 32, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !996, file: !452, line: 429, baseType: !348, size: 32, offset: 736)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !996, file: !452, line: 430, baseType: !348, size: 32, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !996, file: !452, line: 431, baseType: !348, size: 32, offset: 800)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !996, file: !452, line: 433, baseType: !348, size: 32, offset: 832)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !996, file: !452, line: 434, baseType: !348, size: 32, offset: 864)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !996, file: !452, line: 435, baseType: !348, size: 32, offset: 896)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !996, file: !452, line: 436, baseType: !348, size: 32, offset: 928)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !996, file: !452, line: 437, baseType: !348, size: 32, offset: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !996, file: !452, line: 438, baseType: !348, size: 32, offset: 992)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !996, file: !452, line: 439, baseType: !348, size: 32, offset: 1024)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !996, file: !452, line: 440, baseType: !348, size: 32, offset: 1056)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !996, file: !452, line: 441, baseType: !481, size: 64, offset: 1088)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !996, file: !452, line: 443, baseType: !481, size: 64, offset: 1152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !996, file: !452, line: 445, baseType: !475, size: 64, offset: 1216)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !996, file: !452, line: 446, baseType: !475, size: 64, offset: 1280)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !986, file: !890, line: 204, baseType: !901, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !891, file: !890, line: 205, baseType: !1029, size: 128, offset: 1536)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !890, line: 205, size: 128, elements: !1030)
!1030 = !{!1031, !1036}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1029, file: !890, line: 205, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !890, line: 112, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!348, !901, !683, !653, !653, !348}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1029, file: !890, line: 205, baseType: !901, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !891, file: !890, line: 206, baseType: !1038, size: 128, offset: 1664)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !890, line: 206, size: 128, elements: !1039)
!1039 = !{!1040, !1045}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1038, file: !890, line: 206, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !890, line: 115, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!348, !901, !683, !653, !653, !653, !348}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1038, file: !890, line: 206, baseType: !901, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !891, file: !890, line: 207, baseType: !1047, size: 128, offset: 1792)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !890, line: 207, size: 128, elements: !1048)
!1048 = !{!1049, !1054}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1047, file: !890, line: 207, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !890, line: 119, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !901, !683, !653}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1047, file: !890, line: 207, baseType: !901, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !891, file: !890, line: 208, baseType: !1056, size: 128, offset: 1920)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !890, line: 208, size: 128, elements: !1057)
!1057 = !{!1058, !1060}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1056, file: !890, line: 208, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !890, line: 121, baseType: !1051)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1056, file: !890, line: 208, baseType: !901, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !891, file: !890, line: 209, baseType: !1062, size: 128, offset: 2048)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !890, line: 209, size: 128, elements: !1063)
!1063 = !{!1064, !1069}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1062, file: !890, line: 209, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !890, line: 123, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !901, !683, !653, !653, !653, !348, !348, !348}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1062, file: !890, line: 209, baseType: !901, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !891, file: !890, line: 210, baseType: !1071, size: 128, offset: 2176)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !890, line: 210, size: 128, elements: !1072)
!1072 = !{!1073, !1078}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1071, file: !890, line: 210, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !890, line: 128, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!348, !901, !683, !464}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1071, file: !890, line: 210, baseType: !901, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !891, file: !890, line: 211, baseType: !1080, size: 128, offset: 2304)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !890, line: 211, size: 128, elements: !1081)
!1081 = !{!1082, !1087}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1080, file: !890, line: 211, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !890, line: 130, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!348, !901, !683, !464, !653}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1080, file: !890, line: 211, baseType: !901, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !891, file: !890, line: 212, baseType: !1089, size: 128, offset: 2432)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !890, line: 212, size: 128, elements: !1090)
!1090 = !{!1091, !1096}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1089, file: !890, line: 212, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !890, line: 133, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!348, !901, !683, !449}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1089, file: !890, line: 212, baseType: !901, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !891, file: !890, line: 213, baseType: !1098, size: 128, offset: 2560)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !890, line: 213, size: 128, elements: !1099)
!1099 = !{!1100, !1105}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1098, file: !890, line: 213, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !890, line: 135, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!348, !901, !683, !653, !653, !653, !653, !464}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1098, file: !890, line: 213, baseType: !901, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !891, file: !890, line: 214, baseType: !1107, size: 128, offset: 2688)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !890, line: 214, size: 128, elements: !1108)
!1108 = !{!1109, !1115}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1107, file: !890, line: 214, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !890, line: 142, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!348, !901, !683, !464, !653, !653, !653, !653, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1107, file: !890, line: 214, baseType: !901, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !891, file: !890, line: 215, baseType: !1117, size: 128, offset: 2816)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !890, line: 215, size: 128, elements: !1118)
!1118 = !{!1119, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1117, file: !890, line: 215, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !890, line: 148, baseType: !1111)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1117, file: !890, line: 215, baseType: !901, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !891, file: !890, line: 216, baseType: !1123, size: 128, offset: 2944)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !890, line: 216, size: 128, elements: !1124)
!1124 = !{!1125, !1133}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1123, file: !890, line: 216, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !890, line: 156, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!348, !901, !683, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !890, line: 56, baseType: !1132)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !890, line: 56, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1123, file: !890, line: 216, baseType: !901, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !891, file: !890, line: 217, baseType: !1135, size: 128, offset: 3072)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !890, line: 217, size: 128, elements: !1136)
!1136 = !{!1137, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1135, file: !890, line: 217, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !890, line: 158, baseType: !1127)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1135, file: !890, line: 217, baseType: !901, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !891, file: !890, line: 219, baseType: !1141, size: 128, offset: 3200)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !890, line: 219, size: 128, elements: !1142)
!1142 = !{!1143, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1141, file: !890, line: 219, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !890, line: 141, baseType: !1101)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1141, file: !890, line: 219, baseType: !901, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !685, file: !452, line: 404, baseType: !1147, size: 128, offset: 7040)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !452, line: 260, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !452, line: 270, size: 128, elements: !1149)
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1148, file: !452, line: 271, baseType: !348, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1148, file: !452, line: 272, baseType: !1152, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !452, line: 264, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !452, line: 266, size: 128, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !1154, file: !452, line: 267, baseType: !464, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1154, file: !452, line: 268, baseType: !548, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !685, file: !452, line: 406, baseType: !1159, size: 1126016, offset: 7168)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !452, line: 216, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !452, line: 218, size: 1126016, elements: !1161)
!1161 = !{!1162, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1207, !1219, !1227, !1233, !1240, !1241, !1242, !1243, !1253, !1254, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1272, !1273, !1274, !1275}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1160, file: !452, line: 219, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !1164, line: 50, baseType: !1165)
!1164 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !1164, line: 59, size: 320, elements: !1167)
!1167 = !{!1168}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1166, file: !1164, line: 60, baseType: !1169, size: 320)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1170, line: 72, baseType: !1171)
!1170 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!1171 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1170, line: 67, size: 320, elements: !1172)
!1172 = !{!1173, !1192, !1193}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1171, file: !1170, line: 69, baseType: !1174, size: 320)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1175, line: 22, size: 320, elements: !1176)
!1175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1174, file: !1175, line: 24, baseType: !348, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1174, file: !1175, line: 25, baseType: !374, size: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1174, file: !1175, line: 26, baseType: !348, size: 32, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1174, file: !1175, line: 28, baseType: !374, size: 32, offset: 96)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1174, file: !1175, line: 32, baseType: !348, size: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1174, file: !1175, line: 34, baseType: !490, size: 16, offset: 160)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1174, file: !1175, line: 35, baseType: !490, size: 16, offset: 176)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1174, file: !1175, line: 36, baseType: !1185, size: 128, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1186, line: 55, baseType: !1187)
!1186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1186, line: 51, size: 128, elements: !1188)
!1188 = !{!1189, !1191}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1187, file: !1186, line: 53, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1187, file: !1186, line: 54, baseType: !1190, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1171, file: !1170, line: 70, baseType: !333, size: 320)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1171, file: !1170, line: 71, baseType: !477, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1160, file: !452, line: 221, baseType: !348, size: 32, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !1160, file: !452, line: 222, baseType: !348, size: 32, offset: 96)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !1160, file: !452, line: 223, baseType: !348, size: 32, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !1160, file: !452, line: 225, baseType: !348, size: 32, offset: 160)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !1160, file: !452, line: 226, baseType: !724, size: 192, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !1160, file: !452, line: 227, baseType: !502, size: 64, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !1160, file: !452, line: 228, baseType: !348, size: 32, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !1160, file: !452, line: 230, baseType: !1202, size: 32832, offset: 512)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !452, line: 121, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !452, line: 123, size: 32832, elements: !1204)
!1204 = !{!1205, !1206}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !1203, file: !452, line: 124, baseType: !502, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1203, file: !452, line: 125, baseType: !867, size: 32768, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1160, file: !452, line: 232, baseType: !1208, size: 192, offset: 33344)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !452, line: 111, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !452, line: 112, size: 192, elements: !1210)
!1210 = !{!1211, !1212, !1217}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !1209, file: !452, line: 113, baseType: !548, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !1209, file: !452, line: 114, baseType: !1213, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !452, line: 110, baseType: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!348}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1209, file: !452, line: 115, baseType: !1218, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !1160, file: !452, line: 233, baseType: !1220, size: 1048608, offset: 33536)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !452, line: 131, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !452, line: 133, size: 1048608, elements: !1222)
!1222 = !{!1223, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1221, file: !452, line: 134, baseType: !348, size: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1221, file: !452, line: 135, baseType: !1225, size: 1048576, offset: 32)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !1226)
!1226 = !{!298, !847}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !1160, file: !452, line: 234, baseType: !1228, size: 16416, offset: 1082144)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !452, line: 153, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !452, line: 155, size: 16416, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !1229, file: !452, line: 156, baseType: !348, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !1229, file: !452, line: 157, baseType: !455, size: 16384, offset: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !1160, file: !452, line: 235, baseType: !1234, size: 96, offset: 1098560)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !452, line: 163, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !452, line: 165, size: 96, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1235, file: !452, line: 166, baseType: !348, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !1235, file: !452, line: 167, baseType: !348, size: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1235, file: !452, line: 168, baseType: !348, size: 32, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !1160, file: !452, line: 236, baseType: !464, size: 64, offset: 1098688)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !1160, file: !452, line: 237, baseType: !348, size: 32, offset: 1098752)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !1160, file: !452, line: 238, baseType: !348, size: 32, offset: 1098784)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !1160, file: !452, line: 239, baseType: !1244, size: 64, offset: 1098816)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !485, line: 51, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !485, line: 150, size: 704, elements: !1247)
!1247 = !{!1248, !1250, !1251, !1252}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1246, file: !485, line: 151, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !1246, file: !485, line: 152, baseType: !653, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !1246, file: !485, line: 153, baseType: !550, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !1246, file: !485, line: 154, baseType: !266, size: 512, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !1160, file: !452, line: 240, baseType: !348, size: 32, offset: 1098880)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !1160, file: !452, line: 242, baseType: !1255, size: 10240, offset: 1098912)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 10240, elements: !1256)
!1256 = !{!1257}
!1257 = !DISubrange(count: 1280)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !1160, file: !452, line: 243, baseType: !348, size: 32, offset: 1109152)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !1160, file: !452, line: 244, baseType: !348, size: 32, offset: 1109184)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !1160, file: !452, line: 245, baseType: !348, size: 32, offset: 1109216)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !1160, file: !452, line: 246, baseType: !348, size: 32, offset: 1109248)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !1160, file: !452, line: 247, baseType: !348, size: 32, offset: 1109280)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !1160, file: !452, line: 248, baseType: !803, size: 64, offset: 1109312)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !1160, file: !452, line: 249, baseType: !348, size: 32, offset: 1109376)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !1160, file: !452, line: 250, baseType: !1266, size: 64, offset: 1109440)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !452, line: 194, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !452, line: 196, size: 128, elements: !1269)
!1269 = !{!1270, !1271}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1268, file: !452, line: 197, baseType: !464, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1268, file: !452, line: 198, baseType: !1266, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !1160, file: !452, line: 251, baseType: !455, size: 16384, offset: 1109504)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !1160, file: !452, line: 252, baseType: !374, size: 32, offset: 1125888)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !1160, file: !452, line: 253, baseType: !374, size: 32, offset: 1125920)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !1160, file: !452, line: 254, baseType: !348, size: 32, offset: 1125952)
