; ModuleID = 'src/htshelp.c'
source_filename = "src/htshelp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.help_wizard_buffers = type { [2048 x i8], [256 x i8], [256 x i8], [2048 x i8], [2048 x i8], [2048 x i8], [4096 x i8], [256 x i8], [256 x ptr] }

@__const.infomsg.cmd = private unnamed_addr constant [32 x i8] c"-\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 16
@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"param\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [15 x i8] c"%s (--%s[=N])\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"param1\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [19 x i8] c"%s (--%s <param>)\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [7 x i8] c"param0\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [18 x i8] c"%s (--%s<param>)\0A\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [11 x i8] c"%s (--%s)\0A\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1, !dbg !39
@.str.9 = private unnamed_addr constant [19 x i8] c"\0AMORE.. q to quit\0A\00", align 1, !dbg !44
@stdin = external global ptr, align 8

!1052 = !DILocation(line: 90, column: 19, scope: !1014)
!1053 = !DILocation(line: 90, column: 17, scope: !1014)
!1054 = !DILocation(line: 91, column: 19, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1014, file: !2, line: 91, column: 19)
!1056 = !DILocation(line: 91, column: 21, scope: !1055)
!1057 = !DILocation(line: 91, column: 19, scope: !1014)
!1058 = !DILocation(line: 93, column: 42, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 93, column: 21)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 91, column: 27)
!1061 = !DILocation(line: 93, column: 28, scope: !1059)
!1062 = !DILocation(line: 93, column: 21, scope: !1059)
!1063 = !DILocation(line: 93, column: 55, scope: !1059)
!1064 = !DILocation(line: 93, column: 21, scope: !1060)
!1065 = !DILocation(line: 94, column: 45, scope: !1059)
!1066 = !DILocation(line: 94, column: 65, scope: !1059)
!1067 = !DILocation(line: 94, column: 50, scope: !1059)
!1068 = !DILocation(line: 94, column: 19, scope: !1059)
!1069 = !DILocation(line: 95, column: 47, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 95, column: 26)
!1071 = !DILocation(line: 95, column: 33, scope: !1070)
!1072 = !DILocation(line: 95, column: 26, scope: !1070)
!1073 = !DILocation(line: 95, column: 61, scope: !1070)
!1074 = !DILocation(line: 95, column: 26, scope: !1059)
!1075 = !DILocation(line: 96, column: 49, scope: !1070)
!1076 = !DILocation(line: 96, column: 69, scope: !1070)
!1077 = !DILocation(line: 96, column: 54, scope: !1070)
!1078 = !DILocation(line: 96, column: 19, scope: !1070)
!1079 = !DILocation(line: 97, column: 47, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1070, file: !2, line: 97, column: 26)
!1081 = !DILocation(line: 97, column: 33, scope: !1080)
!1082 = !DILocation(line: 97, column: 26, scope: !1080)
!1083 = !DILocation(line: 97, column: 61, scope: !1080)
!1084 = !DILocation(line: 97, column: 26, scope: !1070)
!1085 = !DILocation(line: 98, column: 48, scope: !1080)
!1086 = !DILocation(line: 98, column: 68, scope: !1080)
!1087 = !DILocation(line: 98, column: 53, scope: !1080)
!1088 = !DILocation(line: 98, column: 19, scope: !1080)
!1089 = !DILocation(line: 100, column: 41, scope: !1080)
!1090 = !DILocation(line: 100, column: 61, scope: !1080)
!1091 = !DILocation(line: 100, column: 46, scope: !1080)
!1092 = !DILocation(line: 100, column: 19, scope: !1080)
!1093 = !DILocation(line: 101, column: 22, scope: !1060)
!1094 = !DILocation(line: 102, column: 15, scope: !1060)
!1095 = !DILocation(line: 103, column: 13, scope: !1014)
!1096 = !DILocation(line: 104, column: 11, scope: !1007)
!1097 = !DILocation(line: 105, column: 9, scope: !1002)
!1098 = !DILocation(line: 106, column: 7, scope: !997)
!1099 = !DILocation(line: 109, column: 12, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !976, file: !2, line: 109, column: 11)
!1101 = !DILocation(line: 109, column: 11, scope: !976)
!1102 = !DILocation(line: 110, column: 24, scope: !1100)
!1103 = !DILocation(line: 110, column: 9, scope: !1100)
!1104 = !DILocation(line: 111, column: 8, scope: !976)
!1105 = !DILocation(line: 112, column: 11, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !976, file: !2, line: 112, column: 11)
!1107 = !DILocation(line: 112, column: 13, scope: !1106)
!1108 = !DILocation(line: 112, column: 11, scope: !976)
!1109 = !DILocation(line: 113, column: 11, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1106, file: !2, line: 112, column: 19)
!1111 = !DILocation(line: 114, column: 9, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1110, file: !2, line: 114, column: 9)
!1113 = !DILocation(line: 114, column: 9, scope: !1110)
!1114 = !DILocalVariable(name: "s", scope: !1115, file: !2, line: 114, type: !41)
!1115 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 114, column: 9)
!1116 = !DILocation(line: 114, column: 9, scope: !1115)
!1117 = !DILocation(line: 114, column: 9, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1115, file: !2, line: 114, column: 9)
!1119 = !DILocation(line: 115, column: 7, scope: !1110)
!1120 = !DILocation(line: 116, column: 5, scope: !976)
!1121 = !DILocation(line: 117, column: 3, scope: !972)
!1122 = !DILocation(line: 118, column: 1, scope: !943)
!1123 = distinct !DISubprogram(name: "help_wizard", scope: !2, file: !2, line: 132, type: !1124, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !927, retainedNodes: !948)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{null, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !1128, line: 43, baseType: !1129)
!1128 = !DIFile(filename: "./src/htshelp.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8dfd1dfc92db68d52020ce861e84d325")
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !1130, line: 294, size: 1133184, elements: !1131)
!1130 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!1131 = !{!1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1195, !1196, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1214, !1215, !1216, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1307, !1311, !1330, !1331, !1335, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1809, !1821}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !1129, file: !1130, line: 295, baseType: !931, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !1129, file: !1130, line: 297, baseType: !930, size: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1129, file: !1130, line: 298, baseType: !930, size: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !1129, file: !1130, line: 299, baseType: !930, size: 32, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !1129, file: !1130, line: 300, baseType: !930, size: 32, offset: 160)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1129, file: !1130, line: 301, baseType: !930, size: 32, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !1129, file: !1130, line: 302, baseType: !930, size: 32, offset: 224)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !1129, file: !1130, line: 303, baseType: !930, size: 32, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !1129, file: !1130, line: 304, baseType: !930, size: 32, offset: 288)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1129, file: !1130, line: 305, baseType: !930, size: 32, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !1129, file: !1130, line: 306, baseType: !930, size: 32, offset: 352)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1129, file: !1130, line: 307, baseType: !1144, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1146, line: 7, baseType: !1147)
!1146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1148, line: 49, size: 1728, elements: !1149)
!1148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1149 = !{!1150, !1151, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1166, !1168, !1169, !1170, !1174, !1176, !1178, !1179, !1182, !1184, !1187, !1190, !1191, !1192, !1193, !1194}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1147, file: !1148, line: 51, baseType: !930, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1147, file: !1148, line: 54, baseType: !1152, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1147, file: !1148, line: 55, baseType: !1152, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1147, file: !1148, line: 56, baseType: !1152, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1147, file: !1148, line: 57, baseType: !1152, size: 64, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1147, file: !1148, line: 58, baseType: !1152, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1147, file: !1148, line: 59, baseType: !1152, size: 64, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1147, file: !1148, line: 60, baseType: !1152, size: 64, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1147, file: !1148, line: 61, baseType: !1152, size: 64, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1147, file: !1148, line: 64, baseType: !1152, size: 64, offset: 576)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1147, file: !1148, line: 65, baseType: !1152, size: 64, offset: 640)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1147, file: !1148, line: 66, baseType: !1152, size: 64, offset: 704)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1147, file: !1148, line: 68, baseType: !1164, size: 64, offset: 768)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1148, line: 36, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1147, file: !1148, line: 70, baseType: !1167, size: 64, offset: 832)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1147, file: !1148, line: 72, baseType: !930, size: 32, offset: 896)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1147, file: !1148, line: 73, baseType: !930, size: 32, offset: 928)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1147, file: !1148, line: 74, baseType: !1171, size: 64, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1172, line: 152, baseType: !1173)
!1172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!1173 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1147, file: !1148, line: 77, baseType: !1175, size: 16, offset: 1024)
!1175 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1147, file: !1148, line: 78, baseType: !1177, size: 8, offset: 1040)
!1177 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1147, file: !1148, line: 79, baseType: !316, size: 8, offset: 1048)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1147, file: !1148, line: 81, baseType: !1180, size: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1148, line: 43, baseType: null)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1147, file: !1148, line: 89, baseType: !1183, size: 64, offset: 1152)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1172, line: 153, baseType: !1173)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1147, file: !1148, line: 91, baseType: !1185, size: 64, offset: 1216)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1148, line: 37, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1147, file: !1148, line: 92, baseType: !1188, size: 64, offset: 1280)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1148, line: 38, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1147, file: !1148, line: 93, baseType: !1167, size: 64, offset: 1344)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1147, file: !1148, line: 94, baseType: !929, size: 64, offset: 1408)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1147, file: !1148, line: 95, baseType: !931, size: 64, offset: 1472)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1147, file: !1148, line: 96, baseType: !930, size: 32, offset: 1536)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1147, file: !1148, line: 98, baseType: !920, size: 160, offset: 1568)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !1129, file: !1130, line: 308, baseType: !1144, size: 64, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !1129, file: !1130, line: 309, baseType: !1197, size: 64, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !1198, line: 283, baseType: !1173)
!1198 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1129, file: !1130, line: 310, baseType: !1197, size: 64, offset: 576)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1129, file: !1130, line: 311, baseType: !1197, size: 64, offset: 640)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !1129, file: !1130, line: 312, baseType: !930, size: 32, offset: 704)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !1129, file: !1130, line: 313, baseType: !1197, size: 64, offset: 768)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !1129, file: !1130, line: 314, baseType: !930, size: 32, offset: 832)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !1129, file: !1130, line: 315, baseType: !930, size: 32, offset: 864)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !1129, file: !1130, line: 316, baseType: !930, size: 32, offset: 896)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !1129, file: !1130, line: 317, baseType: !930, size: 32, offset: 928)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1129, file: !1130, line: 318, baseType: !930, size: 32, offset: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1129, file: !1130, line: 319, baseType: !930, size: 32, offset: 992)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !1129, file: !1130, line: 320, baseType: !930, size: 32, offset: 1024)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !1129, file: !1130, line: 321, baseType: !930, size: 32, offset: 1056)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !1129, file: !1130, line: 322, baseType: !1212, size: 32, offset: 1088)
!1212 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !1129, file: !1130, line: 323, baseType: !930, size: 32, offset: 1120)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1129, file: !1130, line: 324, baseType: !930, size: 32, offset: 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !1129, file: !1130, line: 326, baseType: !930, size: 32, offset: 1184)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1129, file: !1130, line: 327, baseType: !1217, size: 512, offset: 1216)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !1130, line: 89, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !1130, line: 91, size: 512, elements: !1219)
!1219 = !{!1220, !1221, !1229, !1230}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1218, file: !1130, line: 92, baseType: !930, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1218, file: !1130, line: 93, baseType: !1222, size: 192, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !1223, line: 57, baseType: !1224)
!1223 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !1223, line: 61, size: 192, elements: !1225)
!1225 = !{!1226, !1227, !1228}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !1224, file: !1223, line: 62, baseType: !1152, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !1224, file: !1223, line: 63, baseType: !931, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !1224, file: !1223, line: 64, baseType: !931, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1218, file: !1130, line: 94, baseType: !930, size: 32, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1218, file: !1130, line: 95, baseType: !1222, size: 192, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !1129, file: !1130, line: 328, baseType: !930, size: 32, offset: 1728)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !1129, file: !1130, line: 329, baseType: !930, size: 32, offset: 1760)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !1129, file: !1130, line: 330, baseType: !1222, size: 192, offset: 1792)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !1129, file: !1130, line: 331, baseType: !930, size: 32, offset: 1984)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !1129, file: !1130, line: 332, baseType: !930, size: 32, offset: 2016)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !1129, file: !1130, line: 333, baseType: !930, size: 32, offset: 2048)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1129, file: !1130, line: 334, baseType: !930, size: 32, offset: 2080)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1129, file: !1130, line: 335, baseType: !1222, size: 192, offset: 2112)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1129, file: !1130, line: 336, baseType: !1222, size: 192, offset: 2304)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1129, file: !1130, line: 337, baseType: !1222, size: 192, offset: 2496)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !1129, file: !1130, line: 338, baseType: !1222, size: 192, offset: 2688)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !1129, file: !1130, line: 339, baseType: !1222, size: 192, offset: 2880)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !1129, file: !1130, line: 340, baseType: !1222, size: 192, offset: 3072)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !1129, file: !1130, line: 341, baseType: !1222, size: 192, offset: 3264)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1129, file: !1130, line: 342, baseType: !930, size: 32, offset: 3456)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !1129, file: !1130, line: 343, baseType: !930, size: 32, offset: 3488)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !1129, file: !1130, line: 344, baseType: !930, size: 32, offset: 3520)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !1129, file: !1130, line: 345, baseType: !930, size: 32, offset: 3552)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !1129, file: !1130, line: 346, baseType: !930, size: 32, offset: 3584)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !1129, file: !1130, line: 347, baseType: !930, size: 32, offset: 3616)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !1129, file: !1130, line: 348, baseType: !930, size: 32, offset: 3648)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !1129, file: !1130, line: 349, baseType: !930, size: 32, offset: 3680)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !1129, file: !1130, line: 350, baseType: !930, size: 32, offset: 3712)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1129, file: !1130, line: 351, baseType: !930, size: 32, offset: 3744)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !1129, file: !1130, line: 352, baseType: !930, size: 32, offset: 3776)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !1129, file: !1130, line: 353, baseType: !930, size: 32, offset: 3808)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !1129, file: !1130, line: 354, baseType: !930, size: 32, offset: 3840)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !1129, file: !1130, line: 355, baseType: !1222, size: 192, offset: 3904)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !1129, file: !1130, line: 356, baseType: !930, size: 32, offset: 4096)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !1129, file: !1130, line: 357, baseType: !930, size: 32, offset: 4128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1129, file: !1130, line: 358, baseType: !1262, size: 64, offset: 4160)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !1130, line: 65, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !1265, line: 55, size: 278656, elements: !1266)
!1265 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!1266 = !{!1267, !1268, !1272}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !1264, file: !1265, line: 56, baseType: !930, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1264, file: !1265, line: 57, baseType: !1269, size: 262144, offset: 32)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !1270)
!1270 = !{!1271}
!1271 = !DISubrange(count: 32768)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !1264, file: !1265, line: 58, baseType: !1273, size: 16448, offset: 262208)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !1265, line: 42, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !1265, line: 44, size: 16448, elements: !1275)
!1275 = !{!1276, !1280, !1281}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1274, file: !1265, line: 45, baseType: !1277, size: 8192)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1278)
!1278 = !{!1279}
!1279 = !DISubrange(count: 1024)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !1274, file: !1265, line: 46, baseType: !1277, size: 8192, offset: 8192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1274, file: !1265, line: 47, baseType: !1282, size: 64, offset: 16384)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !1129, file: !1130, line: 359, baseType: !930, size: 32, offset: 4224)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1129, file: !1130, line: 360, baseType: !930, size: 32, offset: 4256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1129, file: !1130, line: 361, baseType: !930, size: 32, offset: 4288)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !1129, file: !1130, line: 362, baseType: !930, size: 32, offset: 4320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !1129, file: !1130, line: 363, baseType: !930, size: 32, offset: 4352)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !1129, file: !1130, line: 364, baseType: !930, size: 32, offset: 4384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !1129, file: !1130, line: 365, baseType: !930, size: 32, offset: 4416)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !1129, file: !1130, line: 366, baseType: !930, size: 32, offset: 4448)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !1129, file: !1130, line: 367, baseType: !930, size: 32, offset: 4480)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !1129, file: !1130, line: 368, baseType: !930, size: 32, offset: 4512)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1129, file: !1130, line: 369, baseType: !1222, size: 192, offset: 4544)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !1129, file: !1130, line: 370, baseType: !930, size: 32, offset: 4736)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !1129, file: !1130, line: 372, baseType: !930, size: 32, offset: 4768)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !1129, file: !1130, line: 373, baseType: !1222, size: 192, offset: 4800)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !1129, file: !1130, line: 374, baseType: !1222, size: 192, offset: 4992)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1129, file: !1130, line: 375, baseType: !1299, size: 128, offset: 5184)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !1130, line: 101, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !1130, line: 103, size: 128, elements: !1301)
!1301 = !{!1302, !1305}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1300, file: !1130, line: 104, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !1300, file: !1130, line: 105, baseType: !1306, size: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1129, file: !1130, line: 376, baseType: !1308, size: 64, offset: 5312)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !1130, line: 57, baseType: !1310)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !1130, line: 57, flags: DIFlagFwdDecl)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !1129, file: !1130, line: 377, baseType: !1312, size: 64, offset: 5376)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !1130, line: 174, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !1130, line: 534, size: 640, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1315, file: !1130, line: 535, baseType: !1152, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !1315, file: !1130, line: 536, baseType: !1152, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !1315, file: !1130, line: 537, baseType: !1152, size: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !1315, file: !1130, line: 538, baseType: !1152, size: 64, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !1315, file: !1130, line: 539, baseType: !1152, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !1315, file: !1130, line: 540, baseType: !1152, size: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !1315, file: !1130, line: 542, baseType: !930, size: 32, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !1315, file: !1130, line: 543, baseType: !930, size: 32, offset: 416)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1315, file: !1130, line: 544, baseType: !930, size: 32, offset: 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !1315, file: !1130, line: 545, baseType: !930, size: 32, offset: 480)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !1315, file: !1130, line: 546, baseType: !4, size: 8, offset: 512)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1315, file: !1130, line: 548, baseType: !930, size: 32, offset: 544)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1315, file: !1130, line: 549, baseType: !930, size: 32, offset: 576)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !1129, file: !1130, line: 378, baseType: !930, size: 32, offset: 5440)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !1129, file: !1130, line: 379, baseType: !1332, size: 64, offset: 5504)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !1130, line: 286, baseType: !1334)
!1334 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !1130, line: 286, flags: DIFlagFwdDecl)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !1129, file: !1130, line: 380, baseType: !1336, size: 64, offset: 5568)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !1130, line: 61, baseType: !1338)
!1338 = !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !1130, line: 61, flags: DIFlagFwdDecl)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1129, file: !1130, line: 381, baseType: !1222, size: 192, offset: 5632)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1129, file: !1130, line: 382, baseType: !1222, size: 192, offset: 5824)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1129, file: !1130, line: 383, baseType: !1222, size: 192, offset: 6016)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !1129, file: !1130, line: 384, baseType: !1222, size: 192, offset: 6208)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !1129, file: !1130, line: 385, baseType: !1222, size: 192, offset: 6400)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !1129, file: !1130, line: 386, baseType: !930, size: 32, offset: 6592)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !1129, file: !1130, line: 388, baseType: !930, size: 32, offset: 6624)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !1129, file: !1130, line: 389, baseType: !930, size: 32, offset: 6656)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !1129, file: !1130, line: 391, baseType: !946, size: 64, offset: 6720)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !1129, file: !1130, line: 393, baseType: !930, size: 32, offset: 6784)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !1129, file: !1130, line: 394, baseType: !930, size: 32, offset: 6816)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !1129, file: !1130, line: 395, baseType: !930, size: 32, offset: 6848)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !1129, file: !1130, line: 396, baseType: !930, size: 32, offset: 6880)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1129, file: !1130, line: 398, baseType: !930, size: 32, offset: 6912)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !1129, file: !1130, line: 399, baseType: !930, size: 32, offset: 6944)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !1129, file: !1130, line: 402, baseType: !1355, size: 64, offset: 6976)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !1130, line: 49, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !1358, line: 191, size: 3328, elements: !1359)
!1358 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!1359 = !{!1360, !1379, !1385, !1394, !1400, !1406, !1416, !1422, !1431, !1440, !1446, !1452, !1660, !1669, !1678, !1687, !1693, !1702, !1711, !1720, !1729, !1738, !1748, !1754, !1797, !1803}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1357, file: !1358, line: 193, baseType: !1361, size: 128)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !1358, line: 193, size: 128, elements: !1362)
!1362 = !{!1363, !1378}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1361, file: !1358, line: 193, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !1358, line: 83, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{null, !1368}
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !1358, line: 60, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !1358, line: 179, size: 192, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !1370, file: !1358, line: 181, baseType: !929, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1370, file: !1358, line: 187, baseType: !1374, size: 128, offset: 64)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !1358, line: 184, size: 128, elements: !1375)
!1375 = !{!1376, !1377}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1374, file: !1358, line: 185, baseType: !929, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1374, file: !1358, line: 186, baseType: !1368, size: 64, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1361, file: !1358, line: 193, baseType: !1368, size: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1357, file: !1358, line: 194, baseType: !1380, size: 128, offset: 128)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !1358, line: 194, size: 128, elements: !1381)
!1381 = !{!1382, !1384}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1380, file: !1358, line: 194, baseType: !1383, size: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !1358, line: 84, baseType: !1365)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1380, file: !1358, line: 194, baseType: !1368, size: 64, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1357, file: !1358, line: 195, baseType: !1386, size: 128, offset: 256)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !1358, line: 195, size: 128, elements: !1387)
!1387 = !{!1388, !1393}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1386, file: !1358, line: 195, baseType: !1389, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !1358, line: 85, baseType: !1390)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!930, !1368, !1126}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1386, file: !1358, line: 195, baseType: !1368, size: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1357, file: !1358, line: 196, baseType: !1395, size: 128, offset: 384)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !1358, line: 196, size: 128, elements: !1396)
!1396 = !{!1397, !1399}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1395, file: !1358, line: 196, baseType: !1398, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !1358, line: 86, baseType: !1390)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1395, file: !1358, line: 196, baseType: !1368, size: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !1357, file: !1358, line: 197, baseType: !1401, size: 128, offset: 512)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !1358, line: 197, size: 128, elements: !1402)
!1402 = !{!1403, !1405}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1401, file: !1358, line: 197, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !1358, line: 87, baseType: !1390)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1401, file: !1358, line: 197, baseType: !1368, size: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !1357, file: !1358, line: 198, baseType: !1407, size: 128, offset: 640)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !1358, line: 198, size: 128, elements: !1408)
!1408 = !{!1409, !1415}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1407, file: !1358, line: 198, baseType: !1410, size: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !1358, line: 92, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !1358, line: 88, baseType: !1412)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!930, !1368, !1126, !1304, !1306, !946, !946}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1407, file: !1358, line: 198, baseType: !1368, size: 64, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !1357, file: !1358, line: 199, baseType: !1417, size: 128, offset: 768)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !1358, line: 199, size: 128, elements: !1418)
!1418 = !{!1419, !1421}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1417, file: !1358, line: 199, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !1358, line: 93, baseType: !1411)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1417, file: !1358, line: 199, baseType: !1368, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !1357, file: !1358, line: 200, baseType: !1423, size: 128, offset: 896)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !1358, line: 200, size: 128, elements: !1424)
!1424 = !{!1425, !1430}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1423, file: !1358, line: 200, baseType: !1426, size: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !1358, line: 94, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!930, !1368, !1126, !1152, !930, !946, !946}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1423, file: !1358, line: 200, baseType: !1368, size: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !1357, file: !1358, line: 201, baseType: !1432, size: 128, offset: 1024)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !1358, line: 201, size: 128, elements: !1433)
!1433 = !{!1434, !1439}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1432, file: !1358, line: 201, baseType: !1435, size: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !1358, line: 98, baseType: !1436)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{!946, !1368, !1126, !946}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1432, file: !1358, line: 201, baseType: !1368, size: 64, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !1357, file: !1358, line: 202, baseType: !1441, size: 128, offset: 1152)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !1358, line: 202, size: 128, elements: !1442)
!1442 = !{!1443, !1445}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1441, file: !1358, line: 202, baseType: !1444, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !1358, line: 101, baseType: !1436)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1441, file: !1358, line: 202, baseType: !1368, size: 64, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !1357, file: !1358, line: 203, baseType: !1447, size: 128, offset: 1280)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !1358, line: 203, size: 128, elements: !1448)
!1448 = !{!1449, !1451}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1447, file: !1358, line: 203, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !1358, line: 104, baseType: !1436)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1447, file: !1358, line: 203, baseType: !1368, size: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !1357, file: !1358, line: 204, baseType: !1453, size: 128, offset: 1408)
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !1358, line: 204, size: 128, elements: !1454)
!1454 = !{!1455, !1659}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1453, file: !1358, line: 204, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !1358, line: 107, baseType: !1457)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!930, !1368, !1126, !1460, !930, !930, !930, !930, !930, !1628}
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !1130, line: 555, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !1130, line: 557, size: 135040, elements: !1463)
!1463 = !{!1464, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1482, !1483, !1484, !1485, !1486, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !1462, file: !1130, line: 561, baseType: !1465, size: 16384)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !1466)
!1466 = !{!1467}
!1467 = !DISubrange(count: 2048)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !1462, file: !1130, line: 562, baseType: !1465, size: 16384, offset: 16384)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !1462, file: !1130, line: 563, baseType: !1465, size: 16384, offset: 32768)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !1462, file: !1130, line: 564, baseType: !1465, size: 16384, offset: 49152)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !1462, file: !1130, line: 565, baseType: !1465, size: 16384, offset: 65536)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !1462, file: !1130, line: 566, baseType: !1465, size: 16384, offset: 81920)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1462, file: !1130, line: 567, baseType: !1152, size: 64, offset: 98304)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !1462, file: !1130, line: 568, baseType: !1465, size: 16384, offset: 98368)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !1462, file: !1130, line: 569, baseType: !1277, size: 8192, offset: 114752)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1462, file: !1130, line: 570, baseType: !930, size: 32, offset: 122944)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !1462, file: !1130, line: 571, baseType: !930, size: 32, offset: 122976)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1462, file: !1130, line: 572, baseType: !930, size: 32, offset: 123008)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1462, file: !1130, line: 573, baseType: !930, size: 32, offset: 123040)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !1462, file: !1130, line: 574, baseType: !1481, size: 64, offset: 123072)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !1198, line: 284, baseType: !1173)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1462, file: !1130, line: 575, baseType: !930, size: 32, offset: 123136)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !1462, file: !1130, line: 576, baseType: !1481, size: 64, offset: 123200)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1462, file: !1130, line: 577, baseType: !1197, size: 64, offset: 123264)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1462, file: !1130, line: 578, baseType: !1197, size: 64, offset: 123328)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1462, file: !1130, line: 579, baseType: !1487, size: 8960, offset: 123392)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !1130, line: 484, baseType: !1488)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !1130, line: 486, size: 8960, elements: !1489)
!1489 = !{!1490, !1491, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1514, !1572, !1573, !1574, !1575, !1580, !1581, !1585, !1586, !1587, !1588, !1589, !1590}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !1488, file: !1130, line: 487, baseType: !930, size: 32)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !1488, file: !1130, line: 488, baseType: !1492, size: 16, offset: 32)
!1492 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !1488, file: !1130, line: 489, baseType: !1492, size: 16, offset: 48)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1488, file: !1130, line: 490, baseType: !1492, size: 16, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !1488, file: !1130, line: 491, baseType: !1492, size: 16, offset: 80)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !1488, file: !1130, line: 492, baseType: !1492, size: 16, offset: 96)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !1488, file: !1130, line: 493, baseType: !1492, size: 16, offset: 112)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !1488, file: !1130, line: 494, baseType: !1492, size: 16, offset: 128)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !1488, file: !1130, line: 495, baseType: !930, size: 32, offset: 160)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !1488, file: !1130, line: 496, baseType: !930, size: 32, offset: 192)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1488, file: !1130, line: 497, baseType: !1152, size: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1488, file: !1130, line: 498, baseType: !1152, size: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1488, file: !1130, line: 499, baseType: !1144, size: 64, offset: 384)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1488, file: !1130, line: 500, baseType: !1197, size: 64, offset: 448)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !1488, file: !1130, line: 501, baseType: !556, size: 640, offset: 512)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !1488, file: !1130, line: 502, baseType: !504, size: 512, offset: 1152)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !1488, file: !1130, line: 503, baseType: !504, size: 512, offset: 1664)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !1488, file: !1130, line: 504, baseType: !504, size: 512, offset: 2176)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1488, file: !1130, line: 505, baseType: !1152, size: 64, offset: 2688)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !1488, file: !1130, line: 506, baseType: !1197, size: 64, offset: 2752)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !1488, file: !1130, line: 507, baseType: !1492, size: 16, offset: 2816)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !1488, file: !1130, line: 508, baseType: !1513, size: 32, offset: 2848)
!1513 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !1198, line: 323, baseType: !930)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1488, file: !1130, line: 509, baseType: !1515, size: 224, offset: 2880)
!1515 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !1516, line: 91, baseType: !1517)
!1516 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !1516, line: 93, size: 224, elements: !1518)
!1518 = !{!1519}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !1517, file: !1516, line: 103, baseType: !1520, size: 224)
!1520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1517, file: !1516, line: 94, size: 224, elements: !1521)
!1521 = !{!1522, !1530, !1551}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1520, file: !1516, line: 96, baseType: !1523, size: 128)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1524, line: 180, size: 128, elements: !1525)
!1524 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1525 = !{!1526, !1529}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1523, file: !1524, line: 182, baseType: !1527, size: 16)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1528, line: 28, baseType: !1175)
!1528 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1523, file: !1524, line: 183, baseType: !63, size: 112, offset: 16)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1520, file: !1516, line: 98, baseType: !1531, size: 128)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1532, line: 245, size: 128, elements: !1533)
!1532 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!1533 = !{!1534, !1535, !1540, !1548}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1531, file: !1532, line: 247, baseType: !1527, size: 16)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1531, file: !1532, line: 248, baseType: !1536, size: 16, offset: 16)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1532, line: 123, baseType: !1537)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1538, line: 25, baseType: !1539)
!1538 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !1172, line: 40, baseType: !1175)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1531, file: !1532, line: 249, baseType: !1541, size: 32, offset: 32)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1532, line: 31, size: 32, elements: !1542)
!1542 = !{!1543}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1541, file: !1532, line: 33, baseType: !1544, size: 32)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1532, line: 30, baseType: !1545)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1538, line: 26, baseType: !1546)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !1172, line: 42, baseType: !1547)
!1547 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1531, file: !1532, line: 252, baseType: !1549, size: 64, offset: 64)
!1549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1550, size: 64, elements: !98)
!1550 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1520, file: !1516, line: 101, baseType: !1552, size: 224)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1532, line: 260, size: 224, elements: !1553)
!1553 = !{!1554, !1555, !1556, !1557, !1571}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1552, file: !1532, line: 262, baseType: !1527, size: 16)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1552, file: !1532, line: 263, baseType: !1536, size: 16, offset: 16)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1552, file: !1532, line: 264, baseType: !1545, size: 32, offset: 32)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1552, file: !1532, line: 265, baseType: !1558, size: 128, offset: 64)
!1558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1532, line: 219, size: 128, elements: !1559)
!1559 = !{!1560}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1558, file: !1532, line: 226, baseType: !1561, size: 128)
!1561 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1558, file: !1532, line: 221, size: 128, elements: !1562)
!1562 = !{!1563, !1567, !1569}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1561, file: !1532, line: 223, baseType: !1564, size: 128)
!1564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1565, size: 128, elements: !298)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1538, line: 24, baseType: !1566)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !1172, line: 38, baseType: !1550)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1561, file: !1532, line: 224, baseType: !1568, size: 128)
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1537, size: 128, elements: !98)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1561, file: !1532, line: 225, baseType: !1570, size: 128)
!1570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1545, size: 128, elements: !42)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1552, file: !1532, line: 266, baseType: !1545, size: 32, offset: 192)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !1488, file: !1130, line: 510, baseType: !930, size: 32, offset: 3104)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !1488, file: !1130, line: 511, baseType: !1144, size: 64, offset: 3136)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !1488, file: !1130, line: 513, baseType: !1492, size: 16, offset: 3200)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !1488, file: !1130, line: 515, baseType: !1576, size: 64, offset: 3264)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !1578, line: 184, baseType: !1579)
!1578 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1579 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !1578, line: 184, flags: DIFlagFwdDecl)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !1488, file: !1130, line: 517, baseType: !504, size: 512, offset: 3328)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !1488, file: !1130, line: 518, baseType: !1582, size: 2048, offset: 3840)
!1582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1583)
!1583 = !{!1584}
!1584 = !DISubrange(count: 256)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !1488, file: !1130, line: 519, baseType: !1582, size: 2048, offset: 5888)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !1488, file: !1130, line: 520, baseType: !1197, size: 64, offset: 7936)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !1488, file: !1130, line: 521, baseType: !1197, size: 64, offset: 8000)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !1488, file: !1130, line: 522, baseType: !1197, size: 64, offset: 8064)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !1488, file: !1130, line: 523, baseType: !930, size: 32, offset: 8128)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !1488, file: !1130, line: 525, baseType: !1591, size: 768, offset: 8192)
!1591 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !1130, line: 463, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !1130, line: 465, size: 768, elements: !1593)
!1593 = !{!1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1592, file: !1130, line: 466, baseType: !1492, size: 16)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1592, file: !1130, line: 467, baseType: !1492, size: 16, offset: 16)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1592, file: !1130, line: 468, baseType: !1492, size: 16, offset: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !1592, file: !1130, line: 469, baseType: !1492, size: 16, offset: 48)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1592, file: !1130, line: 470, baseType: !1492, size: 16, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !1592, file: !1130, line: 471, baseType: !1492, size: 16, offset: 80)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1592, file: !1130, line: 472, baseType: !946, size: 64, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1592, file: !1130, line: 473, baseType: !946, size: 64, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1592, file: !1130, line: 474, baseType: !946, size: 64, offset: 256)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1592, file: !1130, line: 475, baseType: !946, size: 64, offset: 320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1592, file: !1130, line: 476, baseType: !946, size: 64, offset: 384)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1592, file: !1130, line: 477, baseType: !946, size: 64, offset: 448)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1592, file: !1130, line: 478, baseType: !1607, size: 256, offset: 512)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !1130, line: 452, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !1130, line: 454, size: 256, elements: !1609)
!1609 = !{!1610, !1611, !1612, !1613}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1608, file: !1130, line: 455, baseType: !930, size: 32)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1608, file: !1130, line: 456, baseType: !946, size: 64, offset: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1608, file: !1130, line: 457, baseType: !930, size: 32, offset: 128)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1608, file: !1130, line: 458, baseType: !946, size: 64, offset: 192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1462, file: !1130, line: 580, baseType: !930, size: 32, offset: 132352)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !1462, file: !1130, line: 581, baseType: !930, size: 32, offset: 132384)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !1462, file: !1130, line: 582, baseType: !1197, size: 64, offset: 132416)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !1462, file: !1130, line: 583, baseType: !1481, size: 64, offset: 132480)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1462, file: !1130, line: 585, baseType: !930, size: 32, offset: 132544)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1462, file: !1130, line: 586, baseType: !930, size: 32, offset: 132576)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !1462, file: !1130, line: 587, baseType: !1152, size: 64, offset: 132608)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1462, file: !1130, line: 588, baseType: !1197, size: 64, offset: 132672)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !1462, file: !1130, line: 589, baseType: !1197, size: 64, offset: 132736)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !1462, file: !1130, line: 590, baseType: !1197, size: 64, offset: 132800)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1462, file: !1130, line: 594, baseType: !1582, size: 2048, offset: 132864)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !1462, file: !1130, line: 595, baseType: !930, size: 32, offset: 134912)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !1462, file: !1130, line: 596, baseType: !930, size: 32, offset: 134944)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !1462, file: !1130, line: 597, baseType: !930, size: 32, offset: 134976)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !1130, line: 412, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !1130, line: 414, size: 1344, elements: !1631)
!1631 = !{!1632, !1633, !1634, !1635, !1636, !1637, !1638, !1640, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !1630, file: !1130, line: 415, baseType: !1197, size: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !1630, file: !1130, line: 416, baseType: !1197, size: 64, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !1630, file: !1130, line: 418, baseType: !1481, size: 64, offset: 128)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !1630, file: !1130, line: 420, baseType: !1197, size: 64, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !1630, file: !1130, line: 421, baseType: !1197, size: 64, offset: 256)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !1630, file: !1130, line: 422, baseType: !930, size: 32, offset: 320)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !1630, file: !1130, line: 424, baseType: !1639, size: 128, offset: 384)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1481, size: 128, elements: !49)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !1630, file: !1130, line: 425, baseType: !1641, size: 128, offset: 512)
!1641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 128, elements: !49)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !1630, file: !1130, line: 426, baseType: !1481, size: 64, offset: 640)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !1630, file: !1130, line: 427, baseType: !930, size: 32, offset: 704)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !1630, file: !1130, line: 429, baseType: !930, size: 32, offset: 736)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !1630, file: !1130, line: 430, baseType: !930, size: 32, offset: 768)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !1630, file: !1130, line: 431, baseType: !930, size: 32, offset: 800)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !1630, file: !1130, line: 433, baseType: !930, size: 32, offset: 832)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !1630, file: !1130, line: 434, baseType: !930, size: 32, offset: 864)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !1630, file: !1130, line: 435, baseType: !930, size: 32, offset: 896)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !1630, file: !1130, line: 436, baseType: !930, size: 32, offset: 928)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !1630, file: !1130, line: 437, baseType: !930, size: 32, offset: 960)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !1630, file: !1130, line: 438, baseType: !930, size: 32, offset: 992)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !1630, file: !1130, line: 439, baseType: !930, size: 32, offset: 1024)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !1630, file: !1130, line: 440, baseType: !930, size: 32, offset: 1056)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !1630, file: !1130, line: 441, baseType: !1197, size: 64, offset: 1088)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1630, file: !1130, line: 443, baseType: !1197, size: 64, offset: 1152)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !1630, file: !1130, line: 445, baseType: !1481, size: 64, offset: 1216)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !1630, file: !1130, line: 446, baseType: !1481, size: 64, offset: 1280)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1453, file: !1358, line: 204, baseType: !1368, size: 64, offset: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !1357, file: !1358, line: 205, baseType: !1661, size: 128, offset: 1536)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !1358, line: 205, size: 128, elements: !1662)
!1662 = !{!1663, !1668}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1661, file: !1358, line: 205, baseType: !1664, size: 64)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !1358, line: 112, baseType: !1665)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!930, !1368, !1126, !946, !946, !930}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1661, file: !1358, line: 205, baseType: !1368, size: 64, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !1357, file: !1358, line: 206, baseType: !1670, size: 128, offset: 1664)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !1358, line: 206, size: 128, elements: !1671)
!1671 = !{!1672, !1677}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1670, file: !1358, line: 206, baseType: !1673, size: 64)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !1358, line: 115, baseType: !1674)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!930, !1368, !1126, !946, !946, !946, !930}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1670, file: !1358, line: 206, baseType: !1368, size: 64, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !1357, file: !1358, line: 207, baseType: !1679, size: 128, offset: 1792)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !1358, line: 207, size: 128, elements: !1680)
!1680 = !{!1681, !1686}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1679, file: !1358, line: 207, baseType: !1682, size: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !1358, line: 119, baseType: !1683)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{null, !1368, !1126, !946}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1679, file: !1358, line: 207, baseType: !1368, size: 64, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !1357, file: !1358, line: 208, baseType: !1688, size: 128, offset: 1920)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !1358, line: 208, size: 128, elements: !1689)
!1689 = !{!1690, !1692}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1688, file: !1358, line: 208, baseType: !1691, size: 64)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !1358, line: 121, baseType: !1683)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1688, file: !1358, line: 208, baseType: !1368, size: 64, offset: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !1357, file: !1358, line: 209, baseType: !1694, size: 128, offset: 2048)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !1358, line: 209, size: 128, elements: !1695)
!1695 = !{!1696, !1701}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1694, file: !1358, line: 209, baseType: !1697, size: 64)
!1697 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !1358, line: 123, baseType: !1698)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{null, !1368, !1126, !946, !946, !946, !930, !930, !930}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1694, file: !1358, line: 209, baseType: !1368, size: 64, offset: 64)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !1357, file: !1358, line: 210, baseType: !1703, size: 128, offset: 2176)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !1358, line: 210, size: 128, elements: !1704)
!1704 = !{!1705, !1710}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1703, file: !1358, line: 210, baseType: !1706, size: 64)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !1358, line: 128, baseType: !1707)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!930, !1368, !1126, !1152}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1703, file: !1358, line: 210, baseType: !1368, size: 64, offset: 64)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !1357, file: !1358, line: 211, baseType: !1712, size: 128, offset: 2304)
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !1358, line: 211, size: 128, elements: !1713)
!1713 = !{!1714, !1719}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1712, file: !1358, line: 211, baseType: !1715, size: 64)
!1715 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !1358, line: 130, baseType: !1716)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!930, !1368, !1126, !1152, !946}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1712, file: !1358, line: 211, baseType: !1368, size: 64, offset: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !1357, file: !1358, line: 212, baseType: !1721, size: 128, offset: 2432)
!1721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !1358, line: 212, size: 128, elements: !1722)
!1722 = !{!1723, !1728}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1721, file: !1358, line: 212, baseType: !1724, size: 64)
!1724 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !1358, line: 133, baseType: !1725)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!930, !1368, !1126, !1460}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1721, file: !1358, line: 212, baseType: !1368, size: 64, offset: 64)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !1357, file: !1358, line: 213, baseType: !1730, size: 128, offset: 2560)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !1358, line: 213, size: 128, elements: !1731)
!1731 = !{!1732, !1737}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1730, file: !1358, line: 213, baseType: !1733, size: 64)
!1733 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !1358, line: 135, baseType: !1734)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64)
!1735 = !DISubroutineType(types: !1736)
!1736 = !{!930, !1368, !1126, !946, !946, !946, !946, !1152}
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1730, file: !1358, line: 213, baseType: !1368, size: 64, offset: 64)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !1357, file: !1358, line: 214, baseType: !1739, size: 128, offset: 2688)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !1358, line: 214, size: 128, elements: !1740)
!1740 = !{!1741, !1747}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1739, file: !1358, line: 214, baseType: !1742, size: 64)
!1742 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !1358, line: 142, baseType: !1743)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64)
!1744 = !DISubroutineType(types: !1745)
!1745 = !{!930, !1368, !1126, !1152, !946, !946, !946, !946, !1746}
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1739, file: !1358, line: 214, baseType: !1368, size: 64, offset: 64)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !1357, file: !1358, line: 215, baseType: !1749, size: 128, offset: 2816)
!1749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !1358, line: 215, size: 128, elements: !1750)
!1750 = !{!1751, !1753}
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1749, file: !1358, line: 215, baseType: !1752, size: 64)
!1752 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !1358, line: 148, baseType: !1743)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1749, file: !1358, line: 215, baseType: !1368, size: 64, offset: 64)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !1357, file: !1358, line: 216, baseType: !1755, size: 128, offset: 2944)
!1755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !1358, line: 216, size: 128, elements: !1756)
!1756 = !{!1757, !1796}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1755, file: !1358, line: 216, baseType: !1758, size: 64)
!1758 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !1358, line: 156, baseType: !1759)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64)
!1760 = !DISubroutineType(types: !1761)
!1761 = !{!930, !1368, !1126, !1762}
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64)
!1763 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !1358, line: 56, baseType: !1764)
!1764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !1765, line: 71, size: 1216, elements: !1766)
!1765 = !DIFile(filename: "./src/htsmodules.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "65f13e42a0265151bd8524490683afa8")
!1766 = !{!1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1780, !1781, !1782, !1783, !1784, !1788, !1792, !1793, !1794, !1795}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1764, file: !1765, line: 73, baseType: !946, size: 64)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1764, file: !1765, line: 74, baseType: !930, size: 32, offset: 64)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "mime", scope: !1764, file: !1765, line: 75, baseType: !946, size: 64, offset: 128)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "url_host", scope: !1764, file: !1765, line: 76, baseType: !946, size: 64, offset: 192)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "url_file", scope: !1764, file: !1765, line: 77, baseType: !946, size: 64, offset: 256)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1764, file: !1765, line: 80, baseType: !946, size: 64, offset: 320)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !1764, file: !1765, line: 81, baseType: !1152, size: 64, offset: 384)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "relativeToHtmlLink", scope: !1764, file: !1765, line: 84, baseType: !930, size: 32, offset: 448)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "addLink", scope: !1764, file: !1765, line: 89, baseType: !1776, size: 64, offset: 512)
!1776 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_htsAddLink", file: !1765, line: 68, baseType: !1777)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64)
!1778 = !DISubroutineType(types: !1779)
!1779 = !{!930, !1762, !1152}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "localLink", scope: !1764, file: !1765, line: 94, baseType: !1152, size: 64, offset: 576)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "localLinkSize", scope: !1764, file: !1765, line: 97, baseType: !930, size: 32, offset: 640)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !1764, file: !1765, line: 100, baseType: !929, size: 64, offset: 704)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !1764, file: !1765, line: 104, baseType: !1126, size: 64, offset: 768)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "sback", scope: !1764, file: !1765, line: 107, baseType: !1785, size: 64, offset: 832)
!1785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1786, size: 64)
!1786 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_back", file: !1765, line: 48, baseType: !1787)
!1787 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_back", file: !1765, line: 48, flags: DIFlagFwdDecl)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1764, file: !1765, line: 108, baseType: !1789, size: 64, offset: 896)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1790, size: 64)
!1790 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_back", file: !1765, line: 52, baseType: !1791)
!1791 = !DICompositeType(tag: DW_TAG_structure_type, name: "cache_back", file: !1765, line: 52, flags: DIFlagFwdDecl)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "hashptr", scope: !1764, file: !1765, line: 109, baseType: !1308, size: 64, offset: 960)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "numero_passe", scope: !1764, file: !1765, line: 110, baseType: !930, size: 32, offset: 1024)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_", scope: !1764, file: !1765, line: 112, baseType: !1306, size: 64, offset: 1088)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "page_charset_", scope: !1764, file: !1765, line: 113, baseType: !946, size: 64, offset: 1152)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1755, file: !1358, line: 216, baseType: !1368, size: 64, offset: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !1357, file: !1358, line: 217, baseType: !1798, size: 128, offset: 3072)
!1798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !1358, line: 217, size: 128, elements: !1799)
!1799 = !{!1800, !1802}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1798, file: !1358, line: 217, baseType: !1801, size: 64)
!1801 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !1358, line: 158, baseType: !1759)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1798, file: !1358, line: 217, baseType: !1368, size: 64, offset: 64)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !1357, file: !1358, line: 219, baseType: !1804, size: 128, offset: 3200)
!1804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !1358, line: 219, size: 128, elements: !1805)
!1805 = !{!1806, !1808}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1804, file: !1358, line: 219, baseType: !1807, size: 64)
!1807 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !1358, line: 141, baseType: !1733)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1804, file: !1358, line: 219, baseType: !1368, size: 64, offset: 64)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !1129, file: !1130, line: 404, baseType: !1810, size: 128, offset: 7040)
!1810 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !1130, line: 260, baseType: !1811)
!1811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !1130, line: 270, size: 128, elements: !1812)
!1812 = !{!1813, !1814}
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1811, file: !1130, line: 271, baseType: !930, size: 32)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1811, file: !1130, line: 272, baseType: !1815, size: 64, offset: 64)
!1815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1816, size: 64)
!1816 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !1130, line: 264, baseType: !1817)
!1817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !1130, line: 266, size: 128, elements: !1818)
!1818 = !{!1819, !1820}
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !1817, file: !1130, line: 267, baseType: !1152, size: 64)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1817, file: !1130, line: 268, baseType: !929, size: 64, offset: 64)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1129, file: !1130, line: 406, baseType: !1822, size: 1126016, offset: 7168)
!1822 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !1130, line: 216, baseType: !1823)
!1823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !1130, line: 218, size: 1126016, elements: !1824)
!1824 = !{!1825, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1845, !1857, !1866, !1872, !1879, !1880, !1881, !1882, !1893, !1894, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1912, !1913, !1914, !1915}
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1823, file: !1130, line: 219, baseType: !1826, size: 64)
!1826 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !1130, line: 204, baseType: !1827)
!1827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1828, size: 64)
!1828 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !1130, line: 204, flags: DIFlagFwdDecl)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1823, file: !1130, line: 221, baseType: !930, size: 32, offset: 64)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !1823, file: !1130, line: 222, baseType: !930, size: 32, offset: 96)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !1823, file: !1130, line: 223, baseType: !930, size: 32, offset: 128)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !1823, file: !1130, line: 225, baseType: !930, size: 32, offset: 160)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !1823, file: !1130, line: 226, baseType: !1222, size: 192, offset: 192)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !1823, file: !1130, line: 227, baseType: !1144, size: 64, offset: 384)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !1823, file: !1130, line: 228, baseType: !930, size: 32, offset: 448)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !1823, file: !1130, line: 230, baseType: !1837, size: 32832, offset: 512)
!1837 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !1130, line: 121, baseType: !1838)
!1838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !1130, line: 123, size: 32832, elements: !1839)
!1839 = !{!1840, !1841}
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !1838, file: !1130, line: 124, baseType: !1144, size: 64)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1838, file: !1130, line: 125, baseType: !1842, size: 32768, offset: 64)
!1842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1843)
!1843 = !{!1844}
!1844 = !DISubrange(count: 4096)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1823, file: !1130, line: 232, baseType: !1846, size: 192, offset: 33344)
!1846 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !1130, line: 111, baseType: !1847)
!1847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !1130, line: 112, size: 192, elements: !1848)
!1848 = !{!1849, !1850, !1855}
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !1847, file: !1130, line: 113, baseType: !929, size: 64)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !1847, file: !1130, line: 114, baseType: !1851, size: 64, offset: 64)
!1851 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !1130, line: 110, baseType: !1852)
!1852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1853, size: 64)
!1853 = !DISubroutineType(types: !1854)
!1854 = !{!930}
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1847, file: !1130, line: 115, baseType: !1856, size: 64, offset: 128)
!1856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1846, size: 64)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !1823, file: !1130, line: 233, baseType: !1858, size: 1048608, offset: 33536)
!1858 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !1130, line: 131, baseType: !1859)
!1859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !1130, line: 133, size: 1048608, elements: !1860)
!1860 = !{!1861, !1862}
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1859, file: !1130, line: 134, baseType: !930, size: 32)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1859, file: !1130, line: 135, baseType: !1863, size: 1048576, offset: 32)
!1863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !1864)
!1864 = !{!299, !1865}
!1865 = !DISubrange(count: 8192)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !1823, file: !1130, line: 234, baseType: !1867, size: 16416, offset: 1082144)
!1867 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !1130, line: 153, baseType: !1868)
!1868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !1130, line: 155, size: 16416, elements: !1869)
!1869 = !{!1870, !1871}
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !1868, file: !1130, line: 156, baseType: !930, size: 32)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !1868, file: !1130, line: 157, baseType: !1465, size: 16384, offset: 32)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !1823, file: !1130, line: 235, baseType: !1873, size: 96, offset: 1098560)
!1873 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !1130, line: 163, baseType: !1874)
!1874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !1130, line: 165, size: 96, elements: !1875)
!1875 = !{!1876, !1877, !1878}
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1874, file: !1130, line: 166, baseType: !930, size: 32)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !1874, file: !1130, line: 167, baseType: !930, size: 32, offset: 32)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1874, file: !1130, line: 168, baseType: !930, size: 32, offset: 64)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !1823, file: !1130, line: 236, baseType: !1152, size: 64, offset: 1098688)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !1823, file: !1130, line: 237, baseType: !930, size: 32, offset: 1098752)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !1823, file: !1130, line: 238, baseType: !930, size: 32, offset: 1098784)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !1823, file: !1130, line: 239, baseType: !1883, size: 64, offset: 1098816)
!1883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1884, size: 64)
!1884 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !1130, line: 53, baseType: !1885)
!1885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !1886, line: 150, size: 704, elements: !1887)
!1886 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!1887 = !{!1888, !1890, !1891, !1892}
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1885, file: !1886, line: 151, baseType: !1889, size: 64)
!1889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1885, size: 64)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !1885, file: !1886, line: 152, baseType: !946, size: 64, offset: 64)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !1885, file: !1886, line: 153, baseType: !931, size: 64, offset: 128)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !1885, file: !1886, line: 154, baseType: !504, size: 512, offset: 192)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !1823, file: !1130, line: 240, baseType: !930, size: 32, offset: 1098880)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !1823, file: !1130, line: 242, baseType: !1895, size: 10240, offset: 1098912)
!1895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 10240, elements: !1896)
!1896 = !{!1897}
!1897 = !DISubrange(count: 1280)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !1823, file: !1130, line: 243, baseType: !930, size: 32, offset: 1109152)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !1823, file: !1130, line: 244, baseType: !930, size: 32, offset: 1109184)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !1823, file: !1130, line: 245, baseType: !930, size: 32, offset: 1109216)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !1823, file: !1130, line: 246, baseType: !930, size: 32, offset: 1109248)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !1823, file: !1130, line: 247, baseType: !930, size: 32, offset: 1109280)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !1823, file: !1130, line: 248, baseType: !1304, size: 64, offset: 1109312)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !1823, file: !1130, line: 249, baseType: !930, size: 32, offset: 1109376)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !1823, file: !1130, line: 250, baseType: !1906, size: 64, offset: 1109440)
!1906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1907, size: 64)
!1907 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !1130, line: 194, baseType: !1908)
!1908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !1130, line: 196, size: 128, elements: !1909)
!1909 = !{!1910, !1911}
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1908, file: !1130, line: 197, baseType: !1152, size: 64)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1908, file: !1130, line: 198, baseType: !1906, size: 64, offset: 64)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !1823, file: !1130, line: 251, baseType: !1465, size: 16384, offset: 1109504)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !1823, file: !1130, line: 252, baseType: !1547, size: 32, offset: 1125888)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !1823, file: !1130, line: 253, baseType: !1547, size: 32, offset: 1125920)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !1823, file: !1130, line: 254, baseType: !930, size: 32, offset: 1125952)
!1916 = !DILocalVariable(name: "opt", arg: 1, scope: !1123, file: !2, line: 132, type: !1126)
!1917 = !DILocation(line: 132, column: 29, scope: !1123)
!1918 = !DILocalVariable(name: "buffers", scope: !1123, file: !2, line: 133, type: !1919)
!1919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1920, size: 64)
!1920 = !DIDerivedType(tag: DW_TAG_typedef, name: "help_wizard_buffers", file: !2, line: 130, baseType: !1921)
!1921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "help_wizard_buffers", file: !2, line: 120, size: 120832, elements: !1922)
!1922 = !{!1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931}
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "urls", scope: !1921, file: !2, line: 121, baseType: !1465, size: 16384)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "mainpath", scope: !1921, file: !2, line: 122, baseType: !1582, size: 2048, offset: 16384)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "projname", scope: !1921, file: !2, line: 123, baseType: !1582, size: 2048, offset: 18432)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "stropt", scope: !1921, file: !2, line: 124, baseType: !1465, size: 16384, offset: 20480)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "stropt2", scope: !1921, file: !2, line: 125, baseType: !1465, size: 16384, offset: 36864)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "strwild", scope: !1921, file: !2, line: 126, baseType: !1465, size: 16384, offset: 53248)
