; ModuleID = 'src/htsjava.c'
source_filename = "src/htsjava.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.t_hts_callbackarg = type { ptr, %struct.prev }
%struct.prev = type { ptr, ptr }
%struct.httrackp = type { i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i64, i64, i64, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, %struct.t_proxy, i32, i32, %struct.String, i32, i32, i32, i32, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, %struct.String, %struct.String, %struct.htsfilters, ptr, ptr, i32, ptr, ptr, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, ptr, %struct.htslibhandles, %struct.htsoptstate }
%struct.t_proxy = type { i32, %struct.String, i32, %struct.String }
%struct.htsfilters = type { ptr, ptr }
%struct.String = type { ptr, i64, i64 }
%struct.htslibhandles = type { i32, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "libName", scope: !2, file: !3, line: 99, type: !235, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !815, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/htsjava.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "357fa7a9c1d70ea36b301b0e83a7c832")
!4 = !{!5, !11, !17, !21, !661, !803, !103, !806, !51, !440}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !7, line: 60, baseType: !8)
!7 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !7, line: 179, size: 192, elements: !9)
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !8, file: !7, line: 181, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !8, file: !7, line: 187, baseType: !13, size: 128, offset: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !7, line: 184, size: 128, elements: !14)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !13, file: !7, line: 185, baseType: !11, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !13, file: !7, line: 186, baseType: !5, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !7, line: 156, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !5, !22, !769}
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !24, line: 49, baseType: !25)
!24 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !26, line: 294, size: 1133184, elements: !27)
!26 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!27 = !{!28, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !101, !102, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !119, !120, !121, !122, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !194, !198, !217, !218, !222, !226, !227, !228, !229, !230, !231, !232, !233, !234, !237, !238, !239, !240, !241, !242, !243, !669, !681}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !25, file: !26, line: 295, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 46, baseType: !31)
!30 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!31 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !25, file: !26, line: 297, baseType: !21, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !25, file: !26, line: 298, baseType: !21, size: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !25, file: !26, line: 299, baseType: !21, size: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !25, file: !26, line: 300, baseType: !21, size: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !25, file: !26, line: 301, baseType: !21, size: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !25, file: !26, line: 302, baseType: !21, size: 32, offset: 224)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !25, file: !26, line: 303, baseType: !21, size: 32, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !25, file: !26, line: 304, baseType: !21, size: 32, offset: 288)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !25, file: !26, line: 305, baseType: !21, size: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !25, file: !26, line: 306, baseType: !21, size: 32, offset: 352)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !25, file: !26, line: 307, baseType: !43, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 7, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!48 = !{!49, !50, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !66, !68, !69, !70, !74, !76, !78, !82, !85, !87, !90, !93, !94, !95, !96, !97}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 51, baseType: !21, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 54, baseType: !51, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 55, baseType: !51, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 56, baseType: !51, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 57, baseType: !51, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 58, baseType: !51, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 59, baseType: !51, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 60, baseType: !51, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 61, baseType: !51, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 64, baseType: !51, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 65, baseType: !51, size: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 66, baseType: !51, size: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 68, baseType: !64, size: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 36, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 70, baseType: !67, size: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 72, baseType: !21, size: 32, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 73, baseType: !21, size: 32, offset: 928)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 74, baseType: !71, size: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 152, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!73 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 77, baseType: !75, size: 16, offset: 1024)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 78, baseType: !77, size: 8, offset: 1040)
!77 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 79, baseType: !79, size: 8, offset: 1048)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 81, baseType: !83, size: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 43, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 89, baseType: !86, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !72, line: 153, baseType: !73)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !46, file: !47, line: 91, baseType: !88, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !47, line: 37, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !46, file: !47, line: 92, baseType: !91, size: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !47, line: 38, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !46, file: !47, line: 93, baseType: !67, size: 64, offset: 1344)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !46, file: !47, line: 94, baseType: !11, size: 64, offset: 1408)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 95, baseType: !29, size: 64, offset: 1472)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 96, baseType: !21, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !25, file: !26, line: 308, baseType: !43, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !25, file: !26, line: 309, baseType: !103, size: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !104, line: 283, baseType: !73)
!104 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !25, file: !26, line: 310, baseType: !103, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !25, file: !26, line: 311, baseType: !103, size: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !25, file: !26, line: 312, baseType: !21, size: 32, offset: 704)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !25, file: !26, line: 313, baseType: !103, size: 64, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !25, file: !26, line: 314, baseType: !21, size: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !25, file: !26, line: 315, baseType: !21, size: 32, offset: 864)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !25, file: !26, line: 316, baseType: !21, size: 32, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !25, file: !26, line: 317, baseType: !21, size: 32, offset: 928)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !25, file: !26, line: 318, baseType: !21, size: 32, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !25, file: !26, line: 319, baseType: !21, size: 32, offset: 992)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !25, file: !26, line: 320, baseType: !21, size: 32, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !25, file: !26, line: 321, baseType: !21, size: 32, offset: 1056)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !25, file: !26, line: 322, baseType: !118, size: 32, offset: 1088)
!118 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !25, file: !26, line: 323, baseType: !21, size: 32, offset: 1120)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !25, file: !26, line: 324, baseType: !21, size: 32, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !25, file: !26, line: 326, baseType: !21, size: 32, offset: 1184)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !25, file: !26, line: 327, baseType: !123, size: 512, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !26, line: 89, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !26, line: 91, size: 512, elements: !125)
!125 = !{!126, !127, !134, !135}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !124, file: !26, line: 92, baseType: !21, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !26, line: 93, baseType: !128, size: 192, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !26, line: 71, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !26, line: 75, size: 192, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !129, file: !26, line: 76, baseType: !51, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !129, file: !26, line: 77, baseType: !29, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !129, file: !26, line: 78, baseType: !29, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !124, file: !26, line: 94, baseType: !21, size: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !124, file: !26, line: 95, baseType: !128, size: 192, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !25, file: !26, line: 328, baseType: !21, size: 32, offset: 1728)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !25, file: !26, line: 329, baseType: !21, size: 32, offset: 1760)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !25, file: !26, line: 330, baseType: !128, size: 192, offset: 1792)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !25, file: !26, line: 331, baseType: !21, size: 32, offset: 1984)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !25, file: !26, line: 332, baseType: !21, size: 32, offset: 2016)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !25, file: !26, line: 333, baseType: !21, size: 32, offset: 2048)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !25, file: !26, line: 334, baseType: !21, size: 32, offset: 2080)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !25, file: !26, line: 335, baseType: !128, size: 192, offset: 2112)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !25, file: !26, line: 336, baseType: !128, size: 192, offset: 2304)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !25, file: !26, line: 337, baseType: !128, size: 192, offset: 2496)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !25, file: !26, line: 338, baseType: !128, size: 192, offset: 2688)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !25, file: !26, line: 339, baseType: !128, size: 192, offset: 2880)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !25, file: !26, line: 340, baseType: !128, size: 192, offset: 3072)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !25, file: !26, line: 341, baseType: !128, size: 192, offset: 3264)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !25, file: !26, line: 342, baseType: !21, size: 32, offset: 3456)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !25, file: !26, line: 343, baseType: !21, size: 32, offset: 3488)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !25, file: !26, line: 344, baseType: !21, size: 32, offset: 3520)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !25, file: !26, line: 345, baseType: !21, size: 32, offset: 3552)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !25, file: !26, line: 346, baseType: !21, size: 32, offset: 3584)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !25, file: !26, line: 347, baseType: !21, size: 32, offset: 3616)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !25, file: !26, line: 348, baseType: !21, size: 32, offset: 3648)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !25, file: !26, line: 349, baseType: !21, size: 32, offset: 3680)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !25, file: !26, line: 350, baseType: !21, size: 32, offset: 3712)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !25, file: !26, line: 351, baseType: !21, size: 32, offset: 3744)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !25, file: !26, line: 352, baseType: !21, size: 32, offset: 3776)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !25, file: !26, line: 353, baseType: !21, size: 32, offset: 3808)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !25, file: !26, line: 354, baseType: !21, size: 32, offset: 3840)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !25, file: !26, line: 355, baseType: !128, size: 192, offset: 3904)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !25, file: !26, line: 356, baseType: !21, size: 32, offset: 4096)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !25, file: !26, line: 357, baseType: !21, size: 32, offset: 4128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !25, file: !26, line: 358, baseType: !167, size: 64, offset: 4160)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !26, line: 65, baseType: !169)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !26, line: 65, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !25, file: !26, line: 359, baseType: !21, size: 32, offset: 4224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !25, file: !26, line: 360, baseType: !21, size: 32, offset: 4256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !25, file: !26, line: 361, baseType: !21, size: 32, offset: 4288)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !25, file: !26, line: 362, baseType: !21, size: 32, offset: 4320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !25, file: !26, line: 363, baseType: !21, size: 32, offset: 4352)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !25, file: !26, line: 364, baseType: !21, size: 32, offset: 4384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !25, file: !26, line: 365, baseType: !21, size: 32, offset: 4416)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !25, file: !26, line: 366, baseType: !21, size: 32, offset: 4448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !25, file: !26, line: 367, baseType: !21, size: 32, offset: 4480)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !25, file: !26, line: 368, baseType: !21, size: 32, offset: 4512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !25, file: !26, line: 369, baseType: !128, size: 192, offset: 4544)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !25, file: !26, line: 370, baseType: !21, size: 32, offset: 4736)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !25, file: !26, line: 372, baseType: !21, size: 32, offset: 4768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !25, file: !26, line: 373, baseType: !128, size: 192, offset: 4800)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !25, file: !26, line: 374, baseType: !128, size: 192, offset: 4992)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !25, file: !26, line: 375, baseType: !186, size: 128, offset: 5184)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !26, line: 101, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !26, line: 103, size: 128, elements: !188)
!188 = !{!189, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !187, file: !26, line: 104, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !187, file: !26, line: 105, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !25, file: !26, line: 376, baseType: !195, size: 64, offset: 5312)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !26, line: 57, baseType: !197)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !26, line: 57, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !25, file: !26, line: 377, baseType: !199, size: 64, offset: 5376)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !26, line: 174, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !26, line: 534, size: 640, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !202, file: !26, line: 535, baseType: !51, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !202, file: !26, line: 536, baseType: !51, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !202, file: !26, line: 537, baseType: !51, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !202, file: !26, line: 538, baseType: !51, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !202, file: !26, line: 539, baseType: !51, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !202, file: !26, line: 540, baseType: !51, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !202, file: !26, line: 542, baseType: !21, size: 32, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !202, file: !26, line: 543, baseType: !21, size: 32, offset: 416)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !202, file: !26, line: 544, baseType: !21, size: 32, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !202, file: !26, line: 545, baseType: !21, size: 32, offset: 480)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !202, file: !26, line: 546, baseType: !52, size: 8, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !202, file: !26, line: 548, baseType: !21, size: 32, offset: 544)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !202, file: !26, line: 549, baseType: !21, size: 32, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !25, file: !26, line: 378, baseType: !21, size: 32, offset: 5440)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !25, file: !26, line: 379, baseType: !219, size: 64, offset: 5504)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !26, line: 286, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !26, line: 286, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !25, file: !26, line: 380, baseType: !223, size: 64, offset: 5568)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !26, line: 61, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !26, line: 61, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !25, file: !26, line: 381, baseType: !128, size: 192, offset: 5632)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !25, file: !26, line: 382, baseType: !128, size: 192, offset: 5824)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !25, file: !26, line: 383, baseType: !128, size: 192, offset: 6016)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !25, file: !26, line: 384, baseType: !128, size: 192, offset: 6208)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !25, file: !26, line: 385, baseType: !128, size: 192, offset: 6400)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !25, file: !26, line: 386, baseType: !21, size: 32, offset: 6592)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !25, file: !26, line: 388, baseType: !21, size: 32, offset: 6624)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !25, file: !26, line: 389, baseType: !21, size: 32, offset: 6656)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !25, file: !26, line: 391, baseType: !235, size: 64, offset: 6720)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !25, file: !26, line: 393, baseType: !21, size: 32, offset: 6784)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !25, file: !26, line: 394, baseType: !21, size: 32, offset: 6816)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !25, file: !26, line: 395, baseType: !21, size: 32, offset: 6848)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !25, file: !26, line: 396, baseType: !21, size: 32, offset: 6880)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !25, file: !26, line: 398, baseType: !21, size: 32, offset: 6912)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !25, file: !26, line: 399, baseType: !21, size: 32, offset: 6944)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !25, file: !26, line: 402, baseType: !244, size: 64, offset: 6976)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !26, line: 49, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !7, line: 191, size: 3328, elements: !247)
!247 = !{!248, !257, !263, !272, !278, !284, !294, !300, !309, !318, !324, !330, !558, !567, !576, !585, !591, !600, !609, !618, !627, !636, !646, !652, !657, !663}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !246, file: !7, line: 193, baseType: !249, size: 128)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !7, line: 193, size: 128, elements: !250)
!250 = !{!251, !256}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !249, file: !7, line: 193, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !7, line: 83, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !249, file: !7, line: 193, baseType: !5, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !246, file: !7, line: 194, baseType: !258, size: 128, offset: 128)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !7, line: 194, size: 128, elements: !259)
!259 = !{!260, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !258, file: !7, line: 194, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !7, line: 84, baseType: !253)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !258, file: !7, line: 194, baseType: !5, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !246, file: !7, line: 195, baseType: !264, size: 128, offset: 256)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !7, line: 195, size: 128, elements: !265)
!265 = !{!266, !271}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !264, file: !7, line: 195, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !7, line: 85, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!21, !5, !22}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !264, file: !7, line: 195, baseType: !5, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !246, file: !7, line: 196, baseType: !273, size: 128, offset: 384)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !7, line: 196, size: 128, elements: !274)
!274 = !{!275, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !273, file: !7, line: 196, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !7, line: 86, baseType: !268)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !273, file: !7, line: 196, baseType: !5, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !246, file: !7, line: 197, baseType: !279, size: 128, offset: 512)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !7, line: 197, size: 128, elements: !280)
!280 = !{!281, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !279, file: !7, line: 197, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !7, line: 87, baseType: !268)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !279, file: !7, line: 197, baseType: !5, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !246, file: !7, line: 198, baseType: !285, size: 128, offset: 640)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !7, line: 198, size: 128, elements: !286)
!286 = !{!287, !293}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !285, file: !7, line: 198, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !7, line: 92, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !7, line: 88, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!21, !5, !22, !191, !193, !235, !235}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !285, file: !7, line: 198, baseType: !5, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !246, file: !7, line: 199, baseType: !295, size: 128, offset: 768)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !7, line: 199, size: 128, elements: !296)
!296 = !{!297, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !295, file: !7, line: 199, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !7, line: 93, baseType: !289)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !295, file: !7, line: 199, baseType: !5, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !246, file: !7, line: 200, baseType: !301, size: 128, offset: 896)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !7, line: 200, size: 128, elements: !302)
!302 = !{!303, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !301, file: !7, line: 200, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !7, line: 94, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!21, !5, !22, !51, !21, !235, !235}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !301, file: !7, line: 200, baseType: !5, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !246, file: !7, line: 201, baseType: !310, size: 128, offset: 1024)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !7, line: 201, size: 128, elements: !311)
!311 = !{!312, !317}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !310, file: !7, line: 201, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !7, line: 98, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!235, !5, !22, !235}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !310, file: !7, line: 201, baseType: !5, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !246, file: !7, line: 202, baseType: !319, size: 128, offset: 1152)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !7, line: 202, size: 128, elements: !320)
!320 = !{!321, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !319, file: !7, line: 202, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !7, line: 101, baseType: !314)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !319, file: !7, line: 202, baseType: !5, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !246, file: !7, line: 203, baseType: !325, size: 128, offset: 1280)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !7, line: 203, size: 128, elements: !326)
!326 = !{!327, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !325, file: !7, line: 203, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !7, line: 104, baseType: !314)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !325, file: !7, line: 203, baseType: !5, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !246, file: !7, line: 204, baseType: !331, size: 128, offset: 1408)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !7, line: 204, size: 128, elements: !332)
!332 = !{!333, !557}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !331, file: !7, line: 204, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !7, line: 107, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!21, !5, !22, !338, !21, !21, !21, !21, !21, !524}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !26, line: 555, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !26, line: 557, size: 135040, elements: !341)
!341 = !{!342, !346, !347, !348, !349, !350, !351, !352, !353, !357, !358, !359, !360, !361, !363, !364, !365, !366, !367, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !340, file: !26, line: 561, baseType: !343, size: 16384)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 16384, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 2048)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !340, file: !26, line: 562, baseType: !343, size: 16384, offset: 16384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !340, file: !26, line: 563, baseType: !343, size: 16384, offset: 32768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !340, file: !26, line: 564, baseType: !343, size: 16384, offset: 49152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !340, file: !26, line: 565, baseType: !343, size: 16384, offset: 65536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !340, file: !26, line: 566, baseType: !343, size: 16384, offset: 81920)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !340, file: !26, line: 567, baseType: !51, size: 64, offset: 98304)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !340, file: !26, line: 568, baseType: !343, size: 16384, offset: 98368)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !340, file: !26, line: 569, baseType: !354, size: 8192, offset: 114752)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8192, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !340, file: !26, line: 570, baseType: !21, size: 32, offset: 122944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !340, file: !26, line: 571, baseType: !21, size: 32, offset: 122976)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !340, file: !26, line: 572, baseType: !21, size: 32, offset: 123008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !340, file: !26, line: 573, baseType: !21, size: 32, offset: 123040)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !340, file: !26, line: 574, baseType: !362, size: 64, offset: 123072)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !104, line: 284, baseType: !73)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !340, file: !26, line: 575, baseType: !21, size: 32, offset: 123136)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !340, file: !26, line: 576, baseType: !362, size: 64, offset: 123200)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !340, file: !26, line: 577, baseType: !103, size: 64, offset: 123264)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !340, file: !26, line: 578, baseType: !103, size: 64, offset: 123328)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !340, file: !26, line: 579, baseType: !368, size: 8960, offset: 123392)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !26, line: 484, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !26, line: 486, size: 8960, elements: !370)
!370 = !{!371, !372, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !390, !394, !395, !396, !397, !398, !399, !401, !468, !469, !470, !471, !476, !477, !481, !482, !483, !484, !485, !486}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !369, file: !26, line: 487, baseType: !21, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !369, file: !26, line: 488, baseType: !373, size: 16, offset: 32)
!373 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !369, file: !26, line: 489, baseType: !373, size: 16, offset: 48)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !369, file: !26, line: 490, baseType: !373, size: 16, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !369, file: !26, line: 491, baseType: !373, size: 16, offset: 80)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !369, file: !26, line: 492, baseType: !373, size: 16, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !369, file: !26, line: 493, baseType: !373, size: 16, offset: 112)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !369, file: !26, line: 494, baseType: !373, size: 16, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !369, file: !26, line: 495, baseType: !21, size: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !369, file: !26, line: 496, baseType: !21, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !369, file: !26, line: 497, baseType: !51, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !369, file: !26, line: 498, baseType: !51, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !369, file: !26, line: 499, baseType: !43, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !369, file: !26, line: 500, baseType: !103, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !369, file: !26, line: 501, baseType: !387, size: 640, offset: 512)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 640, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 80)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !369, file: !26, line: 502, baseType: !391, size: 512, offset: 1152)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 512, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !369, file: !26, line: 503, baseType: !391, size: 512, offset: 1664)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !369, file: !26, line: 504, baseType: !391, size: 512, offset: 2176)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !369, file: !26, line: 505, baseType: !51, size: 64, offset: 2688)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !369, file: !26, line: 506, baseType: !103, size: 64, offset: 2752)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !369, file: !26, line: 507, baseType: !373, size: 16, offset: 2816)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !369, file: !26, line: 508, baseType: !400, size: 32, offset: 2848)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !104, line: 323, baseType: !21)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !369, file: !26, line: 509, baseType: !402, size: 224, offset: 2880)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !403, line: 91, baseType: !404)
!403 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !403, line: 93, size: 224, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !404, file: !403, line: 103, baseType: !407, size: 224)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !404, file: !403, line: 94, size: 224, elements: !408)
!408 = !{!409, !420, !443}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !407, file: !403, line: 96, baseType: !410, size: 128)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !411, line: 180, size: 128, elements: !412)
!411 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!412 = !{!413, !416}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !410, file: !411, line: 182, baseType: !414, size: 16)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !415, line: 28, baseType: !75)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !410, file: !411, line: 183, baseType: !417, size: 112, offset: 16)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 112, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 14)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !407, file: !403, line: 98, baseType: !421, size: 128)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !422, line: 245, size: 128, elements: !423)
!422 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!423 = !{!424, !425, !430, !438}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !421, file: !422, line: 247, baseType: !414, size: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !421, file: !422, line: 248, baseType: !426, size: 16, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !422, line: 123, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !428, line: 25, baseType: !429)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !72, line: 40, baseType: !75)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !421, file: !422, line: 249, baseType: !431, size: 32, offset: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !422, line: 31, size: 32, elements: !432)
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !431, file: !422, line: 33, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !422, line: 30, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !428, line: 26, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !72, line: 42, baseType: !437)
!437 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !421, file: !422, line: 252, baseType: !439, size: 64, offset: 64)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 64, elements: !441)
!440 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!441 = !{!442}
!442 = !DISubrange(count: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !407, file: !403, line: 101, baseType: !444, size: 224)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !422, line: 260, size: 224, elements: !445)
!445 = !{!446, !447, !448, !449, !467}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !444, file: !422, line: 262, baseType: !414, size: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !444, file: !422, line: 263, baseType: !426, size: 16, offset: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !444, file: !422, line: 264, baseType: !435, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !444, file: !422, line: 265, baseType: !450, size: 128, offset: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !422, line: 219, size: 128, elements: !451)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !450, file: !422, line: 226, baseType: !453, size: 128)
!453 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !422, line: 221, size: 128, elements: !454)
!454 = !{!455, !461, !463}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !453, file: !422, line: 223, baseType: !456, size: 128)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 128, elements: !459)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !428, line: 24, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !72, line: 38, baseType: !440)
!459 = !{!460}
!460 = !DISubrange(count: 16)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !453, file: !422, line: 224, baseType: !462, size: 128)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 128, elements: !441)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !453, file: !422, line: 225, baseType: !464, size: 128)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 128, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 4)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !444, file: !422, line: 266, baseType: !435, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !369, file: !26, line: 510, baseType: !21, size: 32, offset: 3104)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !369, file: !26, line: 511, baseType: !43, size: 64, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !369, file: !26, line: 513, baseType: !373, size: 16, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !369, file: !26, line: 515, baseType: !472, size: 64, offset: 3264)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !474, line: 184, baseType: !475)
!474 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !474, line: 184, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !369, file: !26, line: 517, baseType: !391, size: 512, offset: 3328)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !369, file: !26, line: 518, baseType: !478, size: 2048, offset: 3840)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !369, file: !26, line: 519, baseType: !478, size: 2048, offset: 5888)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !369, file: !26, line: 520, baseType: !103, size: 64, offset: 7936)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !369, file: !26, line: 521, baseType: !103, size: 64, offset: 8000)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !369, file: !26, line: 522, baseType: !103, size: 64, offset: 8064)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !369, file: !26, line: 523, baseType: !21, size: 32, offset: 8128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !369, file: !26, line: 525, baseType: !487, size: 768, offset: 8192)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !26, line: 463, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !26, line: 465, size: 768, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !488, file: !26, line: 466, baseType: !373, size: 16)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !488, file: !26, line: 467, baseType: !373, size: 16, offset: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !488, file: !26, line: 468, baseType: !373, size: 16, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !488, file: !26, line: 469, baseType: !373, size: 16, offset: 48)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !488, file: !26, line: 470, baseType: !373, size: 16, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !488, file: !26, line: 471, baseType: !373, size: 16, offset: 80)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !488, file: !26, line: 472, baseType: !235, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !488, file: !26, line: 473, baseType: !235, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !488, file: !26, line: 474, baseType: !235, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !488, file: !26, line: 475, baseType: !235, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !488, file: !26, line: 476, baseType: !235, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !488, file: !26, line: 477, baseType: !235, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !488, file: !26, line: 478, baseType: !503, size: 256, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !26, line: 452, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !26, line: 454, size: 256, elements: !505)
!505 = !{!506, !507, !508, !509}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !504, file: !26, line: 455, baseType: !21, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !504, file: !26, line: 456, baseType: !235, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !504, file: !26, line: 457, baseType: !21, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !504, file: !26, line: 458, baseType: !235, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !340, file: !26, line: 580, baseType: !21, size: 32, offset: 132352)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !340, file: !26, line: 581, baseType: !21, size: 32, offset: 132384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !340, file: !26, line: 582, baseType: !103, size: 64, offset: 132416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !340, file: !26, line: 583, baseType: !362, size: 64, offset: 132480)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !340, file: !26, line: 585, baseType: !21, size: 32, offset: 132544)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !340, file: !26, line: 586, baseType: !21, size: 32, offset: 132576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !340, file: !26, line: 587, baseType: !51, size: 64, offset: 132608)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !340, file: !26, line: 588, baseType: !103, size: 64, offset: 132672)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !340, file: !26, line: 589, baseType: !103, size: 64, offset: 132736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !340, file: !26, line: 590, baseType: !103, size: 64, offset: 132800)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !340, file: !26, line: 594, baseType: !478, size: 2048, offset: 132864)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !340, file: !26, line: 595, baseType: !21, size: 32, offset: 134912)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !340, file: !26, line: 596, baseType: !21, size: 32, offset: 134944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !340, file: !26, line: 597, baseType: !21, size: 32, offset: 134976)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !24, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !26, line: 414, size: 1344, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !538, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !526, file: !26, line: 415, baseType: !103, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !526, file: !26, line: 416, baseType: !103, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !526, file: !26, line: 418, baseType: !362, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !526, file: !26, line: 420, baseType: !103, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !526, file: !26, line: 421, baseType: !103, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !526, file: !26, line: 422, baseType: !21, size: 32, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !526, file: !26, line: 424, baseType: !535, size: 128, offset: 384)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 128, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 2)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !526, file: !26, line: 425, baseType: !539, size: 128, offset: 512)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !536)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !526, file: !26, line: 426, baseType: !362, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !526, file: !26, line: 427, baseType: !21, size: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !526, file: !26, line: 429, baseType: !21, size: 32, offset: 736)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !526, file: !26, line: 430, baseType: !21, size: 32, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !526, file: !26, line: 431, baseType: !21, size: 32, offset: 800)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !526, file: !26, line: 433, baseType: !21, size: 32, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !526, file: !26, line: 434, baseType: !21, size: 32, offset: 864)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !526, file: !26, line: 435, baseType: !21, size: 32, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !526, file: !26, line: 436, baseType: !21, size: 32, offset: 928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !526, file: !26, line: 437, baseType: !21, size: 32, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !526, file: !26, line: 438, baseType: !21, size: 32, offset: 992)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !526, file: !26, line: 439, baseType: !21, size: 32, offset: 1024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !526, file: !26, line: 440, baseType: !21, size: 32, offset: 1056)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !526, file: !26, line: 441, baseType: !103, size: 64, offset: 1088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !526, file: !26, line: 443, baseType: !103, size: 64, offset: 1152)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !526, file: !26, line: 445, baseType: !362, size: 64, offset: 1216)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !526, file: !26, line: 446, baseType: !362, size: 64, offset: 1280)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !331, file: !7, line: 204, baseType: !5, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !246, file: !7, line: 205, baseType: !559, size: 128, offset: 1536)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !7, line: 205, size: 128, elements: !560)
!560 = !{!561, !566}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !559, file: !7, line: 205, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !7, line: 112, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!21, !5, !22, !235, !235, !21}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !559, file: !7, line: 205, baseType: !5, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !246, file: !7, line: 206, baseType: !568, size: 128, offset: 1664)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !7, line: 206, size: 128, elements: !569)
!569 = !{!570, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !568, file: !7, line: 206, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !7, line: 115, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!21, !5, !22, !235, !235, !235, !21}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !568, file: !7, line: 206, baseType: !5, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !246, file: !7, line: 207, baseType: !577, size: 128, offset: 1792)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !7, line: 207, size: 128, elements: !578)
!578 = !{!579, !584}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !577, file: !7, line: 207, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !7, line: 119, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !5, !22, !235}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !577, file: !7, line: 207, baseType: !5, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !246, file: !7, line: 208, baseType: !586, size: 128, offset: 1920)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !7, line: 208, size: 128, elements: !587)
!587 = !{!588, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !586, file: !7, line: 208, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !7, line: 121, baseType: !581)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !586, file: !7, line: 208, baseType: !5, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !246, file: !7, line: 209, baseType: !592, size: 128, offset: 2048)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !7, line: 209, size: 128, elements: !593)
!593 = !{!594, !599}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !592, file: !7, line: 209, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !7, line: 123, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !5, !22, !235, !235, !235, !21, !21, !21}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !592, file: !7, line: 209, baseType: !5, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !246, file: !7, line: 210, baseType: !601, size: 128, offset: 2176)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !7, line: 210, size: 128, elements: !602)
!602 = !{!603, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !601, file: !7, line: 210, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !7, line: 128, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!21, !5, !22, !51}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !601, file: !7, line: 210, baseType: !5, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !246, file: !7, line: 211, baseType: !610, size: 128, offset: 2304)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !7, line: 211, size: 128, elements: !611)
!611 = !{!612, !617}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !610, file: !7, line: 211, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !7, line: 130, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!21, !5, !22, !51, !235}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !610, file: !7, line: 211, baseType: !5, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !246, file: !7, line: 212, baseType: !619, size: 128, offset: 2432)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !7, line: 212, size: 128, elements: !620)
!620 = !{!621, !626}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !619, file: !7, line: 212, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !7, line: 133, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!21, !5, !22, !338}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !619, file: !7, line: 212, baseType: !5, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !246, file: !7, line: 213, baseType: !628, size: 128, offset: 2560)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !7, line: 213, size: 128, elements: !629)
!629 = !{!630, !635}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !628, file: !7, line: 213, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !7, line: 135, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!21, !5, !22, !235, !235, !235, !235, !51}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !628, file: !7, line: 213, baseType: !5, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !246, file: !7, line: 214, baseType: !637, size: 128, offset: 2688)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !7, line: 214, size: 128, elements: !638)
!638 = !{!639, !645}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !637, file: !7, line: 214, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !7, line: 142, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!21, !5, !22, !51, !235, !235, !235, !235, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !637, file: !7, line: 214, baseType: !5, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !246, file: !7, line: 215, baseType: !647, size: 128, offset: 2816)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !7, line: 215, size: 128, elements: !648)
!648 = !{!649, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !647, file: !7, line: 215, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !7, line: 148, baseType: !641)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !647, file: !7, line: 215, baseType: !5, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !246, file: !7, line: 216, baseType: !653, size: 128, offset: 2944)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !7, line: 216, size: 128, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !653, file: !7, line: 216, baseType: !17, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !653, file: !7, line: 216, baseType: !5, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !246, file: !7, line: 217, baseType: !658, size: 128, offset: 3072)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !7, line: 217, size: 128, elements: !659)
!659 = !{!660, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !658, file: !7, line: 217, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !7, line: 158, baseType: !18)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !658, file: !7, line: 217, baseType: !5, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !246, file: !7, line: 219, baseType: !664, size: 128, offset: 3200)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !7, line: 219, size: 128, elements: !665)
!665 = !{!666, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !664, file: !7, line: 219, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !7, line: 141, baseType: !631)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !664, file: !7, line: 219, baseType: !5, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !25, file: !26, line: 404, baseType: !670, size: 128, offset: 7040)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !26, line: 260, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !26, line: 270, size: 128, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !671, file: !26, line: 271, baseType: !21, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !671, file: !26, line: 272, baseType: !675, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !26, line: 264, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !26, line: 266, size: 128, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !677, file: !26, line: 267, baseType: !51, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !677, file: !26, line: 268, baseType: !11, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !25, file: !26, line: 406, baseType: !682, size: 1126016, offset: 7168)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !26, line: 216, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !26, line: 218, size: 1126016, elements: !684)
!684 = !{!685, !689, !690, !691, !692, !693, !694, !695, !696, !705, !717, !726, !732, !739, !740, !741, !742, !746, !747, !751, !752, !753, !754, !755, !756, !757, !758, !765, !766, !767, !768}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !683, file: !26, line: 219, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !26, line: 204, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !26, line: 204, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !683, file: !26, line: 221, baseType: !21, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !683, file: !26, line: 222, baseType: !21, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !683, file: !26, line: 223, baseType: !21, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !683, file: !26, line: 225, baseType: !21, size: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !683, file: !26, line: 226, baseType: !128, size: 192, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !683, file: !26, line: 227, baseType: !43, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !683, file: !26, line: 228, baseType: !21, size: 32, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !683, file: !26, line: 230, baseType: !697, size: 32832, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !26, line: 121, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !26, line: 123, size: 32832, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !698, file: !26, line: 124, baseType: !43, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !698, file: !26, line: 125, baseType: !702, size: 32768, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32768, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 4096)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !683, file: !26, line: 232, baseType: !706, size: 192, offset: 33344)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !26, line: 111, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !26, line: 112, size: 192, elements: !708)
!708 = !{!709, !710, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !707, file: !26, line: 113, baseType: !11, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !707, file: !26, line: 114, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !26, line: 110, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!21}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !26, line: 115, baseType: !716, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !683, file: !26, line: 233, baseType: !718, size: 1048608, offset: 33536)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !26, line: 131, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !26, line: 133, size: 1048608, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !719, file: !26, line: 134, baseType: !21, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !719, file: !26, line: 135, baseType: !723, size: 1048576, offset: 32)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 1048576, elements: !724)
!724 = !{!460, !725}
!725 = !DISubrange(count: 8192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !683, file: !26, line: 234, baseType: !727, size: 16416, offset: 1082144)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !26, line: 153, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !26, line: 155, size: 16416, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !728, file: !26, line: 156, baseType: !21, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !728, file: !26, line: 157, baseType: !343, size: 16384, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !683, file: !26, line: 235, baseType: !733, size: 96, offset: 1098560)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !26, line: 163, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !26, line: 165, size: 96, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !734, file: !26, line: 166, baseType: !21, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !734, file: !26, line: 167, baseType: !21, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !734, file: !26, line: 168, baseType: !21, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !683, file: !26, line: 236, baseType: !51, size: 64, offset: 1098688)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !683, file: !26, line: 237, baseType: !21, size: 32, offset: 1098752)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !683, file: !26, line: 238, baseType: !21, size: 32, offset: 1098784)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !683, file: !26, line: 239, baseType: !743, size: 64, offset: 1098816)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !26, line: 53, baseType: !745)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !26, line: 53, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !683, file: !26, line: 240, baseType: !21, size: 32, offset: 1098880)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !683, file: !26, line: 242, baseType: !748, size: 10240, offset: 1098912)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 10240, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 1280)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !683, file: !26, line: 243, baseType: !21, size: 32, offset: 1109152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !683, file: !26, line: 244, baseType: !21, size: 32, offset: 1109184)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !683, file: !26, line: 245, baseType: !21, size: 32, offset: 1109216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !683, file: !26, line: 246, baseType: !21, size: 32, offset: 1109248)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !683, file: !26, line: 247, baseType: !21, size: 32, offset: 1109280)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !683, file: !26, line: 248, baseType: !191, size: 64, offset: 1109312)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !683, file: !26, line: 249, baseType: !21, size: 32, offset: 1109376)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !683, file: !26, line: 250, baseType: !759, size: 64, offset: 1109440)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !26, line: 194, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !26, line: 196, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !761, file: !26, line: 197, baseType: !51, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !761, file: !26, line: 198, baseType: !759, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !683, file: !26, line: 251, baseType: !343, size: 16384, offset: 1109504)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !683, file: !26, line: 252, baseType: !437, size: 32, offset: 1125888)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !683, file: !26, line: 253, baseType: !437, size: 32, offset: 1125920)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !683, file: !26, line: 254, baseType: !21, size: 32, offset: 1125952)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !7, line: 56, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !772, line: 71, size: 1216, elements: !773)
!772 = !DIFile(filename: "./src/htsmodules.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "65f13e42a0265151bd8524490683afa8")
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !787, !788, !789, !790, !791, !795, !799, !800, !801, !802}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !771, file: !772, line: 73, baseType: !235, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !771, file: !772, line: 74, baseType: !21, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mime", scope: !771, file: !772, line: 75, baseType: !235, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "url_host", scope: !771, file: !772, line: 76, baseType: !235, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "url_file", scope: !771, file: !772, line: 77, baseType: !235, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !771, file: !772, line: 80, baseType: !235, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !771, file: !772, line: 81, baseType: !51, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "relativeToHtmlLink", scope: !771, file: !772, line: 84, baseType: !21, size: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "addLink", scope: !771, file: !772, line: 89, baseType: !783, size: 64, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_htsAddLink", file: !772, line: 68, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!21, !769, !51}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "localLink", scope: !771, file: !772, line: 94, baseType: !51, size: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "localLinkSize", scope: !771, file: !772, line: 97, baseType: !21, size: 32, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !771, file: !772, line: 100, baseType: !11, size: 64, offset: 704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !771, file: !772, line: 104, baseType: !22, size: 64, offset: 768)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sback", scope: !771, file: !772, line: 107, baseType: !792, size: 64, offset: 832)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_back", file: !772, line: 48, baseType: !794)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_back", file: !772, line: 48, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !771, file: !772, line: 108, baseType: !796, size: 64, offset: 896)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_back", file: !772, line: 52, baseType: !798)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "cache_back", file: !772, line: 52, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "hashptr", scope: !771, file: !772, line: 109, baseType: !195, size: 64, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "numero_passe", scope: !771, file: !772, line: 110, baseType: !21, size: 32, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_", scope: !771, file: !772, line: 112, baseType: !193, size: 64, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "page_charset_", scope: !771, file: !772, line: 113, baseType: !235, size: 64, offset: 1152)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !51}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESP_STRUCT", file: !808, line: 49, baseType: !809)
!808 = !DIFile(filename: "./src/htsjava.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "3be49aab321da1d79c4c8c8020fc3355")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RESP_STRUCT", file: !808, line: 51, size: 8288, elements: !810)
!810 = !{!811, !812, !813, !814}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "file_position", scope: !809, file: !808, line: 52, baseType: !21, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "index1", scope: !809, file: !808, line: 54, baseType: !437, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !809, file: !808, line: 55, baseType: !437, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !808, line: 56, baseType: !354, size: 8192, offset: 96)
!815 = !{!816, !821, !0, !824, !829, !832, !837, !842, !844, !849, !851, !856, !861, !863, !865, !868, !873, !878, !880, !882, !884, !886, !891, !893, !898, !903, !908, !913, !915, !917, !919}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !3, line: 112, type: !818, isLocal: true, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 56, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 7)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !3, line: 99, type: !823, isLocal: true, isDefinition: true)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !441)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !3, line: 158, type: !826, isLocal: true, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 472, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 59)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !3, line: 175, type: !831, isLocal: true, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32, elements: !465)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !3, line: 177, type: !834, isLocal: true, isDefinition: true)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 184, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 23)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !3, line: 186, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 312, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 39)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !3, line: 199, type: !417, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !3, line: 209, type: !846, isLocal: true, isDefinition: true)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 200, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 25)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !3, line: 232, type: !846, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !3, line: 266, type: !853, isLocal: true, isDefinition: true)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 6)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !3, line: 271, type: !858, isLocal: true, isDefinition: true)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 72, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 9)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !3, line: 299, type: !417, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !3, line: 329, type: !853, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !3, line: 334, type: !867, isLocal: true, isDefinition: true)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !459)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !870, isLocal: true, isDefinition: true)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 136, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 17)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !3, line: 346, type: !875, isLocal: true, isDefinition: true)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 216, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 27)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !3, line: 351, type: !417, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !3, line: 357, type: !818, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !823, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(scope: null, file: !3, line: 368, type: !853, isLocal: true, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !3, line: 374, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 40, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 5)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !3, line: 379, type: !818, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !3, line: 388, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 80, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 10)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !3, line: 390, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 96, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 12)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !3, line: 428, type: !905, isLocal: true, isDefinition: true)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 256, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 32)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !3, line: 438, type: !910, isLocal: true, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 296, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 37)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !3, line: 467, type: !888, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !3, line: 467, type: !888, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !3, line: 468, type: !853, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !3, line: 468, type: !831, isLocal: true, isDefinition: true)
!921 = !{i32 7, !"Dwarf Version", i32 5}
!922 = !{i32 2, !"Debug Info Version", i32 3}
!923 = !{i32 1, !"wchar_size", i32 4}
!924 = !{i32 8, !"PIC Level", i32 2}
!925 = !{i32 7, !"PIE Level", i32 2}
!926 = !{i32 7, !"uwtable", i32 2}
!927 = !{i32 7, !"frame-pointer", i32 2}
!928 = !{!"clang version 16.0.0"}
!929 = distinct !DISubprogram(name: "hts_plug", scope: !3, file: !3, line: 309, type: !930, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !932)
!930 = !DISubroutineType(types: !931)
!931 = !{!21, !22, !235}
!932 = !{}
!933 = !DILocalVariable(name: "opt", arg: 1, scope: !929, file: !3, line: 309, type: !22)
!934 = !DILocation(line: 309, column: 43, scope: !929)
!935 = !DILocalVariable(name: "argv", arg: 2, scope: !929, file: !3, line: 309, type: !235)
!936 = !DILocation(line: 309, column: 60, scope: !929)
!937 = !DILocation(line: 311, column: 3, scope: !929)
!938 = !DILocalVariable(name: "carg", scope: !939, file: !3, line: 311, type: !5)
!939 = distinct !DILexicalBlock(scope: !929, file: !3, line: 311, column: 3)
!940 = !DILocation(line: 311, column: 3, scope: !939)
!941 = !DILocation(line: 312, column: 3, scope: !929)
!942 = !DILocalVariable(name: "carg", scope: !943, file: !3, line: 312, type: !5)
!943 = distinct !DILexicalBlock(scope: !929, file: !3, line: 312, column: 3)
!944 = !DILocation(line: 312, column: 3, scope: !943)
!945 = !DILocation(line: 314, column: 3, scope: !929)
