; ModuleID = 'src/htslib.c'
source_filename = "src/htslib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.t_hts_htmlcheck_callbacks = type { %struct.init, %struct.uninit, %struct.start, %struct.end, %struct.chopt, %struct.preprocess, %struct.postprocess, %struct.check_html, %struct.query, %struct.query2, %struct.query3, %struct.loop, %struct.check_link, %struct.check_mime, %struct.pause, %struct.filesave, %struct.filesave2, %struct.linkdetected, %struct.linkdetected2, %struct.xfrstatus, %struct.savename, %struct.sendhead, %struct.receivehead, %struct.detect, %struct.parse, %struct.extsavename }
%struct.init = type { ptr, ptr }
%struct.uninit = type { ptr, ptr }
%struct.start = type { ptr, ptr }
%struct.end = type { ptr, ptr }
%struct.chopt = type { ptr, ptr }
%struct.preprocess = type { ptr, ptr }
%struct.postprocess = type { ptr, ptr }
%struct.check_html = type { ptr, ptr }
%struct.query = type { ptr, ptr }
%struct.query2 = type { ptr, ptr }
%struct.query3 = type { ptr, ptr }
%struct.loop = type { ptr, ptr }
%struct.check_link = type { ptr, ptr }
%struct.check_mime = type { ptr, ptr }
%struct.pause = type { ptr, ptr }
%struct.filesave = type { ptr, ptr }
%struct.filesave2 = type { ptr, ptr }
%struct.linkdetected = type { ptr, ptr }
%struct.linkdetected2 = type { ptr, ptr }
%struct.xfrstatus = type { ptr, ptr }
%struct.savename = type { ptr, ptr }

!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "htsparsejava_flags", file: !99, line: 276, baseType: !18, size: 32, elements: !100)
!99 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!100 = !{!101, !102, !103, !104, !105}
!101 = !DIEnumerator(name: "HTSPARSE_NONE", value: 0)
!102 = !DIEnumerator(name: "HTSPARSE_DEFAULT", value: 1)
!103 = !DIEnumerator(name: "HTSPARSE_NO_CLASS", value: 2)
!104 = !DIEnumerator(name: "HTSPARSE_NO_JAVASCRIPT", value: 4)
!105 = !DIEnumerator(name: "HTSPARSE_NO_AGGRESSIVE", value: 8)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 40, baseType: !18, size: 32, elements: !108)
!107 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136}
!109 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!110 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!111 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!112 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!113 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!114 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!115 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!116 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!117 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!118 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!119 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!120 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!121 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!122 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!123 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!124 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!125 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!126 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!127 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!128 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!129 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!130 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!131 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!132 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!133 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!134 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!135 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!136 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "coucal_loglevel", file: !138, line: 181, baseType: !18, size: 32, elements: !139)
!138 = !DIFile(filename: "./src/coucal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "62c36e3bcc49ac1175c15c5536712ae6")
!139 = !{!140, !141, !142, !143, !144}
!140 = !DIEnumerator(name: "coucal_log_critical", value: 0)
!141 = !DIEnumerator(name: "coucal_log_warning", value: 1)
!142 = !DIEnumerator(name: "coucal_log_info", value: 2)
!143 = !DIEnumerator(name: "coucal_log_debug", value: 3)
!144 = !DIEnumerator(name: "coucal_log_trace", value: 4)
!145 = !{!146, !147, !152, !7, !155, !157, !1057, !150, !241, !724, !749, !156, !690, !1059, !269, !151, !1062, !457, !569, !1064, !1068, !472, !1072, !166, !185, !191, !610, !616, !622, !632, !638, !647, !656, !662, !668, !882, !891, !900, !909, !915, !924, !933, !942, !951, !960, !970, !1079, !195}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !150}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !153, line: 46, baseType: !154)
!153 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!154 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !159, line: 164, baseType: !160)
!159 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !159, line: 191, size: 3328, elements: !161)
!161 = !{!162, !181, !187, !606, !612, !618, !628, !634, !643, !652, !658, !664, !878, !887, !896, !905, !911, !920, !929, !938, !947, !956, !966, !972, !1045, !1051}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !160, file: !159, line: 193, baseType: !163, size: 128)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !159, line: 193, size: 128, elements: !164)
!164 = !{!165, !180}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !163, file: !159, line: 193, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !159, line: 83, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !159, line: 60, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !159, line: 179, size: 192, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !172, file: !159, line: 181, baseType: !146, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !172, file: !159, line: 187, baseType: !176, size: 128, offset: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !159, line: 184, size: 128, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !176, file: !159, line: 185, baseType: !146, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !176, file: !159, line: 186, baseType: !170, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !163, file: !159, line: 193, baseType: !170, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !160, file: !159, line: 194, baseType: !182, size: 128, offset: 128)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !159, line: 194, size: 128, elements: !183)
!183 = !{!184, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !182, file: !159, line: 194, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !159, line: 84, baseType: !167)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !182, file: !159, line: 194, baseType: !170, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !160, file: !159, line: 195, baseType: !188, size: 128, offset: 256)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !159, line: 195, size: 128, elements: !189)
!189 = !{!190, !605}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !188, file: !159, line: 195, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !159, line: 85, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!7, !170, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !88, line: 49, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !99, line: 294, size: 1133184, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !267, !268, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !285, !286, !287, !288, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !379, !424, !427, !428, !432, !448, !449, !450, !451, !452, !453, !454, !455, !456, !459, !460, !461, !462, !463, !464, !465, !466, !478}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !197, file: !99, line: 295, baseType: !152, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !197, file: !99, line: 297, baseType: !7, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !197, file: !99, line: 298, baseType: !7, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !197, file: !99, line: 299, baseType: !7, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !197, file: !99, line: 300, baseType: !7, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !197, file: !99, line: 301, baseType: !7, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !197, file: !99, line: 302, baseType: !7, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !197, file: !99, line: 303, baseType: !7, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !197, file: !99, line: 304, baseType: !7, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !197, file: !99, line: 305, baseType: !7, size: 32, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !197, file: !99, line: 306, baseType: !7, size: 32, offset: 352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !197, file: !99, line: 307, baseType: !211, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !213, line: 7, baseType: !214)
!213 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !215, line: 49, size: 1728, elements: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !232, !234, !235, !236, !240, !242, !244, !248, !251, !253, !256, !259, !260, !261, !262, !263}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !214, file: !215, line: 51, baseType: !7, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !214, file: !215, line: 54, baseType: !150, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !214, file: !215, line: 55, baseType: !150, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !214, file: !215, line: 56, baseType: !150, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !214, file: !215, line: 57, baseType: !150, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !214, file: !215, line: 58, baseType: !150, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !214, file: !215, line: 59, baseType: !150, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !214, file: !215, line: 60, baseType: !150, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !214, file: !215, line: 61, baseType: !150, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !214, file: !215, line: 64, baseType: !150, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !214, file: !215, line: 65, baseType: !150, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !214, file: !215, line: 66, baseType: !150, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !214, file: !215, line: 68, baseType: !230, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !215, line: 36, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !214, file: !215, line: 70, baseType: !233, size: 64, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !214, file: !215, line: 72, baseType: !7, size: 32, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !214, file: !215, line: 73, baseType: !7, size: 32, offset: 928)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !214, file: !215, line: 74, baseType: !237, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !238, line: 152, baseType: !239)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!239 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !214, file: !215, line: 77, baseType: !241, size: 16, offset: 1024)
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !214, file: !215, line: 78, baseType: !243, size: 8, offset: 1040)
!243 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !214, file: !215, line: 79, baseType: !245, size: 8, offset: 1048)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !214, file: !215, line: 81, baseType: !249, size: 64, offset: 1088)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !215, line: 43, baseType: null)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !214, file: !215, line: 89, baseType: !252, size: 64, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !238, line: 153, baseType: !239)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !214, file: !215, line: 91, baseType: !254, size: 64, offset: 1216)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !215, line: 37, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !214, file: !215, line: 92, baseType: !257, size: 64, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !215, line: 38, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !214, file: !215, line: 93, baseType: !233, size: 64, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !214, file: !215, line: 94, baseType: !146, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !214, file: !215, line: 95, baseType: !152, size: 64, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !214, file: !215, line: 96, baseType: !7, size: 32, offset: 1536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !214, file: !215, line: 98, baseType: !264, size: 160, offset: 1568)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 160, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 20)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !197, file: !99, line: 308, baseType: !211, size: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !197, file: !99, line: 309, baseType: !269, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !270, line: 283, baseType: !239)
!270 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!271 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !197, file: !99, line: 310, baseType: !269, size: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !197, file: !99, line: 311, baseType: !269, size: 64, offset: 640)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !197, file: !99, line: 312, baseType: !7, size: 32, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !197, file: !99, line: 313, baseType: !269, size: 64, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !197, file: !99, line: 314, baseType: !7, size: 32, offset: 832)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !197, file: !99, line: 315, baseType: !7, size: 32, offset: 864)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !197, file: !99, line: 316, baseType: !7, size: 32, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !197, file: !99, line: 317, baseType: !7, size: 32, offset: 928)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !197, file: !99, line: 318, baseType: !7, size: 32, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !197, file: !99, line: 319, baseType: !7, size: 32, offset: 992)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !197, file: !99, line: 320, baseType: !7, size: 32, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !197, file: !99, line: 321, baseType: !7, size: 32, offset: 1056)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !197, file: !99, line: 322, baseType: !284, size: 32, offset: 1088)
!284 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !197, file: !99, line: 323, baseType: !7, size: 32, offset: 1120)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !197, file: !99, line: 324, baseType: !7, size: 32, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !197, file: !99, line: 326, baseType: !7, size: 32, offset: 1184)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !197, file: !99, line: 327, baseType: !289, size: 512, offset: 1216)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !99, line: 89, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !99, line: 91, size: 512, elements: !291)
!291 = !{!292, !293, !301, !302}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !290, file: !99, line: 92, baseType: !7, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !99, line: 93, baseType: !294, size: 192, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !295, line: 57, baseType: !296)
!295 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !295, line: 61, size: 192, elements: !297)
!297 = !{!298, !299, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !296, file: !295, line: 62, baseType: !150, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !296, file: !295, line: 63, baseType: !152, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !296, file: !295, line: 64, baseType: !152, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !290, file: !99, line: 94, baseType: !7, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !290, file: !99, line: 95, baseType: !294, size: 192, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !197, file: !99, line: 328, baseType: !7, size: 32, offset: 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !197, file: !99, line: 329, baseType: !7, size: 32, offset: 1760)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !197, file: !99, line: 330, baseType: !294, size: 192, offset: 1792)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !197, file: !99, line: 331, baseType: !7, size: 32, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !197, file: !99, line: 332, baseType: !7, size: 32, offset: 2016)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !197, file: !99, line: 333, baseType: !7, size: 32, offset: 2048)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !197, file: !99, line: 334, baseType: !7, size: 32, offset: 2080)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !197, file: !99, line: 335, baseType: !294, size: 192, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !197, file: !99, line: 336, baseType: !294, size: 192, offset: 2304)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !197, file: !99, line: 337, baseType: !294, size: 192, offset: 2496)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !197, file: !99, line: 338, baseType: !294, size: 192, offset: 2688)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !197, file: !99, line: 339, baseType: !294, size: 192, offset: 2880)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !197, file: !99, line: 340, baseType: !294, size: 192, offset: 3072)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !197, file: !99, line: 341, baseType: !294, size: 192, offset: 3264)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !197, file: !99, line: 342, baseType: !7, size: 32, offset: 3456)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !197, file: !99, line: 343, baseType: !7, size: 32, offset: 3488)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !197, file: !99, line: 344, baseType: !7, size: 32, offset: 3520)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !197, file: !99, line: 345, baseType: !7, size: 32, offset: 3552)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !197, file: !99, line: 346, baseType: !7, size: 32, offset: 3584)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !197, file: !99, line: 347, baseType: !7, size: 32, offset: 3616)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !197, file: !99, line: 348, baseType: !7, size: 32, offset: 3648)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !197, file: !99, line: 349, baseType: !7, size: 32, offset: 3680)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !197, file: !99, line: 350, baseType: !7, size: 32, offset: 3712)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !197, file: !99, line: 351, baseType: !7, size: 32, offset: 3744)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !197, file: !99, line: 352, baseType: !7, size: 32, offset: 3776)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !197, file: !99, line: 353, baseType: !7, size: 32, offset: 3808)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !197, file: !99, line: 354, baseType: !7, size: 32, offset: 3840)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !197, file: !99, line: 355, baseType: !294, size: 192, offset: 3904)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !197, file: !99, line: 356, baseType: !7, size: 32, offset: 4096)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !197, file: !99, line: 357, baseType: !7, size: 32, offset: 4128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !197, file: !99, line: 358, baseType: !334, size: 64, offset: 4160)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !336, line: 53, baseType: !337)
!336 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !336, line: 55, size: 278656, elements: !338)
!338 = !{!339, !340, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !337, file: !336, line: 56, baseType: !7, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !336, line: 57, baseType: !341, size: 262144, offset: 32)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 262144, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 32768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !337, file: !336, line: 58, baseType: !345, size: 16448, offset: 262208)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !336, line: 42, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !336, line: 44, size: 16448, elements: !347)
!347 = !{!348, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !346, file: !336, line: 45, baseType: !349, size: 8192)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8192, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !346, file: !336, line: 46, baseType: !349, size: 8192, offset: 8192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !336, line: 47, baseType: !354, size: 64, offset: 16384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !197, file: !99, line: 359, baseType: !7, size: 32, offset: 4224)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !197, file: !99, line: 360, baseType: !7, size: 32, offset: 4256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !197, file: !99, line: 361, baseType: !7, size: 32, offset: 4288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !197, file: !99, line: 362, baseType: !7, size: 32, offset: 4320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !197, file: !99, line: 363, baseType: !7, size: 32, offset: 4352)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !197, file: !99, line: 364, baseType: !7, size: 32, offset: 4384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !197, file: !99, line: 365, baseType: !7, size: 32, offset: 4416)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !197, file: !99, line: 366, baseType: !7, size: 32, offset: 4448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !197, file: !99, line: 367, baseType: !7, size: 32, offset: 4480)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !197, file: !99, line: 368, baseType: !7, size: 32, offset: 4512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !197, file: !99, line: 369, baseType: !294, size: 192, offset: 4544)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !197, file: !99, line: 370, baseType: !7, size: 32, offset: 4736)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !197, file: !99, line: 372, baseType: !7, size: 32, offset: 4768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !197, file: !99, line: 373, baseType: !294, size: 192, offset: 4800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !197, file: !99, line: 374, baseType: !294, size: 192, offset: 4992)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !197, file: !99, line: 375, baseType: !371, size: 128, offset: 5184)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !99, line: 101, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !99, line: 103, size: 128, elements: !373)
!373 = !{!374, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !372, file: !99, line: 104, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !372, file: !99, line: 105, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !197, file: !99, line: 376, baseType: !380, size: 64, offset: 5312)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !382, line: 73, baseType: !383)
!382 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !382, line: 202, size: 98624, elements: !384)
!384 = !{!385, !408, !412, !413, !414, !415, !419, !420}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !383, file: !382, line: 204, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !382, line: 57, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !99, line: 534, size: 640, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !393, file: !99, line: 535, baseType: !150, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !393, file: !99, line: 536, baseType: !150, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !393, file: !99, line: 537, baseType: !150, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !393, file: !99, line: 538, baseType: !150, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !393, file: !99, line: 539, baseType: !150, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !393, file: !99, line: 540, baseType: !150, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !393, file: !99, line: 542, baseType: !7, size: 32, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !393, file: !99, line: 543, baseType: !7, size: 32, offset: 416)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !393, file: !99, line: 544, baseType: !7, size: 32, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !393, file: !99, line: 545, baseType: !7, size: 32, offset: 480)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !393, file: !99, line: 546, baseType: !151, size: 8, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !393, file: !99, line: 548, baseType: !7, size: 32, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !393, file: !99, line: 549, baseType: !7, size: 32, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !383, file: !382, line: 206, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !99, line: 210, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !99, line: 210, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !383, file: !382, line: 208, baseType: !409, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !383, file: !382, line: 210, baseType: !409, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !383, file: !382, line: 212, baseType: !7, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !383, file: !382, line: 213, baseType: !416, size: 16384, offset: 288)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 16384, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 2048)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !383, file: !382, line: 214, baseType: !416, size: 16384, offset: 16672)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !383, file: !382, line: 215, baseType: !421, size: 65536, offset: 33056)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 65536, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 8192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !197, file: !99, line: 377, baseType: !425, size: 64, offset: 5376)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !197, file: !99, line: 378, baseType: !7, size: 32, offset: 5440)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !197, file: !99, line: 379, baseType: !429, size: 64, offset: 5504)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !99, line: 286, baseType: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !99, line: 286, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !197, file: !99, line: 380, baseType: !433, size: 64, offset: 5568)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !99, line: 61, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !436, line: 42, size: 33856, elements: !437)
!436 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!437 = !{!438, !442, !446}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !435, file: !436, line: 43, baseType: !439, size: 1024)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 1024, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !435, file: !436, line: 44, baseType: !443, size: 32768, offset: 1024)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32768, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 4096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !436, line: 45, baseType: !447, size: 64, offset: 33792)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !197, file: !99, line: 381, baseType: !294, size: 192, offset: 5632)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !197, file: !99, line: 382, baseType: !294, size: 192, offset: 5824)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !197, file: !99, line: 383, baseType: !294, size: 192, offset: 6016)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !197, file: !99, line: 384, baseType: !294, size: 192, offset: 6208)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !197, file: !99, line: 385, baseType: !294, size: 192, offset: 6400)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !197, file: !99, line: 386, baseType: !7, size: 32, offset: 6592)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !197, file: !99, line: 388, baseType: !7, size: 32, offset: 6624)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !197, file: !99, line: 389, baseType: !7, size: 32, offset: 6656)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !197, file: !99, line: 391, baseType: !457, size: 64, offset: 6720)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !197, file: !99, line: 393, baseType: !7, size: 32, offset: 6784)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !197, file: !99, line: 394, baseType: !7, size: 32, offset: 6816)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !197, file: !99, line: 395, baseType: !7, size: 32, offset: 6848)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !197, file: !99, line: 396, baseType: !7, size: 32, offset: 6880)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !197, file: !99, line: 398, baseType: !7, size: 32, offset: 6912)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !197, file: !99, line: 399, baseType: !7, size: 32, offset: 6944)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !197, file: !99, line: 402, baseType: !157, size: 64, offset: 6976)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !197, file: !99, line: 404, baseType: !467, size: 128, offset: 7040)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !99, line: 260, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !99, line: 270, size: 128, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !468, file: !99, line: 271, baseType: !7, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !468, file: !99, line: 272, baseType: !472, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !99, line: 264, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !99, line: 266, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !474, file: !99, line: 267, baseType: !150, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !474, file: !99, line: 268, baseType: !146, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !197, file: !99, line: 406, baseType: !479, size: 1126016, offset: 7168)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !99, line: 216, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !99, line: 218, size: 1126016, elements: !481)
!481 = !{!482, !518, !519, !520, !521, !522, !523, !524, !525, !531, !543, !552, !558, !565, !566, !567, !568, !582, !583, !587, !588, !589, !590, !591, !592, !593, !594, !601, !602, !603, !604}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !480, file: !99, line: 219, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !99, line: 204, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !486, line: 59, size: 320, elements: !487)
!486 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !485, file: !486, line: 60, baseType: !489, size: 320)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !490, line: 72, baseType: !491)
!490 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !490, line: 67, size: 320, elements: !492)
!492 = !{!493, !513, !517}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !491, file: !490, line: 69, baseType: !494, size: 320)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !495, line: 22, size: 320, elements: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!496 = !{!497, !498, !499, !500, !501, !502, !504, !505}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !494, file: !495, line: 24, baseType: !7, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !494, file: !495, line: 25, baseType: !18, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !494, file: !495, line: 26, baseType: !7, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !494, file: !495, line: 28, baseType: !18, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !494, file: !495, line: 32, baseType: !7, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !494, file: !495, line: 34, baseType: !503, size: 16, offset: 160)
!503 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !494, file: !495, line: 35, baseType: !503, size: 16, offset: 176)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !494, file: !495, line: 36, baseType: !506, size: 128, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !507, line: 55, baseType: !508)
!507 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !507, line: 51, size: 128, elements: !509)
!509 = !{!510, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !508, file: !507, line: 53, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !508, file: !507, line: 54, baseType: !511, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !491, file: !490, line: 70, baseType: !514, size: 320)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 320, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 40)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !491, file: !490, line: 71, baseType: !239, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !480, file: !99, line: 221, baseType: !7, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !480, file: !99, line: 222, baseType: !7, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !480, file: !99, line: 223, baseType: !7, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !480, file: !99, line: 225, baseType: !7, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !480, file: !99, line: 226, baseType: !294, size: 192, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !480, file: !99, line: 227, baseType: !211, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !480, file: !99, line: 228, baseType: !7, size: 32, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !480, file: !99, line: 230, baseType: !526, size: 32832, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !99, line: 121, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !99, line: 123, size: 32832, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !527, file: !99, line: 124, baseType: !211, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !527, file: !99, line: 125, baseType: !443, size: 32768, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !480, file: !99, line: 232, baseType: !532, size: 192, offset: 33344)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !99, line: 111, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !99, line: 112, size: 192, elements: !534)
!534 = !{!535, !536, !541}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !533, file: !99, line: 113, baseType: !146, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !533, file: !99, line: 114, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !99, line: 110, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!7}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !99, line: 115, baseType: !542, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !480, file: !99, line: 233, baseType: !544, size: 1048608, offset: 33536)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !99, line: 131, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !99, line: 133, size: 1048608, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !545, file: !99, line: 134, baseType: !7, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !545, file: !99, line: 135, baseType: !549, size: 1048576, offset: 32)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 1048576, elements: !550)
!550 = !{!551, !423}
!551 = !DISubrange(count: 16)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !480, file: !99, line: 234, baseType: !553, size: 16416, offset: 1082144)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !99, line: 153, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !99, line: 155, size: 16416, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !554, file: !99, line: 156, baseType: !7, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !554, file: !99, line: 157, baseType: !416, size: 16384, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !480, file: !99, line: 235, baseType: !559, size: 96, offset: 1098560)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !99, line: 163, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !99, line: 165, size: 96, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !560, file: !99, line: 166, baseType: !7, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !560, file: !99, line: 167, baseType: !7, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !560, file: !99, line: 168, baseType: !7, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !480, file: !99, line: 236, baseType: !150, size: 64, offset: 1098688)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !480, file: !99, line: 237, baseType: !7, size: 32, offset: 1098752)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !480, file: !99, line: 238, baseType: !7, size: 32, offset: 1098784)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !480, file: !99, line: 239, baseType: !569, size: 64, offset: 1098816)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !571, line: 51, baseType: !572)
!571 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !571, line: 150, size: 704, elements: !573)
!573 = !{!574, !576, !577, !578}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !572, file: !571, line: 151, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !572, file: !571, line: 152, baseType: !457, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !572, file: !571, line: 153, baseType: !152, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !572, file: !571, line: 154, baseType: !579, size: 512, offset: 192)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 512, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !480, file: !99, line: 240, baseType: !7, size: 32, offset: 1098880)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !480, file: !99, line: 242, baseType: !584, size: 10240, offset: 1098912)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 10240, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !480, file: !99, line: 243, baseType: !7, size: 32, offset: 1109152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !480, file: !99, line: 244, baseType: !7, size: 32, offset: 1109184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !480, file: !99, line: 245, baseType: !7, size: 32, offset: 1109216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !480, file: !99, line: 246, baseType: !7, size: 32, offset: 1109248)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !480, file: !99, line: 247, baseType: !7, size: 32, offset: 1109280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !480, file: !99, line: 248, baseType: !376, size: 64, offset: 1109312)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !480, file: !99, line: 249, baseType: !7, size: 32, offset: 1109376)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !480, file: !99, line: 250, baseType: !595, size: 64, offset: 1109440)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !99, line: 194, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !99, line: 196, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !597, file: !99, line: 197, baseType: !150, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !597, file: !99, line: 198, baseType: !595, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !480, file: !99, line: 251, baseType: !416, size: 16384, offset: 1109504)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !480, file: !99, line: 252, baseType: !18, size: 32, offset: 1125888)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !480, file: !99, line: 253, baseType: !18, size: 32, offset: 1125920)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !480, file: !99, line: 254, baseType: !7, size: 32, offset: 1125952)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !188, file: !159, line: 195, baseType: !170, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !160, file: !159, line: 196, baseType: !607, size: 128, offset: 384)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !159, line: 196, size: 128, elements: !608)
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !607, file: !159, line: 196, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !159, line: 86, baseType: !192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !607, file: !159, line: 196, baseType: !170, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !160, file: !159, line: 197, baseType: !613, size: 128, offset: 512)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !159, line: 197, size: 128, elements: !614)
!614 = !{!615, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !613, file: !159, line: 197, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !159, line: 87, baseType: !192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !613, file: !159, line: 197, baseType: !170, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !160, file: !159, line: 198, baseType: !619, size: 128, offset: 640)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !159, line: 198, size: 128, elements: !620)
!620 = !{!621, !627}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !619, file: !159, line: 198, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !159, line: 92, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !159, line: 88, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!7, !170, !195, !376, !378, !457, !457}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !619, file: !159, line: 198, baseType: !170, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !160, file: !159, line: 199, baseType: !629, size: 128, offset: 768)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !159, line: 199, size: 128, elements: !630)
!630 = !{!631, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !629, file: !159, line: 199, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !159, line: 93, baseType: !623)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !629, file: !159, line: 199, baseType: !170, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !160, file: !159, line: 200, baseType: !635, size: 128, offset: 896)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !159, line: 200, size: 128, elements: !636)
!636 = !{!637, !642}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !635, file: !159, line: 200, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !159, line: 94, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!7, !170, !195, !150, !7, !457, !457}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !635, file: !159, line: 200, baseType: !170, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !160, file: !159, line: 201, baseType: !644, size: 128, offset: 1024)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !159, line: 201, size: 128, elements: !645)
!645 = !{!646, !651}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !644, file: !159, line: 201, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !159, line: 98, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!457, !170, !195, !457}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !644, file: !159, line: 201, baseType: !170, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !160, file: !159, line: 202, baseType: !653, size: 128, offset: 1152)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !159, line: 202, size: 128, elements: !654)
!654 = !{!655, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !653, file: !159, line: 202, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !159, line: 101, baseType: !648)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !653, file: !159, line: 202, baseType: !170, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !160, file: !159, line: 203, baseType: !659, size: 128, offset: 1280)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !159, line: 203, size: 128, elements: !660)
!660 = !{!661, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !659, file: !159, line: 203, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !159, line: 104, baseType: !648)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !659, file: !159, line: 203, baseType: !170, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !160, file: !159, line: 204, baseType: !665, size: 128, offset: 1408)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !159, line: 204, size: 128, elements: !666)
!666 = !{!667, !877}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !665, file: !159, line: 204, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !159, line: 107, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!7, !170, !195, !672, !7, !7, !7, !7, !7, !844}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !382, line: 61, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !99, line: 557, size: 135040, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !691, !692, !693, !694, !695, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !674, file: !99, line: 561, baseType: !416, size: 16384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !674, file: !99, line: 562, baseType: !416, size: 16384, offset: 16384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !674, file: !99, line: 563, baseType: !416, size: 16384, offset: 32768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !674, file: !99, line: 564, baseType: !416, size: 16384, offset: 49152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !674, file: !99, line: 565, baseType: !416, size: 16384, offset: 65536)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !674, file: !99, line: 566, baseType: !416, size: 16384, offset: 81920)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !674, file: !99, line: 567, baseType: !150, size: 64, offset: 98304)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !674, file: !99, line: 568, baseType: !416, size: 16384, offset: 98368)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !674, file: !99, line: 569, baseType: !349, size: 8192, offset: 114752)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !674, file: !99, line: 570, baseType: !7, size: 32, offset: 122944)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !674, file: !99, line: 571, baseType: !7, size: 32, offset: 122976)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !674, file: !99, line: 572, baseType: !7, size: 32, offset: 123008)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !674, file: !99, line: 573, baseType: !7, size: 32, offset: 123040)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !674, file: !99, line: 574, baseType: !690, size: 64, offset: 123072)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !270, line: 284, baseType: !239)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !674, file: !99, line: 575, baseType: !7, size: 32, offset: 123136)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !674, file: !99, line: 576, baseType: !690, size: 64, offset: 123200)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !674, file: !99, line: 577, baseType: !269, size: 64, offset: 123264)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !674, file: !99, line: 578, baseType: !269, size: 64, offset: 123328)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !674, file: !99, line: 579, baseType: !696, size: 8960, offset: 123392)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !571, line: 47, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !99, line: 486, size: 8960, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !717, !718, !719, !720, !721, !722, !723, !725, !788, !789, !790, !791, !796, !797, !801, !802, !803, !804, !805, !806}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !697, file: !99, line: 487, baseType: !7, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !697, file: !99, line: 488, baseType: !503, size: 16, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !697, file: !99, line: 489, baseType: !503, size: 16, offset: 48)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !697, file: !99, line: 490, baseType: !503, size: 16, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !697, file: !99, line: 491, baseType: !503, size: 16, offset: 80)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !697, file: !99, line: 492, baseType: !503, size: 16, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !697, file: !99, line: 493, baseType: !503, size: 16, offset: 112)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !697, file: !99, line: 494, baseType: !503, size: 16, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !697, file: !99, line: 495, baseType: !7, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !697, file: !99, line: 496, baseType: !7, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !697, file: !99, line: 497, baseType: !150, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !697, file: !99, line: 498, baseType: !150, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !697, file: !99, line: 499, baseType: !211, size: 64, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !697, file: !99, line: 500, baseType: !269, size: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !697, file: !99, line: 501, baseType: !714, size: 640, offset: 512)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 640, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 80)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !697, file: !99, line: 502, baseType: !579, size: 512, offset: 1152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !697, file: !99, line: 503, baseType: !579, size: 512, offset: 1664)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !697, file: !99, line: 504, baseType: !579, size: 512, offset: 2176)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !697, file: !99, line: 505, baseType: !150, size: 64, offset: 2688)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !697, file: !99, line: 506, baseType: !269, size: 64, offset: 2752)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !697, file: !99, line: 507, baseType: !503, size: 16, offset: 2816)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !697, file: !99, line: 508, baseType: !724, size: 32, offset: 2848)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !270, line: 323, baseType: !7)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !697, file: !99, line: 509, baseType: !726, size: 224, offset: 2880)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !727, line: 91, baseType: !728)
!727 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !727, line: 93, size: 224, elements: !729)
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !728, file: !727, line: 103, baseType: !731, size: 224)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !728, file: !727, line: 94, size: 224, elements: !732)
!732 = !{!733, !744, !764}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !731, file: !727, line: 96, baseType: !734, size: 128)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !735, line: 180, size: 128, elements: !736)
!735 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!736 = !{!737, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !734, file: !735, line: 182, baseType: !738, size: 16)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !739, line: 28, baseType: !241)
!739 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !734, file: !735, line: 183, baseType: !741, size: 112, offset: 16)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 112, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 14)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !731, file: !727, line: 98, baseType: !745, size: 128)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !107, line: 245, size: 128, elements: !746)
!746 = !{!747, !748, !753, !760}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !745, file: !107, line: 247, baseType: !738, size: 16)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !745, file: !107, line: 248, baseType: !749, size: 16, offset: 16)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !107, line: 123, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !751, line: 25, baseType: !752)
!751 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !238, line: 40, baseType: !241)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !745, file: !107, line: 249, baseType: !754, size: 32, offset: 32)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !107, line: 31, size: 32, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !754, file: !107, line: 33, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !107, line: 30, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !751, line: 26, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !238, line: 42, baseType: !18)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !745, file: !107, line: 252, baseType: !761, size: 64, offset: 64)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 64, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !731, file: !727, line: 101, baseType: !765, size: 224)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !107, line: 260, size: 224, elements: !766)
!766 = !{!767, !768, !769, !770, !787}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !765, file: !107, line: 262, baseType: !738, size: 16)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !765, file: !107, line: 263, baseType: !749, size: 16, offset: 16)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !765, file: !107, line: 264, baseType: !758, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !765, file: !107, line: 265, baseType: !771, size: 128, offset: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !107, line: 219, size: 128, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !771, file: !107, line: 226, baseType: !774, size: 128)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !771, file: !107, line: 221, size: 128, elements: !775)
!775 = !{!776, !781, !783}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !774, file: !107, line: 223, baseType: !777, size: 128)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 128, elements: !780)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !751, line: 24, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !238, line: 38, baseType: !156)
!780 = !{!551}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !774, file: !107, line: 224, baseType: !782, size: 128)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 128, elements: !762)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !774, file: !107, line: 225, baseType: !784, size: 128)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 128, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 4)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !765, file: !107, line: 266, baseType: !758, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !697, file: !99, line: 510, baseType: !7, size: 32, offset: 3104)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !697, file: !99, line: 511, baseType: !211, size: 64, offset: 3136)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !697, file: !99, line: 513, baseType: !503, size: 16, offset: 3200)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !697, file: !99, line: 515, baseType: !792, size: 64, offset: 3264)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !794, line: 184, baseType: !795)
!794 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !794, line: 184, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !697, file: !99, line: 517, baseType: !579, size: 512, offset: 3328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !697, file: !99, line: 518, baseType: !798, size: 2048, offset: 3840)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 2048, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !697, file: !99, line: 519, baseType: !798, size: 2048, offset: 5888)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !697, file: !99, line: 520, baseType: !269, size: 64, offset: 7936)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !697, file: !99, line: 521, baseType: !269, size: 64, offset: 8000)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !697, file: !99, line: 522, baseType: !269, size: 64, offset: 8064)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !697, file: !99, line: 523, baseType: !7, size: 32, offset: 8128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !697, file: !99, line: 525, baseType: !807, size: 768, offset: 8192)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !571, line: 43, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !99, line: 465, size: 768, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !808, file: !99, line: 466, baseType: !503, size: 16)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !808, file: !99, line: 467, baseType: !503, size: 16, offset: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !808, file: !99, line: 468, baseType: !503, size: 16, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !808, file: !99, line: 469, baseType: !503, size: 16, offset: 48)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !808, file: !99, line: 470, baseType: !503, size: 16, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !808, file: !99, line: 471, baseType: !503, size: 16, offset: 80)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !808, file: !99, line: 472, baseType: !457, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !808, file: !99, line: 473, baseType: !457, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !808, file: !99, line: 474, baseType: !457, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !808, file: !99, line: 475, baseType: !457, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !808, file: !99, line: 476, baseType: !457, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !808, file: !99, line: 477, baseType: !457, size: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !808, file: !99, line: 478, baseType: !823, size: 256, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !99, line: 452, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !99, line: 454, size: 256, elements: !825)
!825 = !{!826, !827, !828, !829}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !824, file: !99, line: 455, baseType: !7, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !99, line: 456, baseType: !457, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !824, file: !99, line: 457, baseType: !7, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !824, file: !99, line: 458, baseType: !457, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !674, file: !99, line: 580, baseType: !7, size: 32, offset: 132352)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !674, file: !99, line: 581, baseType: !7, size: 32, offset: 132384)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !674, file: !99, line: 582, baseType: !269, size: 64, offset: 132416)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !674, file: !99, line: 583, baseType: !690, size: 64, offset: 132480)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !674, file: !99, line: 585, baseType: !7, size: 32, offset: 132544)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !674, file: !99, line: 586, baseType: !7, size: 32, offset: 132576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !674, file: !99, line: 587, baseType: !150, size: 64, offset: 132608)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !674, file: !99, line: 588, baseType: !269, size: 64, offset: 132672)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !674, file: !99, line: 589, baseType: !269, size: 64, offset: 132736)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !674, file: !99, line: 590, baseType: !269, size: 64, offset: 132800)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !674, file: !99, line: 594, baseType: !798, size: 2048, offset: 132864)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !674, file: !99, line: 595, baseType: !7, size: 32, offset: 134912)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !674, file: !99, line: 596, baseType: !7, size: 32, offset: 134944)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !674, file: !99, line: 597, baseType: !7, size: 32, offset: 134976)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !88, line: 70, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !99, line: 414, size: 1344, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !858, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !846, file: !99, line: 415, baseType: !269, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !846, file: !99, line: 416, baseType: !269, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !846, file: !99, line: 418, baseType: !690, size: 64, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !846, file: !99, line: 420, baseType: !269, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !846, file: !99, line: 421, baseType: !269, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !846, file: !99, line: 422, baseType: !7, size: 32, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !846, file: !99, line: 424, baseType: !855, size: 128, offset: 384)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 128, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 2)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !846, file: !99, line: 425, baseType: !859, size: 128, offset: 512)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 128, elements: !856)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !846, file: !99, line: 426, baseType: !690, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !846, file: !99, line: 427, baseType: !7, size: 32, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !846, file: !99, line: 429, baseType: !7, size: 32, offset: 736)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !846, file: !99, line: 430, baseType: !7, size: 32, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !846, file: !99, line: 431, baseType: !7, size: 32, offset: 800)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !846, file: !99, line: 433, baseType: !7, size: 32, offset: 832)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !846, file: !99, line: 434, baseType: !7, size: 32, offset: 864)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !846, file: !99, line: 435, baseType: !7, size: 32, offset: 896)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !846, file: !99, line: 436, baseType: !7, size: 32, offset: 928)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !846, file: !99, line: 437, baseType: !7, size: 32, offset: 960)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !846, file: !99, line: 438, baseType: !7, size: 32, offset: 992)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !846, file: !99, line: 439, baseType: !7, size: 32, offset: 1024)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !846, file: !99, line: 440, baseType: !7, size: 32, offset: 1056)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !846, file: !99, line: 441, baseType: !269, size: 64, offset: 1088)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !846, file: !99, line: 443, baseType: !269, size: 64, offset: 1152)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !846, file: !99, line: 445, baseType: !690, size: 64, offset: 1216)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !846, file: !99, line: 446, baseType: !690, size: 64, offset: 1280)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !665, file: !159, line: 204, baseType: !170, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !160, file: !159, line: 205, baseType: !879, size: 128, offset: 1536)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !159, line: 205, size: 128, elements: !880)
!880 = !{!881, !886}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !879, file: !159, line: 205, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !159, line: 112, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!7, !170, !195, !457, !457, !7}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !879, file: !159, line: 205, baseType: !170, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !160, file: !159, line: 206, baseType: !888, size: 128, offset: 1664)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !159, line: 206, size: 128, elements: !889)
!889 = !{!890, !895}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !888, file: !159, line: 206, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !159, line: 115, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!7, !170, !195, !457, !457, !457, !7}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !888, file: !159, line: 206, baseType: !170, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !160, file: !159, line: 207, baseType: !897, size: 128, offset: 1792)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !159, line: 207, size: 128, elements: !898)
!898 = !{!899, !904}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !897, file: !159, line: 207, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !159, line: 119, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !170, !195, !457}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !897, file: !159, line: 207, baseType: !170, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !160, file: !159, line: 208, baseType: !906, size: 128, offset: 1920)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !159, line: 208, size: 128, elements: !907)
!907 = !{!908, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !906, file: !159, line: 208, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !159, line: 121, baseType: !901)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !906, file: !159, line: 208, baseType: !170, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !160, file: !159, line: 209, baseType: !912, size: 128, offset: 2048)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !159, line: 209, size: 128, elements: !913)
!913 = !{!914, !919}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !912, file: !159, line: 209, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !159, line: 123, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !170, !195, !457, !457, !457, !7, !7, !7}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !912, file: !159, line: 209, baseType: !170, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !160, file: !159, line: 210, baseType: !921, size: 128, offset: 2176)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !159, line: 210, size: 128, elements: !922)
!922 = !{!923, !928}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !921, file: !159, line: 210, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !159, line: 128, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!7, !170, !195, !150}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !921, file: !159, line: 210, baseType: !170, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !160, file: !159, line: 211, baseType: !930, size: 128, offset: 2304)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !159, line: 211, size: 128, elements: !931)
!931 = !{!932, !937}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !930, file: !159, line: 211, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !159, line: 130, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!7, !170, !195, !150, !457}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !930, file: !159, line: 211, baseType: !170, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !160, file: !159, line: 212, baseType: !939, size: 128, offset: 2432)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !159, line: 212, size: 128, elements: !940)
!940 = !{!941, !946}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !939, file: !159, line: 212, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !159, line: 133, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!7, !170, !195, !672}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !939, file: !159, line: 212, baseType: !170, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !160, file: !159, line: 213, baseType: !948, size: 128, offset: 2560)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !159, line: 213, size: 128, elements: !949)
!949 = !{!950, !955}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !948, file: !159, line: 213, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !159, line: 135, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!7, !170, !195, !457, !457, !457, !457, !150}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !948, file: !159, line: 213, baseType: !170, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !160, file: !159, line: 214, baseType: !957, size: 128, offset: 2688)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !159, line: 214, size: 128, elements: !958)
!958 = !{!959, !965}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !957, file: !159, line: 214, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !159, line: 142, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!7, !170, !195, !150, !457, !457, !457, !457, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !957, file: !159, line: 214, baseType: !170, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !160, file: !159, line: 215, baseType: !967, size: 128, offset: 2816)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !159, line: 215, size: 128, elements: !968)
!968 = !{!969, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !967, file: !159, line: 215, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !159, line: 148, baseType: !961)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !967, file: !159, line: 215, baseType: !170, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !160, file: !159, line: 216, baseType: !973, size: 128, offset: 2944)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !159, line: 216, size: 128, elements: !974)
!974 = !{!975, !1044}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !973, file: !159, line: 216, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !159, line: 156, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!7, !170, !195, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !159, line: 56, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !983, line: 71, size: 1216, elements: !984)
!983 = !DIFile(filename: "./src/htsmodules.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "65f13e42a0265151bd8524490683afa8")
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !998, !999, !1000, !1001, !1002, !1011, !1040, !1041, !1042, !1043}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !982, file: !983, line: 73, baseType: !457, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !982, file: !983, line: 74, baseType: !7, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "mime", scope: !982, file: !983, line: 75, baseType: !457, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "url_host", scope: !982, file: !983, line: 76, baseType: !457, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "url_file", scope: !982, file: !983, line: 77, baseType: !457, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !982, file: !983, line: 80, baseType: !457, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !982, file: !983, line: 81, baseType: !150, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "relativeToHtmlLink", scope: !982, file: !983, line: 84, baseType: !7, size: 32, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "addLink", scope: !982, file: !983, line: 89, baseType: !994, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_htsAddLink", file: !983, line: 68, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!7, !980, !150}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "localLink", scope: !982, file: !983, line: 94, baseType: !150, size: 64, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "localLinkSize", scope: !982, file: !983, line: 97, baseType: !7, size: 32, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !982, file: !983, line: 100, baseType: !146, size: 64, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !982, file: !983, line: 104, baseType: !195, size: 64, offset: 768)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sback", scope: !982, file: !983, line: 107, baseType: !1003, size: 64, offset: 832)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_back", file: !382, line: 65, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_back", file: !382, line: 156, size: 256, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lnk", scope: !1005, file: !382, line: 157, baseType: !672, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1005, file: !382, line: 158, baseType: !7, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !1005, file: !382, line: 159, baseType: !409, size: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ready_size_bytes", scope: !1005, file: !382, line: 160, baseType: !269, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !982, file: !983, line: 108, baseType: !1012, size: 64, offset: 896)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_back", file: !382, line: 69, baseType: !1014)
