; ModuleID = 'src/htsname.c'
source_filename = "src/htsname.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.hts_stat_struct = type { i64, i64, i64, i64, i64, i32, [2 x i64], [2 x i64], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i64 }
%struct.t_hts_htmlcheck_callbacks = type { %struct.init, %struct.uninit, %struct.start, %struct.end, %struct.chopt, %struct.preprocess, %struct.postprocess, %struct.check_html, %struct.query, %struct.query2, %struct.query3, %struct.loop, %struct.check_link, %struct.check_mime, %struct.pause, %struct.filesave, %struct.filesave2, %struct.linkdetected, %struct.linkdetected2, %struct.xfrstatus, %struct.savename, %struct.sendhead, %struct.receivehead, %struct.detect, %struct.parse, %struct.extsavename }
%struct.init = type { ptr, ptr }
%struct.uninit = type { ptr, ptr }
%struct.start = type { ptr, ptr }
%struct.end = type { ptr, ptr }
%struct.chopt = type { ptr, ptr }
%struct.preprocess = type { ptr, ptr }
%struct.postprocess = type { ptr, ptr }
%struct.check_html = type { ptr, ptr }
%struct.query = type { ptr, ptr }
%struct.query2 = type { ptr, ptr }
%struct.query3 = type { ptr, ptr }
%struct.loop = type { ptr, ptr }
%struct.check_link = type { ptr, ptr }
%struct.check_mime = type { ptr, ptr }
%struct.pause = type { ptr, ptr }
%struct.filesave = type { ptr, ptr }
%struct.filesave2 = type { ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "protocol_str", scope: !2, file: !3, line: 164, type: !1366, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "url_savename", scope: !3, file: !3, line: 142, type: !4, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !909, retainedNodes: !1365)
!3 = !DIFile(filename: "src/htsname.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "d911fe3c0324a41bacd7c9a142e076bc")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !25, !27, !27, !29, !871, !879, !221, !6, !6, !907}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_adrfilsave", file: !10, line: 59, baseType: !11)
!10 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_adrfilsave", file: !12, line: 147, size: 49152, elements: !13)
!12 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!13 = !{!14, !24}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !11, file: !12, line: 148, baseType: !15, size: 32768)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_adrfil", file: !10, line: 55, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_adrfil", file: !12, line: 137, size: 32768, elements: !17)
!17 = !{!18, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !16, file: !12, line: 138, baseType: !19, size: 16384)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 16384, elements: !21)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !{!22}
!22 = !DISubrange(count: 2048)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !16, file: !12, line: 139, baseType: !19, size: 16384, offset: 16384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "save", scope: !11, file: !12, line: 149, baseType: !19, size: 16384, offset: 32768)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !31, line: 49, baseType: !32)
!31 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !33, line: 294, size: 1133184, elements: !34)
!33 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!34 = !{!35, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !108, !109, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !126, !127, !128, !129, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !220, !261, !264, !265, !269, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !738, !750}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !32, file: !33, line: 295, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 46, baseType: !38)
!37 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !32, file: !33, line: 297, baseType: !6, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !32, file: !33, line: 298, baseType: !6, size: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !32, file: !33, line: 299, baseType: !6, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !32, file: !33, line: 300, baseType: !6, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !32, file: !33, line: 301, baseType: !6, size: 32, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !32, file: !33, line: 302, baseType: !6, size: 32, offset: 224)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !32, file: !33, line: 303, baseType: !6, size: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !32, file: !33, line: 304, baseType: !6, size: 32, offset: 288)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !32, file: !33, line: 305, baseType: !6, size: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !32, file: !33, line: 306, baseType: !6, size: 32, offset: 352)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !32, file: !33, line: 307, baseType: !50, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !52, line: 7, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !72, !74, !75, !76, !80, !82, !84, !88, !91, !93, !96, !99, !100, !102, !103, !104}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 51, baseType: !6, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 54, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 55, baseType: !58, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 56, baseType: !58, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 57, baseType: !58, size: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 58, baseType: !58, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 59, baseType: !58, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 60, baseType: !58, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 61, baseType: !58, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 64, baseType: !58, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 65, baseType: !58, size: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 66, baseType: !58, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 68, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 36, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 70, baseType: !73, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 74, baseType: !77, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !78, line: 152, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!79 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 77, baseType: !81, size: 16, offset: 1024)
!81 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 78, baseType: !83, size: 8, offset: 1040)
!83 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 79, baseType: !85, size: 8, offset: 1048)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 81, baseType: !89, size: 64, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 43, baseType: null)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 89, baseType: !92, size: 64, offset: 1152)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !78, line: 153, baseType: !79)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !53, file: !54, line: 91, baseType: !94, size: 64, offset: 1216)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !54, line: 37, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !53, file: !54, line: 92, baseType: !97, size: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !54, line: 38, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !53, file: !54, line: 93, baseType: !73, size: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !53, file: !54, line: 94, baseType: !101, size: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 95, baseType: !36, size: 64, offset: 1472)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 98, baseType: !105, size: 160, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !32, file: !33, line: 308, baseType: !50, size: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !32, file: !33, line: 309, baseType: !110, size: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !111, line: 283, baseType: !79)
!111 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !32, file: !33, line: 310, baseType: !110, size: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !32, file: !33, line: 311, baseType: !110, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !32, file: !33, line: 312, baseType: !6, size: 32, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !32, file: !33, line: 313, baseType: !110, size: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !32, file: !33, line: 314, baseType: !6, size: 32, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !32, file: !33, line: 315, baseType: !6, size: 32, offset: 864)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !32, file: !33, line: 316, baseType: !6, size: 32, offset: 896)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !32, file: !33, line: 317, baseType: !6, size: 32, offset: 928)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !32, file: !33, line: 318, baseType: !6, size: 32, offset: 960)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !32, file: !33, line: 319, baseType: !6, size: 32, offset: 992)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !32, file: !33, line: 320, baseType: !6, size: 32, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !32, file: !33, line: 321, baseType: !6, size: 32, offset: 1056)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !32, file: !33, line: 322, baseType: !125, size: 32, offset: 1088)
!125 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !32, file: !33, line: 323, baseType: !6, size: 32, offset: 1120)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !32, file: !33, line: 324, baseType: !6, size: 32, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !32, file: !33, line: 326, baseType: !6, size: 32, offset: 1184)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !32, file: !33, line: 327, baseType: !130, size: 512, offset: 1216)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !33, line: 89, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !33, line: 91, size: 512, elements: !132)
!132 = !{!133, !134, !142, !143}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !131, file: !33, line: 92, baseType: !6, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !33, line: 93, baseType: !135, size: 192, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !136, line: 57, baseType: !137)
!136 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !136, line: 61, size: 192, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !137, file: !136, line: 62, baseType: !58, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !137, file: !136, line: 63, baseType: !36, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !137, file: !136, line: 64, baseType: !36, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !131, file: !33, line: 94, baseType: !6, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !131, file: !33, line: 95, baseType: !135, size: 192, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !32, file: !33, line: 328, baseType: !6, size: 32, offset: 1728)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !32, file: !33, line: 329, baseType: !6, size: 32, offset: 1760)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !32, file: !33, line: 330, baseType: !135, size: 192, offset: 1792)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !32, file: !33, line: 331, baseType: !6, size: 32, offset: 1984)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !32, file: !33, line: 332, baseType: !6, size: 32, offset: 2016)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !32, file: !33, line: 333, baseType: !6, size: 32, offset: 2048)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !32, file: !33, line: 334, baseType: !6, size: 32, offset: 2080)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !32, file: !33, line: 335, baseType: !135, size: 192, offset: 2112)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !32, file: !33, line: 336, baseType: !135, size: 192, offset: 2304)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !32, file: !33, line: 337, baseType: !135, size: 192, offset: 2496)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !32, file: !33, line: 338, baseType: !135, size: 192, offset: 2688)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !32, file: !33, line: 339, baseType: !135, size: 192, offset: 2880)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !32, file: !33, line: 340, baseType: !135, size: 192, offset: 3072)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !32, file: !33, line: 341, baseType: !135, size: 192, offset: 3264)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !32, file: !33, line: 342, baseType: !6, size: 32, offset: 3456)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !32, file: !33, line: 343, baseType: !6, size: 32, offset: 3488)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !32, file: !33, line: 344, baseType: !6, size: 32, offset: 3520)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !32, file: !33, line: 345, baseType: !6, size: 32, offset: 3552)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !32, file: !33, line: 346, baseType: !6, size: 32, offset: 3584)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !32, file: !33, line: 347, baseType: !6, size: 32, offset: 3616)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !32, file: !33, line: 348, baseType: !6, size: 32, offset: 3648)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !32, file: !33, line: 349, baseType: !6, size: 32, offset: 3680)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !32, file: !33, line: 350, baseType: !6, size: 32, offset: 3712)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !32, file: !33, line: 351, baseType: !6, size: 32, offset: 3744)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !32, file: !33, line: 352, baseType: !6, size: 32, offset: 3776)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !32, file: !33, line: 353, baseType: !6, size: 32, offset: 3808)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !32, file: !33, line: 354, baseType: !6, size: 32, offset: 3840)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !32, file: !33, line: 355, baseType: !135, size: 192, offset: 3904)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !32, file: !33, line: 356, baseType: !6, size: 32, offset: 4096)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !32, file: !33, line: 357, baseType: !6, size: 32, offset: 4128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !32, file: !33, line: 358, baseType: !175, size: 64, offset: 4160)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !177, line: 53, baseType: !178)
!177 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !177, line: 55, size: 278656, elements: !179)
!179 = !{!180, !181, !185}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !178, file: !177, line: 56, baseType: !6, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !177, line: 57, baseType: !182, size: 262144, offset: 32)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 262144, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 32768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !178, file: !177, line: 58, baseType: !186, size: 16448, offset: 262208)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !177, line: 42, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !177, line: 44, size: 16448, elements: !188)
!188 = !{!189, !193, !194}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !187, file: !177, line: 45, baseType: !190, size: 8192)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 1024)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !187, file: !177, line: 46, baseType: !190, size: 8192, offset: 8192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !177, line: 47, baseType: !195, size: 64, offset: 16384)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !32, file: !33, line: 359, baseType: !6, size: 32, offset: 4224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !32, file: !33, line: 360, baseType: !6, size: 32, offset: 4256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !32, file: !33, line: 361, baseType: !6, size: 32, offset: 4288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !32, file: !33, line: 362, baseType: !6, size: 32, offset: 4320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !32, file: !33, line: 363, baseType: !6, size: 32, offset: 4352)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !32, file: !33, line: 364, baseType: !6, size: 32, offset: 4384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !32, file: !33, line: 365, baseType: !6, size: 32, offset: 4416)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !32, file: !33, line: 366, baseType: !6, size: 32, offset: 4448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !32, file: !33, line: 367, baseType: !6, size: 32, offset: 4480)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !32, file: !33, line: 368, baseType: !6, size: 32, offset: 4512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !32, file: !33, line: 369, baseType: !135, size: 192, offset: 4544)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !32, file: !33, line: 370, baseType: !6, size: 32, offset: 4736)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !32, file: !33, line: 372, baseType: !6, size: 32, offset: 4768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !32, file: !33, line: 373, baseType: !135, size: 192, offset: 4800)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !32, file: !33, line: 374, baseType: !135, size: 192, offset: 4992)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !32, file: !33, line: 375, baseType: !212, size: 128, offset: 5184)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !33, line: 101, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !33, line: 103, size: 128, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !213, file: !33, line: 104, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !213, file: !33, line: 105, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !32, file: !33, line: 376, baseType: !221, size: 64, offset: 5312)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !12, line: 73, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !12, line: 202, size: 98624, elements: !224)
!224 = !{!225, !248, !252, !253, !254, !255, !256, !257}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !223, file: !12, line: 204, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !12, line: 57, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !33, line: 534, size: 640, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !233, file: !33, line: 535, baseType: !58, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !233, file: !33, line: 536, baseType: !58, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !233, file: !33, line: 537, baseType: !58, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !233, file: !33, line: 538, baseType: !58, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !233, file: !33, line: 539, baseType: !58, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !233, file: !33, line: 540, baseType: !58, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !233, file: !33, line: 542, baseType: !6, size: 32, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !233, file: !33, line: 543, baseType: !6, size: 32, offset: 416)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !233, file: !33, line: 544, baseType: !6, size: 32, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !233, file: !33, line: 545, baseType: !6, size: 32, offset: 480)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !233, file: !33, line: 546, baseType: !20, size: 8, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !233, file: !33, line: 548, baseType: !6, size: 32, offset: 544)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !233, file: !33, line: 549, baseType: !6, size: 32, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !223, file: !12, line: 206, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !33, line: 210, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !33, line: 210, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !223, file: !12, line: 208, baseType: !249, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !223, file: !12, line: 210, baseType: !249, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !223, file: !12, line: 212, baseType: !6, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !223, file: !12, line: 213, baseType: !19, size: 16384, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !223, file: !12, line: 214, baseType: !19, size: 16384, offset: 16672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !223, file: !12, line: 215, baseType: !258, size: 65536, offset: 33056)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 65536, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 8192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !32, file: !33, line: 377, baseType: !262, size: 64, offset: 5376)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !32, file: !33, line: 378, baseType: !6, size: 32, offset: 5440)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !32, file: !33, line: 379, baseType: !266, size: 64, offset: 5504)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !33, line: 286, baseType: !268)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !33, line: 286, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !32, file: !33, line: 380, baseType: !270, size: 64, offset: 5568)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !33, line: 61, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !273, line: 42, size: 33856, elements: !274)
!273 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!274 = !{!275, !279, !283}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !272, file: !273, line: 43, baseType: !276, size: 1024)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !272, file: !273, line: 44, baseType: !280, size: 32768, offset: 1024)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32768, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 4096)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !273, line: 45, baseType: !284, size: 64, offset: 33792)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !32, file: !33, line: 381, baseType: !135, size: 192, offset: 5632)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !32, file: !33, line: 382, baseType: !135, size: 192, offset: 5824)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !32, file: !33, line: 383, baseType: !135, size: 192, offset: 6016)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !32, file: !33, line: 384, baseType: !135, size: 192, offset: 6208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !32, file: !33, line: 385, baseType: !135, size: 192, offset: 6400)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !32, file: !33, line: 386, baseType: !6, size: 32, offset: 6592)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !32, file: !33, line: 388, baseType: !6, size: 32, offset: 6624)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !32, file: !33, line: 389, baseType: !6, size: 32, offset: 6656)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !32, file: !33, line: 391, baseType: !27, size: 64, offset: 6720)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !32, file: !33, line: 393, baseType: !6, size: 32, offset: 6784)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !32, file: !33, line: 394, baseType: !6, size: 32, offset: 6816)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !32, file: !33, line: 395, baseType: !6, size: 32, offset: 6848)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !32, file: !33, line: 396, baseType: !6, size: 32, offset: 6880)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !32, file: !33, line: 398, baseType: !6, size: 32, offset: 6912)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !32, file: !33, line: 399, baseType: !6, size: 32, offset: 6944)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !32, file: !33, line: 402, baseType: !301, size: 64, offset: 6976)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !303, line: 164, baseType: !304)
!303 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !303, line: 191, size: 3328, elements: !305)
!305 = !{!306, !325, !331, !340, !346, !352, !362, !368, !377, !386, !392, !398, !620, !629, !638, !647, !653, !662, !671, !680, !689, !698, !708, !714, !726, !732}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !304, file: !303, line: 193, baseType: !307, size: 128)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !303, line: 193, size: 128, elements: !308)
!308 = !{!309, !324}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !307, file: !303, line: 193, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !303, line: 83, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !303, line: 60, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !303, line: 179, size: 192, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !316, file: !303, line: 181, baseType: !101, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !316, file: !303, line: 187, baseType: !320, size: 128, offset: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !303, line: 184, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !320, file: !303, line: 185, baseType: !101, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !320, file: !303, line: 186, baseType: !314, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !307, file: !303, line: 193, baseType: !314, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !304, file: !303, line: 194, baseType: !326, size: 128, offset: 128)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !303, line: 194, size: 128, elements: !327)
!327 = !{!328, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !326, file: !303, line: 194, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !303, line: 84, baseType: !311)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !326, file: !303, line: 194, baseType: !314, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !304, file: !303, line: 195, baseType: !332, size: 128, offset: 256)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !303, line: 195, size: 128, elements: !333)
!333 = !{!334, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !332, file: !303, line: 195, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !303, line: 85, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!6, !314, !29}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !332, file: !303, line: 195, baseType: !314, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !304, file: !303, line: 196, baseType: !341, size: 128, offset: 384)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !303, line: 196, size: 128, elements: !342)
!342 = !{!343, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !341, file: !303, line: 196, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !303, line: 86, baseType: !336)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !341, file: !303, line: 196, baseType: !314, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !304, file: !303, line: 197, baseType: !347, size: 128, offset: 512)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !303, line: 197, size: 128, elements: !348)
!348 = !{!349, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !347, file: !303, line: 197, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !303, line: 87, baseType: !336)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !347, file: !303, line: 197, baseType: !314, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !304, file: !303, line: 198, baseType: !353, size: 128, offset: 640)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !303, line: 198, size: 128, elements: !354)
!354 = !{!355, !361}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !353, file: !303, line: 198, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !303, line: 92, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !303, line: 88, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!6, !314, !29, !217, !219, !27, !27}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !353, file: !303, line: 198, baseType: !314, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !304, file: !303, line: 199, baseType: !363, size: 128, offset: 768)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !303, line: 199, size: 128, elements: !364)
!364 = !{!365, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !363, file: !303, line: 199, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !303, line: 93, baseType: !357)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !363, file: !303, line: 199, baseType: !314, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !304, file: !303, line: 200, baseType: !369, size: 128, offset: 896)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !303, line: 200, size: 128, elements: !370)
!370 = !{!371, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !369, file: !303, line: 200, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !303, line: 94, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!6, !314, !29, !58, !6, !27, !27}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !369, file: !303, line: 200, baseType: !314, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !304, file: !303, line: 201, baseType: !378, size: 128, offset: 1024)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !303, line: 201, size: 128, elements: !379)
!379 = !{!380, !385}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !378, file: !303, line: 201, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !303, line: 98, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!27, !314, !29, !27}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !378, file: !303, line: 201, baseType: !314, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !304, file: !303, line: 202, baseType: !387, size: 128, offset: 1152)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !303, line: 202, size: 128, elements: !388)
!388 = !{!389, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !387, file: !303, line: 202, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !303, line: 101, baseType: !382)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !387, file: !303, line: 202, baseType: !314, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !304, file: !303, line: 203, baseType: !393, size: 128, offset: 1280)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !303, line: 203, size: 128, elements: !394)
!394 = !{!395, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !393, file: !303, line: 203, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !303, line: 104, baseType: !382)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !393, file: !303, line: 203, baseType: !314, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !304, file: !303, line: 204, baseType: !399, size: 128, offset: 1408)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !303, line: 204, size: 128, elements: !400)
!400 = !{!401, !619}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !399, file: !303, line: 204, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !303, line: 107, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!6, !314, !29, !406, !6, !6, !6, !6, !6, !586}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !12, line: 61, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !33, line: 557, size: 135040, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !425, !426, !427, !428, !429, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !408, file: !33, line: 561, baseType: !19, size: 16384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !408, file: !33, line: 562, baseType: !19, size: 16384, offset: 16384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !408, file: !33, line: 563, baseType: !19, size: 16384, offset: 32768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !408, file: !33, line: 564, baseType: !19, size: 16384, offset: 49152)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !408, file: !33, line: 565, baseType: !19, size: 16384, offset: 65536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !408, file: !33, line: 566, baseType: !19, size: 16384, offset: 81920)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !408, file: !33, line: 567, baseType: !58, size: 64, offset: 98304)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !408, file: !33, line: 568, baseType: !19, size: 16384, offset: 98368)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !408, file: !33, line: 569, baseType: !190, size: 8192, offset: 114752)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !408, file: !33, line: 570, baseType: !6, size: 32, offset: 122944)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !408, file: !33, line: 571, baseType: !6, size: 32, offset: 122976)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !408, file: !33, line: 572, baseType: !6, size: 32, offset: 123008)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !408, file: !33, line: 573, baseType: !6, size: 32, offset: 123040)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !408, file: !33, line: 574, baseType: !424, size: 64, offset: 123072)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !111, line: 284, baseType: !79)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !408, file: !33, line: 575, baseType: !6, size: 32, offset: 123136)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !408, file: !33, line: 576, baseType: !424, size: 64, offset: 123200)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !408, file: !33, line: 577, baseType: !110, size: 64, offset: 123264)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !408, file: !33, line: 578, baseType: !110, size: 64, offset: 123328)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !408, file: !33, line: 579, baseType: !430, size: 8960, offset: 123392)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !10, line: 47, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !33, line: 486, size: 8960, elements: !432)
!432 = !{!433, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !452, !456, !457, !458, !459, !460, !461, !463, !530, !531, !532, !533, !538, !539, !543, !544, !545, !546, !547, !548}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !431, file: !33, line: 487, baseType: !6, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !431, file: !33, line: 488, baseType: !435, size: 16, offset: 32)
!435 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !431, file: !33, line: 489, baseType: !435, size: 16, offset: 48)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !431, file: !33, line: 490, baseType: !435, size: 16, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !431, file: !33, line: 491, baseType: !435, size: 16, offset: 80)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !431, file: !33, line: 492, baseType: !435, size: 16, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !431, file: !33, line: 493, baseType: !435, size: 16, offset: 112)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !431, file: !33, line: 494, baseType: !435, size: 16, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !431, file: !33, line: 495, baseType: !6, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !431, file: !33, line: 496, baseType: !6, size: 32, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !431, file: !33, line: 497, baseType: !58, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !431, file: !33, line: 498, baseType: !58, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !431, file: !33, line: 499, baseType: !50, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !431, file: !33, line: 500, baseType: !110, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !431, file: !33, line: 501, baseType: !449, size: 640, offset: 512)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 640, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 80)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !431, file: !33, line: 502, baseType: !453, size: 512, offset: 1152)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !431, file: !33, line: 503, baseType: !453, size: 512, offset: 1664)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !431, file: !33, line: 504, baseType: !453, size: 512, offset: 2176)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !431, file: !33, line: 505, baseType: !58, size: 64, offset: 2688)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !431, file: !33, line: 506, baseType: !110, size: 64, offset: 2752)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !431, file: !33, line: 507, baseType: !435, size: 16, offset: 2816)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !431, file: !33, line: 508, baseType: !462, size: 32, offset: 2848)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !111, line: 323, baseType: !6)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !431, file: !33, line: 509, baseType: !464, size: 224, offset: 2880)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !465, line: 91, baseType: !466)
!465 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !465, line: 93, size: 224, elements: !467)
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !466, file: !465, line: 103, baseType: !469, size: 224)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !466, file: !465, line: 94, size: 224, elements: !470)
!470 = !{!471, !482, !505}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !469, file: !465, line: 96, baseType: !472, size: 128)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !473, line: 180, size: 128, elements: !474)
!473 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!474 = !{!475, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !472, file: !473, line: 182, baseType: !476, size: 16)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !477, line: 28, baseType: !81)
!477 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !472, file: !473, line: 183, baseType: !479, size: 112, offset: 16)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 112, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 14)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !469, file: !465, line: 98, baseType: !483, size: 128)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !484, line: 245, size: 128, elements: !485)
!484 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!485 = !{!486, !487, !492, !500}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !483, file: !484, line: 247, baseType: !476, size: 16)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !483, file: !484, line: 248, baseType: !488, size: 16, offset: 16)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !484, line: 123, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !490, line: 25, baseType: !491)
!490 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !78, line: 40, baseType: !81)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !483, file: !484, line: 249, baseType: !493, size: 32, offset: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !484, line: 31, size: 32, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !493, file: !484, line: 33, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !484, line: 30, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !490, line: 26, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !78, line: 42, baseType: !499)
!499 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !483, file: !484, line: 252, baseType: !501, size: 64, offset: 64)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 64, elements: !503)
!502 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!503 = !{!504}
!504 = !DISubrange(count: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !469, file: !465, line: 101, baseType: !506, size: 224)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !484, line: 260, size: 224, elements: !507)
!507 = !{!508, !509, !510, !511, !529}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !506, file: !484, line: 262, baseType: !476, size: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !506, file: !484, line: 263, baseType: !488, size: 16, offset: 16)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !506, file: !484, line: 264, baseType: !497, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !506, file: !484, line: 265, baseType: !512, size: 128, offset: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !484, line: 219, size: 128, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !512, file: !484, line: 226, baseType: !515, size: 128)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !512, file: !484, line: 221, size: 128, elements: !516)
!516 = !{!517, !523, !525}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !515, file: !484, line: 223, baseType: !518, size: 128)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 128, elements: !521)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !490, line: 24, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !78, line: 38, baseType: !502)
!521 = !{!522}
!522 = !DISubrange(count: 16)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !515, file: !484, line: 224, baseType: !524, size: 128)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !503)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !515, file: !484, line: 225, baseType: !526, size: 128)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 128, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 4)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !506, file: !484, line: 266, baseType: !497, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !431, file: !33, line: 510, baseType: !6, size: 32, offset: 3104)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !431, file: !33, line: 511, baseType: !50, size: 64, offset: 3136)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !431, file: !33, line: 513, baseType: !435, size: 16, offset: 3200)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !431, file: !33, line: 515, baseType: !534, size: 64, offset: 3264)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !536, line: 184, baseType: !537)
!536 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !536, line: 184, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !431, file: !33, line: 517, baseType: !453, size: 512, offset: 3328)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !431, file: !33, line: 518, baseType: !540, size: 2048, offset: 3840)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !431, file: !33, line: 519, baseType: !540, size: 2048, offset: 5888)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !431, file: !33, line: 520, baseType: !110, size: 64, offset: 7936)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !431, file: !33, line: 521, baseType: !110, size: 64, offset: 8000)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !431, file: !33, line: 522, baseType: !110, size: 64, offset: 8064)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !431, file: !33, line: 523, baseType: !6, size: 32, offset: 8128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !431, file: !33, line: 525, baseType: !549, size: 768, offset: 8192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !10, line: 43, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !33, line: 465, size: 768, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !550, file: !33, line: 466, baseType: !435, size: 16)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !550, file: !33, line: 467, baseType: !435, size: 16, offset: 16)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !550, file: !33, line: 468, baseType: !435, size: 16, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !550, file: !33, line: 469, baseType: !435, size: 16, offset: 48)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !550, file: !33, line: 470, baseType: !435, size: 16, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !550, file: !33, line: 471, baseType: !435, size: 16, offset: 80)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !550, file: !33, line: 472, baseType: !27, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !550, file: !33, line: 473, baseType: !27, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !550, file: !33, line: 474, baseType: !27, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !550, file: !33, line: 475, baseType: !27, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !550, file: !33, line: 476, baseType: !27, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !550, file: !33, line: 477, baseType: !27, size: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !550, file: !33, line: 478, baseType: !565, size: 256, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !33, line: 452, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !33, line: 454, size: 256, elements: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !566, file: !33, line: 455, baseType: !6, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !566, file: !33, line: 456, baseType: !27, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !566, file: !33, line: 457, baseType: !6, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !566, file: !33, line: 458, baseType: !27, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !408, file: !33, line: 580, baseType: !6, size: 32, offset: 132352)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !408, file: !33, line: 581, baseType: !6, size: 32, offset: 132384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !408, file: !33, line: 582, baseType: !110, size: 64, offset: 132416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !408, file: !33, line: 583, baseType: !424, size: 64, offset: 132480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !408, file: !33, line: 585, baseType: !6, size: 32, offset: 132544)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !408, file: !33, line: 586, baseType: !6, size: 32, offset: 132576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !408, file: !33, line: 587, baseType: !58, size: 64, offset: 132608)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !408, file: !33, line: 588, baseType: !110, size: 64, offset: 132672)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !408, file: !33, line: 589, baseType: !110, size: 64, offset: 132736)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !408, file: !33, line: 590, baseType: !110, size: 64, offset: 132800)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !408, file: !33, line: 594, baseType: !540, size: 2048, offset: 132864)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !408, file: !33, line: 595, baseType: !6, size: 32, offset: 134912)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !408, file: !33, line: 596, baseType: !6, size: 32, offset: 134944)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !408, file: !33, line: 597, baseType: !6, size: 32, offset: 134976)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !31, line: 70, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !33, line: 414, size: 1344, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !600, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !588, file: !33, line: 415, baseType: !110, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !588, file: !33, line: 416, baseType: !110, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !588, file: !33, line: 418, baseType: !424, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !588, file: !33, line: 420, baseType: !110, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !588, file: !33, line: 421, baseType: !110, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !588, file: !33, line: 422, baseType: !6, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !588, file: !33, line: 424, baseType: !597, size: 128, offset: 384)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 128, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 2)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !588, file: !33, line: 425, baseType: !601, size: 128, offset: 512)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !598)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !588, file: !33, line: 426, baseType: !424, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !588, file: !33, line: 427, baseType: !6, size: 32, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !588, file: !33, line: 429, baseType: !6, size: 32, offset: 736)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !588, file: !33, line: 430, baseType: !6, size: 32, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !588, file: !33, line: 431, baseType: !6, size: 32, offset: 800)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !588, file: !33, line: 433, baseType: !6, size: 32, offset: 832)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !588, file: !33, line: 434, baseType: !6, size: 32, offset: 864)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !588, file: !33, line: 435, baseType: !6, size: 32, offset: 896)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !588, file: !33, line: 436, baseType: !6, size: 32, offset: 928)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !588, file: !33, line: 437, baseType: !6, size: 32, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !588, file: !33, line: 438, baseType: !6, size: 32, offset: 992)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !588, file: !33, line: 439, baseType: !6, size: 32, offset: 1024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !588, file: !33, line: 440, baseType: !6, size: 32, offset: 1056)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !588, file: !33, line: 441, baseType: !110, size: 64, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !588, file: !33, line: 443, baseType: !110, size: 64, offset: 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !588, file: !33, line: 445, baseType: !424, size: 64, offset: 1216)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !588, file: !33, line: 446, baseType: !424, size: 64, offset: 1280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !399, file: !303, line: 204, baseType: !314, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !304, file: !303, line: 205, baseType: !621, size: 128, offset: 1536)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !303, line: 205, size: 128, elements: !622)
!622 = !{!623, !628}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !621, file: !303, line: 205, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !303, line: 112, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!6, !314, !29, !27, !27, !6}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !621, file: !303, line: 205, baseType: !314, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !304, file: !303, line: 206, baseType: !630, size: 128, offset: 1664)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !303, line: 206, size: 128, elements: !631)
!631 = !{!632, !637}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !630, file: !303, line: 206, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !303, line: 115, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!6, !314, !29, !27, !27, !27, !6}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !630, file: !303, line: 206, baseType: !314, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !304, file: !303, line: 207, baseType: !639, size: 128, offset: 1792)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !303, line: 207, size: 128, elements: !640)
!640 = !{!641, !646}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !639, file: !303, line: 207, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !303, line: 119, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !314, !29, !27}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !639, file: !303, line: 207, baseType: !314, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !304, file: !303, line: 208, baseType: !648, size: 128, offset: 1920)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !303, line: 208, size: 128, elements: !649)
!649 = !{!650, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !648, file: !303, line: 208, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !303, line: 121, baseType: !643)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !648, file: !303, line: 208, baseType: !314, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !304, file: !303, line: 209, baseType: !654, size: 128, offset: 2048)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !303, line: 209, size: 128, elements: !655)
!655 = !{!656, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !654, file: !303, line: 209, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !303, line: 123, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !314, !29, !27, !27, !27, !6, !6, !6}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !654, file: !303, line: 209, baseType: !314, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !304, file: !303, line: 210, baseType: !663, size: 128, offset: 2176)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !303, line: 210, size: 128, elements: !664)
!664 = !{!665, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !663, file: !303, line: 210, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !303, line: 128, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!6, !314, !29, !58}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !663, file: !303, line: 210, baseType: !314, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !304, file: !303, line: 211, baseType: !672, size: 128, offset: 2304)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !303, line: 211, size: 128, elements: !673)
!673 = !{!674, !679}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !672, file: !303, line: 211, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !303, line: 130, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!6, !314, !29, !58, !27}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !672, file: !303, line: 211, baseType: !314, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !304, file: !303, line: 212, baseType: !681, size: 128, offset: 2432)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !303, line: 212, size: 128, elements: !682)
!682 = !{!683, !688}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !681, file: !303, line: 212, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !303, line: 133, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!6, !314, !29, !406}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !681, file: !303, line: 212, baseType: !314, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !304, file: !303, line: 213, baseType: !690, size: 128, offset: 2560)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !303, line: 213, size: 128, elements: !691)
!691 = !{!692, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !690, file: !303, line: 213, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !303, line: 135, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!6, !314, !29, !27, !27, !27, !27, !58}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !690, file: !303, line: 213, baseType: !314, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !304, file: !303, line: 214, baseType: !699, size: 128, offset: 2688)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !303, line: 214, size: 128, elements: !700)
!700 = !{!701, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !699, file: !303, line: 214, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !303, line: 142, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!6, !314, !29, !58, !27, !27, !27, !27, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !699, file: !303, line: 214, baseType: !314, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !304, file: !303, line: 215, baseType: !709, size: 128, offset: 2816)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !303, line: 215, size: 128, elements: !710)
!710 = !{!711, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !709, file: !303, line: 215, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !303, line: 148, baseType: !703)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !709, file: !303, line: 215, baseType: !314, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !304, file: !303, line: 216, baseType: !715, size: 128, offset: 2944)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !303, line: 216, size: 128, elements: !716)
!716 = !{!717, !725}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !715, file: !303, line: 216, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !303, line: 156, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!6, !314, !29, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !303, line: 56, baseType: !724)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !303, line: 56, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !715, file: !303, line: 216, baseType: !314, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !304, file: !303, line: 217, baseType: !727, size: 128, offset: 3072)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !303, line: 217, size: 128, elements: !728)
!728 = !{!729, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !727, file: !303, line: 217, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !303, line: 158, baseType: !719)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !727, file: !303, line: 217, baseType: !314, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !304, file: !303, line: 219, baseType: !733, size: 128, offset: 3200)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !303, line: 219, size: 128, elements: !734)
!734 = !{!735, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !733, file: !303, line: 219, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !303, line: 141, baseType: !693)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !733, file: !303, line: 219, baseType: !314, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !32, file: !33, line: 404, baseType: !739, size: 128, offset: 7040)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !33, line: 260, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !33, line: 270, size: 128, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !740, file: !33, line: 271, baseType: !6, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !740, file: !33, line: 272, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !33, line: 264, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !33, line: 266, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !746, file: !33, line: 267, baseType: !58, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !746, file: !33, line: 268, baseType: !101, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !32, file: !33, line: 406, baseType: !751, size: 1126016, offset: 7168)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !33, line: 216, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !33, line: 218, size: 1126016, elements: !753)
!753 = !{!754, !789, !790, !791, !792, !793, !794, !795, !796, !802, !814, !822, !828, !835, !836, !837, !838, !848, !849, !853, !854, !855, !856, !857, !858, !859, !860, !867, !868, !869, !870}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !752, file: !33, line: 219, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !33, line: 204, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !758, line: 59, size: 320, elements: !759)
!758 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !757, file: !758, line: 60, baseType: !761, size: 320)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !762, line: 72, baseType: !763)
!762 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!763 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !762, line: 67, size: 320, elements: !764)
!764 = !{!765, !784, !788}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !763, file: !762, line: 69, baseType: !766, size: 320)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !767, line: 22, size: 320, elements: !768)
!767 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !766, file: !767, line: 24, baseType: !6, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !766, file: !767, line: 25, baseType: !499, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !766, file: !767, line: 26, baseType: !6, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !766, file: !767, line: 28, baseType: !499, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !766, file: !767, line: 32, baseType: !6, size: 32, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !766, file: !767, line: 34, baseType: !435, size: 16, offset: 160)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !766, file: !767, line: 35, baseType: !435, size: 16, offset: 176)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !766, file: !767, line: 36, baseType: !777, size: 128, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !778, line: 55, baseType: !779)
!778 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !778, line: 51, size: 128, elements: !780)
!780 = !{!781, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !779, file: !778, line: 53, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !779, file: !778, line: 54, baseType: !782, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !763, file: !762, line: 70, baseType: !785, size: 320)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 320, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 40)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !763, file: !762, line: 71, baseType: !79, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !752, file: !33, line: 221, baseType: !6, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !752, file: !33, line: 222, baseType: !6, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !752, file: !33, line: 223, baseType: !6, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !752, file: !33, line: 225, baseType: !6, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !752, file: !33, line: 226, baseType: !135, size: 192, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !752, file: !33, line: 227, baseType: !50, size: 64, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !752, file: !33, line: 228, baseType: !6, size: 32, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !752, file: !33, line: 230, baseType: !797, size: 32832, offset: 512)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !33, line: 121, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !33, line: 123, size: 32832, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !798, file: !33, line: 124, baseType: !50, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !798, file: !33, line: 125, baseType: !280, size: 32768, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !752, file: !33, line: 232, baseType: !803, size: 192, offset: 33344)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !33, line: 111, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !33, line: 112, size: 192, elements: !805)
!805 = !{!806, !807, !812}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !804, file: !33, line: 113, baseType: !101, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !804, file: !33, line: 114, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !33, line: 110, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!6}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !804, file: !33, line: 115, baseType: !813, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !752, file: !33, line: 233, baseType: !815, size: 1048608, offset: 33536)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !33, line: 131, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !33, line: 133, size: 1048608, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !816, file: !33, line: 134, baseType: !6, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !816, file: !33, line: 135, baseType: !820, size: 1048576, offset: 32)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1048576, elements: !821)
!821 = !{!522, !260}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !752, file: !33, line: 234, baseType: !823, size: 16416, offset: 1082144)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !33, line: 153, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !33, line: 155, size: 16416, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !824, file: !33, line: 156, baseType: !6, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !824, file: !33, line: 157, baseType: !19, size: 16384, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !752, file: !33, line: 235, baseType: !829, size: 96, offset: 1098560)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !33, line: 163, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !33, line: 165, size: 96, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !830, file: !33, line: 166, baseType: !6, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !830, file: !33, line: 167, baseType: !6, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !830, file: !33, line: 168, baseType: !6, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !752, file: !33, line: 236, baseType: !58, size: 64, offset: 1098688)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !752, file: !33, line: 237, baseType: !6, size: 32, offset: 1098752)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !752, file: !33, line: 238, baseType: !6, size: 32, offset: 1098784)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !752, file: !33, line: 239, baseType: !839, size: 64, offset: 1098816)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !10, line: 51, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !10, line: 150, size: 704, elements: !842)
!842 = !{!843, !845, !846, !847}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !10, line: 151, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !841, file: !10, line: 152, baseType: !27, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !841, file: !10, line: 153, baseType: !36, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !841, file: !10, line: 154, baseType: !453, size: 512, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !752, file: !33, line: 240, baseType: !6, size: 32, offset: 1098880)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !752, file: !33, line: 242, baseType: !850, size: 10240, offset: 1098912)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 10240, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 1280)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !752, file: !33, line: 243, baseType: !6, size: 32, offset: 1109152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !752, file: !33, line: 244, baseType: !6, size: 32, offset: 1109184)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !752, file: !33, line: 245, baseType: !6, size: 32, offset: 1109216)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !752, file: !33, line: 246, baseType: !6, size: 32, offset: 1109248)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !752, file: !33, line: 247, baseType: !6, size: 32, offset: 1109280)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !752, file: !33, line: 248, baseType: !217, size: 64, offset: 1109312)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !752, file: !33, line: 249, baseType: !6, size: 32, offset: 1109376)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !752, file: !33, line: 250, baseType: !861, size: 64, offset: 1109440)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !33, line: 194, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !33, line: 196, size: 128, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !863, file: !33, line: 197, baseType: !58, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !33, line: 198, baseType: !861, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !752, file: !33, line: 251, baseType: !19, size: 16384, offset: 1109504)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !752, file: !33, line: 252, baseType: !499, size: 32, offset: 1125888)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !752, file: !33, line: 253, baseType: !499, size: 32, offset: 1125920)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !752, file: !33, line: 254, baseType: !6, size: 32, offset: 1125952)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_back", file: !12, line: 65, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_back", file: !12, line: 156, size: 256, elements: !874)
!874 = !{!875, !876, !877, !878}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lnk", scope: !873, file: !12, line: 157, baseType: !406, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !873, file: !12, line: 158, baseType: !6, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !873, file: !12, line: 159, baseType: !249, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ready_size_bytes", scope: !873, file: !12, line: 160, baseType: !110, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_back", file: !12, line: 69, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_back", file: !12, line: 170, size: 3136, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !905, !906}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !881, file: !12, line: 171, baseType: !6, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !881, file: !12, line: 173, baseType: !6, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ro", scope: !881, file: !12, line: 174, baseType: !6, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dat", scope: !881, file: !12, line: 175, baseType: !50, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ndx", scope: !881, file: !12, line: 175, baseType: !50, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "olddat", scope: !881, file: !12, line: 175, baseType: !50, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !881, file: !12, line: 176, baseType: !58, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !881, file: !12, line: 177, baseType: !50, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "txt", scope: !881, file: !12, line: 178, baseType: !50, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !881, file: !12, line: 179, baseType: !540, size: 2048, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "hashtable", scope: !881, file: !12, line: 181, baseType: !249, size: 64, offset: 2560)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "cached_tests", scope: !881, file: !12, line: 183, baseType: !249, size: 64, offset: 2624)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !881, file: !12, line: 185, baseType: !50, size: 64, offset: 2688)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !881, file: !12, line: 186, baseType: !50, size: 64, offset: 2752)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_ant", scope: !881, file: !12, line: 188, baseType: !6, size: 32, offset: 2816)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_last", scope: !881, file: !12, line: 189, baseType: !6, size: 32, offset: 2848)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "zipInput", scope: !881, file: !12, line: 191, baseType: !101, size: 64, offset: 2880)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "zipOutput", scope: !881, file: !12, line: 192, baseType: !101, size: 64, offset: 2944)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "zipEntries", scope: !881, file: !12, line: 193, baseType: !902, size: 64, offset: 3008)
