; ModuleID = 'src/htsparse.c'
source_filename = "src/htsparse.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.t_hts_htmlcheck_callbacks = type { %struct.init, %struct.uninit, %struct.start, %struct.end, %struct.chopt, %struct.preprocess, %struct.postprocess, %struct.check_html, %struct.query, %struct.query2, %struct.query3, %struct.loop, %struct.check_link, %struct.check_mime, %struct.pause, %struct.filesave, %struct.filesave2, %struct.linkdetected, %struct.linkdetected2, %struct.xfrstatus, %struct.savename, %struct.sendhead, %struct.receivehead, %struct.detect, %struct.parse, %struct.extsavename }
%struct.init = type { ptr, ptr }
%struct.uninit = type { ptr, ptr }
%struct.start = type { ptr, ptr }
%struct.end = type { ptr, ptr }
%struct.chopt = type { ptr, ptr }
%struct.preprocess = type { ptr, ptr }
%struct.postprocess = type { ptr, ptr }
%struct.check_html = type { ptr, ptr }
%struct.query = type { ptr, ptr }
%struct.query2 = type { ptr, ptr }
%struct.query3 = type { ptr, ptr }
%struct.loop = type { ptr, ptr }
%struct.check_link = type { ptr, ptr }
%struct.check_mime = type { ptr, ptr }
%struct.pause = type { ptr, ptr }
%struct.filesave = type { ptr, ptr }
%struct.filesave2 = type { ptr, ptr }
%struct.linkdetected = type { ptr, ptr }
%struct.linkdetected2 = type { ptr, ptr }
%struct.xfrstatus = type { ptr, ptr }
%struct.savename = type { ptr, ptr }

!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3878, type: !92, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3879, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 64)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3897, type: !24, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3906, type: !92, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3912, type: !372, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3973, type: !462, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3986, type: !404, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3999, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 60)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4004, type: !577, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4077, type: !54, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4120, type: !188, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4120, type: !701, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4173, type: !404, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4187, type: !331, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4195, type: !331, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4204, type: !29, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4205, type: !280, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4206, type: !29, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4209, type: !111, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4210, type: !29, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4217, type: !111, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4242, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 58)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "roll", scope: !752, file: !2, line: 4275, type: !755, isLocal: true, isDefinition: true)
!752 = distinct !DISubprogram(name: "hts_mirror_wait_for_next_file", scope: !2, file: !2, line: 3964, type: !753, scopeLine: 3965, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1677, retainedNodes: !1691)
!753 = !DISubroutineType(types: !754)
!754 = !{!755, !756, !1643}
!755 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !758, line: 56, baseType: !759)
!758 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !760, line: 71, size: 1216, elements: !761)
!760 = !DIFile(filename: "./src/htsmodules.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "65f13e42a0265151bd8524490683afa8")
!761 = !{!762, !765, !766, !767, !768, !769, !770, !772, !773, !778, !779, !780, !782, !1601, !1610, !1639, !1640, !1641, !1642}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !759, file: !760, line: 73, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !760, line: 74, baseType: !755, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mime", scope: !759, file: !760, line: 75, baseType: !763, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "url_host", scope: !759, file: !760, line: 76, baseType: !763, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "url_file", scope: !759, file: !760, line: 77, baseType: !763, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !759, file: !760, line: 80, baseType: !763, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "err_msg", scope: !759, file: !760, line: 81, baseType: !771, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "relativeToHtmlLink", scope: !759, file: !760, line: 84, baseType: !755, size: 32, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "addLink", scope: !759, file: !760, line: 89, baseType: !774, size: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_htsAddLink", file: !760, line: 68, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!755, !756, !771}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "localLink", scope: !759, file: !760, line: 94, baseType: !771, size: 64, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "localLinkSize", scope: !759, file: !760, line: 97, baseType: !755, size: 32, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !759, file: !760, line: 100, baseType: !781, size: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !759, file: !760, line: 104, baseType: !783, size: 64, offset: 768)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !785, line: 49, baseType: !786)
!785 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !787, line: 294, size: 1133184, elements: !788)
!787 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!788 = !{!789, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !854, !855, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !872, !873, !874, !875, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !966, !1011, !1014, !1015, !1019, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1471, !1483}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !786, file: !787, line: 295, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !791, line: 46, baseType: !792)
!791 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!792 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !786, file: !787, line: 297, baseType: !755, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !786, file: !787, line: 298, baseType: !755, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !786, file: !787, line: 299, baseType: !755, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !786, file: !787, line: 300, baseType: !755, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !786, file: !787, line: 301, baseType: !755, size: 32, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !786, file: !787, line: 302, baseType: !755, size: 32, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !786, file: !787, line: 303, baseType: !755, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !786, file: !787, line: 304, baseType: !755, size: 32, offset: 288)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !786, file: !787, line: 305, baseType: !755, size: 32, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !786, file: !787, line: 306, baseType: !755, size: 32, offset: 352)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !786, file: !787, line: 307, baseType: !804, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !806, line: 7, baseType: !807)
!806 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !808, line: 49, size: 1728, elements: !809)
!808 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !825, !827, !828, !829, !833, !835, !837, !838, !841, !843, !846, !849, !850, !851, !852, !853}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !807, file: !808, line: 51, baseType: !755, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !807, file: !808, line: 54, baseType: !771, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !807, file: !808, line: 55, baseType: !771, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !807, file: !808, line: 56, baseType: !771, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !807, file: !808, line: 57, baseType: !771, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !807, file: !808, line: 58, baseType: !771, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !807, file: !808, line: 59, baseType: !771, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !807, file: !808, line: 60, baseType: !771, size: 64, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !807, file: !808, line: 61, baseType: !771, size: 64, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !807, file: !808, line: 64, baseType: !771, size: 64, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !807, file: !808, line: 65, baseType: !771, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !807, file: !808, line: 66, baseType: !771, size: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !807, file: !808, line: 68, baseType: !823, size: 64, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !808, line: 36, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !807, file: !808, line: 70, baseType: !826, size: 64, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !807, file: !808, line: 72, baseType: !755, size: 32, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !807, file: !808, line: 73, baseType: !755, size: 32, offset: 928)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !807, file: !808, line: 74, baseType: !830, size: 64, offset: 960)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !831, line: 152, baseType: !832)
!831 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!832 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !807, file: !808, line: 77, baseType: !834, size: 16, offset: 1024)
!834 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !807, file: !808, line: 78, baseType: !836, size: 8, offset: 1040)
!836 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !807, file: !808, line: 79, baseType: !106, size: 8, offset: 1048)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !807, file: !808, line: 81, baseType: !839, size: 64, offset: 1088)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !808, line: 43, baseType: null)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !807, file: !808, line: 89, baseType: !842, size: 64, offset: 1152)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !831, line: 153, baseType: !832)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !807, file: !808, line: 91, baseType: !844, size: 64, offset: 1216)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !808, line: 37, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !807, file: !808, line: 92, baseType: !847, size: 64, offset: 1280)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !808, line: 38, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !807, file: !808, line: 93, baseType: !826, size: 64, offset: 1344)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !807, file: !808, line: 94, baseType: !781, size: 64, offset: 1408)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !807, file: !808, line: 95, baseType: !790, size: 64, offset: 1472)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !807, file: !808, line: 96, baseType: !755, size: 32, offset: 1536)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !807, file: !808, line: 98, baseType: !14, size: 160, offset: 1568)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !786, file: !787, line: 308, baseType: !804, size: 64, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !786, file: !787, line: 309, baseType: !856, size: 64, offset: 512)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !857, line: 283, baseType: !832)
!857 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!858 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !786, file: !787, line: 310, baseType: !856, size: 64, offset: 576)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !786, file: !787, line: 311, baseType: !856, size: 64, offset: 640)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !786, file: !787, line: 312, baseType: !755, size: 32, offset: 704)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !786, file: !787, line: 313, baseType: !856, size: 64, offset: 768)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !786, file: !787, line: 314, baseType: !755, size: 32, offset: 832)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !786, file: !787, line: 315, baseType: !755, size: 32, offset: 864)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !786, file: !787, line: 316, baseType: !755, size: 32, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !786, file: !787, line: 317, baseType: !755, size: 32, offset: 928)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !786, file: !787, line: 318, baseType: !755, size: 32, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !786, file: !787, line: 319, baseType: !755, size: 32, offset: 992)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !786, file: !787, line: 320, baseType: !755, size: 32, offset: 1024)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !786, file: !787, line: 321, baseType: !755, size: 32, offset: 1056)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !786, file: !787, line: 322, baseType: !871, size: 32, offset: 1088)
!871 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !786, file: !787, line: 323, baseType: !755, size: 32, offset: 1120)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !786, file: !787, line: 324, baseType: !755, size: 32, offset: 1152)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !786, file: !787, line: 326, baseType: !755, size: 32, offset: 1184)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !786, file: !787, line: 327, baseType: !876, size: 512, offset: 1216)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !787, line: 89, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !787, line: 91, size: 512, elements: !878)
!878 = !{!879, !880, !888, !889}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !877, file: !787, line: 92, baseType: !755, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !877, file: !787, line: 93, baseType: !881, size: 192, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !882, line: 57, baseType: !883)
!882 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !882, line: 61, size: 192, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !883, file: !882, line: 62, baseType: !771, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !883, file: !882, line: 63, baseType: !790, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !883, file: !882, line: 64, baseType: !790, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !877, file: !787, line: 94, baseType: !755, size: 32, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !877, file: !787, line: 95, baseType: !881, size: 192, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !786, file: !787, line: 328, baseType: !755, size: 32, offset: 1728)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !786, file: !787, line: 329, baseType: !755, size: 32, offset: 1760)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !786, file: !787, line: 330, baseType: !881, size: 192, offset: 1792)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !786, file: !787, line: 331, baseType: !755, size: 32, offset: 1984)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !786, file: !787, line: 332, baseType: !755, size: 32, offset: 2016)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !786, file: !787, line: 333, baseType: !755, size: 32, offset: 2048)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !786, file: !787, line: 334, baseType: !755, size: 32, offset: 2080)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !786, file: !787, line: 335, baseType: !881, size: 192, offset: 2112)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !786, file: !787, line: 336, baseType: !881, size: 192, offset: 2304)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !786, file: !787, line: 337, baseType: !881, size: 192, offset: 2496)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !786, file: !787, line: 338, baseType: !881, size: 192, offset: 2688)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !786, file: !787, line: 339, baseType: !881, size: 192, offset: 2880)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !786, file: !787, line: 340, baseType: !881, size: 192, offset: 3072)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !786, file: !787, line: 341, baseType: !881, size: 192, offset: 3264)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !786, file: !787, line: 342, baseType: !755, size: 32, offset: 3456)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !786, file: !787, line: 343, baseType: !755, size: 32, offset: 3488)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !786, file: !787, line: 344, baseType: !755, size: 32, offset: 3520)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !786, file: !787, line: 345, baseType: !755, size: 32, offset: 3552)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !786, file: !787, line: 346, baseType: !755, size: 32, offset: 3584)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !786, file: !787, line: 347, baseType: !755, size: 32, offset: 3616)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !786, file: !787, line: 348, baseType: !755, size: 32, offset: 3648)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !786, file: !787, line: 349, baseType: !755, size: 32, offset: 3680)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !786, file: !787, line: 350, baseType: !755, size: 32, offset: 3712)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !786, file: !787, line: 351, baseType: !755, size: 32, offset: 3744)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !786, file: !787, line: 352, baseType: !755, size: 32, offset: 3776)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !786, file: !787, line: 353, baseType: !755, size: 32, offset: 3808)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !786, file: !787, line: 354, baseType: !755, size: 32, offset: 3840)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !786, file: !787, line: 355, baseType: !881, size: 192, offset: 3904)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !786, file: !787, line: 356, baseType: !755, size: 32, offset: 4096)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !786, file: !787, line: 357, baseType: !755, size: 32, offset: 4128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !786, file: !787, line: 358, baseType: !921, size: 64, offset: 4160)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !923, line: 53, baseType: !924)
!923 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !923, line: 55, size: 278656, elements: !925)
!925 = !{!926, !927, !931}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !924, file: !923, line: 56, baseType: !755, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !924, file: !923, line: 57, baseType: !928, size: 262144, offset: 32)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 32768)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !924, file: !923, line: 58, baseType: !932, size: 16448, offset: 262208)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !923, line: 42, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !923, line: 44, size: 16448, elements: !934)
!934 = !{!935, !939, !940}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !933, file: !923, line: 45, baseType: !936, size: 8192)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 1024)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !933, file: !923, line: 46, baseType: !936, size: 8192, offset: 8192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !933, file: !923, line: 47, baseType: !941, size: 64, offset: 16384)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !786, file: !787, line: 359, baseType: !755, size: 32, offset: 4224)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !786, file: !787, line: 360, baseType: !755, size: 32, offset: 4256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !786, file: !787, line: 361, baseType: !755, size: 32, offset: 4288)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !786, file: !787, line: 362, baseType: !755, size: 32, offset: 4320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !786, file: !787, line: 363, baseType: !755, size: 32, offset: 4352)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !786, file: !787, line: 364, baseType: !755, size: 32, offset: 4384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !786, file: !787, line: 365, baseType: !755, size: 32, offset: 4416)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !786, file: !787, line: 366, baseType: !755, size: 32, offset: 4448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !786, file: !787, line: 367, baseType: !755, size: 32, offset: 4480)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !786, file: !787, line: 368, baseType: !755, size: 32, offset: 4512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !786, file: !787, line: 369, baseType: !881, size: 192, offset: 4544)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !786, file: !787, line: 370, baseType: !755, size: 32, offset: 4736)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !786, file: !787, line: 372, baseType: !755, size: 32, offset: 4768)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !786, file: !787, line: 373, baseType: !881, size: 192, offset: 4800)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !786, file: !787, line: 374, baseType: !881, size: 192, offset: 4992)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !786, file: !787, line: 375, baseType: !958, size: 128, offset: 5184)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !787, line: 101, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !787, line: 103, size: 128, elements: !960)
!960 = !{!961, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !959, file: !787, line: 104, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !959, file: !787, line: 105, baseType: !965, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !786, file: !787, line: 376, baseType: !967, size: 64, offset: 5312)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !969, line: 73, baseType: !970)
!969 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !969, line: 202, size: 98624, elements: !971)
!971 = !{!972, !995, !999, !1000, !1001, !1002, !1006, !1007}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !970, file: !969, line: 204, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !969, line: 57, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !787, line: 534, size: 640, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !980, file: !787, line: 535, baseType: !771, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !980, file: !787, line: 536, baseType: !771, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !980, file: !787, line: 537, baseType: !771, size: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !980, file: !787, line: 538, baseType: !771, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !980, file: !787, line: 539, baseType: !771, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !980, file: !787, line: 540, baseType: !771, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !980, file: !787, line: 542, baseType: !755, size: 32, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !980, file: !787, line: 543, baseType: !755, size: 32, offset: 416)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !980, file: !787, line: 544, baseType: !755, size: 32, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !980, file: !787, line: 545, baseType: !755, size: 32, offset: 480)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !980, file: !787, line: 546, baseType: !4, size: 8, offset: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !980, file: !787, line: 548, baseType: !755, size: 32, offset: 544)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !980, file: !787, line: 549, baseType: !755, size: 32, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !970, file: !969, line: 206, baseType: !996, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !787, line: 210, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !787, line: 210, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !970, file: !969, line: 208, baseType: !996, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !970, file: !969, line: 210, baseType: !996, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !970, file: !969, line: 212, baseType: !755, size: 32, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !970, file: !969, line: 213, baseType: !1003, size: 16384, offset: 288)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 2048)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !970, file: !969, line: 214, baseType: !1003, size: 16384, offset: 16672)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !970, file: !969, line: 215, baseType: !1008, size: 65536, offset: 33056)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 8192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !786, file: !787, line: 377, baseType: !1012, size: 64, offset: 5376)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !786, file: !787, line: 378, baseType: !755, size: 32, offset: 5440)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !786, file: !787, line: 379, baseType: !1016, size: 64, offset: 5504)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !787, line: 286, baseType: !1018)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !787, line: 286, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !786, file: !787, line: 380, baseType: !1020, size: 64, offset: 5568)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !787, line: 61, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !1023, line: 42, size: 33856, elements: !1024)
!1023 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!1024 = !{!1025, !1029, !1033}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1022, file: !1023, line: 43, baseType: !1026, size: 1024)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !1022, file: !1023, line: 44, baseType: !1030, size: 32768, offset: 1024)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 4096)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !1023, line: 45, baseType: !1034, size: 64, offset: 33792)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !786, file: !787, line: 381, baseType: !881, size: 192, offset: 5632)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !786, file: !787, line: 382, baseType: !881, size: 192, offset: 5824)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !786, file: !787, line: 383, baseType: !881, size: 192, offset: 6016)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !786, file: !787, line: 384, baseType: !881, size: 192, offset: 6208)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !786, file: !787, line: 385, baseType: !881, size: 192, offset: 6400)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !786, file: !787, line: 386, baseType: !755, size: 32, offset: 6592)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !786, file: !787, line: 388, baseType: !755, size: 32, offset: 6624)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !786, file: !787, line: 389, baseType: !755, size: 32, offset: 6656)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !786, file: !787, line: 391, baseType: !763, size: 64, offset: 6720)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !786, file: !787, line: 393, baseType: !755, size: 32, offset: 6784)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !786, file: !787, line: 394, baseType: !755, size: 32, offset: 6816)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !786, file: !787, line: 395, baseType: !755, size: 32, offset: 6848)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !786, file: !787, line: 396, baseType: !755, size: 32, offset: 6880)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !786, file: !787, line: 398, baseType: !755, size: 32, offset: 6912)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !786, file: !787, line: 399, baseType: !755, size: 32, offset: 6944)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !786, file: !787, line: 402, baseType: !1051, size: 64, offset: 6976)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !758, line: 164, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !758, line: 191, size: 3328, elements: !1054)
!1054 = !{!1055, !1074, !1080, !1089, !1095, !1101, !1111, !1117, !1126, !1135, !1141, !1147, !1356, !1365, !1374, !1383, !1389, !1398, !1407, !1416, !1425, !1434, !1444, !1450, !1459, !1465}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1053, file: !758, line: 193, baseType: !1056, size: 128)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !758, line: 193, size: 128, elements: !1057)
!1057 = !{!1058, !1073}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1056, file: !758, line: 193, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !758, line: 83, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !758, line: 60, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !758, line: 179, size: 192, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !1065, file: !758, line: 181, baseType: !781, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1065, file: !758, line: 187, baseType: !1069, size: 128, offset: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !758, line: 184, size: 128, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1069, file: !758, line: 185, baseType: !781, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1069, file: !758, line: 186, baseType: !1063, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1056, file: !758, line: 193, baseType: !1063, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1053, file: !758, line: 194, baseType: !1075, size: 128, offset: 128)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !758, line: 194, size: 128, elements: !1076)
!1076 = !{!1077, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1075, file: !758, line: 194, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !758, line: 84, baseType: !1060)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1075, file: !758, line: 194, baseType: !1063, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1053, file: !758, line: 195, baseType: !1081, size: 128, offset: 256)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !758, line: 195, size: 128, elements: !1082)
!1082 = !{!1083, !1088}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1081, file: !758, line: 195, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !758, line: 85, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!755, !1063, !783}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1081, file: !758, line: 195, baseType: !1063, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1053, file: !758, line: 196, baseType: !1090, size: 128, offset: 384)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !758, line: 196, size: 128, elements: !1091)
!1091 = !{!1092, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1090, file: !758, line: 196, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !758, line: 86, baseType: !1085)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1090, file: !758, line: 196, baseType: !1063, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !1053, file: !758, line: 197, baseType: !1096, size: 128, offset: 512)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !758, line: 197, size: 128, elements: !1097)
!1097 = !{!1098, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1096, file: !758, line: 197, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !758, line: 87, baseType: !1085)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1096, file: !758, line: 197, baseType: !1063, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !1053, file: !758, line: 198, baseType: !1102, size: 128, offset: 640)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !758, line: 198, size: 128, elements: !1103)
!1103 = !{!1104, !1110}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1102, file: !758, line: 198, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !758, line: 92, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !758, line: 88, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!755, !1063, !783, !963, !965, !763, !763}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1102, file: !758, line: 198, baseType: !1063, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !1053, file: !758, line: 199, baseType: !1112, size: 128, offset: 768)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !758, line: 199, size: 128, elements: !1113)
!1113 = !{!1114, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1112, file: !758, line: 199, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !758, line: 93, baseType: !1106)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1112, file: !758, line: 199, baseType: !1063, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !1053, file: !758, line: 200, baseType: !1118, size: 128, offset: 896)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !758, line: 200, size: 128, elements: !1119)
!1119 = !{!1120, !1125}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1118, file: !758, line: 200, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !758, line: 94, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!755, !1063, !783, !771, !755, !763, !763}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1118, file: !758, line: 200, baseType: !1063, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !1053, file: !758, line: 201, baseType: !1127, size: 128, offset: 1024)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !758, line: 201, size: 128, elements: !1128)
!1128 = !{!1129, !1134}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1127, file: !758, line: 201, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !758, line: 98, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!763, !1063, !783, !763}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1127, file: !758, line: 201, baseType: !1063, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !1053, file: !758, line: 202, baseType: !1136, size: 128, offset: 1152)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !758, line: 202, size: 128, elements: !1137)
!1137 = !{!1138, !1140}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1136, file: !758, line: 202, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !758, line: 101, baseType: !1131)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1136, file: !758, line: 202, baseType: !1063, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !1053, file: !758, line: 203, baseType: !1142, size: 128, offset: 1280)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !758, line: 203, size: 128, elements: !1143)
!1143 = !{!1144, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1142, file: !758, line: 203, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !758, line: 104, baseType: !1131)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1142, file: !758, line: 203, baseType: !1063, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !1053, file: !758, line: 204, baseType: !1148, size: 128, offset: 1408)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !758, line: 204, size: 128, elements: !1149)
!1149 = !{!1150, !1355}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1148, file: !758, line: 204, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !758, line: 107, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!755, !1063, !783, !1155, !755, !755, !755, !755, !755, !1324}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !969, line: 61, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !787, line: 557, size: 135040, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1174, !1175, !1176, !1177, !1178, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !1157, file: !787, line: 561, baseType: !1003, size: 16384)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !1157, file: !787, line: 562, baseType: !1003, size: 16384, offset: 16384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !1157, file: !787, line: 563, baseType: !1003, size: 16384, offset: 32768)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !1157, file: !787, line: 564, baseType: !1003, size: 16384, offset: 49152)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !1157, file: !787, line: 565, baseType: !1003, size: 16384, offset: 65536)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !1157, file: !787, line: 566, baseType: !1003, size: 16384, offset: 81920)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !1157, file: !787, line: 567, baseType: !771, size: 64, offset: 98304)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !1157, file: !787, line: 568, baseType: !1003, size: 16384, offset: 98368)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !1157, file: !787, line: 569, baseType: !936, size: 8192, offset: 114752)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1157, file: !787, line: 570, baseType: !755, size: 32, offset: 122944)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !1157, file: !787, line: 571, baseType: !755, size: 32, offset: 122976)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !1157, file: !787, line: 572, baseType: !755, size: 32, offset: 123008)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1157, file: !787, line: 573, baseType: !755, size: 32, offset: 123040)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !1157, file: !787, line: 574, baseType: !1173, size: 64, offset: 123072)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !857, line: 284, baseType: !832)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1157, file: !787, line: 575, baseType: !755, size: 32, offset: 123136)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !1157, file: !787, line: 576, baseType: !1173, size: 64, offset: 123200)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1157, file: !787, line: 577, baseType: !856, size: 64, offset: 123264)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1157, file: !787, line: 578, baseType: !856, size: 64, offset: 123328)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1157, file: !787, line: 579, baseType: !1179, size: 8960, offset: 123392)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !1180, line: 47, baseType: !1181)
!1180 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !787, line: 486, size: 8960, elements: !1182)
!1182 = !{!1183, !1184, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1268, !1269, !1270, !1271, !1276, !1277, !1281, !1282, !1283, !1284, !1285, !1286}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !1181, file: !787, line: 487, baseType: !755, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !1181, file: !787, line: 488, baseType: !1185, size: 16, offset: 32)
!1185 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !1181, file: !787, line: 489, baseType: !1185, size: 16, offset: 48)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1181, file: !787, line: 490, baseType: !1185, size: 16, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !1181, file: !787, line: 491, baseType: !1185, size: 16, offset: 80)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !1181, file: !787, line: 492, baseType: !1185, size: 16, offset: 96)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !1181, file: !787, line: 493, baseType: !1185, size: 16, offset: 112)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !1181, file: !787, line: 494, baseType: !1185, size: 16, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !1181, file: !787, line: 495, baseType: !755, size: 32, offset: 160)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !1181, file: !787, line: 496, baseType: !755, size: 32, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !1181, file: !787, line: 497, baseType: !771, size: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1181, file: !787, line: 498, baseType: !771, size: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1181, file: !787, line: 499, baseType: !804, size: 64, offset: 384)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1181, file: !787, line: 500, baseType: !856, size: 64, offset: 448)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !1181, file: !787, line: 501, baseType: !1199, size: 640, offset: 512)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !1200)
!1200 = !{!1201}
!1201 = !DISubrange(count: 80)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !1181, file: !787, line: 502, baseType: !701, size: 512, offset: 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !1181, file: !787, line: 503, baseType: !701, size: 512, offset: 1664)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !1181, file: !787, line: 504, baseType: !701, size: 512, offset: 2176)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1181, file: !787, line: 505, baseType: !771, size: 64, offset: 2688)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !1181, file: !787, line: 506, baseType: !856, size: 64, offset: 2752)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !1181, file: !787, line: 507, baseType: !1185, size: 16, offset: 2816)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !1181, file: !787, line: 508, baseType: !1209, size: 32, offset: 2848)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !857, line: 323, baseType: !755)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1181, file: !787, line: 509, baseType: !1211, size: 224, offset: 2880)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !1212, line: 91, baseType: !1213)
!1212 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !1212, line: 93, size: 224, elements: !1214)
!1214 = !{!1215}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !1213, file: !1212, line: 103, baseType: !1216, size: 224)
!1216 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1213, file: !1212, line: 94, size: 224, elements: !1217)
!1217 = !{!1218, !1226, !1247}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1216, file: !1212, line: 96, baseType: !1219, size: 128)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1220, line: 180, size: 128, elements: !1221)
!1220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1221 = !{!1222, !1225}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1219, file: !1220, line: 182, baseType: !1223, size: 16)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1224, line: 28, baseType: !834)
!1224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1219, file: !1220, line: 183, baseType: !489, size: 112, offset: 16)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1216, file: !1212, line: 98, baseType: !1227, size: 128)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1228, line: 245, size: 128, elements: !1229)
!1228 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!1229 = !{!1230, !1231, !1236, !1244}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1227, file: !1228, line: 247, baseType: !1223, size: 16)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1227, file: !1228, line: 248, baseType: !1232, size: 16, offset: 16)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1228, line: 123, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1234, line: 25, baseType: !1235)
!1234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !831, line: 40, baseType: !834)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1227, file: !1228, line: 249, baseType: !1237, size: 32, offset: 32)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1228, line: 31, size: 32, elements: !1238)
!1238 = !{!1239}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1237, file: !1228, line: 33, baseType: !1240, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1228, line: 30, baseType: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1234, line: 26, baseType: !1242)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !831, line: 42, baseType: !1243)
!1243 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1227, file: !1228, line: 252, baseType: !1245, size: 64, offset: 64)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 64, elements: !134)
!1246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1216, file: !1212, line: 101, baseType: !1248, size: 224)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1228, line: 260, size: 224, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1267}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1248, file: !1228, line: 262, baseType: !1223, size: 16)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1248, file: !1228, line: 263, baseType: !1232, size: 16, offset: 16)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1248, file: !1228, line: 264, baseType: !1241, size: 32, offset: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1248, file: !1228, line: 265, baseType: !1254, size: 128, offset: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1228, line: 219, size: 128, elements: !1255)
!1255 = !{!1256}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1254, file: !1228, line: 226, baseType: !1257, size: 128)
!1257 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1254, file: !1228, line: 221, size: 128, elements: !1258)
!1258 = !{!1259, !1263, !1265}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1257, file: !1228, line: 223, baseType: !1260, size: 128)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1261, size: 128, elements: !75)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1234, line: 24, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !831, line: 38, baseType: !1246)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1257, file: !1228, line: 224, baseType: !1264, size: 128)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 128, elements: !134)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1257, file: !1228, line: 225, baseType: !1266, size: 128)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1241, size: 128, elements: !70)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1248, file: !1228, line: 266, baseType: !1241, size: 32, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !1181, file: !787, line: 510, baseType: !755, size: 32, offset: 3104)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !1181, file: !787, line: 511, baseType: !804, size: 64, offset: 3136)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !1181, file: !787, line: 513, baseType: !1185, size: 16, offset: 3200)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !1181, file: !787, line: 515, baseType: !1272, size: 64, offset: 3264)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !1274, line: 184, baseType: !1275)
!1274 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !1274, line: 184, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !1181, file: !787, line: 517, baseType: !701, size: 512, offset: 3328)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !1181, file: !787, line: 518, baseType: !1278, size: 2048, offset: 3840)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1279)
!1279 = !{!1280}
!1280 = !DISubrange(count: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !1181, file: !787, line: 519, baseType: !1278, size: 2048, offset: 5888)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !1181, file: !787, line: 520, baseType: !856, size: 64, offset: 7936)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !1181, file: !787, line: 521, baseType: !856, size: 64, offset: 8000)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !1181, file: !787, line: 522, baseType: !856, size: 64, offset: 8064)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !1181, file: !787, line: 523, baseType: !755, size: 32, offset: 8128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !1181, file: !787, line: 525, baseType: !1287, size: 768, offset: 8192)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !1180, line: 43, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !787, line: 465, size: 768, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1288, file: !787, line: 466, baseType: !1185, size: 16)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1288, file: !787, line: 467, baseType: !1185, size: 16, offset: 16)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !1288, file: !787, line: 468, baseType: !1185, size: 16, offset: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !1288, file: !787, line: 469, baseType: !1185, size: 16, offset: 48)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !1288, file: !787, line: 470, baseType: !1185, size: 16, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !1288, file: !787, line: 471, baseType: !1185, size: 16, offset: 80)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1288, file: !787, line: 472, baseType: !763, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1288, file: !787, line: 473, baseType: !763, size: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1288, file: !787, line: 474, baseType: !763, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !1288, file: !787, line: 475, baseType: !763, size: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !1288, file: !787, line: 476, baseType: !763, size: 64, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1288, file: !787, line: 477, baseType: !763, size: 64, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1288, file: !787, line: 478, baseType: !1303, size: 256, offset: 512)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !787, line: 452, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !787, line: 454, size: 256, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1304, file: !787, line: 455, baseType: !755, size: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1304, file: !787, line: 456, baseType: !763, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1304, file: !787, line: 457, baseType: !755, size: 32, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1304, file: !787, line: 458, baseType: !763, size: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !1157, file: !787, line: 580, baseType: !755, size: 32, offset: 132352)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !1157, file: !787, line: 581, baseType: !755, size: 32, offset: 132384)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !1157, file: !787, line: 582, baseType: !856, size: 64, offset: 132416)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !1157, file: !787, line: 583, baseType: !1173, size: 64, offset: 132480)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !1157, file: !787, line: 585, baseType: !755, size: 32, offset: 132544)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !1157, file: !787, line: 586, baseType: !755, size: 32, offset: 132576)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !1157, file: !787, line: 587, baseType: !771, size: 64, offset: 132608)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1157, file: !787, line: 588, baseType: !856, size: 64, offset: 132672)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !1157, file: !787, line: 589, baseType: !856, size: 64, offset: 132736)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !1157, file: !787, line: 590, baseType: !856, size: 64, offset: 132800)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1157, file: !787, line: 594, baseType: !1278, size: 2048, offset: 132864)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !1157, file: !787, line: 595, baseType: !755, size: 32, offset: 134912)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !1157, file: !787, line: 596, baseType: !755, size: 32, offset: 134944)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !1157, file: !787, line: 597, baseType: !755, size: 32, offset: 134976)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !785, line: 70, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !787, line: 414, size: 1344, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1331, !1332, !1333, !1334, !1336, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !1326, file: !787, line: 415, baseType: !856, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !1326, file: !787, line: 416, baseType: !856, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !1326, file: !787, line: 418, baseType: !1173, size: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !1326, file: !787, line: 420, baseType: !856, size: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !1326, file: !787, line: 421, baseType: !856, size: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !1326, file: !787, line: 422, baseType: !755, size: 32, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !1326, file: !787, line: 424, baseType: !1335, size: 128, offset: 384)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1173, size: 128, elements: !162)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !1326, file: !787, line: 425, baseType: !1337, size: 128, offset: 512)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 128, elements: !162)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !1326, file: !787, line: 426, baseType: !1173, size: 64, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !1326, file: !787, line: 427, baseType: !755, size: 32, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !1326, file: !787, line: 429, baseType: !755, size: 32, offset: 736)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !1326, file: !787, line: 430, baseType: !755, size: 32, offset: 768)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !1326, file: !787, line: 431, baseType: !755, size: 32, offset: 800)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !1326, file: !787, line: 433, baseType: !755, size: 32, offset: 832)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !1326, file: !787, line: 434, baseType: !755, size: 32, offset: 864)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !1326, file: !787, line: 435, baseType: !755, size: 32, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !1326, file: !787, line: 436, baseType: !755, size: 32, offset: 928)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !1326, file: !787, line: 437, baseType: !755, size: 32, offset: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !1326, file: !787, line: 438, baseType: !755, size: 32, offset: 992)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !1326, file: !787, line: 439, baseType: !755, size: 32, offset: 1024)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !1326, file: !787, line: 440, baseType: !755, size: 32, offset: 1056)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !1326, file: !787, line: 441, baseType: !856, size: 64, offset: 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !1326, file: !787, line: 443, baseType: !856, size: 64, offset: 1152)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !1326, file: !787, line: 445, baseType: !1173, size: 64, offset: 1216)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !1326, file: !787, line: 446, baseType: !1173, size: 64, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1148, file: !758, line: 204, baseType: !1063, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !1053, file: !758, line: 205, baseType: !1357, size: 128, offset: 1536)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !758, line: 205, size: 128, elements: !1358)
!1358 = !{!1359, !1364}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1357, file: !758, line: 205, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !758, line: 112, baseType: !1361)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!755, !1063, !783, !763, !763, !755}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1357, file: !758, line: 205, baseType: !1063, size: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !1053, file: !758, line: 206, baseType: !1366, size: 128, offset: 1664)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !758, line: 206, size: 128, elements: !1367)
!1367 = !{!1368, !1373}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1366, file: !758, line: 206, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !758, line: 115, baseType: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!755, !1063, !783, !763, !763, !763, !755}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1366, file: !758, line: 206, baseType: !1063, size: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !1053, file: !758, line: 207, baseType: !1375, size: 128, offset: 1792)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !758, line: 207, size: 128, elements: !1376)
!1376 = !{!1377, !1382}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1375, file: !758, line: 207, baseType: !1378, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !758, line: 119, baseType: !1379)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{null, !1063, !783, !763}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1375, file: !758, line: 207, baseType: !1063, size: 64, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !1053, file: !758, line: 208, baseType: !1384, size: 128, offset: 1920)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !758, line: 208, size: 128, elements: !1385)
!1385 = !{!1386, !1388}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1384, file: !758, line: 208, baseType: !1387, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !758, line: 121, baseType: !1379)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1384, file: !758, line: 208, baseType: !1063, size: 64, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !1053, file: !758, line: 209, baseType: !1390, size: 128, offset: 2048)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !758, line: 209, size: 128, elements: !1391)
!1391 = !{!1392, !1397}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1390, file: !758, line: 209, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !758, line: 123, baseType: !1394)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{null, !1063, !783, !763, !763, !763, !755, !755, !755}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1390, file: !758, line: 209, baseType: !1063, size: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !1053, file: !758, line: 210, baseType: !1399, size: 128, offset: 2176)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !758, line: 210, size: 128, elements: !1400)
!1400 = !{!1401, !1406}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1399, file: !758, line: 210, baseType: !1402, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !758, line: 128, baseType: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!755, !1063, !783, !771}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1399, file: !758, line: 210, baseType: !1063, size: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !1053, file: !758, line: 211, baseType: !1408, size: 128, offset: 2304)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !758, line: 211, size: 128, elements: !1409)
!1409 = !{!1410, !1415}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1408, file: !758, line: 211, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !758, line: 130, baseType: !1412)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!755, !1063, !783, !771, !763}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1408, file: !758, line: 211, baseType: !1063, size: 64, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !1053, file: !758, line: 212, baseType: !1417, size: 128, offset: 2432)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !758, line: 212, size: 128, elements: !1418)
!1418 = !{!1419, !1424}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1417, file: !758, line: 212, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !758, line: 133, baseType: !1421)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!755, !1063, !783, !1155}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1417, file: !758, line: 212, baseType: !1063, size: 64, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !1053, file: !758, line: 213, baseType: !1426, size: 128, offset: 2560)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !758, line: 213, size: 128, elements: !1427)
!1427 = !{!1428, !1433}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1426, file: !758, line: 213, baseType: !1429, size: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !758, line: 135, baseType: !1430)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!755, !1063, !783, !763, !763, !763, !763, !771}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1426, file: !758, line: 213, baseType: !1063, size: 64, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !1053, file: !758, line: 214, baseType: !1435, size: 128, offset: 2688)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !758, line: 214, size: 128, elements: !1436)
!1436 = !{!1437, !1443}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1435, file: !758, line: 214, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !758, line: 142, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!755, !1063, !783, !771, !763, !763, !763, !763, !1442}
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1435, file: !758, line: 214, baseType: !1063, size: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !1053, file: !758, line: 215, baseType: !1445, size: 128, offset: 2816)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !758, line: 215, size: 128, elements: !1446)
!1446 = !{!1447, !1449}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1445, file: !758, line: 215, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !758, line: 148, baseType: !1439)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1445, file: !758, line: 215, baseType: !1063, size: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !1053, file: !758, line: 216, baseType: !1451, size: 128, offset: 2944)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !758, line: 216, size: 128, elements: !1452)
!1452 = !{!1453, !1458}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1451, file: !758, line: 216, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !758, line: 156, baseType: !1455)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!755, !1063, !783, !756}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1451, file: !758, line: 216, baseType: !1063, size: 64, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !1053, file: !758, line: 217, baseType: !1460, size: 128, offset: 3072)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !758, line: 217, size: 128, elements: !1461)
!1461 = !{!1462, !1464}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1460, file: !758, line: 217, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !758, line: 158, baseType: !1455)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1460, file: !758, line: 217, baseType: !1063, size: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !1053, file: !758, line: 219, baseType: !1466, size: 128, offset: 3200)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !758, line: 219, size: 128, elements: !1467)
!1467 = !{!1468, !1470}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !1466, file: !758, line: 219, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !758, line: 141, baseType: !1429)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !1466, file: !758, line: 219, baseType: !1063, size: 64, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !786, file: !787, line: 404, baseType: !1472, size: 128, offset: 7040)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !787, line: 260, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !787, line: 270, size: 128, elements: !1474)
!1474 = !{!1475, !1476}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1473, file: !787, line: 271, baseType: !755, size: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1473, file: !787, line: 272, baseType: !1477, size: 64, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !787, line: 264, baseType: !1479)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !787, line: 266, size: 128, elements: !1480)
!1480 = !{!1481, !1482}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !1479, file: !787, line: 267, baseType: !771, size: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1479, file: !787, line: 268, baseType: !781, size: 64, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !786, file: !787, line: 406, baseType: !1484, size: 1126016, offset: 7168)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !787, line: 216, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !787, line: 218, size: 1126016, elements: !1486)
!1486 = !{!1487, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1532, !1544, !1552, !1558, !1565, !1566, !1567, !1568, !1578, !1579, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1597, !1598, !1599, !1600}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1485, file: !787, line: 219, baseType: !1488, size: 64)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !787, line: 204, baseType: !1489)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !1491, line: 59, size: 320, elements: !1492)
!1491 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!1492 = !{!1493}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1490, file: !1491, line: 60, baseType: !1494, size: 320)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !1495, line: 72, baseType: !1496)
!1495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!1496 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1495, line: 67, size: 320, elements: !1497)
!1497 = !{!1498, !1517, !1518}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !1496, file: !1495, line: 69, baseType: !1499, size: 320)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !1500, line: 22, size: 320, elements: !1501)
!1500 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!1501 = !{!1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !1499, file: !1500, line: 24, baseType: !755, size: 32)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1499, file: !1500, line: 25, baseType: !1243, size: 32, offset: 32)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !1499, file: !1500, line: 26, baseType: !755, size: 32, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !1499, file: !1500, line: 28, baseType: !1243, size: 32, offset: 96)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !1499, file: !1500, line: 32, baseType: !755, size: 32, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !1499, file: !1500, line: 34, baseType: !1185, size: 16, offset: 160)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !1499, file: !1500, line: 35, baseType: !1185, size: 16, offset: 176)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !1499, file: !1500, line: 36, baseType: !1510, size: 128, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !1511, line: 55, baseType: !1512)
!1511 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !1511, line: 51, size: 128, elements: !1513)
!1513 = !{!1514, !1516}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !1512, file: !1511, line: 53, baseType: !1515, size: 64)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !1512, file: !1511, line: 54, baseType: !1515, size: 64, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1496, file: !1495, line: 70, baseType: !236, size: 320)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1496, file: !1495, line: 71, baseType: !832, size: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1485, file: !787, line: 221, baseType: !755, size: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !1485, file: !787, line: 222, baseType: !755, size: 32, offset: 96)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !1485, file: !787, line: 223, baseType: !755, size: 32, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !1485, file: !787, line: 225, baseType: !755, size: 32, offset: 160)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !1485, file: !787, line: 226, baseType: !881, size: 192, offset: 192)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !1485, file: !787, line: 227, baseType: !804, size: 64, offset: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !1485, file: !787, line: 228, baseType: !755, size: 32, offset: 448)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !1485, file: !787, line: 230, baseType: !1527, size: 32832, offset: 512)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !787, line: 121, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !787, line: 123, size: 32832, elements: !1529)
!1529 = !{!1530, !1531}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !1528, file: !787, line: 124, baseType: !804, size: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1528, file: !787, line: 125, baseType: !1030, size: 32768, offset: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1485, file: !787, line: 232, baseType: !1533, size: 192, offset: 33344)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !787, line: 111, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !787, line: 112, size: 192, elements: !1535)
!1535 = !{!1536, !1537, !1542}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !1534, file: !787, line: 113, baseType: !781, size: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !1534, file: !787, line: 114, baseType: !1538, size: 64, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !787, line: 110, baseType: !1539)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!755}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1534, file: !787, line: 115, baseType: !1543, size: 64, offset: 128)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !1485, file: !787, line: 233, baseType: !1545, size: 1048608, offset: 33536)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !787, line: 131, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !787, line: 133, size: 1048608, elements: !1547)
!1547 = !{!1548, !1549}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1546, file: !787, line: 134, baseType: !755, size: 32)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1546, file: !787, line: 135, baseType: !1550, size: 1048576, offset: 32)
!1550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !1551)
!1551 = !{!76, !1010}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !1485, file: !787, line: 234, baseType: !1553, size: 16416, offset: 1082144)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !787, line: 153, baseType: !1554)
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !787, line: 155, size: 16416, elements: !1555)
!1555 = !{!1556, !1557}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !1554, file: !787, line: 156, baseType: !755, size: 32)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !1554, file: !787, line: 157, baseType: !1003, size: 16384, offset: 32)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !1485, file: !787, line: 235, baseType: !1559, size: 96, offset: 1098560)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !787, line: 163, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !787, line: 165, size: 96, elements: !1561)
!1561 = !{!1562, !1563, !1564}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1560, file: !787, line: 166, baseType: !755, size: 32)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !1560, file: !787, line: 167, baseType: !755, size: 32, offset: 32)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1560, file: !787, line: 168, baseType: !755, size: 32, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !1485, file: !787, line: 236, baseType: !771, size: 64, offset: 1098688)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !1485, file: !787, line: 237, baseType: !755, size: 32, offset: 1098752)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !1485, file: !787, line: 238, baseType: !755, size: 32, offset: 1098784)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !1485, file: !787, line: 239, baseType: !1569, size: 64, offset: 1098816)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !1180, line: 51, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !1180, line: 150, size: 704, elements: !1572)
!1572 = !{!1573, !1575, !1576, !1577}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1571, file: !1180, line: 151, baseType: !1574, size: 64)
