; ModuleID = 'src/htsserver.c'
source_filename = "src/htsserver.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.initIntElt = type { ptr, i32 }
%struct.initStrElt = type { ptr, ptr }
%struct.SOCaddr = type { %union.anon }
%union.anon = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon.0 }
%union.anon.0 = type { [4 x i32] }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.String = type { ptr, i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.coucal_value = type { i64 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }

@NewLangStrSz = dso_local global i32 1024, align 4, !dbg !0
@NewLangStr = dso_local global ptr null, align 8, !dbg !93
@NewLangStrKeysSz = dso_local global i32 1024, align 4, !dbg !99
@NewLangStrKeys = dso_local global ptr null, align 8, !dbg !101
@NewLangListSz = dso_local global i32 1024, align 4, !dbg !103
@NewLangList = dso_local global ptr null, align 8, !dbg !105
@commandRunning = dso_local global i32 0, align 4, !dbg !107

!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !91, line: 49, baseType: !79)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "", checksumkind: CSK_MD5, checksum: "5ab727ca201ba12ae255687119da3fa7")
!92 = !{!0, !93, !99, !101, !103, !105, !107, !109, !111, !113, !115, !117, !119, !121, !891, !894, !899, !904, !909, !914, !917, !922, !924, !926, !928, !930, !935, !937, !939, !941, !943, !945, !947, !949, !951, !956, !961, !963, !968, !970, !972, !974, !977, !982, !984, !989, !991, !996, !1001, !1006, !1008, !1013, !1015, !1017, !1019, !1021, !1023, !1025, !1028, !1033, !1038, !1040, !1042, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1081, !1083, !1085, !1087, !1089, !1091, !1096, !1098, !1100, !1102, !1104, !1106, !1111, !1113, !1118, !1120, !1122, !1124, !1126, !1128, !1133, !1135, !1140, !1145, !1147, !1152, !1154, !1156, !1158, !1163, !1168, !1170, !1172, !1174, !1176, !1178, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1194, !1196, !1198, !1200, !1202, !1204, !1209, !1211, !1213, !1215, !1217, !1219, !1221, !1223, !1225, !1227, !1229, !1231, !1236, !1238, !1240, !1245, !1247, !1249, !1251, !1253, !1255, !1257, !1259, !1261, !1263, !1265, !1267, !1269, !1271, !1273, !1275, !1277, !1279, !1281, !1283, !1285, !1287, !1289, !1291, !1293, !1298, !1300, !1302, !1304, !1309, !1314, !1316, !1318, !1320, !1322, !1325, !1328, !1330, !1332, !1334, !1339, !1341, !1346, !1348, !1353, !1356, !1358, !1360, !1362, !1364, !1366, !1368, !1370, !1372, !1374, !1376, !1378, !1380, !1382, !1384, !1390, !1392, !1395, !1397}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "NewLangStr", scope: !2, file: !3, line: 74, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !96, line: 210, baseType: !97)
!96 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !96, line: 210, flags: DIFlagFwdDecl)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "NewLangStrKeysSz", scope: !2, file: !3, line: 75, type: !67, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "NewLangStrKeys", scope: !2, file: !3, line: 76, type: !95, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "NewLangListSz", scope: !2, file: !3, line: 77, type: !67, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "NewLangList", scope: !2, file: !3, line: 78, type: !95, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "commandRunning", scope: !2, file: !3, line: 85, type: !67, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "commandEndRequested", scope: !2, file: !3, line: 86, type: !67, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "commandEnd", scope: !2, file: !3, line: 87, type: !67, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "commandReturn", scope: !2, file: !3, line: 88, type: !67, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "commandReturnMsg", scope: !2, file: !3, line: 89, type: !74, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "commandReturnCmdl", scope: !2, file: !3, line: 90, type: !74, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "commandReturnSet", scope: !2, file: !3, line: 91, type: !67, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "global_opt", scope: !2, file: !3, line: 93, type: !123, isLocal: false, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !125, line: 49, baseType: !126)
!125 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !96, line: 294, size: 1133184, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !193, !194, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !210, !211, !212, !213, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !304, !308, !327, !328, !332, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !785, !797}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !126, file: !96, line: 295, baseType: !80, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !126, file: !96, line: 297, baseType: !67, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !126, file: !96, line: 298, baseType: !67, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !126, file: !96, line: 299, baseType: !67, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !126, file: !96, line: 300, baseType: !67, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !126, file: !96, line: 301, baseType: !67, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !126, file: !96, line: 302, baseType: !67, size: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !126, file: !96, line: 303, baseType: !67, size: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !126, file: !96, line: 304, baseType: !67, size: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !126, file: !96, line: 305, baseType: !67, size: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !126, file: !96, line: 306, baseType: !67, size: 32, offset: 352)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !126, file: !96, line: 307, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !142, line: 7, baseType: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !144, line: 49, size: 1728, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !161, !163, !164, !165, !167, !168, !170, !174, !177, !179, !182, !185, !186, !187, !188, !189}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !143, file: !144, line: 51, baseType: !67, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !143, file: !144, line: 54, baseType: !74, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !143, file: !144, line: 55, baseType: !74, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !143, file: !144, line: 56, baseType: !74, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !143, file: !144, line: 57, baseType: !74, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !143, file: !144, line: 58, baseType: !74, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !143, file: !144, line: 59, baseType: !74, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !143, file: !144, line: 60, baseType: !74, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !143, file: !144, line: 61, baseType: !74, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !143, file: !144, line: 64, baseType: !74, size: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !143, file: !144, line: 65, baseType: !74, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !143, file: !144, line: 66, baseType: !74, size: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !143, file: !144, line: 68, baseType: !159, size: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !144, line: 36, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !143, file: !144, line: 70, baseType: !162, size: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !143, file: !144, line: 72, baseType: !67, size: 32, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !143, file: !144, line: 73, baseType: !67, size: 32, offset: 928)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !143, file: !144, line: 74, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 152, baseType: !79)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !143, file: !144, line: 77, baseType: !73, size: 16, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !143, file: !144, line: 78, baseType: !169, size: 8, offset: 1040)
!169 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !143, file: !144, line: 79, baseType: !171, size: 8, offset: 1048)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !143, file: !144, line: 81, baseType: !175, size: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !144, line: 43, baseType: null)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !143, file: !144, line: 89, baseType: !178, size: 64, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !72, line: 153, baseType: !79)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !143, file: !144, line: 91, baseType: !180, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !144, line: 37, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !143, file: !144, line: 92, baseType: !183, size: 64, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !144, line: 38, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !143, file: !144, line: 93, baseType: !162, size: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !143, file: !144, line: 94, baseType: !83, size: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !143, file: !144, line: 95, baseType: !80, size: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !143, file: !144, line: 96, baseType: !67, size: 32, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !143, file: !144, line: 98, baseType: !190, size: 160, offset: 1568)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 160, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 20)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !126, file: !96, line: 308, baseType: !140, size: 64, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !126, file: !96, line: 309, baseType: !195, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !66, line: 283, baseType: !79)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !126, file: !96, line: 310, baseType: !195, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !126, file: !96, line: 311, baseType: !195, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !126, file: !96, line: 312, baseType: !67, size: 32, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !126, file: !96, line: 313, baseType: !195, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !126, file: !96, line: 314, baseType: !67, size: 32, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !126, file: !96, line: 315, baseType: !67, size: 32, offset: 864)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !126, file: !96, line: 316, baseType: !67, size: 32, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !126, file: !96, line: 317, baseType: !67, size: 32, offset: 928)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !126, file: !96, line: 318, baseType: !67, size: 32, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !126, file: !96, line: 319, baseType: !67, size: 32, offset: 992)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !126, file: !96, line: 320, baseType: !67, size: 32, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !126, file: !96, line: 321, baseType: !67, size: 32, offset: 1056)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !126, file: !96, line: 322, baseType: !209, size: 32, offset: 1088)
!209 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !126, file: !96, line: 323, baseType: !67, size: 32, offset: 1120)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !126, file: !96, line: 324, baseType: !67, size: 32, offset: 1152)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !126, file: !96, line: 326, baseType: !67, size: 32, offset: 1184)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !126, file: !96, line: 327, baseType: !214, size: 512, offset: 1216)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !96, line: 89, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !96, line: 91, size: 512, elements: !216)
!216 = !{!217, !218, !226, !227}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !215, file: !96, line: 92, baseType: !67, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !96, line: 93, baseType: !219, size: 192, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !220, line: 57, baseType: !221)
!220 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !220, line: 61, size: 192, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !221, file: !220, line: 62, baseType: !74, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !221, file: !220, line: 63, baseType: !80, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !221, file: !220, line: 64, baseType: !80, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !215, file: !96, line: 94, baseType: !67, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !215, file: !96, line: 95, baseType: !219, size: 192, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !126, file: !96, line: 328, baseType: !67, size: 32, offset: 1728)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !126, file: !96, line: 329, baseType: !67, size: 32, offset: 1760)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !126, file: !96, line: 330, baseType: !219, size: 192, offset: 1792)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !126, file: !96, line: 331, baseType: !67, size: 32, offset: 1984)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !126, file: !96, line: 332, baseType: !67, size: 32, offset: 2016)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !126, file: !96, line: 333, baseType: !67, size: 32, offset: 2048)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !126, file: !96, line: 334, baseType: !67, size: 32, offset: 2080)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !126, file: !96, line: 335, baseType: !219, size: 192, offset: 2112)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !126, file: !96, line: 336, baseType: !219, size: 192, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !126, file: !96, line: 337, baseType: !219, size: 192, offset: 2496)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !126, file: !96, line: 338, baseType: !219, size: 192, offset: 2688)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !126, file: !96, line: 339, baseType: !219, size: 192, offset: 2880)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !126, file: !96, line: 340, baseType: !219, size: 192, offset: 3072)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !126, file: !96, line: 341, baseType: !219, size: 192, offset: 3264)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !126, file: !96, line: 342, baseType: !67, size: 32, offset: 3456)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !126, file: !96, line: 343, baseType: !67, size: 32, offset: 3488)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !126, file: !96, line: 344, baseType: !67, size: 32, offset: 3520)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !126, file: !96, line: 345, baseType: !67, size: 32, offset: 3552)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !126, file: !96, line: 346, baseType: !67, size: 32, offset: 3584)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !126, file: !96, line: 347, baseType: !67, size: 32, offset: 3616)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !126, file: !96, line: 348, baseType: !67, size: 32, offset: 3648)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !126, file: !96, line: 349, baseType: !67, size: 32, offset: 3680)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !126, file: !96, line: 350, baseType: !67, size: 32, offset: 3712)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !126, file: !96, line: 351, baseType: !67, size: 32, offset: 3744)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !126, file: !96, line: 352, baseType: !67, size: 32, offset: 3776)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !126, file: !96, line: 353, baseType: !67, size: 32, offset: 3808)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !126, file: !96, line: 354, baseType: !67, size: 32, offset: 3840)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !126, file: !96, line: 355, baseType: !219, size: 192, offset: 3904)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !126, file: !96, line: 356, baseType: !67, size: 32, offset: 4096)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !126, file: !96, line: 357, baseType: !67, size: 32, offset: 4128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !126, file: !96, line: 358, baseType: !259, size: 64, offset: 4160)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !261, line: 53, baseType: !262)
!261 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !261, line: 55, size: 278656, elements: !263)
!263 = !{!264, !265, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !262, file: !261, line: 56, baseType: !67, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !261, line: 57, baseType: !266, size: 262144, offset: 32)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 262144, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 32768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !262, file: !261, line: 58, baseType: !270, size: 16448, offset: 262208)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !261, line: 42, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !261, line: 44, size: 16448, elements: !272)
!272 = !{!273, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !271, file: !261, line: 45, baseType: !274, size: 8192)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8192, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 1024)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !271, file: !261, line: 46, baseType: !274, size: 8192, offset: 8192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !261, line: 47, baseType: !279, size: 64, offset: 16384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !126, file: !96, line: 359, baseType: !67, size: 32, offset: 4224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !126, file: !96, line: 360, baseType: !67, size: 32, offset: 4256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !126, file: !96, line: 361, baseType: !67, size: 32, offset: 4288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !126, file: !96, line: 362, baseType: !67, size: 32, offset: 4320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !126, file: !96, line: 363, baseType: !67, size: 32, offset: 4352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !126, file: !96, line: 364, baseType: !67, size: 32, offset: 4384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !126, file: !96, line: 365, baseType: !67, size: 32, offset: 4416)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !126, file: !96, line: 366, baseType: !67, size: 32, offset: 4448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !126, file: !96, line: 367, baseType: !67, size: 32, offset: 4480)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !126, file: !96, line: 368, baseType: !67, size: 32, offset: 4512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !126, file: !96, line: 369, baseType: !219, size: 192, offset: 4544)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !126, file: !96, line: 370, baseType: !67, size: 32, offset: 4736)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !126, file: !96, line: 372, baseType: !67, size: 32, offset: 4768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !126, file: !96, line: 373, baseType: !219, size: 192, offset: 4800)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !126, file: !96, line: 374, baseType: !219, size: 192, offset: 4992)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !126, file: !96, line: 375, baseType: !296, size: 128, offset: 5184)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !96, line: 101, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !96, line: 103, size: 128, elements: !298)
!298 = !{!299, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !297, file: !96, line: 104, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !297, file: !96, line: 105, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !126, file: !96, line: 376, baseType: !305, size: 64, offset: 5312)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !96, line: 57, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !96, line: 57, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !126, file: !96, line: 377, baseType: !309, size: 64, offset: 5376)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !96, line: 174, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !96, line: 534, size: 640, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !312, file: !96, line: 535, baseType: !74, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !312, file: !96, line: 536, baseType: !74, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !312, file: !96, line: 537, baseType: !74, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !312, file: !96, line: 538, baseType: !74, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !312, file: !96, line: 539, baseType: !74, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !312, file: !96, line: 540, baseType: !74, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !312, file: !96, line: 542, baseType: !67, size: 32, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !312, file: !96, line: 543, baseType: !67, size: 32, offset: 416)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !312, file: !96, line: 544, baseType: !67, size: 32, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !312, file: !96, line: 545, baseType: !67, size: 32, offset: 480)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !312, file: !96, line: 546, baseType: !75, size: 8, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !312, file: !96, line: 548, baseType: !67, size: 32, offset: 544)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !312, file: !96, line: 549, baseType: !67, size: 32, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !126, file: !96, line: 378, baseType: !67, size: 32, offset: 5440)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !126, file: !96, line: 379, baseType: !329, size: 64, offset: 5504)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !96, line: 286, baseType: !331)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !96, line: 286, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !126, file: !96, line: 380, baseType: !333, size: 64, offset: 5568)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !96, line: 61, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !96, line: 61, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !126, file: !96, line: 381, baseType: !219, size: 192, offset: 5632)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !126, file: !96, line: 382, baseType: !219, size: 192, offset: 5824)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !126, file: !96, line: 383, baseType: !219, size: 192, offset: 6016)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !126, file: !96, line: 384, baseType: !219, size: 192, offset: 6208)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !126, file: !96, line: 385, baseType: !219, size: 192, offset: 6400)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !126, file: !96, line: 386, baseType: !67, size: 32, offset: 6592)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !126, file: !96, line: 388, baseType: !67, size: 32, offset: 6624)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !126, file: !96, line: 389, baseType: !67, size: 32, offset: 6656)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !126, file: !96, line: 391, baseType: !84, size: 64, offset: 6720)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !126, file: !96, line: 393, baseType: !67, size: 32, offset: 6784)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !126, file: !96, line: 394, baseType: !67, size: 32, offset: 6816)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !126, file: !96, line: 395, baseType: !67, size: 32, offset: 6848)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !126, file: !96, line: 396, baseType: !67, size: 32, offset: 6880)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !126, file: !96, line: 398, baseType: !67, size: 32, offset: 6912)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !126, file: !96, line: 399, baseType: !67, size: 32, offset: 6944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !126, file: !96, line: 402, baseType: !352, size: 64, offset: 6976)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !354, line: 164, baseType: !355)
!354 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !354, line: 191, size: 3328, elements: !356)
!356 = !{!357, !376, !382, !391, !397, !403, !413, !419, !428, !437, !443, !449, !667, !676, !685, !694, !700, !709, !718, !727, !736, !745, !755, !761, !773, !779}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !355, file: !354, line: 193, baseType: !358, size: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !354, line: 193, size: 128, elements: !359)
!359 = !{!360, !375}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !358, file: !354, line: 193, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !354, line: 83, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !354, line: 60, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !354, line: 179, size: 192, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !367, file: !354, line: 181, baseType: !83, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !367, file: !354, line: 187, baseType: !371, size: 128, offset: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !354, line: 184, size: 128, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !371, file: !354, line: 185, baseType: !83, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !371, file: !354, line: 186, baseType: !365, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !358, file: !354, line: 193, baseType: !365, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !355, file: !354, line: 194, baseType: !377, size: 128, offset: 128)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !354, line: 194, size: 128, elements: !378)
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !377, file: !354, line: 194, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !354, line: 84, baseType: !362)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !377, file: !354, line: 194, baseType: !365, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !355, file: !354, line: 195, baseType: !383, size: 128, offset: 256)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !354, line: 195, size: 128, elements: !384)
!384 = !{!385, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !383, file: !354, line: 195, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !354, line: 85, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!67, !365, !123}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !383, file: !354, line: 195, baseType: !365, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !355, file: !354, line: 196, baseType: !392, size: 128, offset: 384)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !354, line: 196, size: 128, elements: !393)
!393 = !{!394, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !392, file: !354, line: 196, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !354, line: 86, baseType: !387)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !392, file: !354, line: 196, baseType: !365, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !355, file: !354, line: 197, baseType: !398, size: 128, offset: 512)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !354, line: 197, size: 128, elements: !399)
!399 = !{!400, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !398, file: !354, line: 197, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !354, line: 87, baseType: !387)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !398, file: !354, line: 197, baseType: !365, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !355, file: !354, line: 198, baseType: !404, size: 128, offset: 640)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !354, line: 198, size: 128, elements: !405)
!405 = !{!406, !412}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !404, file: !354, line: 198, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !354, line: 92, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !354, line: 88, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!67, !365, !123, !301, !303, !84, !84}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !404, file: !354, line: 198, baseType: !365, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !355, file: !354, line: 199, baseType: !414, size: 128, offset: 768)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !354, line: 199, size: 128, elements: !415)
!415 = !{!416, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !414, file: !354, line: 199, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !354, line: 93, baseType: !408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !414, file: !354, line: 199, baseType: !365, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !355, file: !354, line: 200, baseType: !420, size: 128, offset: 896)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !354, line: 200, size: 128, elements: !421)
!421 = !{!422, !427}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !420, file: !354, line: 200, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !354, line: 94, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!67, !365, !123, !74, !67, !84, !84}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !420, file: !354, line: 200, baseType: !365, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !355, file: !354, line: 201, baseType: !429, size: 128, offset: 1024)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !354, line: 201, size: 128, elements: !430)
!430 = !{!431, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !429, file: !354, line: 201, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !354, line: 98, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!84, !365, !123, !84}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !429, file: !354, line: 201, baseType: !365, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !355, file: !354, line: 202, baseType: !438, size: 128, offset: 1152)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !354, line: 202, size: 128, elements: !439)
!439 = !{!440, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !438, file: !354, line: 202, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !354, line: 101, baseType: !433)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !438, file: !354, line: 202, baseType: !365, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !355, file: !354, line: 203, baseType: !444, size: 128, offset: 1280)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !354, line: 203, size: 128, elements: !445)
!445 = !{!446, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !444, file: !354, line: 203, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !354, line: 104, baseType: !433)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !444, file: !354, line: 203, baseType: !365, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !355, file: !354, line: 204, baseType: !450, size: 128, offset: 1408)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !354, line: 204, size: 128, elements: !451)
!451 = !{!452, !666}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !450, file: !354, line: 204, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !354, line: 107, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!67, !365, !123, !457, !67, !67, !67, !67, !67, !633}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !354, line: 44, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !96, line: 557, size: 135040, elements: !460)
!460 = !{!461, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !479, !480, !481, !482, !483, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !459, file: !96, line: 561, baseType: !462, size: 16384)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16384, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 2048)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !459, file: !96, line: 562, baseType: !462, size: 16384, offset: 16384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !459, file: !96, line: 563, baseType: !462, size: 16384, offset: 32768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !459, file: !96, line: 564, baseType: !462, size: 16384, offset: 49152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !459, file: !96, line: 565, baseType: !462, size: 16384, offset: 65536)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !459, file: !96, line: 566, baseType: !462, size: 16384, offset: 81920)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !459, file: !96, line: 567, baseType: !74, size: 64, offset: 98304)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !459, file: !96, line: 568, baseType: !462, size: 16384, offset: 98368)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !459, file: !96, line: 569, baseType: !274, size: 8192, offset: 114752)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !459, file: !96, line: 570, baseType: !67, size: 32, offset: 122944)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !459, file: !96, line: 571, baseType: !67, size: 32, offset: 122976)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !459, file: !96, line: 572, baseType: !67, size: 32, offset: 123008)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !459, file: !96, line: 573, baseType: !67, size: 32, offset: 123040)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !459, file: !96, line: 574, baseType: !478, size: 64, offset: 123072)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !66, line: 284, baseType: !79)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !459, file: !96, line: 575, baseType: !67, size: 32, offset: 123136)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !459, file: !96, line: 576, baseType: !478, size: 64, offset: 123200)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !459, file: !96, line: 577, baseType: !195, size: 64, offset: 123264)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !459, file: !96, line: 578, baseType: !195, size: 64, offset: 123328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !459, file: !96, line: 579, baseType: !484, size: 8960, offset: 123392)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !485, line: 47, baseType: !486)
!485 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !96, line: 486, size: 8960, elements: !487)
!487 = !{!488, !489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !507, !511, !512, !513, !514, !515, !516, !517, !577, !578, !579, !580, !585, !586, !590, !591, !592, !593, !594, !595}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !486, file: !96, line: 487, baseType: !67, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !486, file: !96, line: 488, baseType: !490, size: 16, offset: 32)
!490 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !486, file: !96, line: 489, baseType: !490, size: 16, offset: 48)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !486, file: !96, line: 490, baseType: !490, size: 16, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !486, file: !96, line: 491, baseType: !490, size: 16, offset: 80)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !486, file: !96, line: 492, baseType: !490, size: 16, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !486, file: !96, line: 493, baseType: !490, size: 16, offset: 112)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !486, file: !96, line: 494, baseType: !490, size: 16, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !486, file: !96, line: 495, baseType: !67, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !486, file: !96, line: 496, baseType: !67, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !486, file: !96, line: 497, baseType: !74, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !486, file: !96, line: 498, baseType: !74, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !486, file: !96, line: 499, baseType: !140, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !96, line: 500, baseType: !195, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !486, file: !96, line: 501, baseType: !504, size: 640, offset: 512)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 640, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 80)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !486, file: !96, line: 502, baseType: !508, size: 512, offset: 1152)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !486, file: !96, line: 503, baseType: !508, size: 512, offset: 1664)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !486, file: !96, line: 504, baseType: !508, size: 512, offset: 2176)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !486, file: !96, line: 505, baseType: !74, size: 64, offset: 2688)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !486, file: !96, line: 506, baseType: !195, size: 64, offset: 2752)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !486, file: !96, line: 507, baseType: !490, size: 16, offset: 2816)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !486, file: !96, line: 508, baseType: !65, size: 32, offset: 2848)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !486, file: !96, line: 509, baseType: !518, size: 224, offset: 2880)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !519, line: 91, baseType: !520)
!519 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !519, line: 93, size: 224, elements: !521)
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !520, file: !519, line: 103, baseType: !523, size: 224)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !519, line: 94, size: 224, elements: !524)
!524 = !{!525, !536, !552}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !523, file: !519, line: 96, baseType: !526, size: 128)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !527, line: 180, size: 128, elements: !528)
!527 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!528 = !{!529, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !526, file: !527, line: 182, baseType: !530, size: 16)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !531, line: 28, baseType: !73)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !526, file: !527, line: 183, baseType: !533, size: 112, offset: 16)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 112, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 14)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !523, file: !519, line: 98, baseType: !537, size: 128)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !34, line: 245, size: 128, elements: !538)
!538 = !{!539, !540, !541, !548}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !537, file: !34, line: 247, baseType: !530, size: 16)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !537, file: !34, line: 248, baseType: !68, size: 16, offset: 16)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !537, file: !34, line: 249, baseType: !542, size: 32, offset: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !34, line: 31, size: 32, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !542, file: !34, line: 33, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !34, line: 30, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !70, line: 26, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !72, line: 42, baseType: !7)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !537, file: !34, line: 252, baseType: !549, size: 64, offset: 64)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 64, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 8)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !523, file: !519, line: 101, baseType: !553, size: 224)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !34, line: 260, size: 224, elements: !554)
!554 = !{!555, !556, !557, !558, !576}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !553, file: !34, line: 262, baseType: !530, size: 16)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !553, file: !34, line: 263, baseType: !68, size: 16, offset: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !553, file: !34, line: 264, baseType: !546, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !553, file: !34, line: 265, baseType: !559, size: 128, offset: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !34, line: 219, size: 128, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !559, file: !34, line: 226, baseType: !562, size: 128)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !34, line: 221, size: 128, elements: !563)
!563 = !{!564, !570, !572}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !562, file: !34, line: 223, baseType: !565, size: 128)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !568)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !70, line: 24, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !72, line: 38, baseType: !89)
!568 = !{!569}
!569 = !DISubrange(count: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !562, file: !34, line: 224, baseType: !571, size: 128)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !550)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !562, file: !34, line: 225, baseType: !573, size: 128)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 128, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 4)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !553, file: !34, line: 266, baseType: !546, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !486, file: !96, line: 510, baseType: !67, size: 32, offset: 3104)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !486, file: !96, line: 511, baseType: !140, size: 64, offset: 3136)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !486, file: !96, line: 513, baseType: !490, size: 16, offset: 3200)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !486, file: !96, line: 515, baseType: !581, size: 64, offset: 3264)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !583, line: 184, baseType: !584)
!583 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !583, line: 184, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !486, file: !96, line: 517, baseType: !508, size: 512, offset: 3328)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !486, file: !96, line: 518, baseType: !587, size: 2048, offset: 3840)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 2048, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !486, file: !96, line: 519, baseType: !587, size: 2048, offset: 5888)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !486, file: !96, line: 520, baseType: !195, size: 64, offset: 7936)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !486, file: !96, line: 521, baseType: !195, size: 64, offset: 8000)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !486, file: !96, line: 522, baseType: !195, size: 64, offset: 8064)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !486, file: !96, line: 523, baseType: !67, size: 32, offset: 8128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !486, file: !96, line: 525, baseType: !596, size: 768, offset: 8192)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !485, line: 43, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !96, line: 465, size: 768, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !597, file: !96, line: 466, baseType: !490, size: 16)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !597, file: !96, line: 467, baseType: !490, size: 16, offset: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !597, file: !96, line: 468, baseType: !490, size: 16, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !597, file: !96, line: 469, baseType: !490, size: 16, offset: 48)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !597, file: !96, line: 470, baseType: !490, size: 16, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !597, file: !96, line: 471, baseType: !490, size: 16, offset: 80)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !597, file: !96, line: 472, baseType: !84, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !597, file: !96, line: 473, baseType: !84, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !597, file: !96, line: 474, baseType: !84, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !597, file: !96, line: 475, baseType: !84, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !597, file: !96, line: 476, baseType: !84, size: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !597, file: !96, line: 477, baseType: !84, size: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !597, file: !96, line: 478, baseType: !612, size: 256, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !96, line: 452, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !96, line: 454, size: 256, elements: !614)
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !613, file: !96, line: 455, baseType: !67, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !96, line: 456, baseType: !84, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !613, file: !96, line: 457, baseType: !67, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !613, file: !96, line: 458, baseType: !84, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !459, file: !96, line: 580, baseType: !67, size: 32, offset: 132352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !459, file: !96, line: 581, baseType: !67, size: 32, offset: 132384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !459, file: !96, line: 582, baseType: !195, size: 64, offset: 132416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !459, file: !96, line: 583, baseType: !478, size: 64, offset: 132480)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !459, file: !96, line: 585, baseType: !67, size: 32, offset: 132544)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !459, file: !96, line: 586, baseType: !67, size: 32, offset: 132576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !459, file: !96, line: 587, baseType: !74, size: 64, offset: 132608)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !459, file: !96, line: 588, baseType: !195, size: 64, offset: 132672)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !459, file: !96, line: 589, baseType: !195, size: 64, offset: 132736)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !459, file: !96, line: 590, baseType: !195, size: 64, offset: 132800)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !459, file: !96, line: 594, baseType: !587, size: 2048, offset: 132864)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !459, file: !96, line: 595, baseType: !67, size: 32, offset: 134912)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !459, file: !96, line: 596, baseType: !67, size: 32, offset: 134944)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !459, file: !96, line: 597, baseType: !67, size: 32, offset: 134976)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !125, line: 70, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !96, line: 414, size: 1344, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !647, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !635, file: !96, line: 415, baseType: !195, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !635, file: !96, line: 416, baseType: !195, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !635, file: !96, line: 418, baseType: !478, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !635, file: !96, line: 420, baseType: !195, size: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !635, file: !96, line: 421, baseType: !195, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !635, file: !96, line: 422, baseType: !67, size: 32, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !635, file: !96, line: 424, baseType: !644, size: 128, offset: 384)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 128, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 2)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !635, file: !96, line: 425, baseType: !648, size: 128, offset: 512)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 128, elements: !645)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !635, file: !96, line: 426, baseType: !478, size: 64, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !635, file: !96, line: 427, baseType: !67, size: 32, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !635, file: !96, line: 429, baseType: !67, size: 32, offset: 736)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !635, file: !96, line: 430, baseType: !67, size: 32, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !635, file: !96, line: 431, baseType: !67, size: 32, offset: 800)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !635, file: !96, line: 433, baseType: !67, size: 32, offset: 832)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !635, file: !96, line: 434, baseType: !67, size: 32, offset: 864)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !635, file: !96, line: 435, baseType: !67, size: 32, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !635, file: !96, line: 436, baseType: !67, size: 32, offset: 928)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !635, file: !96, line: 437, baseType: !67, size: 32, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !635, file: !96, line: 438, baseType: !67, size: 32, offset: 992)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !635, file: !96, line: 439, baseType: !67, size: 32, offset: 1024)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !635, file: !96, line: 440, baseType: !67, size: 32, offset: 1056)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !635, file: !96, line: 441, baseType: !195, size: 64, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !635, file: !96, line: 443, baseType: !195, size: 64, offset: 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !635, file: !96, line: 445, baseType: !478, size: 64, offset: 1216)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !635, file: !96, line: 446, baseType: !478, size: 64, offset: 1280)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !450, file: !354, line: 204, baseType: !365, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !355, file: !354, line: 205, baseType: !668, size: 128, offset: 1536)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !354, line: 205, size: 128, elements: !669)
!669 = !{!670, !675}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !668, file: !354, line: 205, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !354, line: 112, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!67, !365, !123, !84, !84, !67}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !668, file: !354, line: 205, baseType: !365, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !355, file: !354, line: 206, baseType: !677, size: 128, offset: 1664)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !354, line: 206, size: 128, elements: !678)
!678 = !{!679, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !677, file: !354, line: 206, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !354, line: 115, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!67, !365, !123, !84, !84, !84, !67}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !677, file: !354, line: 206, baseType: !365, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !355, file: !354, line: 207, baseType: !686, size: 128, offset: 1792)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !354, line: 207, size: 128, elements: !687)
!687 = !{!688, !693}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !686, file: !354, line: 207, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !354, line: 119, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !365, !123, !84}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !686, file: !354, line: 207, baseType: !365, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !355, file: !354, line: 208, baseType: !695, size: 128, offset: 1920)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !354, line: 208, size: 128, elements: !696)
!696 = !{!697, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !695, file: !354, line: 208, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !354, line: 121, baseType: !690)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !695, file: !354, line: 208, baseType: !365, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !355, file: !354, line: 209, baseType: !701, size: 128, offset: 2048)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !354, line: 209, size: 128, elements: !702)
!702 = !{!703, !708}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !701, file: !354, line: 209, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !354, line: 123, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !365, !123, !84, !84, !84, !67, !67, !67}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !701, file: !354, line: 209, baseType: !365, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !355, file: !354, line: 210, baseType: !710, size: 128, offset: 2176)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !354, line: 210, size: 128, elements: !711)
!711 = !{!712, !717}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !710, file: !354, line: 210, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !354, line: 128, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!67, !365, !123, !74}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !710, file: !354, line: 210, baseType: !365, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !355, file: !354, line: 211, baseType: !719, size: 128, offset: 2304)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !354, line: 211, size: 128, elements: !720)
!720 = !{!721, !726}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !719, file: !354, line: 211, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !354, line: 130, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!67, !365, !123, !74, !84}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !719, file: !354, line: 211, baseType: !365, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !355, file: !354, line: 212, baseType: !728, size: 128, offset: 2432)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !354, line: 212, size: 128, elements: !729)
!729 = !{!730, !735}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !728, file: !354, line: 212, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !354, line: 133, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!67, !365, !123, !457}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !728, file: !354, line: 212, baseType: !365, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !355, file: !354, line: 213, baseType: !737, size: 128, offset: 2560)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !354, line: 213, size: 128, elements: !738)
!738 = !{!739, !744}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !737, file: !354, line: 213, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !354, line: 135, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!67, !365, !123, !84, !84, !84, !84, !74}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !737, file: !354, line: 213, baseType: !365, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !355, file: !354, line: 214, baseType: !746, size: 128, offset: 2688)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !354, line: 214, size: 128, elements: !747)
!747 = !{!748, !754}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !746, file: !354, line: 214, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !354, line: 142, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!67, !365, !123, !74, !84, !84, !84, !84, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !746, file: !354, line: 214, baseType: !365, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !355, file: !354, line: 215, baseType: !756, size: 128, offset: 2816)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !354, line: 215, size: 128, elements: !757)
!757 = !{!758, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !756, file: !354, line: 215, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !354, line: 148, baseType: !750)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !756, file: !354, line: 215, baseType: !365, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !355, file: !354, line: 216, baseType: !762, size: 128, offset: 2944)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !354, line: 216, size: 128, elements: !763)
!763 = !{!764, !772}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !762, file: !354, line: 216, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !354, line: 156, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!67, !365, !123, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !354, line: 56, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !354, line: 56, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !762, file: !354, line: 216, baseType: !365, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !355, file: !354, line: 217, baseType: !774, size: 128, offset: 3072)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !354, line: 217, size: 128, elements: !775)
!775 = !{!776, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !774, file: !354, line: 217, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !354, line: 158, baseType: !766)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !774, file: !354, line: 217, baseType: !365, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !355, file: !354, line: 219, baseType: !780, size: 128, offset: 3200)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !354, line: 219, size: 128, elements: !781)
!781 = !{!782, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !780, file: !354, line: 219, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !354, line: 141, baseType: !740)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !780, file: !354, line: 219, baseType: !365, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !126, file: !96, line: 404, baseType: !786, size: 128, offset: 7040)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !96, line: 260, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !96, line: 270, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !787, file: !96, line: 271, baseType: !67, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !787, file: !96, line: 272, baseType: !791, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !96, line: 264, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !96, line: 266, size: 128, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !793, file: !96, line: 267, baseType: !74, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !793, file: !96, line: 268, baseType: !83, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !96, line: 406, baseType: !798, size: 1126016, offset: 7168)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !96, line: 216, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !96, line: 218, size: 1126016, elements: !800)
!800 = !{!801, !805, !806, !807, !808, !809, !810, !811, !812, !821, !833, !842, !848, !855, !856, !857, !858, !868, !869, !873, !874, !875, !876, !877, !878, !879, !880, !887, !888, !889, !890}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !799, file: !96, line: 219, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !96, line: 204, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !96, line: 204, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !799, file: !96, line: 221, baseType: !67, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !799, file: !96, line: 222, baseType: !67, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !799, file: !96, line: 223, baseType: !67, size: 32, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !799, file: !96, line: 225, baseType: !67, size: 32, offset: 160)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !799, file: !96, line: 226, baseType: !219, size: 192, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !799, file: !96, line: 227, baseType: !140, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !799, file: !96, line: 228, baseType: !67, size: 32, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !799, file: !96, line: 230, baseType: !813, size: 32832, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !96, line: 121, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !96, line: 123, size: 32832, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !814, file: !96, line: 124, baseType: !140, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !814, file: !96, line: 125, baseType: !818, size: 32768, offset: 64)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32768, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 4096)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !799, file: !96, line: 232, baseType: !822, size: 192, offset: 33344)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !96, line: 111, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !96, line: 112, size: 192, elements: !824)
!824 = !{!825, !826, !831}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !823, file: !96, line: 113, baseType: !83, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !823, file: !96, line: 114, baseType: !827, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !96, line: 110, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!67}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !823, file: !96, line: 115, baseType: !832, size: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !799, file: !96, line: 233, baseType: !834, size: 1048608, offset: 33536)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !96, line: 131, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !96, line: 133, size: 1048608, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !835, file: !96, line: 134, baseType: !67, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !835, file: !96, line: 135, baseType: !839, size: 1048576, offset: 32)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 1048576, elements: !840)
!840 = !{!569, !841}
!841 = !DISubrange(count: 8192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !799, file: !96, line: 234, baseType: !843, size: 16416, offset: 1082144)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !96, line: 153, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !96, line: 155, size: 16416, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !844, file: !96, line: 156, baseType: !67, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !844, file: !96, line: 157, baseType: !462, size: 16384, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !799, file: !96, line: 235, baseType: !849, size: 96, offset: 1098560)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !96, line: 163, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !96, line: 165, size: 96, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !850, file: !96, line: 166, baseType: !67, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !850, file: !96, line: 167, baseType: !67, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !850, file: !96, line: 168, baseType: !67, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !799, file: !96, line: 236, baseType: !74, size: 64, offset: 1098688)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !799, file: !96, line: 237, baseType: !67, size: 32, offset: 1098752)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !799, file: !96, line: 238, baseType: !67, size: 32, offset: 1098784)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !799, file: !96, line: 239, baseType: !859, size: 64, offset: 1098816)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !485, line: 51, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !485, line: 150, size: 704, elements: !862)
!862 = !{!863, !865, !866, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !861, file: !485, line: 151, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !861, file: !485, line: 152, baseType: !84, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !861, file: !485, line: 153, baseType: !80, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !861, file: !485, line: 154, baseType: !508, size: 512, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !799, file: !96, line: 240, baseType: !67, size: 32, offset: 1098880)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !799, file: !96, line: 242, baseType: !870, size: 10240, offset: 1098912)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 10240, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 1280)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !799, file: !96, line: 243, baseType: !67, size: 32, offset: 1109152)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !799, file: !96, line: 244, baseType: !67, size: 32, offset: 1109184)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !799, file: !96, line: 245, baseType: !67, size: 32, offset: 1109216)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !799, file: !96, line: 246, baseType: !67, size: 32, offset: 1109248)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !799, file: !96, line: 247, baseType: !67, size: 32, offset: 1109280)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !799, file: !96, line: 248, baseType: !301, size: 64, offset: 1109312)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !799, file: !96, line: 249, baseType: !67, size: 32, offset: 1109376)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !799, file: !96, line: 250, baseType: !881, size: 64, offset: 1109440)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !96, line: 194, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !96, line: 196, size: 128, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !883, file: !96, line: 197, baseType: !74, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !96, line: 198, baseType: !881, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !799, file: !96, line: 251, baseType: !462, size: 16384, offset: 1109504)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !799, file: !96, line: 252, baseType: !7, size: 32, offset: 1125888)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !799, file: !96, line: 253, baseType: !7, size: 32, offset: 1125920)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !799, file: !96, line: 254, baseType: !67, size: 32, offset: 1125952)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !3, line: 260, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !568)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !3, line: 329, type: !896, isLocal: true, isDefinition: true)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 416, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 52)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !3, line: 339, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 72, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 9)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !3, line: 339, type: !906, isLocal: true, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 48, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 6)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !3, line: 339, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 24, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 3)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !550)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !919, isLocal: true, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 80, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 10)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !916, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !916, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !916, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !3, line: 340, type: !906, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !3, line: 343, type: !932, isLocal: true, isDefinition: true)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 56, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 7)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !3, line: 344, type: !932, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !3, line: 345, type: !916, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !3, line: 346, type: !916, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !919, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !916, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !3, line: 352, type: !906, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !3, line: 354, type: !919, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !3, line: 355, type: !932, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !3, line: 360, type: !953, isLocal: true, isDefinition: true)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 40, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 5)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !3, line: 360, type: !958, isLocal: true, isDefinition: true)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 408, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 51)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !3, line: 361, type: !932, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 600, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 75)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !953, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !508, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !3, line: 371, type: !911, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !3, line: 375, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16, elements: !645)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !3, line: 381, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 47)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !3, line: 382, type: !919, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !3, line: 382, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 384, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 48)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !3, line: 383, type: !953, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !3, line: 400, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 256, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 32)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !3, line: 400, type: !998, isLocal: true, isDefinition: true)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 440, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 55)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !3, line: 401, type: !1003, isLocal: true, isDefinition: true)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 248, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 31)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !3, line: 402, type: !993, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
