; ModuleID = 'src/htstools.c'
source_filename = "src/htstools.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lien_adrfil = type { [2048 x i8], [2048 x i8] }
%struct.httrackp = type { i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i64, i64, i64, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, %struct.t_proxy, i32, i32, %struct.String, i32, i32, i32, i32, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, %struct.String, %struct.String, %struct.htsfilters, ptr, ptr, i32, ptr, ptr, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, ptr, %struct.htslibhandles, %struct.htsoptstate }
%struct.t_proxy = type { i32, %struct.String, i32, %struct.String }
%struct.htsfilters = type { ptr, ptr }
%struct.String = type { ptr, i64, i64 }
%struct.htslibhandles = type { i32, ptr }

!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 22)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !267, line: 496, type: !200, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !267, line: 496, type: !31, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !267, line: 496, type: !190, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !267, line: 496, type: !190, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !267, line: 496, type: !130, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 806, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 54)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !185, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 816, type: !185, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 820, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 36)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 821, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 19)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !86, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !130, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 336, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 42)
!311 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !312, retainedTypes: !329, globals: !421, splitDebugInlining: false, nameTableKind: None)
!312 = !{!313}
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 46, baseType: !315, size: 32, elements: !316)
!314 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!315 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!317 = !DIEnumerator(name: "_ISupper", value: 256)
!318 = !DIEnumerator(name: "_ISlower", value: 512)
!319 = !DIEnumerator(name: "_ISalpha", value: 1024)
!320 = !DIEnumerator(name: "_ISdigit", value: 2048)
!321 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!322 = !DIEnumerator(name: "_ISspace", value: 8192)
!323 = !DIEnumerator(name: "_ISprint", value: 16384)
!324 = !DIEnumerator(name: "_ISgraph", value: 32768)
!325 = !DIEnumerator(name: "_ISblank", value: 1)
!326 = !DIEnumerator(name: "_IScntrl", value: 2)
!327 = !DIEnumerator(name: "_ISpunct", value: 4)
!328 = !DIEnumerator(name: "_ISalnum", value: 8)
!329 = !{!330, !331, !332, !333, !334, !337, !340, !341, !342, !354, !416, !4}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!331 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!332 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!333 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !335, line: 46, baseType: !336)
!335 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!336 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "topindex_chain", file: !345, line: 276, size: 16576, elements: !346)
!345 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!346 = !{!347, !348, !349, !353}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !344, file: !345, line: 277, baseType: !331, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !344, file: !345, line: 278, baseType: !340, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !345, line: 279, baseType: !350, size: 16384, offset: 128)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 2048)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !345, line: 280, baseType: !343, size: 64, offset: 16512)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "find_handle_struct", file: !345, line: 268, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "find_handle_struct", file: !2, line: 64, size: 17664, elements: !357)
!357 = !{!358, !363, !380, !415}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hdir", scope: !356, file: !2, line: 65, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !361, line: 127, baseType: !362)
!361 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !361, line: 127, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dirp", scope: !356, file: !2, line: 66, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !366, line: 22, size: 2240, elements: !367)
!366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!367 = !{!368, !371, !374, !375, !376}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !365, file: !366, line: 25, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !370, line: 148, baseType: !336)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !365, file: !366, line: 26, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !370, line: 152, baseType: !373)
!373 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !365, file: !366, line: 31, baseType: !333, size: 16, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !365, file: !366, line: 32, baseType: !332, size: 8, offset: 144)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !365, file: !366, line: 33, baseType: !377, size: 2048, offset: 152)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "filestat", scope: !356, file: !2, line: 67, baseType: !381, size: 1152, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_STAT", file: !345, line: 317, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !383, line: 26, size: 1152, elements: !384)
!383 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!384 = !{!385, !387, !388, !390, !392, !394, !396, !397, !398, !399, !401, !403, !411, !412, !413}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !382, file: !383, line: 31, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !370, line: 145, baseType: !336)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !382, file: !383, line: 36, baseType: !369, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !382, file: !383, line: 44, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !370, line: 151, baseType: !336)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !382, file: !383, line: 45, baseType: !391, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !370, line: 150, baseType: !315)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !382, file: !383, line: 47, baseType: !393, size: 32, offset: 224)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !370, line: 146, baseType: !315)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !382, file: !383, line: 48, baseType: !395, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !370, line: 147, baseType: !315)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !382, file: !383, line: 50, baseType: !331, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !382, file: !383, line: 52, baseType: !386, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !382, file: !383, line: 57, baseType: !372, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !382, file: !383, line: 61, baseType: !400, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !370, line: 175, baseType: !373)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !382, file: !383, line: 63, baseType: !402, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !370, line: 180, baseType: !373)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !382, file: !383, line: 74, baseType: !404, size: 128, offset: 576)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !405, line: 11, size: 128, elements: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !404, file: !405, line: 16, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !370, line: 160, baseType: !373)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !404, file: !405, line: 21, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !370, line: 197, baseType: !373)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !382, file: !383, line: 75, baseType: !404, size: 128, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !382, file: !383, line: 76, baseType: !404, size: 128, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !382, file: !383, line: 89, baseType: !414, size: 192, offset: 960)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 192, elements: !22)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !356, file: !2, line: 68, baseType: !350, size: 16384, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "topindex_chain", file: !345, line: 274, baseType: !344)
!421 = !{!0, !7, !12, !17, !19, !24, !29, !34, !39, !41, !46, !51, !56, !61, !66, !68, !70, !75, !77, !79, !84, !89, !94, !96, !101, !106, !111, !113, !118, !123, !128, !133, !138, !143, !148, !150, !155, !160, !165, !167, !172, !177, !183, !188, !193, !198, !203, !208, !210, !215, !217, !222, !224, !229, !234, !236, !241, !246, !251, !253, !256, !261, !263, !265, !268, !273, !275, !277, !279, !281, !283, !288, !290, !292, !297, !302, !304, !306}
!422 = !{i32 7, !"Dwarf Version", i32 5}
!423 = !{i32 2, !"Debug Info Version", i32 3}
!424 = !{i32 1, !"wchar_size", i32 4}
!425 = !{i32 8, !"PIC Level", i32 2}
!426 = !{i32 7, !"PIE Level", i32 2}
!427 = !{i32 7, !"uwtable", i32 2}
!428 = !{i32 7, !"frame-pointer", i32 2}
!429 = !{!"clang version 16.0.0"}
!430 = distinct !DISubprogram(name: "ident_url_relatif", scope: !2, file: !2, line: 124, type: !431, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !311, retainedNodes: !441)
!431 = !DISubroutineType(types: !432)
!432 = !{!331, !341, !341, !341, !433}
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_adrfil", file: !267, line: 55, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_adrfil", file: !437, line: 137, size: 32768, elements: !438)
!437 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !436, file: !437, line: 138, baseType: !350, size: 16384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !436, file: !437, line: 139, baseType: !350, size: 16384, offset: 16384)
!441 = !{}
!442 = !DILocalVariable(name: "lien", arg: 1, scope: !430, file: !2, line: 124, type: !341)
!443 = !DILocation(line: 124, column: 35, scope: !430)
!444 = !DILocalVariable(name: "origin_adr", arg: 2, scope: !430, file: !2, line: 124, type: !341)
!445 = !DILocation(line: 124, column: 53, scope: !430)
!446 = !DILocalVariable(name: "origin_fil", arg: 3, scope: !430, file: !2, line: 125, type: !341)
!447 = !DILocation(line: 125, column: 35, scope: !430)
!448 = !DILocalVariable(name: "adrfil", arg: 4, scope: !430, file: !2, line: 126, type: !433)
!449 = !DILocation(line: 126, column: 42, scope: !430)
!450 = !DILocalVariable(name: "ok", scope: !430, file: !2, line: 127, type: !331)
!451 = !DILocation(line: 127, column: 7, scope: !430)
!452 = !DILocalVariable(name: "scheme", scope: !430, file: !2, line: 128, type: !331)
!453 = !DILocation(line: 128, column: 7, scope: !430)
!454 = !DILocation(line: 130, column: 3, scope: !430)
!455 = !DILocation(line: 132, column: 3, scope: !430)
!456 = !DILocation(line: 132, column: 11, scope: !430)
!457 = !DILocation(line: 132, column: 18, scope: !430)
!458 = !DILocation(line: 133, column: 3, scope: !430)
!459 = !DILocation(line: 133, column: 11, scope: !430)
!460 = !DILocation(line: 133, column: 18, scope: !430)
!461 = !DILocation(line: 136, column: 7, scope: !462)
!462 = distinct !DILexicalBlock(scope: !430, file: !2, line: 136, column: 7)
!463 = !DILocation(line: 0, scope: !462)
!464 = !DILocation(line: 136, column: 25, scope: !462)
!465 = !DILocation(line: 136, column: 7, scope: !430)
!466 = !DILocation(line: 137, column: 5, scope: !462)
!467 = !DILocalVariable(name: "a", scope: !468, file: !2, line: 141, type: !341)
!468 = distinct !DILexicalBlock(scope: !430, file: !2, line: 140, column: 3)
!469 = !DILocation(line: 141, column: 17, scope: !468)
!470 = !DILocation(line: 141, column: 21, scope: !468)
!471 = !DILocation(line: 143, column: 5, scope: !468)
!472 = !DILocation(line: 143, column: 11, scope: !468)
!473 = !DILocation(line: 144, column: 8, scope: !468)
!474 = distinct !{!474, !471, !473, !475}
!475 = !{!"llvm.loop.mustprogress"}
!476 = !DILocation(line: 145, column: 10, scope: !477)
!477 = distinct !DILexicalBlock(scope: !468, file: !2, line: 145, column: 9)
!478 = !DILocation(line: 145, column: 9, scope: !477)
!479 = !DILocation(line: 145, column: 12, scope: !477)
!480 = !DILocation(line: 145, column: 9, scope: !468)
!481 = !DILocation(line: 146, column: 14, scope: !477)
!482 = !DILocation(line: 146, column: 7, scope: !477)
!483 = !DILocation(line: 151, column: 17, scope: !484)
!484 = distinct !DILexicalBlock(scope: !430, file: !2, line: 151, column: 7)
!485 = !DILocation(line: 151, column: 8, scope: !484)
!486 = !DILocation(line: 152, column: 7, scope: !484)
!487 = !DILocation(line: 152, column: 20, scope: !484)
!488 = !DILocation(line: 152, column: 11, scope: !484)
!489 = !DILocation(line: 153, column: 7, scope: !484)
!490 = !DILocation(line: 153, column: 19, scope: !484)
!491 = !DILocation(line: 153, column: 11, scope: !484)
!492 = !DILocation(line: 153, column: 34, scope: !484)
!493 = !DILocation(line: 151, column: 7, scope: !430)
!494 = !DILocation(line: 155, column: 28, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !2, line: 155, column: 9)
!496 = distinct !DILexicalBlock(scope: !484, file: !2, line: 154, column: 7)
!497 = !DILocation(line: 155, column: 34, scope: !495)
!498 = !DILocation(line: 155, column: 9, scope: !495)
!499 = !DILocation(line: 155, column: 42, scope: !495)
!500 = !DILocation(line: 155, column: 9, scope: !496)
!501 = !DILocation(line: 156, column: 10, scope: !502)
!502 = distinct !DILexicalBlock(scope: !495, file: !2, line: 155, column: 49)
!503 = !DILocation(line: 157, column: 5, scope: !502)
!504 = !DILocation(line: 158, column: 3, scope: !496)
!505 = !DILocation(line: 158, column: 23, scope: !506)
!506 = distinct !DILexicalBlock(scope: !484, file: !2, line: 158, column: 14)
!507 = !DILocation(line: 158, column: 14, scope: !506)
!508 = !DILocation(line: 158, column: 14, scope: !484)
!509 = !DILocation(line: 160, column: 9, scope: !510)
!510 = distinct !DILexicalBlock(scope: !511, file: !2, line: 160, column: 9)
!511 = distinct !DILexicalBlock(scope: !506, file: !2, line: 158, column: 40)
!512 = !DILocation(line: 160, column: 9, scope: !511)
!513 = !DILocation(line: 161, column: 30, scope: !514)
!514 = distinct !DILexicalBlock(scope: !515, file: !2, line: 161, column: 11)
!515 = distinct !DILexicalBlock(scope: !510, file: !2, line: 160, column: 26)
!516 = !DILocation(line: 161, column: 36, scope: !514)
!517 = !DILocation(line: 161, column: 11, scope: !514)
!518 = !DILocation(line: 161, column: 44, scope: !514)
!519 = !DILocation(line: 161, column: 11, scope: !515)
!520 = !DILocation(line: 162, column: 12, scope: !521)
!521 = distinct !DILexicalBlock(scope: !514, file: !2, line: 161, column: 51)
!522 = !DILocation(line: 163, column: 7, scope: !521)
!523 = !DILocation(line: 164, column: 5, scope: !515)
!524 = !DILocation(line: 165, column: 10, scope: !525)
!525 = distinct !DILexicalBlock(scope: !510, file: !2, line: 164, column: 12)
!526 = !DILocation(line: 168, column: 3, scope: !511)
!527 = !DILocation(line: 168, column: 23, scope: !528)
!528 = distinct !DILexicalBlock(scope: !506, file: !2, line: 168, column: 14)
!529 = !DILocation(line: 168, column: 14, scope: !528)
!530 = !DILocation(line: 168, column: 14, scope: !506)
!531 = !DILocation(line: 170, column: 28, scope: !532)
!532 = distinct !DILexicalBlock(scope: !533, file: !2, line: 170, column: 9)
!533 = distinct !DILexicalBlock(scope: !528, file: !2, line: 168, column: 42)
!534 = !DILocation(line: 170, column: 34, scope: !532)
!535 = !DILocation(line: 170, column: 9, scope: !532)
!536 = !DILocation(line: 170, column: 42, scope: !532)
!537 = !DILocation(line: 170, column: 9, scope: !533)
!538 = !DILocation(line: 171, column: 10, scope: !539)
!539 = distinct !DILexicalBlock(scope: !532, file: !2, line: 170, column: 49)
!540 = !DILocation(line: 172, column: 5, scope: !539)
!541 = !DILocation(line: 174, column: 3, scope: !533)
!542 = !DILocation(line: 174, column: 15, scope: !543)
!543 = distinct !DILexicalBlock(scope: !528, file: !2, line: 174, column: 14)
!544 = !DILocation(line: 174, column: 14, scope: !543)
!545 = !DILocation(line: 174, column: 23, scope: !543)
!546 = !DILocation(line: 174, column: 38, scope: !543)
!547 = !DILocation(line: 174, column: 29, scope: !543)
!548 = !DILocation(line: 175, column: 27, scope: !543)
!549 = !DILocation(line: 175, column: 41, scope: !543)
!550 = !DILocation(line: 175, column: 32, scope: !543)
!551 = !DILocation(line: 176, column: 27, scope: !543)
!552 = !DILocation(line: 176, column: 41, scope: !543)
!553 = !DILocation(line: 176, column: 32, scope: !543)
!554 = !DILocation(line: 174, column: 14, scope: !528)
!555 = !DILocation(line: 178, column: 8, scope: !556)
!556 = distinct !DILexicalBlock(scope: !543, file: !2, line: 177, column: 17)
!557 = !DILocation(line: 179, column: 3, scope: !556)
!558 = !DILocation(line: 184, column: 9, scope: !559)
!559 = distinct !DILexicalBlock(scope: !560, file: !2, line: 184, column: 9)
!560 = distinct !DILexicalBlock(scope: !543, file: !2, line: 179, column: 10)
!561 = !DILocation(line: 184, column: 20, scope: !559)
!562 = !DILocation(line: 184, column: 28, scope: !559)
!563 = !DILocation(line: 184, column: 31, scope: !559)
!564 = !DILocation(line: 184, column: 42, scope: !559)
!565 = !DILocation(line: 185, column: 7, scope: !559)
!566 = !DILocation(line: 185, column: 11, scope: !559)
!567 = !DILocation(line: 185, column: 10, scope: !559)
!568 = !DILocation(line: 185, column: 22, scope: !559)
!569 = !DILocation(line: 185, column: 30, scope: !559)
!570 = !DILocation(line: 185, column: 34, scope: !559)
!571 = !DILocation(line: 185, column: 33, scope: !559)
!572 = !DILocation(line: 185, column: 45, scope: !559)
!573 = !DILocation(line: 184, column: 9, scope: !560)
!574 = !DILocation(line: 186, column: 7, scope: !575)
!575 = distinct !DILexicalBlock(scope: !559, file: !2, line: 185, column: 54)
!576 = !DILocation(line: 190, column: 23, scope: !577)
!577 = distinct !DILexicalBlock(scope: !560, file: !2, line: 190, column: 9)
!578 = !DILocation(line: 190, column: 16, scope: !577)
!579 = !DILocation(line: 190, column: 10, scope: !577)
!580 = !DILocation(line: 190, column: 35, scope: !577)
!581 = !DILocation(line: 191, column: 9, scope: !577)
!582 = !DILocation(line: 191, column: 26, scope: !577)
!583 = !DILocation(line: 191, column: 19, scope: !577)
!584 = !DILocation(line: 191, column: 13, scope: !577)
!585 = !DILocation(line: 191, column: 38, scope: !577)
!586 = !DILocation(line: 192, column: 9, scope: !577)
!587 = !DILocation(line: 192, column: 26, scope: !577)
!588 = !DILocation(line: 192, column: 19, scope: !577)
!589 = !DILocation(line: 192, column: 13, scope: !577)
!590 = !DILocation(line: 192, column: 32, scope: !577)
!591 = !DILocation(line: 190, column: 9, scope: !560)
!592 = !DILocation(line: 195, column: 20, scope: !593)
!593 = distinct !DILexicalBlock(scope: !594, file: !2, line: 195, column: 11)
!594 = distinct !DILexicalBlock(scope: !577, file: !2, line: 192, column: 51)
!595 = !DILocation(line: 195, column: 11, scope: !593)
!596 = !DILocation(line: 195, column: 11, scope: !594)
!597 = !DILocation(line: 196, column: 14, scope: !598)
!598 = distinct !DILexicalBlock(scope: !593, file: !2, line: 195, column: 36)
!599 = !DILocation(line: 197, column: 9, scope: !598)
!600 = !DILocation(line: 198, column: 7, scope: !598)
!601 = !DILocation(line: 198, column: 27, scope: !602)
!602 = distinct !DILexicalBlock(scope: !593, file: !2, line: 198, column: 18)
!603 = !DILocation(line: 198, column: 18, scope: !602)
!604 = !DILocation(line: 198, column: 18, scope: !593)
!605 = !DILocation(line: 199, column: 14, scope: !606)
!606 = distinct !DILexicalBlock(scope: !602, file: !2, line: 198, column: 44)
!607 = !DILocation(line: 200, column: 9, scope: !606)
!608 = !DILocation(line: 201, column: 9, scope: !606)
!609 = !DILocation(line: 202, column: 7, scope: !606)
!610 = !DILocation(line: 202, column: 27, scope: !611)
!611 = distinct !DILexicalBlock(scope: !602, file: !2, line: 202, column: 18)
!612 = !DILocation(line: 202, column: 18, scope: !611)
!613 = !DILocation(line: 202, column: 18, scope: !602)
!614 = !DILocation(line: 203, column: 14, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !2, line: 202, column: 42)
!616 = !DILocation(line: 204, column: 9, scope: !615)
!617 = !DILocation(line: 205, column: 9, scope: !615)
!618 = !DILocation(line: 206, column: 7, scope: !615)
!619 = !DILocation(line: 207, column: 9, scope: !620)
!620 = distinct !DILexicalBlock(scope: !611, file: !2, line: 206, column: 14)
!621 = !DILocation(line: 210, column: 12, scope: !622)
!622 = distinct !DILexicalBlock(scope: !594, file: !2, line: 210, column: 11)
!623 = !DILocation(line: 210, column: 11, scope: !622)
!624 = !DILocation(line: 210, column: 17, scope: !622)
!625 = !DILocation(line: 210, column: 11, scope: !594)
!626 = !DILocation(line: 211, column: 14, scope: !627)
!627 = distinct !DILexicalBlock(scope: !628, file: !2, line: 211, column: 13)
!628 = distinct !DILexicalBlock(scope: !622, file: !2, line: 210, column: 25)
!629 = !DILocation(line: 211, column: 13, scope: !627)
!630 = !DILocation(line: 211, column: 19, scope: !627)
!631 = !DILocation(line: 211, column: 13, scope: !628)
!632 = !DILocation(line: 212, column: 11, scope: !633)
!633 = distinct !DILexicalBlock(scope: !627, file: !2, line: 211, column: 28)
!634 = !DILocation(line: 213, column: 9, scope: !633)
!635 = !DILocation(line: 213, column: 21, scope: !636)
!636 = distinct !DILexicalBlock(scope: !627, file: !2, line: 213, column: 20)
!637 = !DILocation(line: 213, column: 20, scope: !636)
!638 = !DILocation(line: 213, column: 26, scope: !636)
!639 = !DILocation(line: 213, column: 20, scope: !627)
!640 = !DILocalVariable(name: "a", scope: !641, file: !2, line: 214, type: !340)
!641 = distinct !DILexicalBlock(scope: !636, file: !2, line: 213, column: 34)
!642 = !DILocation(line: 214, column: 17, scope: !641)
!643 = !DILocation(line: 216, column: 11, scope: !641)
!644 = !DILocation(line: 217, column: 22, scope: !641)
!645 = !DILocation(line: 217, column: 30, scope: !641)
!646 = !DILocation(line: 217, column: 15, scope: !641)
!647 = !DILocation(line: 217, column: 13, scope: !641)
!648 = !DILocation(line: 218, column: 15, scope: !649)
!649 = distinct !DILexicalBlock(scope: !641, file: !2, line: 218, column: 15)
!650 = !DILocation(line: 218, column: 15, scope: !641)
!651 = !DILocation(line: 219, column: 14, scope: !649)
!652 = !DILocation(line: 219, column: 16, scope: !649)
!653 = !DILocation(line: 219, column: 13, scope: !649)
!654 = !DILocation(line: 220, column: 11, scope: !641)
!655 = !DILocation(line: 221, column: 9, scope: !641)
!656 = !DILocalVariable(name: "a", scope: !657, file: !2, line: 222, type: !341)
!657 = distinct !DILexicalBlock(scope: !636, file: !2, line: 221, column: 16)
!658 = !DILocation(line: 222, column: 23, scope: !657)
!659 = !DILocation(line: 222, column: 34, scope: !657)
!660 = !DILocation(line: 222, column: 27, scope: !657)
!661 = !DILocation(line: 224, column: 15, scope: !662)
!662 = distinct !DILexicalBlock(scope: !657, file: !2, line: 224, column: 15)
!663 = !DILocation(line: 224, column: 17, scope: !662)
!664 = !DILocation(line: 224, column: 15, scope: !657)
!665 = !DILocation(line: 225, column: 17, scope: !662)
!666 = !DILocation(line: 225, column: 37, scope: !662)
!667 = !DILocation(line: 225, column: 30, scope: !662)
!668 = !DILocation(line: 225, column: 28, scope: !662)
!669 = !DILocation(line: 225, column: 15, scope: !662)
!670 = !DILocation(line: 225, column: 13, scope: !662)
!671 = !DILocation(line: 226, column: 11, scope: !657)
!672 = !DILocation(line: 226, column: 19, scope: !657)
!673 = !DILocation(line: 226, column: 18, scope: !657)
!674 = !DILocation(line: 226, column: 21, scope: !657)
!675 = !DILocation(line: 226, column: 29, scope: !657)
!676 = !DILocation(line: 226, column: 33, scope: !657)
!677 = !DILocation(line: 226, column: 37, scope: !657)
!678 = !DILocation(line: 226, column: 35, scope: !657)
!679 = !DILocation(line: 0, scope: !657)
!680 = !DILocation(line: 227, column: 14, scope: !657)
!681 = distinct !{!681, !671, !680, !475}
!682 = !DILocation(line: 228, column: 16, scope: !683)
!683 = distinct !DILexicalBlock(scope: !657, file: !2, line: 228, column: 15)
!684 = !DILocation(line: 228, column: 15, scope: !683)
!685 = !DILocation(line: 228, column: 18, scope: !683)
!686 = !DILocation(line: 228, column: 15, scope: !657)
!687 = !DILocation(line: 229, column: 26, scope: !688)
!688 = distinct !DILexicalBlock(scope: !689, file: !2, line: 229, column: 17)
!689 = distinct !DILexicalBlock(scope: !683, file: !2, line: 228, column: 26)
!690 = !DILocation(line: 229, column: 30, scope: !688)
!691 = !DILocation(line: 229, column: 28, scope: !688)
!692 = !DILocation(line: 229, column: 19, scope: !688)
!693 = !DILocation(line: 229, column: 43, scope: !688)
!694 = !DILocation(line: 229, column: 18, scope: !688)
!695 = !DILocation(line: 229, column: 56, scope: !688)
!696 = !DILocation(line: 229, column: 49, scope: !688)
!697 = !DILocation(line: 229, column: 47, scope: !688)
!698 = !DILocation(line: 229, column: 63, scope: !688)
!699 = !DILocation(line: 229, column: 17, scope: !689)
!700 = !DILocation(line: 231, column: 23, scope: !701)
!701 = distinct !DILexicalBlock(scope: !688, file: !2, line: 229, column: 81)
!702 = !DILocation(line: 231, column: 31, scope: !701)
!703 = !DILocation(line: 231, column: 36, scope: !701)
!704 = !DILocation(line: 231, column: 56, scope: !701)
!705 = !DILocation(line: 231, column: 60, scope: !701)
!706 = !DILocation(line: 231, column: 58, scope: !701)
!707 = !DILocation(line: 231, column: 49, scope: !701)
!708 = !DILocation(line: 231, column: 73, scope: !701)
!709 = !DILocation(line: 231, column: 48, scope: !701)
!710 = !DILocation(line: 231, column: 15, scope: !701)
!711 = !DILocation(line: 232, column: 17, scope: !701)
!712 = !DILocation(line: 232, column: 25, scope: !701)
!713 = !DILocation(line: 232, column: 39, scope: !701)
!714 = !DILocation(line: 232, column: 43, scope: !701)
!715 = !DILocation(line: 232, column: 41, scope: !701)
!716 = !DILocation(line: 232, column: 32, scope: !701)
!717 = !DILocation(line: 232, column: 29, scope: !701)
!718 = !DILocation(line: 232, column: 56, scope: !701)
!719 = !DILocation(line: 232, column: 61, scope: !701)
!720 = !DILocation(line: 235, column: 33, scope: !721)
!721 = distinct !DILexicalBlock(scope: !701, file: !2, line: 235, column: 19)
!722 = !DILocation(line: 235, column: 41, scope: !721)
!723 = !DILocation(line: 235, column: 26, scope: !721)
!724 = !DILocation(line: 235, column: 20, scope: !721)
!725 = !DILocation(line: 235, column: 61, scope: !721)
!726 = !DILocation(line: 235, column: 54, scope: !721)
!727 = !DILocation(line: 235, column: 48, scope: !721)
!728 = !DILocation(line: 235, column: 46, scope: !721)
!729 = !DILocation(line: 235, column: 68, scope: !721)
!730 = !DILocation(line: 235, column: 19, scope: !701)
!731 = !DILocation(line: 236, column: 17, scope: !732)
!732 = distinct !DILexicalBlock(scope: !721, file: !2, line: 235, column: 86)
!733 = !DILocation(line: 238, column: 31, scope: !732)
!734 = !DILocation(line: 238, column: 39, scope: !732)
!735 = !DILocation(line: 238, column: 17, scope: !732)
!736 = !DILocation(line: 239, column: 15, scope: !732)
!737 = !DILocation(line: 240, column: 20, scope: !721)
!738 = !DILocation(line: 241, column: 13, scope: !701)
!739 = !DILocation(line: 242, column: 18, scope: !740)
!740 = distinct !DILexicalBlock(scope: !688, file: !2, line: 241, column: 20)
!741 = !DILocation(line: 244, column: 11, scope: !689)
!742 = !DILocation(line: 245, column: 16, scope: !743)
!743 = distinct !DILexicalBlock(scope: !683, file: !2, line: 244, column: 18)
!744 = !DILocation(line: 248, column: 7, scope: !628)
!745 = !DILocation(line: 250, column: 9, scope: !746)
!746 = distinct !DILexicalBlock(scope: !622, file: !2, line: 248, column: 14)
!747 = !DILocation(line: 251, column: 23, scope: !746)
!748 = !DILocation(line: 251, column: 31, scope: !746)
!749 = !DILocation(line: 251, column: 9, scope: !746)
!750 = !DILocation(line: 253, column: 5, scope: !594)
!751 = !DILocation(line: 254, column: 10, scope: !577)
!752 = !DILocalVariable(name: "a", scope: !753, file: !2, line: 260, type: !340)
!753 = distinct !DILexicalBlock(scope: !430, file: !2, line: 259, column: 3)
!754 = !DILocation(line: 260, column: 11, scope: !753)
!755 = !DILocation(line: 260, column: 35, scope: !753)
!756 = !DILocation(line: 260, column: 43, scope: !753)
!757 = !DILocation(line: 260, column: 15, scope: !753)
!758 = !DILocation(line: 262, column: 5, scope: !753)
!759 = !DILocation(line: 262, column: 12, scope: !753)
!760 = !DILocation(line: 262, column: 11, scope: !753)
!761 = !DILocation(line: 263, column: 13, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !2, line: 263, column: 11)
!763 = distinct !DILexicalBlock(scope: !753, file: !2, line: 262, column: 15)
!764 = !DILocation(line: 263, column: 12, scope: !762)
!765 = !DILocation(line: 263, column: 15, scope: !762)
!766 = !DILocation(line: 263, column: 23, scope: !762)
!767 = !DILocation(line: 263, column: 28, scope: !762)
!768 = !DILocation(line: 263, column: 27, scope: !762)
!769 = !DILocation(line: 263, column: 30, scope: !762)
!770 = !DILocation(line: 263, column: 11, scope: !763)
!771 = !DILocation(line: 264, column: 10, scope: !762)
!772 = !DILocation(line: 264, column: 12, scope: !762)
!773 = !DILocation(line: 264, column: 9, scope: !762)
!774 = !DILocation(line: 265, column: 8, scope: !763)
!775 = distinct !{!775, !758, !776, !475}
!776 = !DILocation(line: 266, column: 5, scope: !753)
!777 = !DILocation(line: 270, column: 27, scope: !778)
!778 = distinct !DILexicalBlock(scope: !430, file: !2, line: 270, column: 7)
!779 = !DILocation(line: 270, column: 35, scope: !778)
!780 = !DILocation(line: 270, column: 8, scope: !778)
!781 = !DILocation(line: 270, column: 40, scope: !778)
!782 = !DILocation(line: 270, column: 52, scope: !778)
!783 = !DILocation(line: 270, column: 60, scope: !778)
!784 = !DILocation(line: 270, column: 43, scope: !778)
!785 = !DILocation(line: 270, column: 7, scope: !430)
!786 = !DILocalVariable(name: "a", scope: !787, file: !2, line: 271, type: !788)
!787 = distinct !DILexicalBlock(scope: !778, file: !2, line: 270, column: 76)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!789 = !DILocation(line: 271, column: 17, scope: !787)
!790 = !DILocation(line: 271, column: 41, scope: !787)
!791 = !DILocation(line: 271, column: 49, scope: !787)
!792 = !DILocation(line: 271, column: 21, scope: !787)
!793 = !DILocation(line: 273, column: 28, scope: !794)
!794 = distinct !DILexicalBlock(scope: !787, file: !2, line: 273, column: 9)
!795 = !DILocation(line: 273, column: 38, scope: !794)
!796 = !DILocation(line: 273, column: 31, scope: !794)
!797 = !DILocation(line: 273, column: 10, scope: !794)
!798 = !DILocation(line: 273, column: 9, scope: !787)
!799 = !DILocalVariable(name: "idna", scope: !800, file: !2, line: 274, type: !788)
!800 = distinct !DILexicalBlock(scope: !794, file: !2, line: 273, column: 43)
!801 = !DILocation(line: 274, column: 19, scope: !800)
!802 = !DILocation(line: 274, column: 54, scope: !800)
!803 = !DILocation(line: 274, column: 64, scope: !800)
!804 = !DILocation(line: 274, column: 57, scope: !800)
!805 = !DILocation(line: 274, column: 26, scope: !800)
!806 = !DILocation(line: 275, column: 11, scope: !807)
!807 = distinct !DILexicalBlock(scope: !800, file: !2, line: 275, column: 11)
!808 = !DILocation(line: 275, column: 16, scope: !807)
!809 = !DILocation(line: 275, column: 11, scope: !800)
!810 = !DILocation(line: 276, column: 20, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !2, line: 276, column: 13)
!812 = distinct !DILexicalBlock(scope: !807, file: !2, line: 275, column: 25)
!813 = !DILocation(line: 276, column: 13, scope: !811)
!814 = !DILocation(line: 276, column: 26, scope: !811)
!815 = !DILocation(line: 276, column: 13, scope: !812)
!816 = !DILocation(line: 277, column: 11, scope: !817)
!817 = distinct !DILexicalBlock(scope: !811, file: !2, line: 276, column: 44)
!818 = !DILocation(line: 278, column: 9, scope: !817)
!819 = !DILocation(line: 279, column: 14, scope: !812)
!820 = !DILocation(line: 279, column: 9, scope: !812)
!821 = !DILocation(line: 280, column: 7, scope: !812)
!822 = !DILocation(line: 281, column: 5, scope: !800)
!823 = !DILocation(line: 282, column: 3, scope: !787)
!824 = !DILocation(line: 284, column: 10, scope: !430)
!825 = !DILocation(line: 284, column: 3, scope: !430)
!826 = !DILocation(line: 285, column: 1, scope: !430)
!827 = distinct !DISubprogram(name: "abortf_", scope: !255, file: !255, line: 95, type: !828, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, retainedNodes: !441)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !341, !341, !331}
!830 = !DILocalVariable(name: "exp", arg: 1, scope: !827, file: !255, line: 95, type: !341)
!831 = !DILocation(line: 95, column: 44, scope: !827)
!832 = !DILocalVariable(name: "file", arg: 2, scope: !827, file: !255, line: 95, type: !341)
!833 = !DILocation(line: 95, column: 61, scope: !827)
!834 = !DILocalVariable(name: "line", arg: 3, scope: !827, file: !255, line: 95, type: !331)
!835 = !DILocation(line: 95, column: 71, scope: !827)
!836 = !DILocation(line: 99, column: 14, scope: !827)
!837 = !DILocation(line: 99, column: 19, scope: !827)
!838 = !DILocation(line: 99, column: 25, scope: !827)
!839 = !DILocation(line: 99, column: 3, scope: !827)
!840 = !DILocation(line: 100, column: 3, scope: !827)
!841 = distinct !DISubprogram(name: "strfield", scope: !267, file: !267, line: 431, type: !842, scopeLine: 431, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, retainedNodes: !441)
!842 = !DISubroutineType(types: !843)
!843 = !{!331, !341, !341}
!844 = !DILocalVariable(name: "f", arg: 1, scope: !841, file: !267, line: 431, type: !341)
!845 = !DILocation(line: 431, column: 37, scope: !841)
!846 = !DILocalVariable(name: "s", arg: 2, scope: !841, file: !267, line: 431, type: !341)
!847 = !DILocation(line: 431, column: 52, scope: !841)
!848 = !DILocalVariable(name: "r", scope: !841, file: !267, line: 432, type: !331)
!849 = !DILocation(line: 432, column: 7, scope: !841)
!850 = !DILocation(line: 434, column: 3, scope: !841)
!851 = !DILocation(line: 434, column: 9, scope: !841)
!852 = !DILocation(line: 434, column: 24, scope: !841)
!853 = !DILocation(line: 434, column: 30, scope: !841)
!854 = !DILocation(line: 434, column: 29, scope: !841)
!855 = !DILocation(line: 434, column: 28, scope: !841)
!856 = !DILocation(line: 434, column: 33, scope: !841)
!857 = !DILocation(line: 434, column: 39, scope: !841)
!858 = !DILocation(line: 434, column: 45, scope: !841)
!859 = !DILocation(line: 434, column: 44, scope: !841)
!860 = !DILocation(line: 434, column: 43, scope: !841)
!861 = !DILocation(line: 434, column: 48, scope: !841)
!862 = !DILocation(line: 0, scope: !841)
!863 = !DILocation(line: 435, column: 6, scope: !864)
!864 = distinct !DILexicalBlock(scope: !841, file: !267, line: 434, column: 55)
!865 = !DILocation(line: 436, column: 6, scope: !864)
!866 = !DILocation(line: 437, column: 6, scope: !864)
!867 = distinct !{!867, !850, !868, !475}
!868 = !DILocation(line: 438, column: 3, scope: !841)
!869 = !DILocation(line: 439, column: 8, scope: !870)
!870 = distinct !DILexicalBlock(scope: !841, file: !267, line: 439, column: 7)
!871 = !DILocation(line: 439, column: 7, scope: !870)
!872 = !DILocation(line: 439, column: 10, scope: !870)
!873 = !DILocation(line: 439, column: 7, scope: !841)
!874 = !DILocation(line: 440, column: 12, scope: !870)
!875 = !DILocation(line: 440, column: 5, scope: !870)
!876 = !DILocation(line: 442, column: 5, scope: !870)
!877 = !DILocation(line: 443, column: 1, scope: !841)
!878 = distinct !DISubprogram(name: "strcpy_safe_", scope: !255, file: !255, line: 212, type: !879, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, retainedNodes: !441)
!879 = !DISubroutineType(types: !880)
!880 = !{!340, !788, !881, !882, !881, !341, !341, !331}
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!883 = !DILocalVariable(name: "dest", arg: 1, scope: !878, file: !255, line: 212, type: !788)
!884 = !DILocation(line: 212, column: 61, scope: !878)
!885 = !DILocalVariable(name: "sizeof_dest", arg: 2, scope: !878, file: !255, line: 212, type: !881)
!886 = !DILocation(line: 212, column: 80, scope: !878)
!887 = !DILocalVariable(name: "source", arg: 3, scope: !878, file: !255, line: 213, type: !882)
!888 = !DILocation(line: 213, column: 67, scope: !878)
!889 = !DILocalVariable(name: "sizeof_source", arg: 4, scope: !878, file: !255, line: 213, type: !881)
!890 = !DILocation(line: 213, column: 88, scope: !878)
!891 = !DILocalVariable(name: "exp", arg: 5, scope: !878, file: !255, line: 214, type: !341)
!892 = !DILocation(line: 214, column: 61, scope: !878)
!893 = !DILocalVariable(name: "file", arg: 6, scope: !878, file: !255, line: 214, type: !341)
!894 = !DILocation(line: 214, column: 78, scope: !878)
!895 = !DILocalVariable(name: "line", arg: 7, scope: !878, file: !255, line: 214, type: !331)
!896 = !DILocation(line: 214, column: 88, scope: !878)
!897 = !DILocation(line: 215, column: 3, scope: !878)
!898 = !DILocation(line: 216, column: 3, scope: !878)
!899 = !DILocation(line: 216, column: 11, scope: !878)
!900 = !DILocation(line: 217, column: 24, scope: !878)
!901 = !DILocation(line: 217, column: 30, scope: !878)
!902 = !DILocation(line: 217, column: 43, scope: !878)
!903 = !DILocation(line: 217, column: 51, scope: !878)
!904 = !DILocation(line: 217, column: 79, scope: !878)
!905 = !DILocation(line: 217, column: 84, scope: !878)
!906 = !DILocation(line: 217, column: 90, scope: !878)
!907 = !DILocation(line: 217, column: 10, scope: !878)
!908 = !DILocation(line: 217, column: 3, scope: !878)
!909 = distinct !DISubprogram(name: "strncat_safe_", scope: !255, file: !255, line: 197, type: !910, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, retainedNodes: !441)
!910 = !DISubroutineType(types: !911)
!911 = !{!340, !788, !881, !882, !881, !881, !341, !341, !331}
!912 = !DILocalVariable(name: "dest", arg: 1, scope: !909, file: !255, line: 197, type: !788)
!913 = !DILocation(line: 197, column: 62, scope: !909)
!914 = !DILocalVariable(name: "sizeof_dest", arg: 2, scope: !909, file: !255, line: 197, type: !881)
!915 = !DILocation(line: 197, column: 81, scope: !909)
!916 = !DILocalVariable(name: "source", arg: 3, scope: !909, file: !255, line: 198, type: !882)
!917 = !DILocation(line: 198, column: 68, scope: !909)
!918 = !DILocalVariable(name: "sizeof_source", arg: 4, scope: !909, file: !255, line: 198, type: !881)
!919 = !DILocation(line: 198, column: 89, scope: !909)
!920 = !DILocalVariable(name: "n", arg: 5, scope: !909, file: !255, line: 199, type: !881)
!921 = !DILocation(line: 199, column: 63, scope: !909)
!922 = !DILocalVariable(name: "exp", arg: 6, scope: !909, file: !255, line: 200, type: !341)
!923 = !DILocation(line: 200, column: 62, scope: !909)
!924 = !DILocalVariable(name: "file", arg: 7, scope: !909, file: !255, line: 200, type: !341)
!925 = !DILocation(line: 200, column: 79, scope: !909)
!926 = !DILocalVariable(name: "line", arg: 8, scope: !909, file: !255, line: 200, type: !331)
!927 = !DILocation(line: 200, column: 89, scope: !909)
!928 = !DILocalVariable(name: "source_len", scope: !909, file: !255, line: 201, type: !881)
!929 = !DILocation(line: 201, column: 16, scope: !909)
!930 = !DILocation(line: 201, column: 42, scope: !909)
!931 = !DILocation(line: 201, column: 50, scope: !909)
!932 = !DILocation(line: 201, column: 65, scope: !909)
!933 = !DILocation(line: 201, column: 71, scope: !909)
!934 = !DILocation(line: 201, column: 29, scope: !909)
!935 = !DILocalVariable(name: "dest_len", scope: !909, file: !255, line: 202, type: !881)
!936 = !DILocation(line: 202, column: 16, scope: !909)
!937 = !DILocation(line: 202, column: 40, scope: !909)
!938 = !DILocation(line: 202, column: 46, scope: !909)
!939 = !DILocation(line: 202, column: 59, scope: !909)
!940 = !DILocation(line: 202, column: 65, scope: !909)
!941 = !DILocation(line: 202, column: 27, scope: !909)
!942 = !DILocalVariable(name: "source_copy", scope: !909, file: !255, line: 204, type: !881)
!943 = !DILocation(line: 204, column: 16, scope: !909)
!944 = !DILocation(line: 204, column: 30, scope: !909)
!945 = !DILocation(line: 204, column: 44, scope: !909)
!946 = !DILocation(line: 204, column: 41, scope: !909)
!947 = !DILocation(line: 204, column: 48, scope: !909)
!948 = !DILocation(line: 204, column: 61, scope: !909)
!949 = !DILocalVariable(name: "dest_final_len", scope: !909, file: !255, line: 205, type: !881)
!950 = !DILocation(line: 205, column: 16, scope: !909)
!951 = !DILocation(line: 205, column: 33, scope: !909)
!952 = !DILocation(line: 205, column: 44, scope: !909)
!953 = !DILocation(line: 205, column: 42, scope: !909)
!954 = !DILocation(line: 206, column: 3, scope: !909)
!955 = !DILocation(line: 207, column: 10, scope: !909)
!956 = !DILocation(line: 207, column: 17, scope: !909)
!957 = !DILocation(line: 207, column: 15, scope: !909)
!958 = !DILocation(line: 207, column: 27, scope: !909)
!959 = !DILocation(line: 207, column: 35, scope: !909)
!960 = !DILocation(line: 207, column: 3, scope: !909)
!961 = !DILocation(line: 208, column: 3, scope: !909)
!962 = !DILocation(line: 208, column: 8, scope: !909)
!963 = !DILocation(line: 208, column: 24, scope: !909)
!964 = !DILocation(line: 209, column: 10, scope: !909)
!965 = !DILocation(line: 209, column: 3, scope: !909)
!966 = distinct !DISubprogram(name: "link_has_authority", scope: !2, file: !2, line: 380, type: !967, scopeLine: 380, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !311, retainedNodes: !441)
!967 = !DISubroutineType(types: !968)
!968 = !{!331, !341}
!969 = !DILocalVariable(name: "lien", arg: 1, scope: !966, file: !2, line: 380, type: !341)
!970 = !DILocation(line: 380, column: 36, scope: !966)
!971 = !DILocalVariable(name: "a", scope: !966, file: !2, line: 381, type: !341)
!972 = !DILocation(line: 381, column: 15, scope: !966)
!973 = !DILocation(line: 381, column: 19, scope: !966)
!974 = !DILocation(line: 383, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !966, file: !2, line: 383, column: 7)
!976 = !DILocation(line: 383, column: 7, scope: !966)
!977 = !DILocation(line: 385, column: 5, scope: !978)
!978 = distinct !DILexicalBlock(scope: !975, file: !2, line: 383, column: 36)
!979 = !DILocation(line: 385, column: 11, scope: !978)
!980 = !DILocation(line: 386, column: 8, scope: !978)
!981 = distinct !{!981, !977, !980, !475}
!982 = !DILocation(line: 387, column: 10, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !2, line: 387, column: 9)
!984 = !DILocation(line: 387, column: 9, scope: !983)
!985 = !DILocation(line: 387, column: 12, scope: !983)
!986 = !DILocation(line: 387, column: 9, scope: !978)
!987 = !DILocation(line: 388, column: 8, scope: !983)
!988 = !DILocation(line: 388, column: 7, scope: !983)
!989 = !DILocation(line: 390, column: 7, scope: !983)
!990 = !DILocation(line: 391, column: 3, scope: !978)
!991 = !DILocation(line: 392, column: 15, scope: !992)
!992 = distinct !DILexicalBlock(scope: !966, file: !2, line: 392, column: 7)
!993 = !DILocation(line: 392, column: 7, scope: !992)
!994 = !DILocation(line: 392, column: 27, scope: !992)
!995 = !DILocation(line: 392, column: 7, scope: !966)
!996 = !DILocation(line: 393, column: 5, scope: !992)
!997 = !DILocation(line: 394, column: 3, scope: !966)
!998 = !DILocation(line: 395, column: 1, scope: !966)
!999 = distinct !DISubprogram(name: "lienrelatif", scope: !2, file: !2, line: 289, type: !1000, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !311, retainedNodes: !441)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!331, !340, !341, !341}
!1002 = !DILocalVariable(name: "s", arg: 1, scope: !999, file: !2, line: 289, type: !340)
!1003 = !DILocation(line: 289, column: 23, scope: !999)
!1004 = !DILocalVariable(name: "link", arg: 2, scope: !999, file: !2, line: 289, type: !341)
!1005 = !DILocation(line: 289, column: 38, scope: !999)
!1006 = !DILocalVariable(name: "curr_fil", arg: 3, scope: !999, file: !2, line: 289, type: !341)
!1007 = !DILocation(line: 289, column: 56, scope: !999)
!1008 = !DILocalVariable(name: "_curr", scope: !999, file: !2, line: 290, type: !350)
!1009 = !DILocation(line: 290, column: 15, scope: !999)
!1010 = !DILocalVariable(name: "newcurr_fil", scope: !999, file: !2, line: 291, type: !350)
!1011 = !DILocation(line: 291, column: 15, scope: !999)
!1012 = !DILocalVariable(name: "newlink", scope: !999, file: !2, line: 291, type: !350)
!1013 = !DILocation(line: 291, column: 48, scope: !999)
!1014 = !DILocalVariable(name: "curr", scope: !999, file: !2, line: 292, type: !340)
!1015 = !DILocation(line: 292, column: 9, scope: !999)
!1016 = !DILocalVariable(name: "a", scope: !999, file: !2, line: 295, type: !340)
!1017 = !DILocation(line: 295, column: 9, scope: !999)
!1018 = !DILocalVariable(name: "slash", scope: !999, file: !2, line: 296, type: !331)
!1019 = !DILocation(line: 296, column: 7, scope: !999)
!1020 = !DILocation(line: 299, column: 3, scope: !999)
!1021 = !DILocation(line: 299, column: 18, scope: !999)
!1022 = !DILocation(line: 300, column: 3, scope: !999)
!1023 = !DILocation(line: 300, column: 14, scope: !999)
!1024 = !DILocalVariable(name: "a", scope: !1025, file: !2, line: 305, type: !341)
!1025 = distinct !DILexicalBlock(scope: !999, file: !2, line: 304, column: 3)
!1026 = !DILocation(line: 305, column: 17, scope: !1025)
!1027 = !DILocation(line: 307, column: 21, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1025, file: !2, line: 307, column: 9)
!1029 = !DILocation(line: 307, column: 14, scope: !1028)
!1030 = !DILocation(line: 307, column: 12, scope: !1028)
!1031 = !DILocation(line: 307, column: 9, scope: !1025)
!1032 = !DILocation(line: 308, column: 7, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 307, column: 38)
!1034 = !DILocation(line: 309, column: 18, scope: !1033)
!1035 = !DILocation(line: 309, column: 16, scope: !1033)
!1036 = !DILocation(line: 310, column: 5, scope: !1033)
!1037 = !DILocation(line: 311, column: 21, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1025, file: !2, line: 311, column: 9)
!1039 = !DILocation(line: 311, column: 14, scope: !1038)
!1040 = !DILocation(line: 311, column: 12, scope: !1038)
!1041 = !DILocation(line: 311, column: 9, scope: !1025)
!1042 = !DILocation(line: 312, column: 7, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !2, line: 311, column: 34)
!1044 = !DILocation(line: 313, column: 14, scope: !1043)
!1045 = !DILocation(line: 313, column: 12, scope: !1043)
!1046 = !DILocation(line: 314, column: 5, scope: !1043)
!1047 = !DILocation(line: 318, column: 10, scope: !999)
!1048 = !DILocation(line: 318, column: 8, scope: !999)
!1049 = !DILocation(line: 319, column: 3, scope: !999)
!1050 = !DILocation(line: 320, column: 19, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !999, file: !2, line: 320, column: 7)
!1052 = !DILocation(line: 320, column: 12, scope: !1051)
!1053 = !DILocation(line: 320, column: 10, scope: !1051)
!1054 = !DILocation(line: 320, column: 31, scope: !1051)
!1055 = !DILocation(line: 320, column: 7, scope: !999)
!1056 = !DILocation(line: 321, column: 9, scope: !1051)
!1057 = !DILocation(line: 321, column: 23, scope: !1051)
!1058 = !DILocation(line: 321, column: 16, scope: !1051)
!1059 = !DILocation(line: 321, column: 14, scope: !1051)
!1060 = !DILocation(line: 321, column: 29, scope: !1051)
!1061 = !DILocation(line: 321, column: 7, scope: !1051)
!1062 = !DILocation(line: 321, column: 5, scope: !1051)
!1063 = !DILocation(line: 322, column: 3, scope: !999)
!1064 = !DILocation(line: 322, column: 11, scope: !999)
!1065 = !DILocation(line: 322, column: 10, scope: !999)
!1066 = !DILocation(line: 322, column: 13, scope: !999)
!1067 = !DILocation(line: 322, column: 21, scope: !999)
!1068 = !DILocation(line: 322, column: 25, scope: !999)
!1069 = !DILocation(line: 322, column: 29, scope: !999)
!1070 = !DILocation(line: 322, column: 27, scope: !999)
!1071 = !DILocation(line: 0, scope: !999)
!1072 = !DILocation(line: 323, column: 6, scope: !999)
!1073 = distinct !{!1073, !1063, !1072, !475}
!1074 = !DILocation(line: 324, column: 8, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !999, file: !2, line: 324, column: 7)
!1076 = !DILocation(line: 324, column: 7, scope: !1075)
!1077 = !DILocation(line: 324, column: 10, scope: !1075)
!1078 = !DILocation(line: 324, column: 7, scope: !999)
!1079 = !DILocation(line: 325, column: 7, scope: !1075)
!1080 = !DILocation(line: 325, column: 9, scope: !1075)
!1081 = !DILocation(line: 325, column: 14, scope: !1075)
!1082 = !DILocation(line: 325, column: 5, scope: !1075)
!1083 = !DILocation(line: 328, column: 3, scope: !999)
!1084 = !DILocation(line: 328, column: 8, scope: !999)
!1085 = !DILocalVariable(name: "l", scope: !1086, file: !2, line: 332, type: !341)
!1086 = distinct !DILexicalBlock(scope: !999, file: !2, line: 331, column: 3)
!1087 = !DILocation(line: 332, column: 17, scope: !1086)
!1088 = !DILocation(line: 334, column: 10, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1086, file: !2, line: 334, column: 9)
!1090 = !DILocation(line: 334, column: 9, scope: !1089)
!1091 = !DILocation(line: 334, column: 15, scope: !1089)
!1092 = !DILocation(line: 334, column: 9, scope: !1086)
!1093 = !DILocation(line: 335, column: 11, scope: !1089)
!1094 = !DILocation(line: 335, column: 7, scope: !1089)
!1095 = !DILocation(line: 336, column: 10, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1086, file: !2, line: 336, column: 9)
!1097 = !DILocation(line: 336, column: 9, scope: !1096)
!1098 = !DILocation(line: 336, column: 15, scope: !1096)
!1099 = !DILocation(line: 336, column: 9, scope: !1086)
!1100 = !DILocation(line: 337, column: 11, scope: !1096)
!1101 = !DILocation(line: 337, column: 7, scope: !1096)
!1102 = !DILocation(line: 338, column: 9, scope: !1086)
!1103 = !DILocation(line: 338, column: 7, scope: !1086)
!1104 = !DILocation(line: 341, column: 5, scope: !1086)
!1105 = !DILocation(line: 341, column: 12, scope: !1086)
!1106 = !DILocation(line: 341, column: 34, scope: !1086)
!1107 = !DILocation(line: 341, column: 39, scope: !1086)
!1108 = !DILocation(line: 341, column: 38, scope: !1086)
!1109 = !DILocation(line: 341, column: 44, scope: !1086)
!1110 = !DILocation(line: 0, scope: !1086)
!1111 = !DILocation(line: 342, column: 11, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1086, file: !2, line: 341, column: 51)
!1113 = !DILocation(line: 343, column: 11, scope: !1112)
!1114 = distinct !{!1114, !1104, !1115, !475}
!1115 = !DILocation(line: 344, column: 5, scope: !1086)
!1116 = !DILocation(line: 347, column: 5, scope: !1086)
!1117 = !DILocation(line: 347, column: 14, scope: !1086)
!1118 = !DILocation(line: 347, column: 13, scope: !1086)
!1119 = !DILocation(line: 347, column: 19, scope: !1086)
!1120 = !DILocation(line: 347, column: 27, scope: !1086)
!1121 = !DILocation(line: 347, column: 32, scope: !1086)
!1122 = !DILocation(line: 347, column: 31, scope: !1086)
!1123 = !DILocation(line: 347, column: 37, scope: !1086)
!1124 = !DILocation(line: 347, column: 46, scope: !1086)
!1125 = !DILocation(line: 347, column: 50, scope: !1086)
!1126 = !DILocation(line: 347, column: 57, scope: !1086)
!1127 = !DILocation(line: 347, column: 55, scope: !1086)
!1128 = !DILocation(line: 348, column: 11, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1086, file: !2, line: 347, column: 61)
!1130 = !DILocation(line: 349, column: 11, scope: !1129)
!1131 = distinct !{!1131, !1116, !1132, !475}
!1132 = !DILocation(line: 350, column: 5, scope: !1086)
!1133 = !DILocation(line: 357, column: 7, scope: !999)
!1134 = !DILocation(line: 357, column: 5, scope: !999)
!1135 = !DILocation(line: 358, column: 8, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !999, file: !2, line: 358, column: 7)
!1137 = !DILocation(line: 358, column: 7, scope: !1136)
!1138 = !DILocation(line: 358, column: 10, scope: !1136)
!1139 = !DILocation(line: 358, column: 7, scope: !999)
!1140 = !DILocation(line: 359, column: 6, scope: !1136)
!1141 = !DILocation(line: 359, column: 5, scope: !1136)
!1142 = !DILocation(line: 360, column: 3, scope: !999)
!1143 = !DILocation(line: 360, column: 10, scope: !999)
!1144 = !DILocation(line: 360, column: 9, scope: !999)
!1145 = !DILocation(line: 361, column: 12, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !999, file: !2, line: 361, column: 9)
!1147 = !DILocation(line: 361, column: 9, scope: !1146)
!1148 = !DILocation(line: 361, column: 16, scope: !1146)
!1149 = !DILocation(line: 361, column: 9, scope: !999)
!1150 = !DILocation(line: 362, column: 7, scope: !1146)
!1151 = distinct !{!1151, !1142, !1152, !475}
!1152 = !DILocation(line: 362, column: 7, scope: !999)
!1153 = !DILocation(line: 365, column: 7, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !999, file: !2, line: 365, column: 7)
!1155 = !DILocation(line: 365, column: 7, scope: !999)
!1156 = !DILocation(line: 366, column: 5, scope: !1154)
!1157 = !DILocation(line: 369, column: 3, scope: !999)
!1158 = !DILocation(line: 372, column: 14, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !999, file: !2, line: 372, column: 7)
!1160 = !DILocation(line: 372, column: 7, scope: !1159)
!1161 = !DILocation(line: 372, column: 17, scope: !1159)
!1162 = !DILocation(line: 372, column: 7, scope: !999)
!1163 = !DILocation(line: 373, column: 5, scope: !1159)
!1164 = !DILocation(line: 376, column: 3, scope: !999)
!1165 = !DILocation(line: 377, column: 1, scope: !999)
!1166 = distinct !DISubprogram(name: "link_has_authorization", scope: !2, file: !2, line: 397, type: !967, scopeLine: 397, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !311, retainedNodes: !441)
!1167 = !DILocalVariable(name: "lien", arg: 1, scope: !1166, file: !2, line: 397, type: !341)
!1168 = !DILocation(line: 397, column: 40, scope: !1166)
!1169 = !DILocalVariable(name: "adr", scope: !1166, file: !2, line: 398, type: !341)
!1170 = !DILocation(line: 398, column: 15, scope: !1166)
!1171 = !DILocation(line: 398, column: 41, scope: !1166)
!1172 = !DILocation(line: 398, column: 21, scope: !1166)
!1173 = !DILocalVariable(name: "firstslash", scope: !1166, file: !2, line: 399, type: !341)
!1174 = !DILocation(line: 399, column: 15, scope: !1166)
!1175 = !DILocation(line: 399, column: 35, scope: !1166)
!1176 = !DILocation(line: 399, column: 28, scope: !1166)
!1177 = !DILocalVariable(name: "detect", scope: !1166, file: !2, line: 400, type: !341)
!1178 = !DILocation(line: 400, column: 15, scope: !1166)
!1179 = !DILocation(line: 400, column: 31, scope: !1166)
!1180 = !DILocation(line: 400, column: 24, scope: !1166)
!1181 = !DILocation(line: 402, column: 7, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1166, file: !2, line: 402, column: 7)
!1183 = !DILocation(line: 402, column: 7, scope: !1166)
!1184 = !DILocation(line: 403, column: 9, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !2, line: 403, column: 9)
!1186 = distinct !DILexicalBlock(scope: !1182, file: !2, line: 402, column: 19)
!1187 = !DILocation(line: 403, column: 9, scope: !1186)
!1188 = !DILocation(line: 404, column: 15, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1185, file: !2, line: 403, column: 17)
!1190 = !DILocation(line: 404, column: 24, scope: !1189)
!1191 = !DILocation(line: 404, column: 22, scope: !1189)
!1192 = !DILocation(line: 404, column: 7, scope: !1189)
!1193 = !DILocation(line: 406, column: 3, scope: !1186)
!1194 = !DILocation(line: 407, column: 13, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1182, file: !2, line: 406, column: 10)
!1196 = !DILocation(line: 407, column: 20, scope: !1195)
!1197 = !DILocation(line: 407, column: 5, scope: !1195)
!1198 = !DILocation(line: 409, column: 3, scope: !1166)
!1199 = !DILocation(line: 410, column: 1, scope: !1166)
!1200 = distinct !DISubprogram(name: "long_to_83", scope: !2, file: !2, line: 413, type: !1201, scopeLine: 413, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !311, retainedNodes: !441)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{null, !331, !340, !340}
!1203 = !DILocalVariable(name: "mode", arg: 1, scope: !1200, file: !2, line: 413, type: !331)
!1204 = !DILocation(line: 413, column: 21, scope: !1200)
!1205 = !DILocalVariable(name: "n83", arg: 2, scope: !1200, file: !2, line: 413, type: !340)
!1206 = !DILocation(line: 413, column: 33, scope: !1200)
!1207 = !DILocalVariable(name: "save", arg: 3, scope: !1200, file: !2, line: 413, type: !340)
!1208 = !DILocation(line: 413, column: 44, scope: !1200)
!1209 = !DILocation(line: 414, column: 3, scope: !1200)
!1210 = !DILocation(line: 414, column: 10, scope: !1200)
!1211 = !DILocation(line: 416, column: 3, scope: !1200)
!1212 = !DILocation(line: 416, column: 10, scope: !1200)
!1213 = !DILocation(line: 416, column: 9, scope: !1200)
!1214 = !DILocalVariable(name: "fn83", scope: !1215, file: !2, line: 417, type: !377)
!1215 = distinct !DILexicalBlock(scope: !1200, file: !2, line: 416, column: 16)
!1216 = !DILocation(line: 417, column: 10, scope: !1215)
!1217 = !DILocalVariable(name: "fnl", scope: !1215, file: !2, line: 417, type: !377)
!1218 = !DILocation(line: 417, column: 21, scope: !1215)
!1219 = !DILocalVariable(name: "i", scope: !1215, file: !2, line: 418, type: !334)
!1220 = !DILocation(line: 418, column: 12, scope: !1215)
!1221 = !DILocalVariable(name: "j", scope: !1215, file: !2, line: 418, type: !334)
!1222 = !DILocation(line: 418, column: 15, scope: !1215)
!1223 = !DILocation(line: 420, column: 15, scope: !1215)
!1224 = !DILocation(line: 420, column: 22, scope: !1215)
!1225 = !DILocation(line: 420, column: 5, scope: !1215)
!1226 = !DILocation(line: 420, column: 13, scope: !1215)
!1227 = !DILocation(line: 421, column: 15, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1215, file: !2, line: 421, column: 5)
!1229 = !DILocation(line: 421, column: 11, scope: !1228)
!1230 = !DILocation(line: 421, column: 9, scope: !1228)
!1231 = !DILocation(line: 421, column: 21, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1228, file: !2, line: 421, column: 5)
!1233 = !DILocation(line: 421, column: 26, scope: !1232)
!1234 = !DILocation(line: 421, column: 29, scope: !1232)
!1235 = !DILocation(line: 421, column: 32, scope: !1232)
!1236 = !DILocation(line: 421, column: 37, scope: !1232)
!1237 = !DILocation(line: 421, column: 40, scope: !1232)
!1238 = !DILocation(line: 0, scope: !1232)
!1239 = !DILocation(line: 421, column: 5, scope: !1228)
!1240 = !DILocation(line: 422, column: 11, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 422, column: 11)
!1242 = distinct !DILexicalBlock(scope: !1232, file: !2, line: 421, column: 54)
!1243 = !DILocation(line: 422, column: 13, scope: !1241)
!1244 = !DILocation(line: 422, column: 17, scope: !1241)
!1245 = !DILocation(line: 422, column: 11, scope: !1242)
!1246 = !DILocation(line: 423, column: 20, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1241, file: !2, line: 422, column: 32)
!1248 = !DILocation(line: 423, column: 25, scope: !1247)
!1249 = !DILocation(line: 423, column: 14, scope: !1247)
!1250 = !DILocation(line: 423, column: 9, scope: !1247)
!1251 = !DILocation(line: 423, column: 18, scope: !1247)
!1252 = !DILocation(line: 424, column: 7, scope: !1247)
!1253 = !DILocation(line: 425, column: 5, scope: !1242)
!1254 = !DILocation(line: 421, column: 50, scope: !1232)
!1255 = !DILocation(line: 421, column: 5, scope: !1232)
!1256 = distinct !{!1256, !1239, !1257, !475}
!1257 = !DILocation(line: 425, column: 5, scope: !1228)
!1258 = !DILocation(line: 426, column: 9, scope: !1215)
!1259 = !DILocation(line: 426, column: 5, scope: !1215)
!1260 = !DILocation(line: 426, column: 12, scope: !1215)
!1261 = !DILocation(line: 428, column: 20, scope: !1215)
!1262 = !DILocation(line: 428, column: 26, scope: !1215)
!1263 = !DILocation(line: 428, column: 32, scope: !1215)
!1264 = !DILocation(line: 428, column: 5, scope: !1215)
!1265 = !DILocation(line: 429, column: 5, scope: !1215)
!1266 = !DILocation(line: 431, column: 13, scope: !1215)
!1267 = !DILocation(line: 431, column: 10, scope: !1215)
!1268 = !DILocation(line: 432, column: 10, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1215, file: !2, line: 432, column: 9)
!1270 = !DILocation(line: 432, column: 9, scope: !1269)
!1271 = !DILocation(line: 432, column: 15, scope: !1269)
!1272 = !DILocation(line: 432, column: 9, scope: !1215)
!1273 = !DILocation(line: 433, column: 7, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1269, file: !2, line: 432, column: 23)
!1275 = !DILocation(line: 434, column: 11, scope: !1274)
!1276 = !DILocation(line: 435, column: 5, scope: !1274)
!1277 = distinct !{!1277, !1211, !1278, !475}
!1278 = !DILocation(line: 436, column: 3, scope: !1200)
!1279 = !DILocation(line: 437, column: 1, scope: !1200)
!1280 = distinct !DISubprogram(name: "longfile_to_83", scope: !2, file: !2, line: 440, type: !1201, scopeLine: 440, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !311, retainedNodes: !441)
!1281 = !DILocalVariable(name: "mode", arg: 1, scope: !1280, file: !2, line: 440, type: !331)
!1282 = !DILocation(line: 440, column: 25, scope: !1280)
!1283 = !DILocalVariable(name: "n83", arg: 2, scope: !1280, file: !2, line: 440, type: !340)
!1284 = !DILocation(line: 440, column: 37, scope: !1280)
!1285 = !DILocalVariable(name: "save", arg: 3, scope: !1280, file: !2, line: 440, type: !340)
!1286 = !DILocation(line: 440, column: 48, scope: !1280)
!1287 = !DILocalVariable(name: "j", scope: !1280, file: !2, line: 441, type: !331)
!1288 = !DILocation(line: 441, column: 7, scope: !1280)
!1289 = !DILocalVariable(name: "max", scope: !1280, file: !2, line: 441, type: !331)
!1290 = !DILocation(line: 441, column: 14, scope: !1280)
!1291 = !DILocalVariable(name: "i", scope: !1280, file: !2, line: 442, type: !331)
!1292 = !DILocation(line: 442, column: 7, scope: !1280)
!1293 = !DILocalVariable(name: "nom", scope: !1280, file: !2, line: 443, type: !377)
!1294 = !DILocation(line: 443, column: 8, scope: !1280)
!1295 = !DILocalVariable(name: "ext", scope: !1280, file: !2, line: 444, type: !377)
!1296 = !DILocation(line: 444, column: 8, scope: !1280)
!1297 = !DILocation(line: 446, column: 12, scope: !1280)
!1298 = !DILocation(line: 446, column: 19, scope: !1280)
!1299 = !DILocation(line: 446, column: 3, scope: !1280)
!1300 = !DILocation(line: 446, column: 10, scope: !1280)
!1301 = !DILocation(line: 448, column: 11, scope: !1280)
!1302 = !DILocation(line: 448, column: 3, scope: !1280)
!1303 = !DILocation(line: 450, column: 9, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1280, file: !2, line: 448, column: 17)
!1305 = !DILocation(line: 451, column: 5, scope: !1304)
!1306 = !DILocation(line: 453, column: 9, scope: !1304)
!1307 = !DILocation(line: 454, column: 5, scope: !1304)
!1308 = !DILocation(line: 456, column: 9, scope: !1304)
!1309 = !DILocation(line: 457, column: 5, scope: !1304)
!1310 = !DILocation(line: 461, column: 7, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1280, file: !2, line: 461, column: 7)
!1312 = !DILocation(line: 461, column: 15, scope: !1311)
!1313 = !DILocation(line: 461, column: 7, scope: !1280)
!1314 = !DILocation(line: 462, column: 5, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1311, file: !2, line: 461, column: 23)
!1316 = !DILocation(line: 462, column: 13, scope: !1315)
!1317 = !DILocation(line: 463, column: 3, scope: !1315)
!1318 = !DILocalVariable(name: "last_dot", scope: !1319, file: !2, line: 466, type: !340)
!1319 = distinct !DILexicalBlock(scope: !1280, file: !2, line: 465, column: 3)
!1320 = !DILocation(line: 466, column: 11, scope: !1319)
!1321 = !DILocation(line: 466, column: 30, scope: !1319)
!1322 = !DILocation(line: 466, column: 22, scope: !1319)
!1323 = !DILocalVariable(name: "dot", scope: !1319, file: !2, line: 467, type: !340)
!1324 = !DILocation(line: 467, column: 11, scope: !1319)
!1325 = !DILocation(line: 469, column: 5, scope: !1319)
!1326 = !DILocation(line: 469, column: 25, scope: !1319)
!1327 = !DILocation(line: 469, column: 18, scope: !1319)
!1328 = !DILocation(line: 469, column: 16, scope: !1319)
!1329 = !DILocation(line: 470, column: 8, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 469, column: 38)
!1331 = !DILocation(line: 470, column: 12, scope: !1330)
!1332 = distinct !{!1332, !1325, !1333, !475}
!1333 = !DILocation(line: 471, column: 5, scope: !1319)
!1334 = !DILocation(line: 472, column: 9, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 472, column: 9)
!1336 = !DILocation(line: 472, column: 9, scope: !1319)
!1337 = !DILocation(line: 473, column: 8, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1335, file: !2, line: 472, column: 19)
!1339 = !DILocation(line: 473, column: 17, scope: !1338)
!1340 = !DILocation(line: 474, column: 5, scope: !1338)
!1341 = !DILocation(line: 482, column: 9, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1280, file: !2, line: 482, column: 3)
!1343 = !DILocation(line: 482, column: 16, scope: !1342)
!1344 = !DILocation(line: 482, column: 7, scope: !1342)
!1345 = !DILocation(line: 482, column: 21, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1342, file: !2, line: 482, column: 3)
!1347 = !DILocation(line: 482, column: 26, scope: !1346)
!1348 = !DILocation(line: 482, column: 29, scope: !1346)
!1349 = !DILocation(line: 482, column: 3, scope: !1342)
!1350 = !DILocalVariable(name: "a", scope: !1351, file: !2, line: 483, type: !4)
!1351 = distinct !DILexicalBlock(scope: !1346, file: !2, line: 482, column: 40)
!1352 = !DILocation(line: 483, column: 10, scope: !1351)
!1353 = !DILocation(line: 483, column: 14, scope: !1351)
!1354 = !DILocation(line: 483, column: 19, scope: !1351)
!1355 = !DILocation(line: 485, column: 9, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1351, file: !2, line: 485, column: 9)
!1357 = !DILocation(line: 485, column: 11, scope: !1356)
!1358 = !DILocation(line: 485, column: 18, scope: !1356)
!1359 = !DILocation(line: 485, column: 21, scope: !1356)
!1360 = !DILocation(line: 485, column: 23, scope: !1356)
!1361 = !DILocation(line: 485, column: 9, scope: !1351)
!1362 = !DILocation(line: 486, column: 9, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1356, file: !2, line: 485, column: 31)
!1364 = !DILocation(line: 487, column: 5, scope: !1363)
!1365 = !DILocation(line: 489, column: 13, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1356, file: !2, line: 488, column: 11)
!1367 = !DILocation(line: 489, column: 15, scope: !1366)
!1368 = !DILocation(line: 489, column: 22, scope: !1366)
!1369 = !DILocation(line: 489, column: 25, scope: !1366)
!1370 = !DILocation(line: 489, column: 27, scope: !1366)
!1371 = !DILocation(line: 489, column: 35, scope: !1366)
!1372 = !DILocation(line: 489, column: 39, scope: !1366)
!1373 = !DILocation(line: 489, column: 41, scope: !1366)
!1374 = !DILocation(line: 489, column: 48, scope: !1366)
!1375 = !DILocation(line: 489, column: 51, scope: !1366)
!1376 = !DILocation(line: 489, column: 53, scope: !1366)
!1377 = !DILocation(line: 489, column: 61, scope: !1366)
!1378 = !DILocation(line: 489, column: 64, scope: !1366)
!1379 = !DILocation(line: 489, column: 66, scope: !1366)
!1380 = !DILocation(line: 490, column: 12, scope: !1366)
!1381 = !DILocation(line: 490, column: 15, scope: !1366)
!1382 = !DILocation(line: 490, column: 17, scope: !1366)
!1383 = !DILocation(line: 488, column: 11, scope: !1356)
!1384 = !DILocation(line: 491, column: 11, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1386, file: !2, line: 491, column: 11)
!1386 = distinct !DILexicalBlock(scope: !1366, file: !2, line: 490, column: 26)
!1387 = !DILocation(line: 491, column: 13, scope: !1385)
!1388 = !DILocation(line: 491, column: 18, scope: !1385)
!1389 = !DILocation(line: 491, column: 21, scope: !1385)
!1390 = !DILocation(line: 491, column: 26, scope: !1385)
!1391 = !DILocation(line: 491, column: 28, scope: !1385)
!1392 = !DILocation(line: 491, column: 33, scope: !1385)
!1393 = !DILocation(line: 491, column: 11, scope: !1386)
!1394 = !DILocation(line: 492, column: 9, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !1385, file: !2, line: 491, column: 41)
!1396 = !DILocation(line: 494, column: 9, scope: !1386)
!1397 = !DILocation(line: 495, column: 5, scope: !1386)
!1398 = !DILocation(line: 496, column: 17, scope: !1351)
!1399 = !DILocation(line: 496, column: 5, scope: !1351)
!1400 = !DILocation(line: 496, column: 11, scope: !1351)
!1401 = !DILocation(line: 496, column: 15, scope: !1351)
!1402 = !DILocation(line: 497, column: 3, scope: !1351)
!1403 = !DILocation(line: 482, column: 36, scope: !1346)
!1404 = !DILocation(line: 482, column: 3, scope: !1346)
!1405 = distinct !{!1405, !1349, !1406, !475}
!1406 = !DILocation(line: 497, column: 3, scope: !1342)
!1407 = !DILocation(line: 498, column: 3, scope: !1280)
!1408 = !DILocation(line: 498, column: 8, scope: !1280)
!1409 = !DILocation(line: 498, column: 11, scope: !1280)
!1410 = !DILocation(line: 500, column: 9, scope: !1280)
!1411 = !DILocation(line: 500, column: 5, scope: !1280)
!1412 = !DILocation(line: 501, column: 3, scope: !1280)
!1413 = !DILocation(line: 501, column: 10, scope: !1280)
!1414 = !DILocation(line: 501, column: 14, scope: !1280)
!1415 = !DILocation(line: 501, column: 12, scope: !1280)
!1416 = !DILocation(line: 501, column: 19, scope: !1280)
!1417 = !DILocation(line: 501, column: 23, scope: !1280)
!1418 = !DILocation(line: 501, column: 28, scope: !1280)
!1419 = !DILocation(line: 501, column: 22, scope: !1280)
!1420 = !DILocation(line: 501, column: 32, scope: !1280)
!1421 = !DILocation(line: 501, column: 36, scope: !1280)
!1422 = !DILocation(line: 501, column: 41, scope: !1280)
!1423 = !DILocation(line: 501, column: 44, scope: !1280)
!1424 = !DILocation(line: 0, scope: !1280)
!1425 = !DILocation(line: 502, column: 9, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1427, file: !2, line: 502, column: 9)
!1427 = distinct !DILexicalBlock(scope: !1280, file: !2, line: 501, column: 53)
!1428 = !DILocation(line: 502, column: 14, scope: !1426)
!1429 = !DILocation(line: 502, column: 17, scope: !1426)
!1430 = !DILocation(line: 502, column: 9, scope: !1427)
!1431 = !DILocation(line: 503, column: 16, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1426, file: !2, line: 502, column: 25)
!1433 = !DILocation(line: 503, column: 21, scope: !1432)
!1434 = !DILocation(line: 503, column: 11, scope: !1432)
!1435 = !DILocation(line: 503, column: 7, scope: !1432)
!1436 = !DILocation(line: 503, column: 14, scope: !1432)
!1437 = !DILocation(line: 504, column: 8, scope: !1432)
!1438 = !DILocation(line: 505, column: 5, scope: !1432)
!1439 = !DILocation(line: 506, column: 6, scope: !1427)
!1440 = distinct !{!1440, !1412, !1441, !475}
!1441 = !DILocation(line: 507, column: 3, scope: !1280)
!1442 = !DILocation(line: 508, column: 7, scope: !1280)
!1443 = !DILocation(line: 508, column: 3, scope: !1280)
!1444 = !DILocation(line: 508, column: 10, scope: !1280)
!1445 = !DILocation(line: 509, column: 7, scope: !1446)
!1446 = distinct !DILexicalBlock(scope: !1280, file: !2, line: 509, column: 7)
!1447 = !DILocation(line: 509, column: 12, scope: !1446)
!1448 = !DILocation(line: 509, column: 7, scope: !1280)
!1449 = !DILocation(line: 510, column: 22, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1446, file: !2, line: 509, column: 16)
!1451 = !DILocation(line: 510, column: 15, scope: !1450)
!1452 = !DILocation(line: 510, column: 9, scope: !1450)
!1453 = !DILocation(line: 510, column: 28, scope: !1450)
!1454 = !DILocation(line: 510, column: 7, scope: !1450)
!1455 = !DILocation(line: 511, column: 5, scope: !1450)
!1456 = !DILocation(line: 511, column: 12, scope: !1450)
!1457 = !DILocation(line: 511, column: 14, scope: !1450)
!1458 = !DILocation(line: 511, column: 19, scope: !1450)
!1459 = !DILocation(line: 511, column: 23, scope: !1450)
!1460 = !DILocation(line: 511, column: 28, scope: !1450)
!1461 = !DILocation(line: 511, column: 31, scope: !1450)
!1462 = !DILocation(line: 511, column: 39, scope: !1450)
!1463 = !DILocation(line: 511, column: 43, scope: !1450)
!1464 = !DILocation(line: 511, column: 48, scope: !1450)
!1465 = !DILocation(line: 511, column: 51, scope: !1450)
!1466 = !DILocation(line: 0, scope: !1450)
!1467 = !DILocation(line: 512, column: 8, scope: !1450)
!1468 = distinct !{!1468, !1455, !1467, !475}
!1469 = !DILocation(line: 513, column: 9, scope: !1470)
!1470 = distinct !DILexicalBlock(scope: !1450, file: !2, line: 513, column: 9)
!1471 = !DILocation(line: 513, column: 14, scope: !1470)
!1472 = !DILocation(line: 513, column: 17, scope: !1470)
!1473 = !DILocation(line: 513, column: 9, scope: !1450)
!1474 = !DILocalVariable(name: "j", scope: !1475, file: !2, line: 514, type: !331)
!1475 = distinct !DILexicalBlock(scope: !1470, file: !2, line: 513, column: 25)
!1476 = !DILocation(line: 514, column: 11, scope: !1475)
!1477 = !DILocation(line: 516, column: 8, scope: !1475)
!1478 = !DILocation(line: 517, column: 7, scope: !1475)
!1479 = !DILocation(line: 517, column: 14, scope: !1475)
!1480 = !DILocation(line: 517, column: 16, scope: !1475)
!1481 = !DILocation(line: 517, column: 21, scope: !1475)
!1482 = !DILocation(line: 517, column: 25, scope: !1475)
!1483 = !DILocation(line: 517, column: 30, scope: !1475)
!1484 = !DILocation(line: 517, column: 24, scope: !1475)
!1485 = !DILocation(line: 0, scope: !1475)
!1486 = !DILocation(line: 518, column: 13, scope: !1487)
!1487 = distinct !DILexicalBlock(scope: !1488, file: !2, line: 518, column: 13)
!1488 = distinct !DILexicalBlock(scope: !1475, file: !2, line: 517, column: 35)
!1489 = !DILocation(line: 518, column: 18, scope: !1487)
!1490 = !DILocation(line: 518, column: 21, scope: !1487)
!1491 = !DILocation(line: 518, column: 13, scope: !1488)
!1492 = !DILocation(line: 519, column: 20, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1487, file: !2, line: 518, column: 29)
!1494 = !DILocation(line: 519, column: 25, scope: !1493)
!1495 = !DILocation(line: 519, column: 15, scope: !1493)
!1496 = !DILocation(line: 519, column: 11, scope: !1493)
!1497 = !DILocation(line: 519, column: 18, scope: !1493)
!1498 = !DILocation(line: 520, column: 12, scope: !1493)
!1499 = !DILocation(line: 521, column: 9, scope: !1493)
!1500 = !DILocation(line: 522, column: 10, scope: !1488)
!1501 = distinct !{!1501, !1478, !1502, !475}
!1502 = !DILocation(line: 523, column: 7, scope: !1475)
!1503 = !DILocation(line: 524, column: 11, scope: !1475)
!1504 = !DILocation(line: 524, column: 7, scope: !1475)
!1505 = !DILocation(line: 524, column: 14, scope: !1475)
!1506 = !DILocation(line: 525, column: 5, scope: !1475)
!1507 = !DILocation(line: 526, column: 3, scope: !1450)
!1508 = !DILocation(line: 528, column: 3, scope: !1280)
!1509 = !DILocation(line: 528, column: 10, scope: !1280)
!1510 = !DILocation(line: 529, column: 3, scope: !1280)
!1511 = !DILocation(line: 530, column: 7, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1280, file: !2, line: 530, column: 7)
!1513 = !DILocation(line: 530, column: 7, scope: !1280)
!1514 = !DILocation(line: 531, column: 5, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1512, file: !2, line: 530, column: 25)
!1516 = !DILocation(line: 532, column: 5, scope: !1515)
!1517 = !DILocation(line: 533, column: 3, scope: !1515)
!1518 = !DILocation(line: 534, column: 1, scope: !1280)
!1519 = distinct !DISubprogram(name: "verif_backblue", scope: !2, file: !2, line: 538, type: !1520, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !311, retainedNodes: !441)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!331, !1522, !341}
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !345, line: 49, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !1525, line: 294, size: 1133184, elements: !1526)
!1525 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!1526 = !{!1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1585, !1586, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1603, !1604, !1605, !1606, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1697, !1738, !1741, !1742, !1746, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !2199, !2211}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !1524, file: !1525, line: 295, baseType: !334, size: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !1524, file: !1525, line: 297, baseType: !331, size: 32, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1524, file: !1525, line: 298, baseType: !331, size: 32, offset: 96)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !1524, file: !1525, line: 299, baseType: !331, size: 32, offset: 128)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !1524, file: !1525, line: 300, baseType: !331, size: 32, offset: 160)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1524, file: !1525, line: 301, baseType: !331, size: 32, offset: 192)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !1524, file: !1525, line: 302, baseType: !331, size: 32, offset: 224)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !1524, file: !1525, line: 303, baseType: !331, size: 32, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !1524, file: !1525, line: 304, baseType: !331, size: 32, offset: 288)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1524, file: !1525, line: 305, baseType: !331, size: 32, offset: 320)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !1524, file: !1525, line: 306, baseType: !331, size: 32, offset: 352)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !1524, file: !1525, line: 307, baseType: !1539, size: 64, offset: 384)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1541, line: 7, baseType: !1542)
!1541 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1543, line: 49, size: 1728, elements: !1544)
!1543 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1544 = !{!1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1560, !1562, !1563, !1564, !1565, !1566, !1568, !1569, !1572, !1574, !1577, !1580, !1581, !1582, !1583, !1584}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1542, file: !1543, line: 51, baseType: !331, size: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1542, file: !1543, line: 54, baseType: !340, size: 64, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1542, file: !1543, line: 55, baseType: !340, size: 64, offset: 128)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1542, file: !1543, line: 56, baseType: !340, size: 64, offset: 192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1542, file: !1543, line: 57, baseType: !340, size: 64, offset: 256)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1542, file: !1543, line: 58, baseType: !340, size: 64, offset: 320)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1542, file: !1543, line: 59, baseType: !340, size: 64, offset: 384)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1542, file: !1543, line: 60, baseType: !340, size: 64, offset: 448)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1542, file: !1543, line: 61, baseType: !340, size: 64, offset: 512)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1542, file: !1543, line: 64, baseType: !340, size: 64, offset: 576)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1542, file: !1543, line: 65, baseType: !340, size: 64, offset: 640)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1542, file: !1543, line: 66, baseType: !340, size: 64, offset: 704)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1542, file: !1543, line: 68, baseType: !1558, size: 64, offset: 768)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64)
!1559 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1543, line: 36, flags: DIFlagFwdDecl)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1542, file: !1543, line: 70, baseType: !1561, size: 64, offset: 832)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1542, file: !1543, line: 72, baseType: !331, size: 32, offset: 896)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1542, file: !1543, line: 73, baseType: !331, size: 32, offset: 928)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1542, file: !1543, line: 74, baseType: !372, size: 64, offset: 960)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1542, file: !1543, line: 77, baseType: !333, size: 16, offset: 1024)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1542, file: !1543, line: 78, baseType: !1567, size: 8, offset: 1040)
!1567 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1542, file: !1543, line: 79, baseType: !108, size: 8, offset: 1048)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1542, file: !1543, line: 81, baseType: !1570, size: 64, offset: 1088)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1543, line: 43, baseType: null)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1542, file: !1543, line: 89, baseType: !1573, size: 64, offset: 1152)
!1573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !370, line: 153, baseType: !373)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1542, file: !1543, line: 91, baseType: !1575, size: 64, offset: 1216)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64)
!1576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1543, line: 37, flags: DIFlagFwdDecl)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1542, file: !1543, line: 92, baseType: !1578, size: 64, offset: 1280)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1543, line: 38, flags: DIFlagFwdDecl)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1542, file: !1543, line: 93, baseType: !1561, size: 64, offset: 1344)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1542, file: !1543, line: 94, baseType: !330, size: 64, offset: 1408)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1542, file: !1543, line: 95, baseType: !334, size: 64, offset: 1472)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1542, file: !1543, line: 96, baseType: !331, size: 32, offset: 1536)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1542, file: !1543, line: 98, baseType: !205, size: 160, offset: 1568)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !1524, file: !1525, line: 308, baseType: !1539, size: 64, offset: 448)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !1524, file: !1525, line: 309, baseType: !1587, size: 64, offset: 512)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !1588, line: 283, baseType: !373)
!1588 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !1524, file: !1525, line: 310, baseType: !1587, size: 64, offset: 576)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !1524, file: !1525, line: 311, baseType: !1587, size: 64, offset: 640)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !1524, file: !1525, line: 312, baseType: !331, size: 32, offset: 704)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !1524, file: !1525, line: 313, baseType: !1587, size: 64, offset: 768)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !1524, file: !1525, line: 314, baseType: !331, size: 32, offset: 832)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !1524, file: !1525, line: 315, baseType: !331, size: 32, offset: 864)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !1524, file: !1525, line: 316, baseType: !331, size: 32, offset: 896)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !1524, file: !1525, line: 317, baseType: !331, size: 32, offset: 928)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1524, file: !1525, line: 318, baseType: !331, size: 32, offset: 960)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !1524, file: !1525, line: 319, baseType: !331, size: 32, offset: 992)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !1524, file: !1525, line: 320, baseType: !331, size: 32, offset: 1024)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !1524, file: !1525, line: 321, baseType: !331, size: 32, offset: 1056)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !1524, file: !1525, line: 322, baseType: !1602, size: 32, offset: 1088)
!1602 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !1524, file: !1525, line: 323, baseType: !331, size: 32, offset: 1120)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1524, file: !1525, line: 324, baseType: !331, size: 32, offset: 1152)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !1524, file: !1525, line: 326, baseType: !331, size: 32, offset: 1184)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1524, file: !1525, line: 327, baseType: !1607, size: 512, offset: 1216)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !1525, line: 89, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !1525, line: 91, size: 512, elements: !1609)
!1609 = !{!1610, !1611, !1619, !1620}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1608, file: !1525, line: 92, baseType: !331, size: 32)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1608, file: !1525, line: 93, baseType: !1612, size: 192, offset: 64)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !1613, line: 57, baseType: !1614)
!1613 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !1613, line: 61, size: 192, elements: !1615)
!1615 = !{!1616, !1617, !1618}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !1614, file: !1613, line: 62, baseType: !340, size: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !1614, file: !1613, line: 63, baseType: !334, size: 64, offset: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !1614, file: !1613, line: 64, baseType: !334, size: 64, offset: 128)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1608, file: !1525, line: 94, baseType: !331, size: 32, offset: 256)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !1608, file: !1525, line: 95, baseType: !1612, size: 192, offset: 320)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !1524, file: !1525, line: 328, baseType: !331, size: 32, offset: 1728)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !1524, file: !1525, line: 329, baseType: !331, size: 32, offset: 1760)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !1524, file: !1525, line: 330, baseType: !1612, size: 192, offset: 1792)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !1524, file: !1525, line: 331, baseType: !331, size: 32, offset: 1984)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !1524, file: !1525, line: 332, baseType: !331, size: 32, offset: 2016)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !1524, file: !1525, line: 333, baseType: !331, size: 32, offset: 2048)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !1524, file: !1525, line: 334, baseType: !331, size: 32, offset: 2080)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !1524, file: !1525, line: 335, baseType: !1612, size: 192, offset: 2112)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !1524, file: !1525, line: 336, baseType: !1612, size: 192, offset: 2304)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1524, file: !1525, line: 337, baseType: !1612, size: 192, offset: 2496)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !1524, file: !1525, line: 338, baseType: !1612, size: 192, offset: 2688)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !1524, file: !1525, line: 339, baseType: !1612, size: 192, offset: 2880)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !1524, file: !1525, line: 340, baseType: !1612, size: 192, offset: 3072)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !1524, file: !1525, line: 341, baseType: !1612, size: 192, offset: 3264)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !1524, file: !1525, line: 342, baseType: !331, size: 32, offset: 3456)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !1524, file: !1525, line: 343, baseType: !331, size: 32, offset: 3488)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !1524, file: !1525, line: 344, baseType: !331, size: 32, offset: 3520)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !1524, file: !1525, line: 345, baseType: !331, size: 32, offset: 3552)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !1524, file: !1525, line: 346, baseType: !331, size: 32, offset: 3584)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !1524, file: !1525, line: 347, baseType: !331, size: 32, offset: 3616)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !1524, file: !1525, line: 348, baseType: !331, size: 32, offset: 3648)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !1524, file: !1525, line: 349, baseType: !331, size: 32, offset: 3680)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !1524, file: !1525, line: 350, baseType: !331, size: 32, offset: 3712)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !1524, file: !1525, line: 351, baseType: !331, size: 32, offset: 3744)
