; ModuleID = 'src/htsthread.c'
source_filename = "src/htsthread.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.htsmutex_s = type { %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_attr_t = type { i64, [48 x i8] }
%struct.hts_thread_s = type { ptr, ptr }

@process_chain_mutex = internal global ptr null, align 8, !dbg !0
@process_chain = internal global i32 0, align 4, !dbg !39
@.str = private unnamed_addr constant [21 x i8] c"s_args != ((void*)0)\00", align 1, !dbg !16
@.str.1 = private unnamed_addr constant [16 x i8] c"src/htsthread.c\00", align 1, !dbg !22
@.str.2 = private unnamed_addr constant [20 x i8] c"mutex != ((void*)0)\00", align 1, !dbg !27
@.str.3 = private unnamed_addr constant [21 x i8] c"*mutex != ((void*)0)\00", align 1, !dbg !32
@.str.4 = private unnamed_addr constant [44 x i8] c"mutex != ((void*)0) && *mutex != ((void*)0)\00", align 1, !dbg !34
@stderr = external global ptr, align 8
@.str.5 = private unnamed_addr constant [20 x i8] c"%s failed at %s:%d\0A\00", align 1, !dbg !42
@.str.6 = private unnamed_addr constant [18 x i8] c"process_chain > 0\00", align 1, !dbg !45

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "process_chain_mutex", scope: !2, file: !3, line: 48, type: !55, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !15, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/htsthread.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "aeaf9fa3b642f2fb7ee693a62a361eeb")
!4 = !{!5, !6}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_thread_s", file: !3, line: 90, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_thread_s", file: !3, line: 87, size: 128, elements: !9)
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !8, file: !3, line: 88, baseType: !5, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !8, file: !3, line: 89, baseType: !12, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !5}
!15 = !{!16, !22, !27, !32, !34, !0, !39, !42, !45, !50}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(scope: null, file: !3, line: 127, type: !18, isLocal: true, isDefinition: true)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 168, elements: !20)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !{!21}
!21 = !DISubrange(count: 21)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !3, line: 127, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 16)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !3, line: 194, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 20)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !3, line: 198, type: !18, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !3, line: 208, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 352, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 44)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "process_chain", scope: !2, file: !3, line: 47, type: !41, isLocal: true, isDefinition: true)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !44, line: 91, type: !29, isLocal: true, isDefinition: true)
!44 = !DIFile(filename: "./src/htssafe.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "0a24d1c0939efbe916010d30091bc9cc")
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !3, line: 106, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 144, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 18)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !3, line: 114, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 152, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 19)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !56, line: 50, baseType: !57)
!56 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !56, line: 59, size: 320, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !58, file: !56, line: 60, baseType: !61, size: 320)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !62, line: 72, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !62, line: 67, size: 320, elements: !64)
!64 = !{!65, !86, !90}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !63, file: !62, line: 69, baseType: !66, size: 320)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !67, line: 22, size: 320, elements: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!68 = !{!69, !70, !72, !73, !74, !75, !77, !78}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !66, file: !67, line: 24, baseType: !41, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !66, file: !67, line: 25, baseType: !71, size: 32, offset: 32)
!71 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !66, file: !67, line: 26, baseType: !41, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !66, file: !67, line: 28, baseType: !71, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !66, file: !67, line: 32, baseType: !41, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !66, file: !67, line: 34, baseType: !76, size: 16, offset: 160)
!76 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !66, file: !67, line: 35, baseType: !76, size: 16, offset: 176)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !66, file: !67, line: 36, baseType: !79, size: 128, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !80, line: 55, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !80, line: 51, size: 128, elements: !82)
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !81, file: !80, line: 53, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !81, file: !80, line: 54, baseType: !84, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !63, file: !62, line: 70, baseType: !87, size: 320)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 320, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 40)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !63, file: !62, line: 71, baseType: !91, size: 64)
!91 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!92 = !{i32 7, !"Dwarf Version", i32 5}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{i32 1, !"wchar_size", i32 4}
!95 = !{i32 8, !"PIC Level", i32 2}
!96 = !{i32 7, !"PIE Level", i32 2}
!97 = !{i32 7, !"uwtable", i32 2}
!98 = !{i32 7, !"frame-pointer", i32 2}
!99 = !{!"clang version 16.0.0"}
!100 = distinct !DISubprogram(name: "htsthread_wait", scope: !3, file: !3, line: 50, type: !101, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{null}
!103 = !{}
!104 = !DILocation(line: 51, column: 3, scope: !100)
!105 = !DILocation(line: 52, column: 1, scope: !100)
!106 = distinct !DISubprogram(name: "htsthread_wait_n", scope: !3, file: !3, line: 54, type: !107, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !103)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !41}
!109 = !DILocalVariable(name: "n_wait", arg: 1, scope: !106, file: !3, line: 54, type: !41)
!110 = !DILocation(line: 54, column: 38, scope: !106)
!111 = !DILocalVariable(name: "wait", scope: !106, file: !3, line: 56, type: !41)
!112 = !DILocation(line: 56, column: 7, scope: !106)
!113 = !DILocation(line: 58, column: 3, scope: !106)
!114 = !DILocation(line: 59, column: 5, scope: !115)
!115 = distinct !DILexicalBlock(scope: !106, file: !3, line: 58, column: 6)
!116 = !DILocation(line: 60, column: 13, scope: !115)
!117 = !DILocation(line: 60, column: 29, scope: !115)
!118 = !DILocation(line: 60, column: 27, scope: !115)
!119 = !DILocation(line: 60, column: 10, scope: !115)
!120 = !DILocation(line: 61, column: 5, scope: !115)
!121 = !DILocation(line: 62, column: 9, scope: !122)
!122 = distinct !DILexicalBlock(scope: !115, file: !3, line: 62, column: 9)
!123 = !DILocation(line: 62, column: 9, scope: !115)
!124 = !DILocation(line: 63, column: 7, scope: !125)
!125 = distinct !DILexicalBlock(scope: !126, file: !3, line: 63, column: 7)
!126 = distinct !DILexicalBlock(scope: !122, file: !3, line: 63, column: 7)
!127 = !DILocation(line: 63, column: 7, scope: !126)
!128 = !DILocation(line: 64, column: 3, scope: !115)
!129 = !DILocation(line: 64, column: 11, scope: !106)
!130 = distinct !{!130, !113, !131, !132}
!131 = !DILocation(line: 64, column: 15, scope: !106)
!132 = !{!"llvm.loop.mustprogress"}
!133 = !DILocation(line: 66, column: 1, scope: !106)
!134 = distinct !DISubprogram(name: "hts_mutexlock", scope: !3, file: !3, line: 193, type: !135, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !103)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!138 = !DILocalVariable(name: "mutex", arg: 1, scope: !134, file: !3, line: 193, type: !137)
!139 = !DILocation(line: 193, column: 42, scope: !134)
!140 = !DILocation(line: 194, column: 3, scope: !134)
!141 = !DILocation(line: 195, column: 8, scope: !142)
!142 = distinct !DILexicalBlock(scope: !134, file: !3, line: 195, column: 7)
!143 = !DILocation(line: 195, column: 7, scope: !142)
!144 = !DILocation(line: 195, column: 14, scope: !142)
!145 = !DILocation(line: 195, column: 7, scope: !134)
!146 = !DILocation(line: 196, column: 19, scope: !147)
!147 = distinct !DILexicalBlock(scope: !142, file: !3, line: 195, column: 32)
!148 = !DILocation(line: 196, column: 5, scope: !147)
!149 = !DILocation(line: 197, column: 3, scope: !147)
