; ModuleID = 'src/htsweb.c'
source_filename = "src/htsweb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.t_InpInfo = type { i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i64, i32 }
%struct.struct_coucal = type { ptr, i64, i64, %struct.anon, %struct.anon.0, %struct.anon.1, %struct.anon.2 }
%struct.anon = type { [16 x %struct.coucal_item], i64 }
%struct.coucal_item = type { ptr, %union.coucal_value, %struct.coucal_hashkeys }
%union.coucal_value = type { i64 }
%struct.coucal_hashkeys = type { i32, i32 }
%struct.anon.0 = type { ptr, i64, i64, i64 }
%struct.anon.1 = type { i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.anon.2 = type { %struct.anon.3, %struct.anon.4, %struct.anon.5, %struct.anon.6 }
%struct.anon.3 = type { ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr, ptr }
%struct.anon.5 = type { ptr, ptr, ptr, ptr }
%struct.anon.6 = type { ptr, ptr, ptr }
%union.anon = type { [4 x i32] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.struct_coucal_enum = type { ptr, i64 }
%struct.MD5Context = type { %union.anon.7, [4 x i32], [2 x i32], i32 }
%union.anon.7 = type { [16 x i32] }
%union.anon.8 = type { i64, [8 x i8] }

!86 = !DIEnumerator(name: "coucal_log_debug", value: 3)
!87 = !DIEnumerator(name: "coucal_log_trace", value: 4)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HTTrackStatus", file: !89, line: 146, baseType: !90, size: 32, elements: !91)
!89 = !DIFile(filename: "./src/htsbasenet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "48aef65af186ac0a9c99162429164003")
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!92 = !DIEnumerator(name: "STATUS_ALIVE", value: -103)
!93 = !DIEnumerator(name: "STATUS_FREE", value: -1)
!94 = !DIEnumerator(name: "STATUS_READY", value: 0)
!95 = !DIEnumerator(name: "STATUS_TRANSFER", value: 1)
!96 = !DIEnumerator(name: "STATUS_CHUNK_CR", value: 97)
!97 = !DIEnumerator(name: "STATUS_CHUNK_WAIT", value: 98)
!98 = !DIEnumerator(name: "STATUS_WAIT_HEADERS", value: 99)
!99 = !DIEnumerator(name: "STATUS_CONNECTING", value: 100)
!100 = !DIEnumerator(name: "STATUS_WAIT_DNS", value: 101)
!101 = !DIEnumerator(name: "STATUS_SSL_WAIT_HANDSHAKE", value: 102)
!102 = !DIEnumerator(name: "STATUS_FTP_TRANSFER", value: 1000)
!103 = !DIEnumerator(name: "STATUS_FTP_READY", value: 1001)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HTTPStatusCode", file: !89, line: 90, baseType: !81, size: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!106 = !DIEnumerator(name: "HTTP_CONTINUE", value: 100)
!107 = !DIEnumerator(name: "HTTP_SWITCHING_PROTOCOLS", value: 101)
!108 = !DIEnumerator(name: "HTTP_OK", value: 200)
!109 = !DIEnumerator(name: "HTTP_CREATED", value: 201)
!110 = !DIEnumerator(name: "HTTP_ACCEPTED", value: 202)
!111 = !DIEnumerator(name: "HTTP_NON_AUTHORITATIVE_INFORMATION", value: 203)
!112 = !DIEnumerator(name: "HTTP_NO_CONTENT", value: 204)
!113 = !DIEnumerator(name: "HTTP_RESET_CONTENT", value: 205)
!114 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!115 = !DIEnumerator(name: "HTTP_MULTIPLE_CHOICES", value: 300)
!116 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!117 = !DIEnumerator(name: "HTTP_FOUND", value: 302)
!118 = !DIEnumerator(name: "HTTP_SEE_OTHER", value: 303)
!119 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!120 = !DIEnumerator(name: "HTTP_USE_PROXY", value: 305)
!121 = !DIEnumerator(name: "HTTP_TEMPORARY_REDIRECT", value: 307)
!122 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!123 = !DIEnumerator(name: "HTTP_UNAUTHORIZED", value: 401)
!124 = !DIEnumerator(name: "HTTP_PAYMENT_REQUIRED", value: 402)
!125 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!126 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!127 = !DIEnumerator(name: "HTTP_METHOD_NOT_ALLOWED", value: 405)
!128 = !DIEnumerator(name: "HTTP_NOT_ACCEPTABLE", value: 406)
!129 = !DIEnumerator(name: "HTTP_PROXY_AUTHENTICATION_REQUIRED", value: 407)
!130 = !DIEnumerator(name: "HTTP_REQUEST_TIME_OUT", value: 408)
!131 = !DIEnumerator(name: "HTTP_CONFLICT", value: 409)
!132 = !DIEnumerator(name: "HTTP_GONE", value: 410)
!133 = !DIEnumerator(name: "HTTP_LENGTH_REQUIRED", value: 411)
!134 = !DIEnumerator(name: "HTTP_PRECONDITION_FAILED", value: 412)
!135 = !DIEnumerator(name: "HTTP_REQUEST_ENTITY_TOO_LARGE", value: 413)
!136 = !DIEnumerator(name: "HTTP_REQUEST_URI_TOO_LARGE", value: 414)
!137 = !DIEnumerator(name: "HTTP_UNSUPPORTED_MEDIA_TYPE", value: 415)
!138 = !DIEnumerator(name: "HTTP_REQUESTED_RANGE_NOT_SATISFIABLE", value: 416)
!139 = !DIEnumerator(name: "HTTP_EXPECTATION_FAILED", value: 417)
!140 = !DIEnumerator(name: "HTTP_INTERNAL_SERVER_ERROR", value: 500)
!141 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!142 = !DIEnumerator(name: "HTTP_BAD_GATEWAY", value: 502)
!143 = !DIEnumerator(name: "HTTP_SERVICE_UNAVAILABLE", value: 503)
!144 = !DIEnumerator(name: "HTTP_GATEWAY_TIME_OUT", value: 504)
!145 = !DIEnumerator(name: "HTTP_HTTP_VERSION_NOT_SUPPORTED", value: 505)
!146 = !{!147, !90, !150, !151, !154, !158, !184, !203, !81, !300, !302, !173, !303, !307, !309, !267, !310, !311, !314, !315}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !153)
!152 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!153 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !155, line: 27, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !157, line: 45, baseType: !153)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_item", file: !80, line: 136, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "coucal_item", file: !80, line: 169, size: 192, elements: !161)
!161 = !{!162, !164, !175}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !80, line: 171, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_key", file: !80, line: 108, baseType: !150)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !160, file: !80, line: 174, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_value", file: !80, line: 126, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "coucal_value", file: !80, line: 117, size: 64, elements: !167)
!167 = !{!168, !172, !174}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intg", scope: !166, file: !80, line: 119, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !170, line: 87, baseType: !171)
!170 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!171 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "uintg", scope: !166, file: !80, line: 122, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !170, line: 90, baseType: !153)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !166, file: !80, line: 125, baseType: !150, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "hashes", scope: !160, file: !80, line: 177, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_hashkeys", file: !80, line: 163, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "coucal_hashkeys", file: !80, line: 160, size: 64, elements: !178)
!178 = !{!179, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "hash1", scope: !177, file: !80, line: 161, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_hashkey", file: !80, line: 148, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !155, line: 26, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !157, line: 42, baseType: !81)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "hash2", scope: !177, file: !80, line: 162, baseType: !180, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !80, line: 231, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !2, line: 123, size: 4992, elements: !187)
!187 = !{!188, !189, !190, !191, !199, !207, !218}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !186, file: !2, line: 125, baseType: !158, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lg_size", scope: !186, file: !2, line: 128, baseType: !151, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !186, file: !2, line: 131, baseType: !151, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "stash", scope: !186, file: !2, line: 140, baseType: !192, size: 3136, offset: 192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !2, line: 134, size: 3136, elements: !193)
!193 = !{!194, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !192, file: !2, line: 136, baseType: !195, size: 3072)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 3072, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !192, file: !2, line: 139, baseType: !151, size: 64, offset: 3072)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !186, file: !2, line: 152, baseType: !200, size: 256, offset: 3328)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !2, line: 143, size: 256, elements: !201)
!201 = !{!202, !204, !205, !206}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !200, file: !2, line: 145, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !2, line: 147, baseType: !151, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !200, file: !2, line: 149, baseType: !151, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !200, file: !2, line: 151, baseType: !151, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !186, file: !2, line: 172, baseType: !208, size: 512, offset: 3584)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !2, line: 155, size: 512, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "max_stash_size", scope: !208, file: !2, line: 157, baseType: !151, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "write_count", scope: !208, file: !2, line: 159, baseType: !151, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !208, file: !2, line: 161, baseType: !151, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cuckoo_moved", scope: !208, file: !2, line: 163, baseType: !151, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stash_added", scope: !208, file: !2, line: 165, baseType: !151, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rehash_count", scope: !208, file: !2, line: 167, baseType: !151, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pool_compact_count", scope: !208, file: !2, line: 169, baseType: !151, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pool_realloc_count", scope: !208, file: !2, line: 171, baseType: !151, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !186, file: !2, line: 219, baseType: !219, size: 896, offset: 4096)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !2, line: 175, size: 896, elements: !220)
!220 = !{!221, !231, !258, !284}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !219, file: !2, line: 182, baseType: !222, size: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !2, line: 177, size: 128, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !222, file: !2, line: 179, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_value_freehandler", file: !80, line: 194, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229, !165}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_opaque", file: !80, line: 114, baseType: !150)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !222, file: !2, line: 181, baseType: !229, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !219, file: !2, line: 196, baseType: !232, size: 320, offset: 128)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !2, line: 185, size: 320, elements: !233)
!233 = !{!234, !242, !247, !252, !257}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !232, file: !2, line: 187, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_duphandler", file: !80, line: 198, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!163, !229, !239}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_key_const", file: !80, line: 111, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !232, file: !2, line: 189, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_key_freehandler", file: !80, line: 190, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !229, !163}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !232, file: !2, line: 191, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_hasheshandler", file: !80, line: 202, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!176, !229, !239}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "equals", scope: !232, file: !2, line: 193, baseType: !253, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_cmphandler", file: !80, line: 224, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!90, !229, !239, !239}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !232, file: !2, line: 195, baseType: !229, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !219, file: !2, line: 208, baseType: !259, size: 256, offset: 448)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !2, line: 199, size: 256, elements: !260)
!260 = !{!261, !277, !282, !283}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !259, file: !2, line: 201, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_loghandler", file: !80, line: 206, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !229, !266, !267, !269}
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_loglevel", file: !80, line: 187, baseType: !79)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !271)
!271 = !{!272, !274, !275, !276}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !270, file: !273, baseType: !81, size: 32)
!273 = !DIFile(filename: "src/htsweb.c", directory: "/home/raj/httrack-3.48.21")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !270, file: !273, baseType: !81, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !270, file: !273, baseType: !150, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !270, file: !273, baseType: !150, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fatal", scope: !259, file: !2, line: 203, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_asserthandler", file: !80, line: 210, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !229, !267, !267, !90}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !259, file: !2, line: 205, baseType: !229, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !2, line: 207, baseType: !239, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !219, file: !2, line: 218, baseType: !285, size: 192, offset: 704)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !2, line: 211, size: 192, elements: !286)
!286 = !{!287, !292, !299}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !285, file: !2, line: 213, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_printkeyhandler", file: !80, line: 214, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!267, !229, !239}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !285, file: !2, line: 215, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_coucal_printvaluehandler", file: !80, line: 218, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!267, !229, !297}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal_value_const", file: !80, line: 129, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !285, file: !2, line: 217, baseType: !229, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !301, line: 13, baseType: !81)
!301 = !DIFile(filename: "./src/md5.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "99edca6f5ad4d28f68cfaf61cbdbe62b")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !155, line: 24, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !157, line: 38, baseType: !149)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!310 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !312, line: 97, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !157, line: 154, baseType: !90)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !317, line: 60, baseType: !318)
!317 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !317, line: 179, size: 192, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !318, file: !317, line: 181, baseType: !150, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !317, line: 187, baseType: !322, size: 128, offset: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !317, line: 184, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !322, file: !317, line: 185, baseType: !150, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !322, file: !317, line: 186, baseType: !315, size: 64, offset: 64)
!326 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !54, !59, !64, !69, !327, !333, !342, !347, !352, !354, !359, !364, !366, !371, !373, !378, !383, !388, !391, !396, !401, !403, !408, !410, !412, !417, !419, !424, !429, !431, !436, !439, !444, !446, !448, !450, !452, !455, !457, !459, !461, !463, !468, !473, !478, !483, !486, !491, !493, !495, !497, !499, !501, !503, !505, !507, !509, !511, !1321, !1344, !1346, !1348, !1350, !1352, !1354, !1359, !1361, !1363, !1365, !1367, !1369, !1374, !1376, !1378, !1380, !1382, !1384, !1389, !1391, !1396, !1398, !1400, !1402, !1404, !1406, !1408, !1410, !1412, !1414, !1416, !1421, !1426, !1428, !1430, !1435, !1437, !1442, !1444, !1446, !1448, !1453, !1455, !1460, !1462, !1464, !1466, !1471, !1476, !1478, !1480, !1482, !1487, !1489, !1491, !1493, !1495, !1497, !1499, !1501, !1503, !1505, !1507, !1509, !1511, !1513, !1515, !1518, !1521, !1524, !1529, !1534, !1539, !1541, !1543, !1545, !1550, !1555, !1557, !1559, !1561, !1563, !1565, !1567, !1569, !1571, !1573, !1575, !1577, !1579, !1581, !1583, !1588, !1590, !1592, !1594, !1596, !1599, !1604, !1609, !1611, !1613, !1615, !1617, !1622, !1624, !1629, !1631, !74, !1633, !1635, !1640, !1645, !1647, !1649, !1651, !1653, !1655, !1658, !1660, !1665, !1667, !1669, !1671, !1673, !1675, !1677, !1680, !1682, !1684}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !329, line: 62, type: !330, isLocal: true, isDefinition: true)
!329 = !DIFile(filename: "./src/htsmd5.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "1f6fc3855c464c84df6c5893483a9cfe")
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 65)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "str1", scope: !335, file: !329, line: 84, type: !339, isLocal: true, isDefinition: true)
!335 = distinct !DISubprogram(name: "md5selftest", scope: !329, file: !329, line: 83, type: !336, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !76, retainedNodes: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !{}
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 360, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 45)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "str1m", scope: !335, file: !329, line: 85, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 264, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 33)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "str2", scope: !335, file: !329, line: 86, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 48, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 6)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "str2m", scope: !335, file: !329, line: 87, type: !344, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !329, line: 99, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 52)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !329, line: 99, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 24)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !329, line: 99, type: !14, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !329, line: 99, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 184, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 23)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !329, line: 102, type: !361, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !77, line: 155, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 26)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !77, line: 177, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 54)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !77, line: 179, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 776, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 97)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !77, line: 181, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !345)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !77, line: 191, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 8)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !77, line: 191, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 5)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !77, line: 194, type: !393, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !77, line: 194, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 9)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !77, line: 197, type: !393, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !77, line: 197, type: !405, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !77, line: 200, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 7)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !77, line: 200, type: !398, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !77, line: 203, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 11)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !77, line: 203, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 18)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !77, line: 206, type: !421, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !77, line: 206, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 20)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !77, line: 209, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !350)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !77, line: 209, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 2)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !77, line: 212, type: !421, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !77, line: 215, type: !414, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !77, line: 218, type: !414, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !77, line: 221, type: !393, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !77, line: 226, type: !454, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !196)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !77, line: 226, type: !393, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !77, line: 227, type: !426, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !77, line: 227, type: !393, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !77, line: 228, type: !433, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !77, line: 228, type: !465, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 4)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !77, line: 232, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 3)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !77, line: 233, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 13)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !77, line: 235, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 12)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !77, line: 235, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !369)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !77, line: 240, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 656, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 82)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !77, line: 242, type: !24, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !77, line: 251, type: !438, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !77, line: 253, type: !465, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !77, line: 254, type: !398, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !77, line: 259, type: !414, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !77, line: 262, type: !71, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !77, line: 265, type: !414, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !77, line: 266, type: !470, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !77, line: 267, type: !39, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !77, line: 273, type: !485, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "prev_mytime", scope: !513, file: !77, line: 512, type: !957, isLocal: true, isDefinition: true)
!513 = distinct !DISubprogram(name: "htsshow_loop", scope: !77, file: !77, line: 511, type: !514, scopeLine: 511, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !76, retainedNodes: !338)
!514 = !DISubroutineType(types: !515)
!515 = !{!90, !315, !516, !939, !90, !90, !90, !90, !90, !1290}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !518, line: 49, baseType: !519)
!518 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !520, line: 294, size: 1133184, elements: !521)
!520 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !585, !586, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !603, !604, !605, !606, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !696, !738, !741, !742, !746, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !1157, !1169}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !519, file: !520, line: 295, baseType: !151, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !519, file: !520, line: 297, baseType: !90, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !519, file: !520, line: 298, baseType: !90, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !519, file: !520, line: 299, baseType: !90, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !519, file: !520, line: 300, baseType: !90, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !519, file: !520, line: 301, baseType: !90, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !519, file: !520, line: 302, baseType: !90, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !519, file: !520, line: 303, baseType: !90, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !519, file: !520, line: 304, baseType: !90, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !519, file: !520, line: 305, baseType: !90, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !519, file: !520, line: 306, baseType: !90, size: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !519, file: !520, line: 307, baseType: !534, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !536, line: 7, baseType: !537)
!536 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !538, line: 49, size: 1728, elements: !539)
!538 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !555, !557, !558, !559, !561, !563, !565, !569, !572, !574, !577, !580, !581, !582, !583, !584}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !537, file: !538, line: 51, baseType: !90, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !537, file: !538, line: 54, baseType: !203, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !537, file: !538, line: 55, baseType: !203, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !537, file: !538, line: 56, baseType: !203, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !537, file: !538, line: 57, baseType: !203, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !537, file: !538, line: 58, baseType: !203, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !537, file: !538, line: 59, baseType: !203, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !537, file: !538, line: 60, baseType: !203, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !537, file: !538, line: 61, baseType: !203, size: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !537, file: !538, line: 64, baseType: !203, size: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !537, file: !538, line: 65, baseType: !203, size: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !537, file: !538, line: 66, baseType: !203, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !537, file: !538, line: 68, baseType: !553, size: 64, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !538, line: 36, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !537, file: !538, line: 70, baseType: !556, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !537, file: !538, line: 72, baseType: !90, size: 32, offset: 896)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !537, file: !538, line: 73, baseType: !90, size: 32, offset: 928)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !537, file: !538, line: 74, baseType: !560, size: 64, offset: 960)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !157, line: 152, baseType: !171)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !537, file: !538, line: 77, baseType: !562, size: 16, offset: 1024)
!562 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !537, file: !538, line: 78, baseType: !564, size: 8, offset: 1040)
!564 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !537, file: !538, line: 79, baseType: !566, size: 8, offset: 1048)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 1)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !537, file: !538, line: 81, baseType: !570, size: 64, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !538, line: 43, baseType: null)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !537, file: !538, line: 89, baseType: !573, size: 64, offset: 1152)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !157, line: 153, baseType: !171)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !537, file: !538, line: 91, baseType: !575, size: 64, offset: 1216)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !538, line: 37, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !537, file: !538, line: 92, baseType: !578, size: 64, offset: 1280)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !538, line: 38, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !537, file: !538, line: 93, baseType: !556, size: 64, offset: 1344)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !537, file: !538, line: 94, baseType: !150, size: 64, offset: 1408)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !537, file: !538, line: 95, baseType: !151, size: 64, offset: 1472)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !537, file: !538, line: 96, baseType: !90, size: 32, offset: 1536)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !537, file: !538, line: 98, baseType: !433, size: 160, offset: 1568)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !519, file: !520, line: 308, baseType: !534, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !519, file: !520, line: 309, baseType: !587, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !588, line: 283, baseType: !171)
!588 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!589 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !519, file: !520, line: 310, baseType: !587, size: 64, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !519, file: !520, line: 311, baseType: !587, size: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !519, file: !520, line: 312, baseType: !90, size: 32, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !519, file: !520, line: 313, baseType: !587, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !519, file: !520, line: 314, baseType: !90, size: 32, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !519, file: !520, line: 315, baseType: !90, size: 32, offset: 864)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !519, file: !520, line: 316, baseType: !90, size: 32, offset: 896)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !519, file: !520, line: 317, baseType: !90, size: 32, offset: 928)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !519, file: !520, line: 318, baseType: !90, size: 32, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !519, file: !520, line: 319, baseType: !90, size: 32, offset: 992)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !519, file: !520, line: 320, baseType: !90, size: 32, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !519, file: !520, line: 321, baseType: !90, size: 32, offset: 1056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !519, file: !520, line: 322, baseType: !602, size: 32, offset: 1088)
!602 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !519, file: !520, line: 323, baseType: !90, size: 32, offset: 1120)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !519, file: !520, line: 324, baseType: !90, size: 32, offset: 1152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !519, file: !520, line: 326, baseType: !90, size: 32, offset: 1184)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !519, file: !520, line: 327, baseType: !607, size: 512, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !520, line: 89, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !520, line: 91, size: 512, elements: !609)
!609 = !{!610, !611, !619, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !608, file: !520, line: 92, baseType: !90, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !608, file: !520, line: 93, baseType: !612, size: 192, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !613, line: 57, baseType: !614)
!613 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !613, line: 61, size: 192, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !614, file: !613, line: 62, baseType: !203, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !614, file: !613, line: 63, baseType: !151, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !614, file: !613, line: 64, baseType: !151, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !608, file: !520, line: 94, baseType: !90, size: 32, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !608, file: !520, line: 95, baseType: !612, size: 192, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !519, file: !520, line: 328, baseType: !90, size: 32, offset: 1728)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !519, file: !520, line: 329, baseType: !90, size: 32, offset: 1760)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !519, file: !520, line: 330, baseType: !612, size: 192, offset: 1792)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !519, file: !520, line: 331, baseType: !90, size: 32, offset: 1984)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !519, file: !520, line: 332, baseType: !90, size: 32, offset: 2016)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !519, file: !520, line: 333, baseType: !90, size: 32, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !519, file: !520, line: 334, baseType: !90, size: 32, offset: 2080)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !519, file: !520, line: 335, baseType: !612, size: 192, offset: 2112)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !519, file: !520, line: 336, baseType: !612, size: 192, offset: 2304)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !519, file: !520, line: 337, baseType: !612, size: 192, offset: 2496)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !519, file: !520, line: 338, baseType: !612, size: 192, offset: 2688)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !519, file: !520, line: 339, baseType: !612, size: 192, offset: 2880)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !519, file: !520, line: 340, baseType: !612, size: 192, offset: 3072)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !519, file: !520, line: 341, baseType: !612, size: 192, offset: 3264)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !519, file: !520, line: 342, baseType: !90, size: 32, offset: 3456)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !519, file: !520, line: 343, baseType: !90, size: 32, offset: 3488)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !519, file: !520, line: 344, baseType: !90, size: 32, offset: 3520)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !519, file: !520, line: 345, baseType: !90, size: 32, offset: 3552)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !519, file: !520, line: 346, baseType: !90, size: 32, offset: 3584)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !519, file: !520, line: 347, baseType: !90, size: 32, offset: 3616)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !519, file: !520, line: 348, baseType: !90, size: 32, offset: 3648)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !519, file: !520, line: 349, baseType: !90, size: 32, offset: 3680)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !519, file: !520, line: 350, baseType: !90, size: 32, offset: 3712)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !519, file: !520, line: 351, baseType: !90, size: 32, offset: 3744)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !519, file: !520, line: 352, baseType: !90, size: 32, offset: 3776)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !519, file: !520, line: 353, baseType: !90, size: 32, offset: 3808)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !519, file: !520, line: 354, baseType: !90, size: 32, offset: 3840)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !519, file: !520, line: 355, baseType: !612, size: 192, offset: 3904)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !519, file: !520, line: 356, baseType: !90, size: 32, offset: 4096)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !519, file: !520, line: 357, baseType: !90, size: 32, offset: 4128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !519, file: !520, line: 358, baseType: !652, size: 64, offset: 4160)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !654, line: 53, baseType: !655)
!654 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !654, line: 55, size: 278656, elements: !656)
!656 = !{!657, !658, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !655, file: !654, line: 56, baseType: !90, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !655, file: !654, line: 57, baseType: !659, size: 262144, offset: 32)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 32768)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !655, file: !654, line: 58, baseType: !663, size: 16448, offset: 262208)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !654, line: 42, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !654, line: 44, size: 16448, elements: !665)
!665 = !{!666, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !664, file: !654, line: 45, baseType: !667, size: 8192)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 1024)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !664, file: !654, line: 46, baseType: !667, size: 8192, offset: 8192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !664, file: !654, line: 47, baseType: !672, size: 64, offset: 16384)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !519, file: !520, line: 359, baseType: !90, size: 32, offset: 4224)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !519, file: !520, line: 360, baseType: !90, size: 32, offset: 4256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !519, file: !520, line: 361, baseType: !90, size: 32, offset: 4288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !519, file: !520, line: 362, baseType: !90, size: 32, offset: 4320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !519, file: !520, line: 363, baseType: !90, size: 32, offset: 4352)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !519, file: !520, line: 364, baseType: !90, size: 32, offset: 4384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !519, file: !520, line: 365, baseType: !90, size: 32, offset: 4416)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !519, file: !520, line: 366, baseType: !90, size: 32, offset: 4448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !519, file: !520, line: 367, baseType: !90, size: 32, offset: 4480)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !519, file: !520, line: 368, baseType: !90, size: 32, offset: 4512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !519, file: !520, line: 369, baseType: !612, size: 192, offset: 4544)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !519, file: !520, line: 370, baseType: !90, size: 32, offset: 4736)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !519, file: !520, line: 372, baseType: !90, size: 32, offset: 4768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !519, file: !520, line: 373, baseType: !612, size: 192, offset: 4800)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !519, file: !520, line: 374, baseType: !612, size: 192, offset: 4992)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !519, file: !520, line: 375, baseType: !689, size: 128, offset: 5184)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !520, line: 101, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !520, line: 103, size: 128, elements: !691)
!691 = !{!692, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !690, file: !520, line: 104, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !690, file: !520, line: 105, baseType: !695, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !519, file: !520, line: 376, baseType: !697, size: 64, offset: 5312)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !699, line: 73, baseType: !700)
!699 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !699, line: 202, size: 98624, elements: !701)
!701 = !{!702, !725, !726, !727, !728, !729, !733, !734}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !700, file: !699, line: 204, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !699, line: 57, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !520, line: 534, size: 640, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !710, file: !520, line: 535, baseType: !203, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !710, file: !520, line: 536, baseType: !203, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !710, file: !520, line: 537, baseType: !203, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !710, file: !520, line: 538, baseType: !203, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !710, file: !520, line: 539, baseType: !203, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !710, file: !520, line: 540, baseType: !203, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !710, file: !520, line: 542, baseType: !90, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !710, file: !520, line: 543, baseType: !90, size: 32, offset: 416)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !710, file: !520, line: 544, baseType: !90, size: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !710, file: !520, line: 545, baseType: !90, size: 32, offset: 480)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !710, file: !520, line: 546, baseType: !4, size: 8, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !710, file: !520, line: 548, baseType: !90, size: 32, offset: 544)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !710, file: !520, line: 549, baseType: !90, size: 32, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !700, file: !699, line: 206, baseType: !184, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !700, file: !699, line: 208, baseType: !184, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !700, file: !699, line: 210, baseType: !184, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !700, file: !699, line: 212, baseType: !90, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !700, file: !699, line: 213, baseType: !730, size: 16384, offset: 288)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 2048)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !700, file: !699, line: 214, baseType: !730, size: 16384, offset: 16672)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !700, file: !699, line: 215, baseType: !735, size: 65536, offset: 33056)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 8192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !519, file: !520, line: 377, baseType: !739, size: 64, offset: 5376)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !519, file: !520, line: 378, baseType: !90, size: 32, offset: 5440)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !519, file: !520, line: 379, baseType: !743, size: 64, offset: 5504)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !520, line: 286, baseType: !745)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !520, line: 286, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !519, file: !520, line: 380, baseType: !747, size: 64, offset: 5568)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !520, line: 61, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !750, line: 42, size: 33856, elements: !751)
!750 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!751 = !{!752, !756, !760}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !749, file: !750, line: 43, baseType: !753, size: 1024)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !749, file: !750, line: 44, baseType: !757, size: 32768, offset: 1024)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 4096)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !749, file: !750, line: 45, baseType: !761, size: 64, offset: 33792)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !519, file: !520, line: 381, baseType: !612, size: 192, offset: 5632)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !519, file: !520, line: 382, baseType: !612, size: 192, offset: 5824)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !519, file: !520, line: 383, baseType: !612, size: 192, offset: 6016)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !519, file: !520, line: 384, baseType: !612, size: 192, offset: 6208)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !519, file: !520, line: 385, baseType: !612, size: 192, offset: 6400)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !519, file: !520, line: 386, baseType: !90, size: 32, offset: 6592)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !519, file: !520, line: 388, baseType: !90, size: 32, offset: 6624)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !519, file: !520, line: 389, baseType: !90, size: 32, offset: 6656)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !519, file: !520, line: 391, baseType: !267, size: 64, offset: 6720)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !519, file: !520, line: 393, baseType: !90, size: 32, offset: 6784)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !519, file: !520, line: 394, baseType: !90, size: 32, offset: 6816)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !519, file: !520, line: 395, baseType: !90, size: 32, offset: 6848)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !519, file: !520, line: 396, baseType: !90, size: 32, offset: 6880)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !519, file: !520, line: 398, baseType: !90, size: 32, offset: 6912)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !519, file: !520, line: 399, baseType: !90, size: 32, offset: 6944)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !519, file: !520, line: 402, baseType: !778, size: 64, offset: 6976)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !317, line: 164, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !317, line: 191, size: 3328, elements: !781)
!781 = !{!782, !791, !797, !806, !812, !818, !828, !834, !843, !852, !858, !864, !871, !880, !889, !898, !904, !913, !922, !931, !1108, !1117, !1127, !1133, !1145, !1151}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !780, file: !317, line: 193, baseType: !783, size: 128)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !317, line: 193, size: 128, elements: !784)
!784 = !{!785, !790}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !783, file: !317, line: 193, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !317, line: 83, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !315}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !783, file: !317, line: 193, baseType: !315, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !780, file: !317, line: 194, baseType: !792, size: 128, offset: 128)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !317, line: 194, size: 128, elements: !793)
!793 = !{!794, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !792, file: !317, line: 194, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !317, line: 84, baseType: !787)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !792, file: !317, line: 194, baseType: !315, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !780, file: !317, line: 195, baseType: !798, size: 128, offset: 256)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !317, line: 195, size: 128, elements: !799)
!799 = !{!800, !805}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !798, file: !317, line: 195, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !317, line: 85, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!90, !315, !516}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !798, file: !317, line: 195, baseType: !315, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !780, file: !317, line: 196, baseType: !807, size: 128, offset: 384)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !317, line: 196, size: 128, elements: !808)
!808 = !{!809, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !807, file: !317, line: 196, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !317, line: 86, baseType: !802)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !807, file: !317, line: 196, baseType: !315, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !780, file: !317, line: 197, baseType: !813, size: 128, offset: 512)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !317, line: 197, size: 128, elements: !814)
!814 = !{!815, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !813, file: !317, line: 197, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !317, line: 87, baseType: !802)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !813, file: !317, line: 197, baseType: !315, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !780, file: !317, line: 198, baseType: !819, size: 128, offset: 640)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !317, line: 198, size: 128, elements: !820)
!820 = !{!821, !827}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !819, file: !317, line: 198, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !317, line: 92, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !317, line: 88, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!90, !315, !516, !314, !695, !267, !267}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !819, file: !317, line: 198, baseType: !315, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !780, file: !317, line: 199, baseType: !829, size: 128, offset: 768)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !317, line: 199, size: 128, elements: !830)
!830 = !{!831, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !829, file: !317, line: 199, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !317, line: 93, baseType: !823)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !829, file: !317, line: 199, baseType: !315, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !780, file: !317, line: 200, baseType: !835, size: 128, offset: 896)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !317, line: 200, size: 128, elements: !836)
!836 = !{!837, !842}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !835, file: !317, line: 200, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !317, line: 94, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!90, !315, !516, !203, !90, !267, !267}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !835, file: !317, line: 200, baseType: !315, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !780, file: !317, line: 201, baseType: !844, size: 128, offset: 1024)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !317, line: 201, size: 128, elements: !845)
!845 = !{!846, !851}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !844, file: !317, line: 201, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !317, line: 98, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!267, !315, !516, !267}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !844, file: !317, line: 201, baseType: !315, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !780, file: !317, line: 202, baseType: !853, size: 128, offset: 1152)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !317, line: 202, size: 128, elements: !854)
!854 = !{!855, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !853, file: !317, line: 202, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !317, line: 101, baseType: !848)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !853, file: !317, line: 202, baseType: !315, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !780, file: !317, line: 203, baseType: !859, size: 128, offset: 1280)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !317, line: 203, size: 128, elements: !860)
!860 = !{!861, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !859, file: !317, line: 203, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !317, line: 104, baseType: !848)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !859, file: !317, line: 203, baseType: !315, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !780, file: !317, line: 204, baseType: !865, size: 128, offset: 1408)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !317, line: 204, size: 128, elements: !866)
!866 = !{!867, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !865, file: !317, line: 204, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !317, line: 107, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !865, file: !317, line: 204, baseType: !315, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !780, file: !317, line: 205, baseType: !872, size: 128, offset: 1536)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !317, line: 205, size: 128, elements: !873)
!873 = !{!874, !879}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !872, file: !317, line: 205, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !317, line: 112, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!90, !315, !516, !267, !267, !90}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !872, file: !317, line: 205, baseType: !315, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !780, file: !317, line: 206, baseType: !881, size: 128, offset: 1664)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !317, line: 206, size: 128, elements: !882)
!882 = !{!883, !888}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !881, file: !317, line: 206, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !317, line: 115, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!90, !315, !516, !267, !267, !267, !90}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !881, file: !317, line: 206, baseType: !315, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !780, file: !317, line: 207, baseType: !890, size: 128, offset: 1792)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !317, line: 207, size: 128, elements: !891)
!891 = !{!892, !897}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !890, file: !317, line: 207, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !317, line: 119, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !315, !516, !267}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !890, file: !317, line: 207, baseType: !315, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !780, file: !317, line: 208, baseType: !899, size: 128, offset: 1920)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !317, line: 208, size: 128, elements: !900)
!900 = !{!901, !903}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !899, file: !317, line: 208, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !317, line: 121, baseType: !894)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !899, file: !317, line: 208, baseType: !315, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !780, file: !317, line: 209, baseType: !905, size: 128, offset: 2048)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !317, line: 209, size: 128, elements: !906)
!906 = !{!907, !912}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !905, file: !317, line: 209, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !317, line: 123, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !315, !516, !267, !267, !267, !90, !90, !90}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !905, file: !317, line: 209, baseType: !315, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !780, file: !317, line: 210, baseType: !914, size: 128, offset: 2176)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !317, line: 210, size: 128, elements: !915)
!915 = !{!916, !921}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !914, file: !317, line: 210, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !317, line: 128, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!90, !315, !516, !203}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !914, file: !317, line: 210, baseType: !315, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !780, file: !317, line: 211, baseType: !923, size: 128, offset: 2304)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !317, line: 211, size: 128, elements: !924)
!924 = !{!925, !930}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !923, file: !317, line: 211, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !317, line: 130, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!90, !315, !516, !203, !267}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !923, file: !317, line: 211, baseType: !315, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !780, file: !317, line: 212, baseType: !932, size: 128, offset: 2432)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !317, line: 212, size: 128, elements: !933)
!933 = !{!934, !1107}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !932, file: !317, line: 212, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !317, line: 133, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!90, !315, !516, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !317, line: 44, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !520, line: 557, size: 135040, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !958, !959, !960, !961, !962, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !941, file: !520, line: 561, baseType: !730, size: 16384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !941, file: !520, line: 562, baseType: !730, size: 16384, offset: 16384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !941, file: !520, line: 563, baseType: !730, size: 16384, offset: 32768)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !941, file: !520, line: 564, baseType: !730, size: 16384, offset: 49152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !941, file: !520, line: 565, baseType: !730, size: 16384, offset: 65536)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !941, file: !520, line: 566, baseType: !730, size: 16384, offset: 81920)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !941, file: !520, line: 567, baseType: !203, size: 64, offset: 98304)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !941, file: !520, line: 568, baseType: !730, size: 16384, offset: 98368)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !941, file: !520, line: 569, baseType: !667, size: 8192, offset: 114752)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !941, file: !520, line: 570, baseType: !90, size: 32, offset: 122944)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !941, file: !520, line: 571, baseType: !90, size: 32, offset: 122976)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !941, file: !520, line: 572, baseType: !90, size: 32, offset: 123008)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !941, file: !520, line: 573, baseType: !90, size: 32, offset: 123040)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !941, file: !520, line: 574, baseType: !957, size: 64, offset: 123072)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !588, line: 284, baseType: !171)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !941, file: !520, line: 575, baseType: !90, size: 32, offset: 123136)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !941, file: !520, line: 576, baseType: !957, size: 64, offset: 123200)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !941, file: !520, line: 577, baseType: !587, size: 64, offset: 123264)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !941, file: !520, line: 578, baseType: !587, size: 64, offset: 123328)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !941, file: !520, line: 579, baseType: !963, size: 8960, offset: 123392)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !317, line: 48, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !520, line: 486, size: 8960, elements: !965)
!965 = !{!966, !967, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !985, !989, !990, !991, !992, !993, !994, !996, !1050, !1051, !1052, !1053, !1058, !1059, !1063, !1064, !1065, !1066, !1067, !1068}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !964, file: !520, line: 487, baseType: !90, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !964, file: !520, line: 488, baseType: !968, size: 16, offset: 32)
!968 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !964, file: !520, line: 489, baseType: !968, size: 16, offset: 48)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !964, file: !520, line: 490, baseType: !968, size: 16, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !964, file: !520, line: 491, baseType: !968, size: 16, offset: 80)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !964, file: !520, line: 492, baseType: !968, size: 16, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !964, file: !520, line: 493, baseType: !968, size: 16, offset: 112)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !964, file: !520, line: 494, baseType: !968, size: 16, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !964, file: !520, line: 495, baseType: !90, size: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !964, file: !520, line: 496, baseType: !90, size: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !964, file: !520, line: 497, baseType: !203, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !964, file: !520, line: 498, baseType: !203, size: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !964, file: !520, line: 499, baseType: !534, size: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !964, file: !520, line: 500, baseType: !587, size: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !964, file: !520, line: 501, baseType: !982, size: 640, offset: 512)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 80)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !964, file: !520, line: 502, baseType: !986, size: 512, offset: 1152)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !964, file: !520, line: 503, baseType: !986, size: 512, offset: 1664)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !964, file: !520, line: 504, baseType: !986, size: 512, offset: 2176)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !964, file: !520, line: 505, baseType: !203, size: 64, offset: 2688)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !964, file: !520, line: 506, baseType: !587, size: 64, offset: 2752)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !964, file: !520, line: 507, baseType: !968, size: 16, offset: 2816)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !964, file: !520, line: 508, baseType: !995, size: 32, offset: 2848)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !588, line: 323, baseType: !90)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !964, file: !520, line: 509, baseType: !997, size: 224, offset: 2880)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !998, line: 91, baseType: !999)
!998 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !998, line: 93, size: 224, elements: !1000)
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !999, file: !998, line: 103, baseType: !1002, size: 224)
!1002 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !999, file: !998, line: 94, size: 224, elements: !1003)
!1003 = !{!1004, !1015, !1031}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !1002, file: !998, line: 96, baseType: !1005, size: 128)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !1006, line: 180, size: 128, elements: !1007)
!1006 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!1007 = !{!1008, !1011}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !1005, file: !1006, line: 182, baseType: !1009, size: 16)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !1010, line: 28, baseType: !562)
!1010 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !1005, file: !1006, line: 183, baseType: !1012, size: 112, offset: 16)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 14)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1002, file: !998, line: 98, baseType: !1016, size: 128)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !1017, line: 245, size: 128, elements: !1018)
!1017 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!1018 = !{!1019, !1020, !1024, !1029}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1016, file: !1017, line: 247, baseType: !1009, size: 16)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1016, file: !1017, line: 248, baseType: !1021, size: 16, offset: 16)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !1017, line: 123, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !155, line: 25, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !157, line: 40, baseType: !562)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1016, file: !1017, line: 249, baseType: !1025, size: 32, offset: 32)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1017, line: 31, size: 32, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1025, file: !1017, line: 33, baseType: !1028, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1017, line: 30, baseType: !181)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1016, file: !1017, line: 252, baseType: !1030, size: 64, offset: 64)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !394)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !1002, file: !998, line: 101, baseType: !1032, size: 224)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !1017, line: 260, size: 224, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1049}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1032, file: !1017, line: 262, baseType: !1009, size: 16)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1032, file: !1017, line: 263, baseType: !1021, size: 16, offset: 16)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1032, file: !1017, line: 264, baseType: !181, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1032, file: !1017, line: 265, baseType: !1038, size: 128, offset: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1017, line: 219, size: 128, elements: !1039)
!1039 = !{!1040}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1038, file: !1017, line: 226, baseType: !1041, size: 128)
!1041 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1038, file: !1017, line: 221, size: 128, elements: !1042)
!1042 = !{!1043, !1045, !1047}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1041, file: !1017, line: 223, baseType: !1044, size: 128)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 128, elements: !196)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1041, file: !1017, line: 224, baseType: !1046, size: 128)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 128, elements: !394)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1041, file: !1017, line: 225, baseType: !1048, size: 128)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !466)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !1032, file: !1017, line: 266, baseType: !181, size: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !964, file: !520, line: 510, baseType: !90, size: 32, offset: 3104)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !964, file: !520, line: 511, baseType: !534, size: 64, offset: 3136)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !964, file: !520, line: 513, baseType: !968, size: 16, offset: 3200)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !964, file: !520, line: 515, baseType: !1054, size: 64, offset: 3264)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !1056, line: 184, baseType: !1057)
!1056 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !1056, line: 184, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !964, file: !520, line: 517, baseType: !986, size: 512, offset: 3328)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !964, file: !520, line: 518, baseType: !1060, size: 2048, offset: 3840)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !964, file: !520, line: 519, baseType: !1060, size: 2048, offset: 5888)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !964, file: !520, line: 520, baseType: !587, size: 64, offset: 7936)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !964, file: !520, line: 521, baseType: !587, size: 64, offset: 8000)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !964, file: !520, line: 522, baseType: !587, size: 64, offset: 8064)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !964, file: !520, line: 523, baseType: !90, size: 32, offset: 8128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !964, file: !520, line: 525, baseType: !1069, size: 768, offset: 8192)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !1070, line: 43, baseType: !1071)
!1070 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !520, line: 465, size: 768, elements: !1072)
