; ModuleID = 'src/htswrap.c'
source_filename = "src/htswrap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.httrackp = type { i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i64, i64, i64, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, %struct.t_proxy, i32, i32, %struct.String, i32, i32, i32, i32, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, %struct.String, %struct.String, %struct.htsfilters, ptr, ptr, i32, ptr, ptr, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, ptr, %struct.htslibhandles, %struct.htsoptstate }
%struct.t_proxy = type { i32, %struct.String, i32, %struct.String }
%struct.htsfilters = type { ptr, ptr }
%struct.String = type { ptr, i64, i64 }
%struct.htslibhandles = type { i32, ptr }
%struct.htsoptstate = type { ptr, i32, i32, i32, i32, %struct.String, ptr, i32, %struct.filenote_strc, %struct.htscallbacks, %struct.concat_strc, %struct.usercommand_strc, %struct.fspc_strc, ptr, i32, i32, ptr, i32, [1280 x i8], i32, i32, i32, i32, i32, ptr, i32, ptr, [2048 x i8], i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "src/htswrap.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4796b8babc74edcf6493f57af85af6f5")
!2 = !{!3, !795}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !5, line: 164, baseType: !6)
!5 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !5, line: 191, size: 3328, elements: !7)
!7 = !{!8, !28, !34, !401, !407, !413, !423, !429, !438, !447, !453, !459, !677, !686, !695, !704, !710, !719, !728, !737, !746, !755, !765, !771, !783, !789}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !6, file: !5, line: 193, baseType: !9, size: 128)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !5, line: 193, size: 128, elements: !10)
!10 = !{!11, !27}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !9, file: !5, line: 193, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !5, line: 83, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DISubroutineType(types: !15)
!15 = !{null, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !5, line: 60, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !5, line: 179, size: 192, elements: !19)
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !18, file: !5, line: 181, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !18, file: !5, line: 187, baseType: !23, size: 128, offset: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !5, line: 184, size: 128, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !23, file: !5, line: 185, baseType: !21, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !23, file: !5, line: 186, baseType: !16, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !9, file: !5, line: 193, baseType: !16, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !6, file: !5, line: 194, baseType: !29, size: 128, offset: 128)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !5, line: 194, size: 128, elements: !30)
!30 = !{!31, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !29, file: !5, line: 194, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !5, line: 84, baseType: !13)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !29, file: !5, line: 194, baseType: !16, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !6, file: !5, line: 195, baseType: !35, size: 128, offset: 256)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !5, line: 195, size: 128, elements: !36)
!36 = !{!37, !400}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !35, file: !5, line: 195, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !5, line: 85, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !16, !43}
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !45, line: 46, baseType: !46)
!45 = !DIFile(filename: "./src/htswrap.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "0204d12388435491ab3241255698ec23")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !47, line: 294, size: 1133184, elements: !48)
!47 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!48 = !{!49, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !122, !123, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !140, !141, !142, !143, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !234, !239, !258, !259, !263, !267, !268, !269, !270, !271, !272, !273, !274, !275, !278, !279, !280, !281, !282, !283, !284, !285, !297}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !46, file: !47, line: 295, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!52 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !46, file: !47, line: 297, baseType: !42, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !46, file: !47, line: 298, baseType: !42, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !46, file: !47, line: 299, baseType: !42, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !46, file: !47, line: 300, baseType: !42, size: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !46, file: !47, line: 301, baseType: !42, size: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !46, file: !47, line: 302, baseType: !42, size: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !46, file: !47, line: 303, baseType: !42, size: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !46, file: !47, line: 304, baseType: !42, size: 32, offset: 288)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !46, file: !47, line: 305, baseType: !42, size: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !46, file: !47, line: 306, baseType: !42, size: 32, offset: 352)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !46, file: !47, line: 307, baseType: !64, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !66, line: 7, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 49, size: 1728, elements: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!69 = !{!70, !71, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !95, !97, !99, !103, !106, !108, !111, !114, !115, !116, !117, !118}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 51, baseType: !42, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 54, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 55, baseType: !72, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 56, baseType: !72, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 57, baseType: !72, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 58, baseType: !72, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 59, baseType: !72, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 60, baseType: !72, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 61, baseType: !72, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 64, baseType: !72, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 65, baseType: !72, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 66, baseType: !72, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 72, baseType: !42, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 73, baseType: !42, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 152, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!94 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 77, baseType: !96, size: 16, offset: 1024)
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 78, baseType: !98, size: 8, offset: 1040)
!98 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 79, baseType: !100, size: 8, offset: 1048)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 1)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 81, baseType: !104, size: 64, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 43, baseType: null)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 89, baseType: !107, size: 64, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !93, line: 153, baseType: !94)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !67, file: !68, line: 91, baseType: !109, size: 64, offset: 1216)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !68, line: 37, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !67, file: !68, line: 92, baseType: !112, size: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !68, line: 38, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !67, file: !68, line: 93, baseType: !88, size: 64, offset: 1344)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !67, file: !68, line: 94, baseType: !21, size: 64, offset: 1408)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 95, baseType: !50, size: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 96, baseType: !42, size: 32, offset: 1536)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 98, baseType: !119, size: 160, offset: 1568)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 160, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 20)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !46, file: !47, line: 308, baseType: !64, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !46, file: !47, line: 309, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !125, line: 283, baseType: !94)
!125 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!126 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !46, file: !47, line: 310, baseType: !124, size: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !46, file: !47, line: 311, baseType: !124, size: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !46, file: !47, line: 312, baseType: !42, size: 32, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !46, file: !47, line: 313, baseType: !124, size: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !46, file: !47, line: 314, baseType: !42, size: 32, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !46, file: !47, line: 315, baseType: !42, size: 32, offset: 864)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !46, file: !47, line: 316, baseType: !42, size: 32, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !46, file: !47, line: 317, baseType: !42, size: 32, offset: 928)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !46, file: !47, line: 318, baseType: !42, size: 32, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !46, file: !47, line: 319, baseType: !42, size: 32, offset: 992)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !46, file: !47, line: 320, baseType: !42, size: 32, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !46, file: !47, line: 321, baseType: !42, size: 32, offset: 1056)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !46, file: !47, line: 322, baseType: !139, size: 32, offset: 1088)
!139 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !46, file: !47, line: 323, baseType: !42, size: 32, offset: 1120)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !46, file: !47, line: 324, baseType: !42, size: 32, offset: 1152)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !46, file: !47, line: 326, baseType: !42, size: 32, offset: 1184)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !46, file: !47, line: 327, baseType: !144, size: 512, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !47, line: 89, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !47, line: 91, size: 512, elements: !146)
!146 = !{!147, !148, !156, !157}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !145, file: !47, line: 92, baseType: !42, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !47, line: 93, baseType: !149, size: 192, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !150, line: 57, baseType: !151)
!150 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !150, line: 61, size: 192, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !151, file: !150, line: 62, baseType: !72, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !151, file: !150, line: 63, baseType: !50, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !151, file: !150, line: 64, baseType: !50, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !145, file: !47, line: 94, baseType: !42, size: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !145, file: !47, line: 95, baseType: !149, size: 192, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !46, file: !47, line: 328, baseType: !42, size: 32, offset: 1728)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !46, file: !47, line: 329, baseType: !42, size: 32, offset: 1760)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !46, file: !47, line: 330, baseType: !149, size: 192, offset: 1792)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !46, file: !47, line: 331, baseType: !42, size: 32, offset: 1984)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !46, file: !47, line: 332, baseType: !42, size: 32, offset: 2016)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !46, file: !47, line: 333, baseType: !42, size: 32, offset: 2048)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !46, file: !47, line: 334, baseType: !42, size: 32, offset: 2080)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !46, file: !47, line: 335, baseType: !149, size: 192, offset: 2112)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !46, file: !47, line: 336, baseType: !149, size: 192, offset: 2304)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !46, file: !47, line: 337, baseType: !149, size: 192, offset: 2496)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !46, file: !47, line: 338, baseType: !149, size: 192, offset: 2688)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !46, file: !47, line: 339, baseType: !149, size: 192, offset: 2880)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !46, file: !47, line: 340, baseType: !149, size: 192, offset: 3072)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !46, file: !47, line: 341, baseType: !149, size: 192, offset: 3264)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !46, file: !47, line: 342, baseType: !42, size: 32, offset: 3456)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !46, file: !47, line: 343, baseType: !42, size: 32, offset: 3488)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !46, file: !47, line: 344, baseType: !42, size: 32, offset: 3520)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !46, file: !47, line: 345, baseType: !42, size: 32, offset: 3552)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !46, file: !47, line: 346, baseType: !42, size: 32, offset: 3584)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !46, file: !47, line: 347, baseType: !42, size: 32, offset: 3616)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !46, file: !47, line: 348, baseType: !42, size: 32, offset: 3648)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !46, file: !47, line: 349, baseType: !42, size: 32, offset: 3680)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !46, file: !47, line: 350, baseType: !42, size: 32, offset: 3712)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !46, file: !47, line: 351, baseType: !42, size: 32, offset: 3744)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !46, file: !47, line: 352, baseType: !42, size: 32, offset: 3776)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !46, file: !47, line: 353, baseType: !42, size: 32, offset: 3808)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !46, file: !47, line: 354, baseType: !42, size: 32, offset: 3840)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !46, file: !47, line: 355, baseType: !149, size: 192, offset: 3904)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !46, file: !47, line: 356, baseType: !42, size: 32, offset: 4096)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !46, file: !47, line: 357, baseType: !42, size: 32, offset: 4128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !46, file: !47, line: 358, baseType: !189, size: 64, offset: 4160)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !191, line: 53, baseType: !192)
!191 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !191, line: 55, size: 278656, elements: !193)
!193 = !{!194, !195, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !192, file: !191, line: 56, baseType: !42, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !191, line: 57, baseType: !196, size: 262144, offset: 32)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 262144, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 32768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !192, file: !191, line: 58, baseType: !200, size: 16448, offset: 262208)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !191, line: 42, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !191, line: 44, size: 16448, elements: !202)
!202 = !{!203, !207, !208}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !201, file: !191, line: 45, baseType: !204, size: 8192)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8192, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1024)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !201, file: !191, line: 46, baseType: !204, size: 8192, offset: 8192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !191, line: 47, baseType: !209, size: 64, offset: 16384)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !46, file: !47, line: 359, baseType: !42, size: 32, offset: 4224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !46, file: !47, line: 360, baseType: !42, size: 32, offset: 4256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !46, file: !47, line: 361, baseType: !42, size: 32, offset: 4288)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !46, file: !47, line: 362, baseType: !42, size: 32, offset: 4320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !46, file: !47, line: 363, baseType: !42, size: 32, offset: 4352)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !46, file: !47, line: 364, baseType: !42, size: 32, offset: 4384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !46, file: !47, line: 365, baseType: !42, size: 32, offset: 4416)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !46, file: !47, line: 366, baseType: !42, size: 32, offset: 4448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !46, file: !47, line: 367, baseType: !42, size: 32, offset: 4480)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !46, file: !47, line: 368, baseType: !42, size: 32, offset: 4512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !46, file: !47, line: 369, baseType: !149, size: 192, offset: 4544)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !46, file: !47, line: 370, baseType: !42, size: 32, offset: 4736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !46, file: !47, line: 372, baseType: !42, size: 32, offset: 4768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !46, file: !47, line: 373, baseType: !149, size: 192, offset: 4800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !46, file: !47, line: 374, baseType: !149, size: 192, offset: 4992)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !46, file: !47, line: 375, baseType: !226, size: 128, offset: 5184)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !47, line: 101, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !47, line: 103, size: 128, elements: !228)
!228 = !{!229, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !227, file: !47, line: 104, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !227, file: !47, line: 105, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !46, file: !47, line: 376, baseType: !235, size: 64, offset: 5312)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !237, line: 43, baseType: !238)
!237 = !DIFile(filename: "./src/htshash.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "aa49d00442b5a2bfe1a89d2b483709db")
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !237, line: 43, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !46, file: !47, line: 377, baseType: !240, size: 64, offset: 5376)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !47, line: 174, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !47, line: 534, size: 640, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !243, file: !47, line: 535, baseType: !72, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !243, file: !47, line: 536, baseType: !72, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !243, file: !47, line: 537, baseType: !72, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !243, file: !47, line: 538, baseType: !72, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !243, file: !47, line: 539, baseType: !72, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !243, file: !47, line: 540, baseType: !72, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !243, file: !47, line: 542, baseType: !42, size: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !243, file: !47, line: 543, baseType: !42, size: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !243, file: !47, line: 544, baseType: !42, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !243, file: !47, line: 545, baseType: !42, size: 32, offset: 480)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !243, file: !47, line: 546, baseType: !73, size: 8, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !243, file: !47, line: 548, baseType: !42, size: 32, offset: 544)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !243, file: !47, line: 549, baseType: !42, size: 32, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !46, file: !47, line: 378, baseType: !42, size: 32, offset: 5440)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !46, file: !47, line: 379, baseType: !260, size: 64, offset: 5504)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !47, line: 286, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !47, line: 286, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !46, file: !47, line: 380, baseType: !264, size: 64, offset: 5568)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !47, line: 61, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !47, line: 61, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !46, file: !47, line: 381, baseType: !149, size: 192, offset: 5632)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !46, file: !47, line: 382, baseType: !149, size: 192, offset: 5824)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !46, file: !47, line: 383, baseType: !149, size: 192, offset: 6016)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !46, file: !47, line: 384, baseType: !149, size: 192, offset: 6208)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !46, file: !47, line: 385, baseType: !149, size: 192, offset: 6400)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !46, file: !47, line: 386, baseType: !42, size: 32, offset: 6592)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !46, file: !47, line: 388, baseType: !42, size: 32, offset: 6624)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !46, file: !47, line: 389, baseType: !42, size: 32, offset: 6656)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !46, file: !47, line: 391, baseType: !276, size: 64, offset: 6720)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !46, file: !47, line: 393, baseType: !42, size: 32, offset: 6784)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !46, file: !47, line: 394, baseType: !42, size: 32, offset: 6816)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !46, file: !47, line: 395, baseType: !42, size: 32, offset: 6848)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !46, file: !47, line: 396, baseType: !42, size: 32, offset: 6880)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !46, file: !47, line: 398, baseType: !42, size: 32, offset: 6912)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !46, file: !47, line: 399, baseType: !42, size: 32, offset: 6944)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !46, file: !47, line: 402, baseType: !3, size: 64, offset: 6976)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !46, file: !47, line: 404, baseType: !286, size: 128, offset: 7040)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !47, line: 260, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !47, line: 270, size: 128, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !287, file: !47, line: 271, baseType: !42, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !287, file: !47, line: 272, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !47, line: 264, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !47, line: 266, size: 128, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !293, file: !47, line: 267, baseType: !72, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !293, file: !47, line: 268, baseType: !21, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !46, file: !47, line: 406, baseType: !298, size: 1126016, offset: 7168)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !47, line: 216, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !47, line: 218, size: 1126016, elements: !300)
!300 = !{!301, !305, !306, !307, !308, !309, !310, !311, !312, !321, !333, !343, !352, !359, !360, !361, !362, !376, !377, !381, !382, !383, !384, !385, !386, !387, !388, !395, !396, !398, !399}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !299, file: !47, line: 219, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !47, line: 204, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !47, line: 204, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !299, file: !47, line: 221, baseType: !42, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !299, file: !47, line: 222, baseType: !42, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !299, file: !47, line: 223, baseType: !42, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !299, file: !47, line: 225, baseType: !42, size: 32, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !299, file: !47, line: 226, baseType: !149, size: 192, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !299, file: !47, line: 227, baseType: !64, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !299, file: !47, line: 228, baseType: !42, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !299, file: !47, line: 230, baseType: !313, size: 32832, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !47, line: 121, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !47, line: 123, size: 32832, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !314, file: !47, line: 124, baseType: !64, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !314, file: !47, line: 125, baseType: !318, size: 32768, offset: 64)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32768, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 4096)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !299, file: !47, line: 232, baseType: !322, size: 192, offset: 33344)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !47, line: 111, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !47, line: 112, size: 192, elements: !324)
!324 = !{!325, !326, !331}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !323, file: !47, line: 113, baseType: !21, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !323, file: !47, line: 114, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !47, line: 110, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!42}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !47, line: 115, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !299, file: !47, line: 233, baseType: !334, size: 1048608, offset: 33536)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !47, line: 131, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !47, line: 133, size: 1048608, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !335, file: !47, line: 134, baseType: !42, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !335, file: !47, line: 135, baseType: !339, size: 1048576, offset: 32)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 1048576, elements: !340)
!340 = !{!341, !342}
!341 = !DISubrange(count: 16)
!342 = !DISubrange(count: 8192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !299, file: !47, line: 234, baseType: !344, size: 16416, offset: 1082144)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !47, line: 153, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !47, line: 155, size: 16416, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !345, file: !47, line: 156, baseType: !42, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !345, file: !47, line: 157, baseType: !349, size: 16384, offset: 32)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16384, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 2048)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !299, file: !47, line: 235, baseType: !353, size: 96, offset: 1098560)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !47, line: 163, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !47, line: 165, size: 96, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !354, file: !47, line: 166, baseType: !42, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !354, file: !47, line: 167, baseType: !42, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !354, file: !47, line: 168, baseType: !42, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !299, file: !47, line: 236, baseType: !72, size: 64, offset: 1098688)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !299, file: !47, line: 237, baseType: !42, size: 32, offset: 1098752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !299, file: !47, line: 238, baseType: !42, size: 32, offset: 1098784)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !299, file: !47, line: 239, baseType: !363, size: 64, offset: 1098816)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !365, line: 51, baseType: !366)
!365 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !365, line: 150, size: 704, elements: !367)
!367 = !{!368, !370, !371, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !365, line: 151, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !366, file: !365, line: 152, baseType: !276, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !366, file: !365, line: 153, baseType: !50, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !366, file: !365, line: 154, baseType: !373, size: 512, offset: 192)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 512, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !299, file: !47, line: 240, baseType: !42, size: 32, offset: 1098880)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !299, file: !47, line: 242, baseType: !378, size: 10240, offset: 1098912)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 10240, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 1280)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !299, file: !47, line: 243, baseType: !42, size: 32, offset: 1109152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !299, file: !47, line: 244, baseType: !42, size: 32, offset: 1109184)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !299, file: !47, line: 245, baseType: !42, size: 32, offset: 1109216)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !299, file: !47, line: 246, baseType: !42, size: 32, offset: 1109248)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !299, file: !47, line: 247, baseType: !42, size: 32, offset: 1109280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !299, file: !47, line: 248, baseType: !231, size: 64, offset: 1109312)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !299, file: !47, line: 249, baseType: !42, size: 32, offset: 1109376)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !299, file: !47, line: 250, baseType: !389, size: 64, offset: 1109440)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !47, line: 194, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !47, line: 196, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !391, file: !47, line: 197, baseType: !72, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !47, line: 198, baseType: !389, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !299, file: !47, line: 251, baseType: !349, size: 16384, offset: 1109504)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !299, file: !47, line: 252, baseType: !397, size: 32, offset: 1125888)
!397 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !299, file: !47, line: 253, baseType: !397, size: 32, offset: 1125920)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !299, file: !47, line: 254, baseType: !42, size: 32, offset: 1125952)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !35, file: !5, line: 195, baseType: !16, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !6, file: !5, line: 196, baseType: !402, size: 128, offset: 384)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !5, line: 196, size: 128, elements: !403)
!403 = !{!404, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !402, file: !5, line: 196, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !5, line: 86, baseType: !39)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !402, file: !5, line: 196, baseType: !16, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !6, file: !5, line: 197, baseType: !408, size: 128, offset: 512)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !5, line: 197, size: 128, elements: !409)
!409 = !{!410, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !408, file: !5, line: 197, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !5, line: 87, baseType: !39)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !408, file: !5, line: 197, baseType: !16, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !6, file: !5, line: 198, baseType: !414, size: 128, offset: 640)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !5, line: 198, size: 128, elements: !415)
!415 = !{!416, !422}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !414, file: !5, line: 198, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !5, line: 92, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !5, line: 88, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!42, !16, !43, !231, !233, !276, !276}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !414, file: !5, line: 198, baseType: !16, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !6, file: !5, line: 199, baseType: !424, size: 128, offset: 768)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !5, line: 199, size: 128, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !424, file: !5, line: 199, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !5, line: 93, baseType: !418)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !424, file: !5, line: 199, baseType: !16, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !6, file: !5, line: 200, baseType: !430, size: 128, offset: 896)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !5, line: 200, size: 128, elements: !431)
!431 = !{!432, !437}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !430, file: !5, line: 200, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !5, line: 94, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!42, !16, !43, !72, !42, !276, !276}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !430, file: !5, line: 200, baseType: !16, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !6, file: !5, line: 201, baseType: !439, size: 128, offset: 1024)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !5, line: 201, size: 128, elements: !440)
!440 = !{!441, !446}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !439, file: !5, line: 201, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !5, line: 98, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!276, !16, !43, !276}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !439, file: !5, line: 201, baseType: !16, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !6, file: !5, line: 202, baseType: !448, size: 128, offset: 1152)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !5, line: 202, size: 128, elements: !449)
!449 = !{!450, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !448, file: !5, line: 202, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !5, line: 101, baseType: !443)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !448, file: !5, line: 202, baseType: !16, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !6, file: !5, line: 203, baseType: !454, size: 128, offset: 1280)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !5, line: 203, size: 128, elements: !455)
!455 = !{!456, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !454, file: !5, line: 203, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !5, line: 104, baseType: !443)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !454, file: !5, line: 203, baseType: !16, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !6, file: !5, line: 204, baseType: !460, size: 128, offset: 1408)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !5, line: 204, size: 128, elements: !461)
!461 = !{!462, !676}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !460, file: !5, line: 204, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !5, line: 107, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!42, !16, !43, !467, !42, !42, !42, !42, !42, !642}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !5, line: 44, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !47, line: 557, size: 135040, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !486, !487, !488, !489, !490, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !469, file: !47, line: 561, baseType: !349, size: 16384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !469, file: !47, line: 562, baseType: !349, size: 16384, offset: 16384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !469, file: !47, line: 563, baseType: !349, size: 16384, offset: 32768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !469, file: !47, line: 564, baseType: !349, size: 16384, offset: 49152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !469, file: !47, line: 565, baseType: !349, size: 16384, offset: 65536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !469, file: !47, line: 566, baseType: !349, size: 16384, offset: 81920)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !469, file: !47, line: 567, baseType: !72, size: 64, offset: 98304)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !469, file: !47, line: 568, baseType: !349, size: 16384, offset: 98368)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !469, file: !47, line: 569, baseType: !204, size: 8192, offset: 114752)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !469, file: !47, line: 570, baseType: !42, size: 32, offset: 122944)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !469, file: !47, line: 571, baseType: !42, size: 32, offset: 122976)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !469, file: !47, line: 572, baseType: !42, size: 32, offset: 123008)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !469, file: !47, line: 573, baseType: !42, size: 32, offset: 123040)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !469, file: !47, line: 574, baseType: !485, size: 64, offset: 123072)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !125, line: 284, baseType: !94)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !469, file: !47, line: 575, baseType: !42, size: 32, offset: 123136)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !469, file: !47, line: 576, baseType: !485, size: 64, offset: 123200)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !469, file: !47, line: 577, baseType: !124, size: 64, offset: 123264)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !469, file: !47, line: 578, baseType: !124, size: 64, offset: 123328)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !469, file: !47, line: 579, baseType: !491, size: 8960, offset: 123392)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !365, line: 47, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !47, line: 486, size: 8960, elements: !493)
!493 = !{!494, !495, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !521, !586, !587, !588, !589, !594, !595, !599, !600, !601, !602, !603, !604}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !492, file: !47, line: 487, baseType: !42, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !492, file: !47, line: 488, baseType: !496, size: 16, offset: 32)
!496 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !492, file: !47, line: 489, baseType: !496, size: 16, offset: 48)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !492, file: !47, line: 490, baseType: !496, size: 16, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !492, file: !47, line: 491, baseType: !496, size: 16, offset: 80)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !492, file: !47, line: 492, baseType: !496, size: 16, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !492, file: !47, line: 493, baseType: !496, size: 16, offset: 112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !492, file: !47, line: 494, baseType: !496, size: 16, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !492, file: !47, line: 495, baseType: !42, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !492, file: !47, line: 496, baseType: !42, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !492, file: !47, line: 497, baseType: !72, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !492, file: !47, line: 498, baseType: !72, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !492, file: !47, line: 499, baseType: !64, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !47, line: 500, baseType: !124, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !492, file: !47, line: 501, baseType: !510, size: 640, offset: 512)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 640, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 80)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !492, file: !47, line: 502, baseType: !373, size: 512, offset: 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !492, file: !47, line: 503, baseType: !373, size: 512, offset: 1664)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !492, file: !47, line: 504, baseType: !373, size: 512, offset: 2176)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !492, file: !47, line: 505, baseType: !72, size: 64, offset: 2688)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !492, file: !47, line: 506, baseType: !124, size: 64, offset: 2752)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !492, file: !47, line: 507, baseType: !496, size: 16, offset: 2816)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !492, file: !47, line: 508, baseType: !520, size: 32, offset: 2848)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !125, line: 323, baseType: !42)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !492, file: !47, line: 509, baseType: !522, size: 224, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !523, line: 91, baseType: !524)
!523 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !523, line: 93, size: 224, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !524, file: !523, line: 103, baseType: !527, size: 224)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !524, file: !523, line: 94, size: 224, elements: !528)
!528 = !{!529, !540, !562}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !527, file: !523, line: 96, baseType: !530, size: 128)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !531, line: 180, size: 128, elements: !532)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!532 = !{!533, !536}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !530, file: !531, line: 182, baseType: !534, size: 16)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !535, line: 28, baseType: !96)
!535 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !530, file: !531, line: 183, baseType: !537, size: 112, offset: 16)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 112, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 14)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !527, file: !523, line: 98, baseType: !541, size: 128)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !542, line: 245, size: 128, elements: !543)
!542 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!543 = !{!544, !545, !550, !557}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !541, file: !542, line: 247, baseType: !534, size: 16)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !541, file: !542, line: 248, baseType: !546, size: 16, offset: 16)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !542, line: 123, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !548, line: 25, baseType: !549)
!548 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !93, line: 40, baseType: !96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !541, file: !542, line: 249, baseType: !551, size: 32, offset: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !542, line: 31, size: 32, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !551, file: !542, line: 33, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !542, line: 30, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !548, line: 26, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !93, line: 42, baseType: !397)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !541, file: !542, line: 252, baseType: !558, size: 64, offset: 64)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 64, elements: !560)
!559 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!560 = !{!561}
!561 = !DISubrange(count: 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !527, file: !523, line: 101, baseType: !563, size: 224)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !542, line: 260, size: 224, elements: !564)
!564 = !{!565, !566, !567, !568, !585}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !563, file: !542, line: 262, baseType: !534, size: 16)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !563, file: !542, line: 263, baseType: !546, size: 16, offset: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !563, file: !542, line: 264, baseType: !555, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !563, file: !542, line: 265, baseType: !569, size: 128, offset: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !542, line: 219, size: 128, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !569, file: !542, line: 226, baseType: !572, size: 128)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !569, file: !542, line: 221, size: 128, elements: !573)
!573 = !{!574, !579, !581}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !572, file: !542, line: 223, baseType: !575, size: 128)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 128, elements: !578)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !548, line: 24, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !93, line: 38, baseType: !559)
!578 = !{!341}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !572, file: !542, line: 224, baseType: !580, size: 128)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 128, elements: !560)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !572, file: !542, line: 225, baseType: !582, size: 128)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 128, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 4)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !563, file: !542, line: 266, baseType: !555, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !492, file: !47, line: 510, baseType: !42, size: 32, offset: 3104)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !492, file: !47, line: 511, baseType: !64, size: 64, offset: 3136)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !492, file: !47, line: 513, baseType: !496, size: 16, offset: 3200)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !492, file: !47, line: 515, baseType: !590, size: 64, offset: 3264)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !592, line: 184, baseType: !593)
!592 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !592, line: 184, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !492, file: !47, line: 517, baseType: !373, size: 512, offset: 3328)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !492, file: !47, line: 518, baseType: !596, size: 2048, offset: 3840)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 2048, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !492, file: !47, line: 519, baseType: !596, size: 2048, offset: 5888)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !492, file: !47, line: 520, baseType: !124, size: 64, offset: 7936)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !492, file: !47, line: 521, baseType: !124, size: 64, offset: 8000)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !492, file: !47, line: 522, baseType: !124, size: 64, offset: 8064)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !492, file: !47, line: 523, baseType: !42, size: 32, offset: 8128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !492, file: !47, line: 525, baseType: !605, size: 768, offset: 8192)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !365, line: 43, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !47, line: 465, size: 768, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !606, file: !47, line: 466, baseType: !496, size: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !606, file: !47, line: 467, baseType: !496, size: 16, offset: 16)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !606, file: !47, line: 468, baseType: !496, size: 16, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !606, file: !47, line: 469, baseType: !496, size: 16, offset: 48)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !606, file: !47, line: 470, baseType: !496, size: 16, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !606, file: !47, line: 471, baseType: !496, size: 16, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !606, file: !47, line: 472, baseType: !276, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !606, file: !47, line: 473, baseType: !276, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !606, file: !47, line: 474, baseType: !276, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !606, file: !47, line: 475, baseType: !276, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !606, file: !47, line: 476, baseType: !276, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !606, file: !47, line: 477, baseType: !276, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !606, file: !47, line: 478, baseType: !621, size: 256, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !47, line: 452, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !47, line: 454, size: 256, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !622, file: !47, line: 455, baseType: !42, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !622, file: !47, line: 456, baseType: !276, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !622, file: !47, line: 457, baseType: !42, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !622, file: !47, line: 458, baseType: !276, size: 64, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !469, file: !47, line: 580, baseType: !42, size: 32, offset: 132352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !469, file: !47, line: 581, baseType: !42, size: 32, offset: 132384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !469, file: !47, line: 582, baseType: !124, size: 64, offset: 132416)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !469, file: !47, line: 583, baseType: !485, size: 64, offset: 132480)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !469, file: !47, line: 585, baseType: !42, size: 32, offset: 132544)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !469, file: !47, line: 586, baseType: !42, size: 32, offset: 132576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !469, file: !47, line: 587, baseType: !72, size: 64, offset: 132608)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !469, file: !47, line: 588, baseType: !124, size: 64, offset: 132672)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !469, file: !47, line: 589, baseType: !124, size: 64, offset: 132736)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !469, file: !47, line: 590, baseType: !124, size: 64, offset: 132800)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !469, file: !47, line: 594, baseType: !596, size: 2048, offset: 132864)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !469, file: !47, line: 595, baseType: !42, size: 32, offset: 134912)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !469, file: !47, line: 596, baseType: !42, size: 32, offset: 134944)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !469, file: !47, line: 597, baseType: !42, size: 32, offset: 134976)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !644, line: 70, baseType: !645)
!644 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !47, line: 414, size: 1344, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !657, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !645, file: !47, line: 415, baseType: !124, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !645, file: !47, line: 416, baseType: !124, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !645, file: !47, line: 418, baseType: !485, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !645, file: !47, line: 420, baseType: !124, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !645, file: !47, line: 421, baseType: !124, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !645, file: !47, line: 422, baseType: !42, size: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !645, file: !47, line: 424, baseType: !654, size: 128, offset: 384)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 128, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 2)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !645, file: !47, line: 425, baseType: !658, size: 128, offset: 512)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !655)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !645, file: !47, line: 426, baseType: !485, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !645, file: !47, line: 427, baseType: !42, size: 32, offset: 704)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !645, file: !47, line: 429, baseType: !42, size: 32, offset: 736)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !645, file: !47, line: 430, baseType: !42, size: 32, offset: 768)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !645, file: !47, line: 431, baseType: !42, size: 32, offset: 800)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !645, file: !47, line: 433, baseType: !42, size: 32, offset: 832)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !645, file: !47, line: 434, baseType: !42, size: 32, offset: 864)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !645, file: !47, line: 435, baseType: !42, size: 32, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !645, file: !47, line: 436, baseType: !42, size: 32, offset: 928)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !645, file: !47, line: 437, baseType: !42, size: 32, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !645, file: !47, line: 438, baseType: !42, size: 32, offset: 992)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !645, file: !47, line: 439, baseType: !42, size: 32, offset: 1024)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !645, file: !47, line: 440, baseType: !42, size: 32, offset: 1056)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !645, file: !47, line: 441, baseType: !124, size: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !645, file: !47, line: 443, baseType: !124, size: 64, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !645, file: !47, line: 445, baseType: !485, size: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !645, file: !47, line: 446, baseType: !485, size: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !460, file: !5, line: 204, baseType: !16, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !6, file: !5, line: 205, baseType: !678, size: 128, offset: 1536)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !5, line: 205, size: 128, elements: !679)
!679 = !{!680, !685}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !678, file: !5, line: 205, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !5, line: 112, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!42, !16, !43, !276, !276, !42}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !678, file: !5, line: 205, baseType: !16, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !6, file: !5, line: 206, baseType: !687, size: 128, offset: 1664)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !5, line: 206, size: 128, elements: !688)
!688 = !{!689, !694}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !687, file: !5, line: 206, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !5, line: 115, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!42, !16, !43, !276, !276, !276, !42}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !687, file: !5, line: 206, baseType: !16, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !6, file: !5, line: 207, baseType: !696, size: 128, offset: 1792)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !5, line: 207, size: 128, elements: !697)
!697 = !{!698, !703}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !696, file: !5, line: 207, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !5, line: 119, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !16, !43, !276}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !696, file: !5, line: 207, baseType: !16, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !6, file: !5, line: 208, baseType: !705, size: 128, offset: 1920)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !5, line: 208, size: 128, elements: !706)
!706 = !{!707, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !705, file: !5, line: 208, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !5, line: 121, baseType: !700)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !705, file: !5, line: 208, baseType: !16, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !6, file: !5, line: 209, baseType: !711, size: 128, offset: 2048)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !5, line: 209, size: 128, elements: !712)
!712 = !{!713, !718}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !711, file: !5, line: 209, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !5, line: 123, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !16, !43, !276, !276, !276, !42, !42, !42}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !711, file: !5, line: 209, baseType: !16, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !6, file: !5, line: 210, baseType: !720, size: 128, offset: 2176)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !5, line: 210, size: 128, elements: !721)
!721 = !{!722, !727}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !720, file: !5, line: 210, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !5, line: 128, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!42, !16, !43, !72}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !720, file: !5, line: 210, baseType: !16, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !6, file: !5, line: 211, baseType: !729, size: 128, offset: 2304)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !5, line: 211, size: 128, elements: !730)
!730 = !{!731, !736}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !729, file: !5, line: 211, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !5, line: 130, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!42, !16, !43, !72, !276}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !729, file: !5, line: 211, baseType: !16, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !6, file: !5, line: 212, baseType: !738, size: 128, offset: 2432)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !5, line: 212, size: 128, elements: !739)
!739 = !{!740, !745}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !738, file: !5, line: 212, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !5, line: 133, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!42, !16, !43, !467}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !738, file: !5, line: 212, baseType: !16, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !6, file: !5, line: 213, baseType: !747, size: 128, offset: 2560)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !5, line: 213, size: 128, elements: !748)
!748 = !{!749, !754}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !747, file: !5, line: 213, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !5, line: 135, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!42, !16, !43, !276, !276, !276, !276, !72}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !747, file: !5, line: 213, baseType: !16, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !6, file: !5, line: 214, baseType: !756, size: 128, offset: 2688)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !5, line: 214, size: 128, elements: !757)
!757 = !{!758, !764}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !756, file: !5, line: 214, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !5, line: 142, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!42, !16, !43, !72, !276, !276, !276, !276, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !756, file: !5, line: 214, baseType: !16, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !6, file: !5, line: 215, baseType: !766, size: 128, offset: 2816)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !5, line: 215, size: 128, elements: !767)
!767 = !{!768, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !766, file: !5, line: 215, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !5, line: 148, baseType: !760)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !766, file: !5, line: 215, baseType: !16, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !6, file: !5, line: 216, baseType: !772, size: 128, offset: 2944)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !5, line: 216, size: 128, elements: !773)
!773 = !{!774, !782}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !772, file: !5, line: 216, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !5, line: 156, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!42, !16, !43, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !5, line: 56, baseType: !781)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !5, line: 56, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !772, file: !5, line: 216, baseType: !16, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !6, file: !5, line: 217, baseType: !784, size: 128, offset: 3072)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !5, line: 217, size: 128, elements: !785)
!785 = !{!786, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !784, file: !5, line: 217, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !5, line: 158, baseType: !776)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !784, file: !5, line: 217, baseType: !16, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !6, file: !5, line: 219, baseType: !790, size: 128, offset: 3200)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !5, line: 219, size: 128, elements: !791)
!791 = !{!792, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !790, file: !5, line: 219, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !5, line: 141, baseType: !750)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !790, file: !5, line: 219, baseType: !16, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !796, line: 90, baseType: !52)
!796 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!797 = !{i32 7, !"Dwarf Version", i32 5}
!798 = !{i32 2, !"Debug Info Version", i32 3}
!799 = !{i32 1, !"wchar_size", i32 4}
!800 = !{i32 8, !"PIC Level", i32 2}
!801 = !{i32 7, !"PIE Level", i32 2}
!802 = !{i32 7, !"uwtable", i32 2}
!803 = !{i32 7, !"frame-pointer", i32 2}
!804 = !{!"clang version 16.0.0"}
!805 = distinct !DISubprogram(name: "htswrap_init", scope: !1, file: !1, line: 42, type: !329, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !806)
!806 = !{}
!807 = !DILocation(line: 43, column: 3, scope: !805)
!808 = distinct !DISubprogram(name: "htswrap_free", scope: !1, file: !1, line: 46, type: !329, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !806)
!809 = !DILocation(line: 47, column: 3, scope: !808)
!810 = distinct !DISubprogram(name: "htswrap_add", scope: !1, file: !1, line: 50, type: !811, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !806)
!811 = !DISubroutineType(types: !812)
!812 = !{!42, !43, !276, !21}
!813 = !DILocalVariable(name: "opt", arg: 1, scope: !810, file: !1, line: 50, type: !43)
!814 = !DILocation(line: 50, column: 39, scope: !810)
!815 = !DILocalVariable(name: "name", arg: 2, scope: !810, file: !1, line: 50, type: !276)
!816 = !DILocation(line: 50, column: 56, scope: !810)
!817 = !DILocalVariable(name: "fct", arg: 3, scope: !810, file: !1, line: 50, type: !21)
!818 = !DILocation(line: 50, column: 68, scope: !810)
!819 = !DILocation(line: 51, column: 57, scope: !810)
!820 = !DILocation(line: 51, column: 62, scope: !810)
!821 = !DILocation(line: 52, column: 27, scope: !810)
!822 = !DILocation(line: 52, column: 33, scope: !810)
!823 = !DILocation(line: 51, column: 10, scope: !810)
!824 = !DILocation(line: 51, column: 3, scope: !810)
!825 = distinct !DISubprogram(name: "htswrap_read", scope: !1, file: !1, line: 55, type: !826, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !806)
!826 = !DISubroutineType(types: !827)
!827 = !{!795, !43, !276}
!828 = !DILocalVariable(name: "opt", arg: 1, scope: !825, file: !1, line: 55, type: !43)
!829 = !DILocation(line: 55, column: 46, scope: !825)
!830 = !DILocalVariable(name: "name", arg: 2, scope: !825, file: !1, line: 55, type: !276)
!831 = !DILocation(line: 55, column: 63, scope: !825)
!832 = !DILocation(line: 56, column: 69, scope: !825)
!833 = !DILocation(line: 57, column: 39, scope: !825)
!834 = !DILocation(line: 57, column: 54, scope: !825)
!835 = !DILocation(line: 56, column: 22, scope: !825)
!836 = !DILocation(line: 56, column: 10, scope: !825)
!837 = !DILocation(line: 56, column: 3, scope: !825)
