; ModuleID = 'src/htswizard.c'
source_filename = "src/htswizard.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.htspair_t = type { ptr, ptr }
%struct.t_hts_htmlcheck_callbacks = type { %struct.init, %struct.uninit, %struct.start, %struct.end, %struct.chopt, %struct.preprocess, %struct.postprocess, %struct.check_html, %struct.query, %struct.query2, %struct.query3, %struct.loop, %struct.check_link, %struct.check_mime, %struct.pause, %struct.filesave, %struct.filesave2, %struct.linkdetected, %struct.linkdetected2, %struct.xfrstatus, %struct.savename, %struct.sendhead, %struct.receivehead, %struct.detect, %struct.parse, %struct.extsavename }
%struct.init = type { ptr, ptr }
%struct.uninit = type { ptr, ptr }
%struct.start = type { ptr, ptr }
%struct.end = type { ptr, ptr }
%struct.chopt = type { ptr, ptr }
%struct.preprocess = type { ptr, ptr }
%struct.postprocess = type { ptr, ptr }
%struct.check_html = type { ptr, ptr }
%struct.query = type { ptr, ptr }
%struct.query2 = type { ptr, ptr }
%struct.query3 = type { ptr, ptr }
%struct.loop = type { ptr, ptr }
%struct.check_link = type { ptr, ptr }
%struct.check_mime = type { ptr, ptr }
%struct.pause = type { ptr, ptr }
%struct.filesave = type { ptr, ptr }
%struct.filesave2 = type { ptr, ptr }
%struct.linkdetected = type { ptr, ptr }
%struct.linkdetected2 = type { ptr, ptr }
%struct.xfrstatus = type { ptr, ptr }

!2 = !DIFile(filename: "src/htswizard.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c819eb56a7c8d6bec6c9c41ea2a7881b")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 4)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !11, isLocal: true, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !12)
!12 = !{!13}
!13 = !DISubrange(count: 5)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !11, isLocal: true, isDefinition: true)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !18, isLocal: true, isDefinition: true)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 7)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !11, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 6)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !18, isLocal: true, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "hts_detect_embed", scope: !32, file: !2, line: 64, type: !1132, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !33, retainedTypes: !61, globals: !908, splitDebugInlining: false, nameTableKind: None)
!33 = !{!34, !46}
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hts_log_type", file: !35, line: 57, baseType: !36, size: 32, elements: !37)
!35 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45}
!38 = !DIEnumerator(name: "LOG_PANIC", value: 0)
!39 = !DIEnumerator(name: "LOG_ERROR", value: 1)
!40 = !DIEnumerator(name: "LOG_WARNING", value: 2)
!41 = !DIEnumerator(name: "LOG_NOTICE", value: 3)
!42 = !DIEnumerator(name: "LOG_INFO", value: 4)
!43 = !DIEnumerator(name: "LOG_DEBUG", value: 5)
!44 = !DIEnumerator(name: "LOG_TRACE", value: 6)
!45 = !DIEnumerator(name: "LOG_ERRNO", value: 256)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 46, baseType: !36, size: 32, elements: !48)
!47 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!49 = !DIEnumerator(name: "_ISupper", value: 256)
!50 = !DIEnumerator(name: "_ISlower", value: 512)
!51 = !DIEnumerator(name: "_ISalpha", value: 1024)
!52 = !DIEnumerator(name: "_ISdigit", value: 2048)
!53 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!54 = !DIEnumerator(name: "_ISspace", value: 8192)
!55 = !DIEnumerator(name: "_ISprint", value: 16384)
!56 = !DIEnumerator(name: "_ISgraph", value: 32768)
!57 = !DIEnumerator(name: "_ISblank", value: 1)
!58 = !DIEnumerator(name: "_IScntrl", value: 2)
!59 = !DIEnumerator(name: "_ISpunct", value: 4)
!60 = !DIEnumerator(name: "_ISalnum", value: 8)
!61 = !{!62, !80, !108, !181, !345, !101, !675, !153}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !64, line: 164, baseType: !65)
!64 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !64, line: 191, size: 3328, elements: !66)
!66 = !{!67, !87, !93, !518, !524, !530, !540, !546, !555, !564, !570, !576, !790, !799, !808, !817, !823, !832, !841, !850, !859, !868, !878, !884, !896, !902}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !65, file: !64, line: 193, baseType: !68, size: 128)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !64, line: 193, size: 128, elements: !69)
!69 = !{!70, !86}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !68, file: !64, line: 193, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !64, line: 83, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !64, line: 60, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !64, line: 179, size: 192, elements: !78)
!78 = !{!79, !81}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !77, file: !64, line: 181, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !64, line: 187, baseType: !82, size: 128, offset: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !64, line: 184, size: 128, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !82, file: !64, line: 185, baseType: !80, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !82, file: !64, line: 186, baseType: !75, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !68, file: !64, line: 193, baseType: !75, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !65, file: !64, line: 194, baseType: !88, size: 128, offset: 128)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !64, line: 194, size: 128, elements: !89)
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !88, file: !64, line: 194, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !64, line: 84, baseType: !72)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !88, file: !64, line: 194, baseType: !75, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !65, file: !64, line: 195, baseType: !94, size: 128, offset: 256)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !64, line: 195, size: 128, elements: !95)
!95 = !{!96, !517}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !94, file: !64, line: 195, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !64, line: 85, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !75, !102}
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !35, line: 49, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !105, line: 294, size: 1133184, elements: !106)
!105 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!106 = !{!107, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !179, !180, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !197, !198, !199, !200, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !291, !336, !339, !340, !344, !360, !361, !362, !363, !364, !365, !366, !367, !368, !371, !372, !373, !374, !375, !376, !377, !378, !390}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !104, file: !105, line: 295, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!110 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !104, file: !105, line: 297, baseType: !101, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !104, file: !105, line: 298, baseType: !101, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !104, file: !105, line: 299, baseType: !101, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !104, file: !105, line: 300, baseType: !101, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !104, file: !105, line: 301, baseType: !101, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !104, file: !105, line: 302, baseType: !101, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !104, file: !105, line: 303, baseType: !101, size: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !104, file: !105, line: 304, baseType: !101, size: 32, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !104, file: !105, line: 305, baseType: !101, size: 32, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !104, file: !105, line: 306, baseType: !101, size: 32, offset: 352)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !104, file: !105, line: 307, baseType: !122, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !124, line: 7, baseType: !125)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !126, line: 49, size: 1728, elements: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!127 = !{!128, !129, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !144, !146, !147, !148, !152, !154, !156, !160, !163, !165, !168, !171, !172, !173, !174, !175}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !125, file: !126, line: 51, baseType: !101, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !125, file: !126, line: 54, baseType: !130, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !125, file: !126, line: 55, baseType: !130, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !125, file: !126, line: 56, baseType: !130, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !125, file: !126, line: 57, baseType: !130, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !125, file: !126, line: 58, baseType: !130, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !125, file: !126, line: 59, baseType: !130, size: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !125, file: !126, line: 60, baseType: !130, size: 64, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !125, file: !126, line: 61, baseType: !130, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !125, file: !126, line: 64, baseType: !130, size: 64, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !125, file: !126, line: 65, baseType: !130, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !125, file: !126, line: 66, baseType: !130, size: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !125, file: !126, line: 68, baseType: !142, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !126, line: 36, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !125, file: !126, line: 70, baseType: !145, size: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !125, file: !126, line: 72, baseType: !101, size: 32, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !125, file: !126, line: 73, baseType: !101, size: 32, offset: 928)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !125, file: !126, line: 74, baseType: !149, size: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !150, line: 152, baseType: !151)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!151 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !125, file: !126, line: 77, baseType: !153, size: 16, offset: 1024)
!153 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !125, file: !126, line: 78, baseType: !155, size: 8, offset: 1040)
!155 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !125, file: !126, line: 79, baseType: !157, size: 8, offset: 1048)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 1)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !125, file: !126, line: 81, baseType: !161, size: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !126, line: 43, baseType: null)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !125, file: !126, line: 89, baseType: !164, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !150, line: 153, baseType: !151)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !125, file: !126, line: 91, baseType: !166, size: 64, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !126, line: 37, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !125, file: !126, line: 92, baseType: !169, size: 64, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !126, line: 38, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !125, file: !126, line: 93, baseType: !145, size: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !125, file: !126, line: 94, baseType: !80, size: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !125, file: !126, line: 95, baseType: !108, size: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !125, file: !126, line: 96, baseType: !101, size: 32, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !125, file: !126, line: 98, baseType: !176, size: 160, offset: 1568)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 20)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !104, file: !105, line: 308, baseType: !122, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !104, file: !105, line: 309, baseType: !181, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !182, line: 283, baseType: !151)
!182 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !104, file: !105, line: 310, baseType: !181, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !104, file: !105, line: 311, baseType: !181, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !104, file: !105, line: 312, baseType: !101, size: 32, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !104, file: !105, line: 313, baseType: !181, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !104, file: !105, line: 314, baseType: !101, size: 32, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !104, file: !105, line: 315, baseType: !101, size: 32, offset: 864)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !104, file: !105, line: 316, baseType: !101, size: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !104, file: !105, line: 317, baseType: !101, size: 32, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !104, file: !105, line: 318, baseType: !101, size: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !104, file: !105, line: 319, baseType: !101, size: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !104, file: !105, line: 320, baseType: !101, size: 32, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !104, file: !105, line: 321, baseType: !101, size: 32, offset: 1056)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !104, file: !105, line: 322, baseType: !196, size: 32, offset: 1088)
!196 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !104, file: !105, line: 323, baseType: !101, size: 32, offset: 1120)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !104, file: !105, line: 324, baseType: !101, size: 32, offset: 1152)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !104, file: !105, line: 326, baseType: !101, size: 32, offset: 1184)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !104, file: !105, line: 327, baseType: !201, size: 512, offset: 1216)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !105, line: 89, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !105, line: 91, size: 512, elements: !203)
!203 = !{!204, !205, !213, !214}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !202, file: !105, line: 92, baseType: !101, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !105, line: 93, baseType: !206, size: 192, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !207, line: 57, baseType: !208)
!207 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !207, line: 61, size: 192, elements: !209)
!209 = !{!210, !211, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !208, file: !207, line: 62, baseType: !130, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !208, file: !207, line: 63, baseType: !108, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !208, file: !207, line: 64, baseType: !108, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !202, file: !105, line: 94, baseType: !101, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !202, file: !105, line: 95, baseType: !206, size: 192, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !104, file: !105, line: 328, baseType: !101, size: 32, offset: 1728)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !104, file: !105, line: 329, baseType: !101, size: 32, offset: 1760)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !104, file: !105, line: 330, baseType: !206, size: 192, offset: 1792)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !104, file: !105, line: 331, baseType: !101, size: 32, offset: 1984)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !104, file: !105, line: 332, baseType: !101, size: 32, offset: 2016)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !104, file: !105, line: 333, baseType: !101, size: 32, offset: 2048)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !104, file: !105, line: 334, baseType: !101, size: 32, offset: 2080)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !104, file: !105, line: 335, baseType: !206, size: 192, offset: 2112)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !104, file: !105, line: 336, baseType: !206, size: 192, offset: 2304)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !104, file: !105, line: 337, baseType: !206, size: 192, offset: 2496)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !104, file: !105, line: 338, baseType: !206, size: 192, offset: 2688)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !104, file: !105, line: 339, baseType: !206, size: 192, offset: 2880)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !104, file: !105, line: 340, baseType: !206, size: 192, offset: 3072)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !104, file: !105, line: 341, baseType: !206, size: 192, offset: 3264)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !104, file: !105, line: 342, baseType: !101, size: 32, offset: 3456)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !104, file: !105, line: 343, baseType: !101, size: 32, offset: 3488)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !104, file: !105, line: 344, baseType: !101, size: 32, offset: 3520)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !104, file: !105, line: 345, baseType: !101, size: 32, offset: 3552)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !104, file: !105, line: 346, baseType: !101, size: 32, offset: 3584)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !104, file: !105, line: 347, baseType: !101, size: 32, offset: 3616)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !104, file: !105, line: 348, baseType: !101, size: 32, offset: 3648)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !104, file: !105, line: 349, baseType: !101, size: 32, offset: 3680)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !104, file: !105, line: 350, baseType: !101, size: 32, offset: 3712)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !104, file: !105, line: 351, baseType: !101, size: 32, offset: 3744)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !104, file: !105, line: 352, baseType: !101, size: 32, offset: 3776)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !104, file: !105, line: 353, baseType: !101, size: 32, offset: 3808)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !104, file: !105, line: 354, baseType: !101, size: 32, offset: 3840)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !104, file: !105, line: 355, baseType: !206, size: 192, offset: 3904)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !104, file: !105, line: 356, baseType: !101, size: 32, offset: 4096)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !104, file: !105, line: 357, baseType: !101, size: 32, offset: 4128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !104, file: !105, line: 358, baseType: !246, size: 64, offset: 4160)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !248, line: 53, baseType: !249)
!248 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !248, line: 55, size: 278656, elements: !250)
!250 = !{!251, !252, !256}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !249, file: !248, line: 56, baseType: !101, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !249, file: !248, line: 57, baseType: !253, size: 262144, offset: 32)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 32768)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !249, file: !248, line: 58, baseType: !257, size: 16448, offset: 262208)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !248, line: 42, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !248, line: 44, size: 16448, elements: !259)
!259 = !{!260, !264, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !258, file: !248, line: 45, baseType: !261, size: 8192)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !258, file: !248, line: 46, baseType: !261, size: 8192, offset: 8192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !248, line: 47, baseType: !266, size: 64, offset: 16384)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !104, file: !105, line: 359, baseType: !101, size: 32, offset: 4224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !104, file: !105, line: 360, baseType: !101, size: 32, offset: 4256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !104, file: !105, line: 361, baseType: !101, size: 32, offset: 4288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !104, file: !105, line: 362, baseType: !101, size: 32, offset: 4320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !104, file: !105, line: 363, baseType: !101, size: 32, offset: 4352)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !104, file: !105, line: 364, baseType: !101, size: 32, offset: 4384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !104, file: !105, line: 365, baseType: !101, size: 32, offset: 4416)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !104, file: !105, line: 366, baseType: !101, size: 32, offset: 4448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !104, file: !105, line: 367, baseType: !101, size: 32, offset: 4480)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !104, file: !105, line: 368, baseType: !101, size: 32, offset: 4512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !104, file: !105, line: 369, baseType: !206, size: 192, offset: 4544)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !104, file: !105, line: 370, baseType: !101, size: 32, offset: 4736)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !104, file: !105, line: 372, baseType: !101, size: 32, offset: 4768)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !104, file: !105, line: 373, baseType: !206, size: 192, offset: 4800)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !104, file: !105, line: 374, baseType: !206, size: 192, offset: 4992)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !104, file: !105, line: 375, baseType: !283, size: 128, offset: 5184)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !105, line: 101, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !105, line: 103, size: 128, elements: !285)
!285 = !{!286, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !284, file: !105, line: 104, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !284, file: !105, line: 105, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !104, file: !105, line: 376, baseType: !292, size: 64, offset: 5312)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !294, line: 73, baseType: !295)
!294 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !294, line: 202, size: 98624, elements: !296)
!296 = !{!297, !320, !324, !325, !326, !327, !331, !332}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !295, file: !294, line: 204, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !294, line: 57, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !105, line: 534, size: 640, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !305, file: !105, line: 535, baseType: !130, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !305, file: !105, line: 536, baseType: !130, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !305, file: !105, line: 537, baseType: !130, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !305, file: !105, line: 538, baseType: !130, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !305, file: !105, line: 539, baseType: !130, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !305, file: !105, line: 540, baseType: !130, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !305, file: !105, line: 542, baseType: !101, size: 32, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !305, file: !105, line: 543, baseType: !101, size: 32, offset: 416)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !305, file: !105, line: 544, baseType: !101, size: 32, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !305, file: !105, line: 545, baseType: !101, size: 32, offset: 480)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !305, file: !105, line: 546, baseType: !4, size: 8, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !305, file: !105, line: 548, baseType: !101, size: 32, offset: 544)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !305, file: !105, line: 549, baseType: !101, size: 32, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !295, file: !294, line: 206, baseType: !321, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !105, line: 210, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !105, line: 210, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !295, file: !294, line: 208, baseType: !321, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !295, file: !294, line: 210, baseType: !321, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !295, file: !294, line: 212, baseType: !101, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !295, file: !294, line: 213, baseType: !328, size: 16384, offset: 288)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !295, file: !294, line: 214, baseType: !328, size: 16384, offset: 16672)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !295, file: !294, line: 215, baseType: !333, size: 65536, offset: 33056)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 8192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !104, file: !105, line: 377, baseType: !337, size: 64, offset: 5376)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !104, file: !105, line: 378, baseType: !101, size: 32, offset: 5440)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !104, file: !105, line: 379, baseType: !341, size: 64, offset: 5504)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !105, line: 286, baseType: !343)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !105, line: 286, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !104, file: !105, line: 380, baseType: !345, size: 64, offset: 5568)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !105, line: 61, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !348, line: 42, size: 33856, elements: !349)
!348 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!349 = !{!350, !354, !358}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !347, file: !348, line: 43, baseType: !351, size: 1024)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !347, file: !348, line: 44, baseType: !355, size: 32768, offset: 1024)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 4096)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !348, line: 45, baseType: !359, size: 64, offset: 33792)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !104, file: !105, line: 381, baseType: !206, size: 192, offset: 5632)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !104, file: !105, line: 382, baseType: !206, size: 192, offset: 5824)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !104, file: !105, line: 383, baseType: !206, size: 192, offset: 6016)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !104, file: !105, line: 384, baseType: !206, size: 192, offset: 6208)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !104, file: !105, line: 385, baseType: !206, size: 192, offset: 6400)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !104, file: !105, line: 386, baseType: !101, size: 32, offset: 6592)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !104, file: !105, line: 388, baseType: !101, size: 32, offset: 6624)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !104, file: !105, line: 389, baseType: !101, size: 32, offset: 6656)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !104, file: !105, line: 391, baseType: !369, size: 64, offset: 6720)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !104, file: !105, line: 393, baseType: !101, size: 32, offset: 6784)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !104, file: !105, line: 394, baseType: !101, size: 32, offset: 6816)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !104, file: !105, line: 395, baseType: !101, size: 32, offset: 6848)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !104, file: !105, line: 396, baseType: !101, size: 32, offset: 6880)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !104, file: !105, line: 398, baseType: !101, size: 32, offset: 6912)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !104, file: !105, line: 399, baseType: !101, size: 32, offset: 6944)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !104, file: !105, line: 402, baseType: !62, size: 64, offset: 6976)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !104, file: !105, line: 404, baseType: !379, size: 128, offset: 7040)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !105, line: 260, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !105, line: 270, size: 128, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !380, file: !105, line: 271, baseType: !101, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !380, file: !105, line: 272, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !105, line: 264, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !105, line: 266, size: 128, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !386, file: !105, line: 267, baseType: !130, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !386, file: !105, line: 268, baseType: !80, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !104, file: !105, line: 406, baseType: !391, size: 1126016, offset: 7168)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !105, line: 216, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !105, line: 218, size: 1126016, elements: !393)
!393 = !{!394, !430, !431, !432, !433, !434, !435, !436, !437, !443, !455, !464, !470, !477, !478, !479, !480, !494, !495, !499, !500, !501, !502, !503, !504, !505, !506, !513, !514, !515, !516}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !392, file: !105, line: 219, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !105, line: 204, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !398, line: 59, size: 320, elements: !399)
!398 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !397, file: !398, line: 60, baseType: !401, size: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !402, line: 72, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !402, line: 67, size: 320, elements: !404)
!404 = !{!405, !425, !429}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !403, file: !402, line: 69, baseType: !406, size: 320)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !407, line: 22, size: 320, elements: !408)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!408 = !{!409, !410, !411, !412, !413, !414, !416, !417}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !406, file: !407, line: 24, baseType: !101, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !406, file: !407, line: 25, baseType: !36, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !406, file: !407, line: 26, baseType: !101, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !406, file: !407, line: 28, baseType: !36, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !406, file: !407, line: 32, baseType: !101, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !406, file: !407, line: 34, baseType: !415, size: 16, offset: 160)
!415 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !406, file: !407, line: 35, baseType: !415, size: 16, offset: 176)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !406, file: !407, line: 36, baseType: !418, size: 128, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !419, line: 55, baseType: !420)
!419 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !419, line: 51, size: 128, elements: !421)
!421 = !{!422, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !420, file: !419, line: 53, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !420, file: !419, line: 54, baseType: !423, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !403, file: !402, line: 70, baseType: !426, size: 320)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 40)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !403, file: !402, line: 71, baseType: !151, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !392, file: !105, line: 221, baseType: !101, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !392, file: !105, line: 222, baseType: !101, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !392, file: !105, line: 223, baseType: !101, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !392, file: !105, line: 225, baseType: !101, size: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !392, file: !105, line: 226, baseType: !206, size: 192, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !392, file: !105, line: 227, baseType: !122, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !392, file: !105, line: 228, baseType: !101, size: 32, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !392, file: !105, line: 230, baseType: !438, size: 32832, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !105, line: 121, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !105, line: 123, size: 32832, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !439, file: !105, line: 124, baseType: !122, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !439, file: !105, line: 125, baseType: !355, size: 32768, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !392, file: !105, line: 232, baseType: !444, size: 192, offset: 33344)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !105, line: 111, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !105, line: 112, size: 192, elements: !446)
!446 = !{!447, !448, !453}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !445, file: !105, line: 113, baseType: !80, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !445, file: !105, line: 114, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !105, line: 110, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!101}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !105, line: 115, baseType: !454, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !392, file: !105, line: 233, baseType: !456, size: 1048608, offset: 33536)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !105, line: 131, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !105, line: 133, size: 1048608, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !457, file: !105, line: 134, baseType: !101, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !457, file: !105, line: 135, baseType: !461, size: 1048576, offset: 32)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !462)
!462 = !{!463, !335}
!463 = !DISubrange(count: 16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !392, file: !105, line: 234, baseType: !465, size: 16416, offset: 1082144)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !105, line: 153, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !105, line: 155, size: 16416, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !466, file: !105, line: 156, baseType: !101, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !466, file: !105, line: 157, baseType: !328, size: 16384, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !392, file: !105, line: 235, baseType: !471, size: 96, offset: 1098560)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !105, line: 163, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !105, line: 165, size: 96, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !472, file: !105, line: 166, baseType: !101, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !472, file: !105, line: 167, baseType: !101, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !472, file: !105, line: 168, baseType: !101, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !392, file: !105, line: 236, baseType: !130, size: 64, offset: 1098688)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !392, file: !105, line: 237, baseType: !101, size: 32, offset: 1098752)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !392, file: !105, line: 238, baseType: !101, size: 32, offset: 1098784)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !392, file: !105, line: 239, baseType: !481, size: 64, offset: 1098816)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !483, line: 51, baseType: !484)
!483 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !483, line: 150, size: 704, elements: !485)
!485 = !{!486, !488, !489, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !483, line: 151, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !484, file: !483, line: 152, baseType: !369, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !484, file: !483, line: 153, baseType: !108, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !484, file: !483, line: 154, baseType: !491, size: 512, offset: 192)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !392, file: !105, line: 240, baseType: !101, size: 32, offset: 1098880)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !392, file: !105, line: 242, baseType: !496, size: 10240, offset: 1098912)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 10240, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 1280)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !392, file: !105, line: 243, baseType: !101, size: 32, offset: 1109152)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !392, file: !105, line: 244, baseType: !101, size: 32, offset: 1109184)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !392, file: !105, line: 245, baseType: !101, size: 32, offset: 1109216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !392, file: !105, line: 246, baseType: !101, size: 32, offset: 1109248)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !392, file: !105, line: 247, baseType: !101, size: 32, offset: 1109280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !392, file: !105, line: 248, baseType: !288, size: 64, offset: 1109312)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !392, file: !105, line: 249, baseType: !101, size: 32, offset: 1109376)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !392, file: !105, line: 250, baseType: !507, size: 64, offset: 1109440)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !105, line: 194, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !105, line: 196, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !509, file: !105, line: 197, baseType: !130, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !105, line: 198, baseType: !507, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !392, file: !105, line: 251, baseType: !328, size: 16384, offset: 1109504)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !392, file: !105, line: 252, baseType: !36, size: 32, offset: 1125888)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !392, file: !105, line: 253, baseType: !36, size: 32, offset: 1125920)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !392, file: !105, line: 254, baseType: !101, size: 32, offset: 1125952)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !94, file: !64, line: 195, baseType: !75, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !65, file: !64, line: 196, baseType: !519, size: 128, offset: 384)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !64, line: 196, size: 128, elements: !520)
!520 = !{!521, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !519, file: !64, line: 196, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !64, line: 86, baseType: !98)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !519, file: !64, line: 196, baseType: !75, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !65, file: !64, line: 197, baseType: !525, size: 128, offset: 512)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !64, line: 197, size: 128, elements: !526)
!526 = !{!527, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !525, file: !64, line: 197, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !64, line: 87, baseType: !98)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !525, file: !64, line: 197, baseType: !75, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !65, file: !64, line: 198, baseType: !531, size: 128, offset: 640)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !64, line: 198, size: 128, elements: !532)
!532 = !{!533, !539}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !531, file: !64, line: 198, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !64, line: 92, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !64, line: 88, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!101, !75, !102, !288, !290, !369, !369}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !531, file: !64, line: 198, baseType: !75, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !65, file: !64, line: 199, baseType: !541, size: 128, offset: 768)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !64, line: 199, size: 128, elements: !542)
!542 = !{!543, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !541, file: !64, line: 199, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !64, line: 93, baseType: !535)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !541, file: !64, line: 199, baseType: !75, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !65, file: !64, line: 200, baseType: !547, size: 128, offset: 896)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !64, line: 200, size: 128, elements: !548)
!548 = !{!549, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !547, file: !64, line: 200, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !64, line: 94, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!101, !75, !102, !130, !101, !369, !369}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !547, file: !64, line: 200, baseType: !75, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !65, file: !64, line: 201, baseType: !556, size: 128, offset: 1024)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !64, line: 201, size: 128, elements: !557)
!557 = !{!558, !563}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !556, file: !64, line: 201, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !64, line: 98, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!369, !75, !102, !369}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !556, file: !64, line: 201, baseType: !75, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !65, file: !64, line: 202, baseType: !565, size: 128, offset: 1152)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !64, line: 202, size: 128, elements: !566)
!566 = !{!567, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !565, file: !64, line: 202, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !64, line: 101, baseType: !560)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !565, file: !64, line: 202, baseType: !75, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !65, file: !64, line: 203, baseType: !571, size: 128, offset: 1280)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !64, line: 203, size: 128, elements: !572)
!572 = !{!573, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !571, file: !64, line: 203, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !64, line: 104, baseType: !560)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !571, file: !64, line: 203, baseType: !75, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !65, file: !64, line: 204, baseType: !577, size: 128, offset: 1408)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !64, line: 204, size: 128, elements: !578)
!578 = !{!579, !789}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !577, file: !64, line: 204, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !64, line: 107, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!101, !75, !102, !584, !101, !101, !101, !101, !101, !756}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !294, line: 61, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !105, line: 557, size: 135040, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !603, !604, !605, !606, !607, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !586, file: !105, line: 561, baseType: !328, size: 16384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !586, file: !105, line: 562, baseType: !328, size: 16384, offset: 16384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !586, file: !105, line: 563, baseType: !328, size: 16384, offset: 32768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !586, file: !105, line: 564, baseType: !328, size: 16384, offset: 49152)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !586, file: !105, line: 565, baseType: !328, size: 16384, offset: 65536)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !586, file: !105, line: 566, baseType: !328, size: 16384, offset: 81920)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !586, file: !105, line: 567, baseType: !130, size: 64, offset: 98304)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !586, file: !105, line: 568, baseType: !328, size: 16384, offset: 98368)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !586, file: !105, line: 569, baseType: !261, size: 8192, offset: 114752)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !586, file: !105, line: 570, baseType: !101, size: 32, offset: 122944)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !586, file: !105, line: 571, baseType: !101, size: 32, offset: 122976)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !586, file: !105, line: 572, baseType: !101, size: 32, offset: 123008)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !586, file: !105, line: 573, baseType: !101, size: 32, offset: 123040)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !586, file: !105, line: 574, baseType: !602, size: 64, offset: 123072)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !182, line: 284, baseType: !151)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !586, file: !105, line: 575, baseType: !101, size: 32, offset: 123136)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !586, file: !105, line: 576, baseType: !602, size: 64, offset: 123200)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !586, file: !105, line: 577, baseType: !181, size: 64, offset: 123264)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !586, file: !105, line: 578, baseType: !181, size: 64, offset: 123328)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !586, file: !105, line: 579, baseType: !608, size: 8960, offset: 123392)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !483, line: 47, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !105, line: 486, size: 8960, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !629, !630, !631, !632, !633, !634, !635, !637, !700, !701, !702, !703, !708, !709, !713, !714, !715, !716, !717, !718}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !609, file: !105, line: 487, baseType: !101, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !609, file: !105, line: 488, baseType: !415, size: 16, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !609, file: !105, line: 489, baseType: !415, size: 16, offset: 48)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !609, file: !105, line: 490, baseType: !415, size: 16, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !609, file: !105, line: 491, baseType: !415, size: 16, offset: 80)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !609, file: !105, line: 492, baseType: !415, size: 16, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !609, file: !105, line: 493, baseType: !415, size: 16, offset: 112)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !609, file: !105, line: 494, baseType: !415, size: 16, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !609, file: !105, line: 495, baseType: !101, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !609, file: !105, line: 496, baseType: !101, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !609, file: !105, line: 497, baseType: !130, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !609, file: !105, line: 498, baseType: !130, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !609, file: !105, line: 499, baseType: !122, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !609, file: !105, line: 500, baseType: !181, size: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !609, file: !105, line: 501, baseType: !626, size: 640, offset: 512)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 80)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !609, file: !105, line: 502, baseType: !491, size: 512, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !609, file: !105, line: 503, baseType: !491, size: 512, offset: 1664)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !609, file: !105, line: 504, baseType: !491, size: 512, offset: 2176)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !609, file: !105, line: 505, baseType: !130, size: 64, offset: 2688)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !609, file: !105, line: 506, baseType: !181, size: 64, offset: 2752)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !609, file: !105, line: 507, baseType: !415, size: 16, offset: 2816)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !609, file: !105, line: 508, baseType: !636, size: 32, offset: 2848)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !182, line: 323, baseType: !101)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !609, file: !105, line: 509, baseType: !638, size: 224, offset: 2880)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !639, line: 91, baseType: !640)
!639 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !639, line: 93, size: 224, elements: !641)
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !640, file: !639, line: 103, baseType: !643, size: 224)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !640, file: !639, line: 94, size: 224, elements: !644)
!644 = !{!645, !656, !678}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !643, file: !639, line: 96, baseType: !646, size: 128)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !647, line: 180, size: 128, elements: !648)
!647 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!648 = !{!649, !652}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !646, file: !647, line: 182, baseType: !650, size: 16)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !651, line: 28, baseType: !153)
!651 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !646, file: !647, line: 183, baseType: !653, size: 112, offset: 16)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 14)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !643, file: !639, line: 98, baseType: !657, size: 128)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !658, line: 245, size: 128, elements: !659)
!658 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!659 = !{!660, !661, !666, !673}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !657, file: !658, line: 247, baseType: !650, size: 16)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !657, file: !658, line: 248, baseType: !662, size: 16, offset: 16)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !658, line: 123, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !664, line: 25, baseType: !665)
!664 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !150, line: 40, baseType: !153)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !657, file: !658, line: 249, baseType: !667, size: 32, offset: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !658, line: 31, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !667, file: !658, line: 33, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !658, line: 30, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !664, line: 26, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !150, line: 42, baseType: !36)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !657, file: !658, line: 252, baseType: !674, size: 64, offset: 64)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 64, elements: !676)
!675 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!676 = !{!677}
!677 = !DISubrange(count: 8)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !643, file: !639, line: 101, baseType: !679, size: 224)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !658, line: 260, size: 224, elements: !680)
!680 = !{!681, !682, !683, !684, !699}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !679, file: !658, line: 262, baseType: !650, size: 16)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !679, file: !658, line: 263, baseType: !662, size: 16, offset: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !679, file: !658, line: 264, baseType: !671, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !679, file: !658, line: 265, baseType: !685, size: 128, offset: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !658, line: 219, size: 128, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !685, file: !658, line: 226, baseType: !688, size: 128)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !685, file: !658, line: 221, size: 128, elements: !689)
!689 = !{!690, !695, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !688, file: !658, line: 223, baseType: !691, size: 128)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 128, elements: !694)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !664, line: 24, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !150, line: 38, baseType: !675)
!694 = !{!463}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !688, file: !658, line: 224, baseType: !696, size: 128)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 128, elements: !676)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !688, file: !658, line: 225, baseType: !698, size: 128)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 128, elements: !5)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !679, file: !658, line: 266, baseType: !671, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !609, file: !105, line: 510, baseType: !101, size: 32, offset: 3104)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !609, file: !105, line: 511, baseType: !122, size: 64, offset: 3136)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !609, file: !105, line: 513, baseType: !415, size: 16, offset: 3200)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !609, file: !105, line: 515, baseType: !704, size: 64, offset: 3264)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !706, line: 184, baseType: !707)
!706 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !706, line: 184, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !609, file: !105, line: 517, baseType: !491, size: 512, offset: 3328)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !609, file: !105, line: 518, baseType: !710, size: 2048, offset: 3840)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !609, file: !105, line: 519, baseType: !710, size: 2048, offset: 5888)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !609, file: !105, line: 520, baseType: !181, size: 64, offset: 7936)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !609, file: !105, line: 521, baseType: !181, size: 64, offset: 8000)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !609, file: !105, line: 522, baseType: !181, size: 64, offset: 8064)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !609, file: !105, line: 523, baseType: !101, size: 32, offset: 8128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !609, file: !105, line: 525, baseType: !719, size: 768, offset: 8192)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !483, line: 43, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !105, line: 465, size: 768, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !720, file: !105, line: 466, baseType: !415, size: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !720, file: !105, line: 467, baseType: !415, size: 16, offset: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !720, file: !105, line: 468, baseType: !415, size: 16, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !720, file: !105, line: 469, baseType: !415, size: 16, offset: 48)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !720, file: !105, line: 470, baseType: !415, size: 16, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !720, file: !105, line: 471, baseType: !415, size: 16, offset: 80)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !720, file: !105, line: 472, baseType: !369, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !720, file: !105, line: 473, baseType: !369, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !720, file: !105, line: 474, baseType: !369, size: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !720, file: !105, line: 475, baseType: !369, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !720, file: !105, line: 476, baseType: !369, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !720, file: !105, line: 477, baseType: !369, size: 64, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !720, file: !105, line: 478, baseType: !735, size: 256, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !105, line: 452, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !105, line: 454, size: 256, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !736, file: !105, line: 455, baseType: !101, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !736, file: !105, line: 456, baseType: !369, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !736, file: !105, line: 457, baseType: !101, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !736, file: !105, line: 458, baseType: !369, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !586, file: !105, line: 580, baseType: !101, size: 32, offset: 132352)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !586, file: !105, line: 581, baseType: !101, size: 32, offset: 132384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !586, file: !105, line: 582, baseType: !181, size: 64, offset: 132416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !586, file: !105, line: 583, baseType: !602, size: 64, offset: 132480)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !586, file: !105, line: 585, baseType: !101, size: 32, offset: 132544)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !586, file: !105, line: 586, baseType: !101, size: 32, offset: 132576)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !586, file: !105, line: 587, baseType: !130, size: 64, offset: 132608)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !586, file: !105, line: 588, baseType: !181, size: 64, offset: 132672)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !586, file: !105, line: 589, baseType: !181, size: 64, offset: 132736)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !586, file: !105, line: 590, baseType: !181, size: 64, offset: 132800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !586, file: !105, line: 594, baseType: !710, size: 2048, offset: 132864)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !586, file: !105, line: 595, baseType: !101, size: 32, offset: 134912)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !586, file: !105, line: 596, baseType: !101, size: 32, offset: 134944)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !586, file: !105, line: 597, baseType: !101, size: 32, offset: 134976)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !35, line: 70, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !105, line: 414, size: 1344, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !770, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !758, file: !105, line: 415, baseType: !181, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !758, file: !105, line: 416, baseType: !181, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !758, file: !105, line: 418, baseType: !602, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !758, file: !105, line: 420, baseType: !181, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !758, file: !105, line: 421, baseType: !181, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !758, file: !105, line: 422, baseType: !101, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !758, file: !105, line: 424, baseType: !767, size: 128, offset: 384)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 128, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 2)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !758, file: !105, line: 425, baseType: !771, size: 128, offset: 512)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !758, file: !105, line: 426, baseType: !602, size: 64, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !758, file: !105, line: 427, baseType: !101, size: 32, offset: 704)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !758, file: !105, line: 429, baseType: !101, size: 32, offset: 736)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stat_updated_files", scope: !758, file: !105, line: 430, baseType: !101, size: 32, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stat_background", scope: !758, file: !105, line: 431, baseType: !101, size: 32, offset: 800)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nrequests", scope: !758, file: !105, line: 433, baseType: !101, size: 32, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stat_sockid", scope: !758, file: !105, line: 434, baseType: !101, size: 32, offset: 864)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "stat_nsocket", scope: !758, file: !105, line: 435, baseType: !101, size: 32, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors", scope: !758, file: !105, line: 436, baseType: !101, size: 32, offset: 928)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "stat_errors_front", scope: !758, file: !105, line: 437, baseType: !101, size: 32, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stat_warnings", scope: !758, file: !105, line: 438, baseType: !101, size: 32, offset: 992)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "stat_infos", scope: !758, file: !105, line: 439, baseType: !101, size: 32, offset: 1024)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nbk", scope: !758, file: !105, line: 440, baseType: !101, size: 32, offset: 1056)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nb", scope: !758, file: !105, line: 441, baseType: !181, size: 64, offset: 1088)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !758, file: !105, line: 443, baseType: !181, size: 64, offset: 1152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !758, file: !105, line: 445, baseType: !602, size: 64, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "last_request", scope: !758, file: !105, line: 446, baseType: !602, size: 64, offset: 1280)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !577, file: !64, line: 204, baseType: !75, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !65, file: !64, line: 205, baseType: !791, size: 128, offset: 1536)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !64, line: 205, size: 128, elements: !792)
!792 = !{!793, !798}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !791, file: !64, line: 205, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !64, line: 112, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!101, !75, !102, !369, !369, !101}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !791, file: !64, line: 205, baseType: !75, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !65, file: !64, line: 206, baseType: !800, size: 128, offset: 1664)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !64, line: 206, size: 128, elements: !801)
!801 = !{!802, !807}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !800, file: !64, line: 206, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !64, line: 115, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!101, !75, !102, !369, !369, !369, !101}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !800, file: !64, line: 206, baseType: !75, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !65, file: !64, line: 207, baseType: !809, size: 128, offset: 1792)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !64, line: 207, size: 128, elements: !810)
!810 = !{!811, !816}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !809, file: !64, line: 207, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !64, line: 119, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !75, !102, !369}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !809, file: !64, line: 207, baseType: !75, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !65, file: !64, line: 208, baseType: !818, size: 128, offset: 1920)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !64, line: 208, size: 128, elements: !819)
!819 = !{!820, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !818, file: !64, line: 208, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !64, line: 121, baseType: !813)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !818, file: !64, line: 208, baseType: !75, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !65, file: !64, line: 209, baseType: !824, size: 128, offset: 2048)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !64, line: 209, size: 128, elements: !825)
!825 = !{!826, !831}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !824, file: !64, line: 209, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !64, line: 123, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !75, !102, !369, !369, !369, !101, !101, !101}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !824, file: !64, line: 209, baseType: !75, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !65, file: !64, line: 210, baseType: !833, size: 128, offset: 2176)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !64, line: 210, size: 128, elements: !834)
!834 = !{!835, !840}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !833, file: !64, line: 210, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !64, line: 128, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!101, !75, !102, !130}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !833, file: !64, line: 210, baseType: !75, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !65, file: !64, line: 211, baseType: !842, size: 128, offset: 2304)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !64, line: 211, size: 128, elements: !843)
!843 = !{!844, !849}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !842, file: !64, line: 211, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !64, line: 130, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!101, !75, !102, !130, !369}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !842, file: !64, line: 211, baseType: !75, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !65, file: !64, line: 212, baseType: !851, size: 128, offset: 2432)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !64, line: 212, size: 128, elements: !852)
!852 = !{!853, !858}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !851, file: !64, line: 212, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !64, line: 133, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!101, !75, !102, !584}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !851, file: !64, line: 212, baseType: !75, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !65, file: !64, line: 213, baseType: !860, size: 128, offset: 2560)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !64, line: 213, size: 128, elements: !861)
!861 = !{!862, !867}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !860, file: !64, line: 213, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !64, line: 135, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!101, !75, !102, !369, !369, !369, !369, !130}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !860, file: !64, line: 213, baseType: !75, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !65, file: !64, line: 214, baseType: !869, size: 128, offset: 2688)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !64, line: 214, size: 128, elements: !870)
!870 = !{!871, !877}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !869, file: !64, line: 214, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !64, line: 142, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!101, !75, !102, !130, !369, !369, !369, !369, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !869, file: !64, line: 214, baseType: !75, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !65, file: !64, line: 215, baseType: !879, size: 128, offset: 2816)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !64, line: 215, size: 128, elements: !880)
!880 = !{!881, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !879, file: !64, line: 215, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !64, line: 148, baseType: !873)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !879, file: !64, line: 215, baseType: !75, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !65, file: !64, line: 216, baseType: !885, size: 128, offset: 2944)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !64, line: 216, size: 128, elements: !886)
!886 = !{!887, !895}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !885, file: !64, line: 216, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !64, line: 156, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!101, !75, !102, !892}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !64, line: 56, baseType: !894)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !64, line: 56, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !885, file: !64, line: 216, baseType: !75, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !65, file: !64, line: 217, baseType: !897, size: 128, offset: 3072)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !64, line: 217, size: 128, elements: !898)
!898 = !{!899, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !897, file: !64, line: 217, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !64, line: 158, baseType: !889)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !897, file: !64, line: 217, baseType: !75, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !65, file: !64, line: 219, baseType: !903, size: 128, offset: 3200)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !64, line: 219, size: 128, elements: !904)
!904 = !{!905, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !903, file: !64, line: 219, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !64, line: 141, baseType: !863)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !903, file: !64, line: 219, baseType: !75, size: 64, offset: 64)
!908 = !{!0, !7, !9, !14, !16, !21, !23, !28, !30, !909, !911, !916, !921, !926, !929, !932, !937, !939, !942, !947, !952, !954, !959, !961, !966, !971, !976, !978, !983, !988, !990, !992, !994, !999, !1001, !1003, !1005, !1010, !1015, !1020, !1025, !1030, !1032, !1034, !1039, !1044, !1049, !1051, !1056, !1061, !1066, !1071, !1073, !1075, !1077, !1079, !1084, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1114, !1117, !1122, !1127}
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !2, line: 869, type: !157, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !2, line: 882, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 55)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
