; ModuleID = 'src/httrack.c'
source_filename = "src/httrack.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.t_InpInfo = type { i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i64, i32 }
%struct.httrackp = type { i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, i64, i64, i64, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, %struct.t_proxy, i32, i32, %struct.String, i32, i32, i32, i32, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.String, i32, i32, %struct.String, %struct.String, %struct.htsfilters, ptr, ptr, i32, ptr, ptr, %struct.String, %struct.String, %struct.String, %struct.String, %struct.String, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, ptr, %struct.htslibhandles, %struct.htsoptstate }
%struct.t_proxy = type { i32, %struct.String, i32, %struct.String }
%struct.htsfilters = type { ptr, ptr }
%struct.String = type { ptr, i64, i64 }
%struct.htslibhandles = type { i32, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/httrack.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "18e63c17c434232e8fd5210e2d0a0f68")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 69)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 8)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 648, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 81)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 14)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "global_opt", scope: !24, file: !2, line: 201, type: !123, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !54, globals: !76, splitDebugInlining: false, nameTableKind: None)
!25 = !{!26, !42}
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HTTrackStatus", file: !27, line: 146, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "./src/htsbasenet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "48aef65af186ac0a9c99162429164003")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!30 = !DIEnumerator(name: "STATUS_ALIVE", value: -103)
!31 = !DIEnumerator(name: "STATUS_FREE", value: -1)
!32 = !DIEnumerator(name: "STATUS_READY", value: 0)
!33 = !DIEnumerator(name: "STATUS_TRANSFER", value: 1)
!34 = !DIEnumerator(name: "STATUS_CHUNK_CR", value: 97)
!35 = !DIEnumerator(name: "STATUS_CHUNK_WAIT", value: 98)
!36 = !DIEnumerator(name: "STATUS_WAIT_HEADERS", value: 99)
!37 = !DIEnumerator(name: "STATUS_CONNECTING", value: 100)
!38 = !DIEnumerator(name: "STATUS_WAIT_DNS", value: 101)
!39 = !DIEnumerator(name: "STATUS_SSL_WAIT_HANDSHAKE", value: 102)
!40 = !DIEnumerator(name: "STATUS_FTP_TRANSFER", value: 1000)
!41 = !DIEnumerator(name: "STATUS_FTP_READY", value: 1001)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hts_log_type", file: !43, line: 57, baseType: !44, size: 32, elements: !45)
!43 = !DIFile(filename: "./src/httrack-library.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b6c1db18b62a820eb68cf5fcd0002850")
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53}
!46 = !DIEnumerator(name: "LOG_PANIC", value: 0)
!47 = !DIEnumerator(name: "LOG_ERROR", value: 1)
!48 = !DIEnumerator(name: "LOG_WARNING", value: 2)
!49 = !DIEnumerator(name: "LOG_NOTICE", value: 3)
!50 = !DIEnumerator(name: "LOG_INFO", value: 4)
!51 = !DIEnumerator(name: "LOG_DEBUG", value: 5)
!52 = !DIEnumerator(name: "LOG_TRACE", value: 6)
!53 = !DIEnumerator(name: "LOG_ERRNO", value: 256)
!54 = !{!55, !61, !28, !67, !68, !4, !71}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_callbackarg", file: !57, line: 60, baseType: !58)
!57 = !DIFile(filename: "./src/htsdefines.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "8ac9e3f618ab92204dc9f7b5fc77bda3")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_callbackarg", file: !57, line: 179, size: 192, elements: !59)
!59 = !{!60, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "userdef", scope: !58, file: !57, line: 181, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !58, file: !57, line: 187, baseType: !63, size: 128, offset: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev", file: !57, line: 184, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !63, file: !57, line: 185, baseType: !61, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !63, file: !57, line: 186, baseType: !55, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!70 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !72, line: 72, baseType: !73)
!72 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !28}
!76 = !{!0, !7, !12, !17, !77, !82, !88, !93, !22, !99, !101, !106, !111, !116, !118, !942, !965, !970, !972, !977, !982, !984, !989, !991, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1017, !1022, !1024, !1026, !1031, !1033, !1038, !1043, !1048, !1051, !1056, !1058, !1063, !1065, !1067, !1069, !1074, !1079, !1081, !1083, !1085, !1088, !1093, !1095, !1097, !1099, !1101, !1106, !1108, !1110, !1115, !1120, !1125, !1131, !1133, !1136, !1139, !1144, !1146, !1148, !1153, !1158, !1160, !1162, !1167, !1169, !1174, !1179}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !2, line: 240, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 39)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 240, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 184, elements: !86)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!86 = !{!87}
!87 = !DISubrange(count: 23)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 6)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !95, line: 91, type: !96, isLocal: true, isDefinition: true)
!95 = !DIFile(filename: "./src/htssafe.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "0a24d1c0939efbe916010d30091bc9cc")
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 20)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "use_show", scope: !24, file: !2, line: 200, type: !28, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 7)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 4)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 5)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !103, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "prev_mytime", scope: !120, file: !2, line: 322, type: !570, isLocal: true, isDefinition: true)
!120 = distinct !DISubprogram(name: "htsshow_loop", scope: !2, file: !2, line: 321, type: !121, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !24, retainedNodes: !941)
!121 = !DISubroutineType(types: !122)
!122 = !{!28, !55, !123, !552, !28, !28, !28, !28, !28, !908}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "httrackp", file: !43, line: 49, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "httrackp", file: !126, line: 294, size: 1133184, elements: !127)
!126 = !DIFile(filename: "./src/htsopt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "4c13c78c9669919a80461e39e206d058")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !193, !194, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !211, !212, !213, !214, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !305, !350, !353, !354, !358, !374, !375, !376, !377, !378, !379, !380, !381, !382, !384, !385, !386, !387, !388, !389, !390, !774, !786}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "size_httrackp", scope: !125, file: !126, line: 295, baseType: !68, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "wizard", scope: !125, file: !126, line: 297, baseType: !28, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !125, file: !126, line: 298, baseType: !28, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "travel", scope: !125, file: !126, line: 299, baseType: !28, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "seeker", scope: !125, file: !126, line: 300, baseType: !28, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !125, file: !126, line: 301, baseType: !28, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "extdepth", scope: !125, file: !126, line: 302, baseType: !28, size: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "urlmode", scope: !125, file: !126, line: 303, baseType: !28, size: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "no_type_change", scope: !125, file: !126, line: 304, baseType: !28, size: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !125, file: !126, line: 305, baseType: !28, size: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "getmode", scope: !125, file: !126, line: 306, baseType: !28, size: 32, offset: 352)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !125, file: !126, line: 307, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !142, line: 7, baseType: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !144, line: 49, size: 1728, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !161, !163, !164, !165, !169, !171, !173, !177, !180, !182, !185, !188, !189, !190, !191, !192}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !143, file: !144, line: 51, baseType: !28, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !143, file: !144, line: 54, baseType: !67, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !143, file: !144, line: 55, baseType: !67, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !143, file: !144, line: 56, baseType: !67, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !143, file: !144, line: 57, baseType: !67, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !143, file: !144, line: 58, baseType: !67, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !143, file: !144, line: 59, baseType: !67, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !143, file: !144, line: 60, baseType: !67, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !143, file: !144, line: 61, baseType: !67, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !143, file: !144, line: 64, baseType: !67, size: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !143, file: !144, line: 65, baseType: !67, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !143, file: !144, line: 66, baseType: !67, size: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !143, file: !144, line: 68, baseType: !159, size: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !144, line: 36, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !143, file: !144, line: 70, baseType: !162, size: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !143, file: !144, line: 72, baseType: !28, size: 32, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !143, file: !144, line: 73, baseType: !28, size: 32, offset: 928)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !143, file: !144, line: 74, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !167, line: 152, baseType: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!168 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !143, file: !144, line: 77, baseType: !170, size: 16, offset: 1024)
!170 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !143, file: !144, line: 78, baseType: !172, size: 8, offset: 1040)
!172 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !143, file: !144, line: 79, baseType: !174, size: 8, offset: 1048)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 1)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !143, file: !144, line: 81, baseType: !178, size: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !144, line: 43, baseType: null)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !143, file: !144, line: 89, baseType: !181, size: 64, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !167, line: 153, baseType: !168)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !143, file: !144, line: 91, baseType: !183, size: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !144, line: 37, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !143, file: !144, line: 92, baseType: !186, size: 64, offset: 1280)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !144, line: 38, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !143, file: !144, line: 93, baseType: !162, size: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !143, file: !144, line: 94, baseType: !61, size: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !143, file: !144, line: 95, baseType: !68, size: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !143, file: !144, line: 96, baseType: !28, size: 32, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !143, file: !144, line: 98, baseType: !96, size: 160, offset: 1568)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "errlog", scope: !125, file: !126, line: 308, baseType: !140, size: 64, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "maxsite", scope: !125, file: !126, line: 309, baseType: !195, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "LLint", file: !196, line: 283, baseType: !168)
!196 = !DIFile(filename: "./src/htsglobal.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "fb20c0ed09319430675cc60ef3f4ae78")
!197 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !125, file: !126, line: 310, baseType: !195, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !125, file: !126, line: 311, baseType: !195, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "maxsoc", scope: !125, file: !126, line: 312, baseType: !28, size: 32, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fragment", scope: !125, file: !126, line: 313, baseType: !195, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nearlink", scope: !125, file: !126, line: 314, baseType: !28, size: 32, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "makeindex", scope: !125, file: !126, line: 315, baseType: !28, size: 32, offset: 864)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "kindex", scope: !125, file: !126, line: 316, baseType: !28, size: 32, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "delete_old", scope: !125, file: !126, line: 317, baseType: !28, size: 32, offset: 928)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !125, file: !126, line: 318, baseType: !28, size: 32, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !125, file: !126, line: 319, baseType: !28, size: 32, offset: 992)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "maxtime", scope: !125, file: !126, line: 320, baseType: !28, size: 32, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "maxrate", scope: !125, file: !126, line: 321, baseType: !28, size: 32, offset: 1056)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "maxconn", scope: !125, file: !126, line: 322, baseType: !210, size: 32, offset: 1088)
!210 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "waittime", scope: !125, file: !126, line: 323, baseType: !28, size: 32, offset: 1120)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !125, file: !126, line: 324, baseType: !28, size: 32, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !125, file: !126, line: 326, baseType: !28, size: 32, offset: 1184)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !125, file: !126, line: 327, baseType: !215, size: 512, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_proxy", file: !126, line: 89, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_proxy", file: !126, line: 91, size: 512, elements: !217)
!217 = !{!218, !219, !227, !228}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !216, file: !126, line: 92, baseType: !28, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !126, line: 93, baseType: !220, size: 192, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !221, line: 57, baseType: !222)
!221 = !DIFile(filename: "./src/htsstrings.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "5e4fe8440c4fd180bd3428990197f7c5")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !221, line: 61, size: 192, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_", scope: !222, file: !221, line: 62, baseType: !67, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "length_", scope: !222, file: !221, line: 63, baseType: !68, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "capacity_", scope: !222, file: !221, line: 64, baseType: !68, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !216, file: !126, line: 94, baseType: !28, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !216, file: !126, line: 95, baseType: !220, size: 192, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "savename_83", scope: !125, file: !126, line: 328, baseType: !28, size: 32, offset: 1728)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "savename_type", scope: !125, file: !126, line: 329, baseType: !28, size: 32, offset: 1760)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "savename_userdef", scope: !125, file: !126, line: 330, baseType: !220, size: 192, offset: 1792)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "savename_delayed", scope: !125, file: !126, line: 331, baseType: !28, size: 32, offset: 1984)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delayed_cached", scope: !125, file: !126, line: 332, baseType: !28, size: 32, offset: 2016)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml", scope: !125, file: !126, line: 333, baseType: !28, size: 32, offset: 2048)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !125, file: !126, line: 334, baseType: !28, size: 32, offset: 2080)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !125, file: !126, line: 335, baseType: !220, size: 192, offset: 2112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !125, file: !126, line: 336, baseType: !220, size: 192, offset: 2304)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !125, file: !126, line: 337, baseType: !220, size: 192, offset: 2496)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "path_log", scope: !125, file: !126, line: 338, baseType: !220, size: 192, offset: 2688)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "path_html", scope: !125, file: !126, line: 339, baseType: !220, size: 192, offset: 2880)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "path_html_utf8", scope: !125, file: !126, line: 340, baseType: !220, size: 192, offset: 3072)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "path_bin", scope: !125, file: !126, line: 341, baseType: !220, size: 192, offset: 3264)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !125, file: !126, line: 342, baseType: !28, size: 32, offset: 3456)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "makestat", scope: !125, file: !126, line: 343, baseType: !28, size: 32, offset: 3488)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "maketrack", scope: !125, file: !126, line: 344, baseType: !28, size: 32, offset: 3520)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parsejava", scope: !125, file: !126, line: 345, baseType: !28, size: 32, offset: 3552)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "hostcontrol", scope: !125, file: !126, line: 346, baseType: !28, size: 32, offset: 3584)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "errpage", scope: !125, file: !126, line: 347, baseType: !28, size: 32, offset: 3616)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "check_type", scope: !125, file: !126, line: 348, baseType: !28, size: 32, offset: 3648)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "all_in_cache", scope: !125, file: !126, line: 349, baseType: !28, size: 32, offset: 3680)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "robots", scope: !125, file: !126, line: 350, baseType: !28, size: 32, offset: 3712)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !125, file: !126, line: 351, baseType: !28, size: 32, offset: 3744)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "passprivacy", scope: !125, file: !126, line: 352, baseType: !28, size: 32, offset: 3776)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "includequery", scope: !125, file: !126, line: 353, baseType: !28, size: 32, offset: 3808)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_first_page", scope: !125, file: !126, line: 354, baseType: !28, size: 32, offset: 3840)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com", scope: !125, file: !126, line: 355, baseType: !220, size: 192, offset: 3904)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sys_com_exec", scope: !125, file: !126, line: 356, baseType: !28, size: 32, offset: 4096)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "accept_cookie", scope: !125, file: !126, line: 357, baseType: !28, size: 32, offset: 4128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !125, file: !126, line: 358, baseType: !260, size: 64, offset: 4160)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_cookie", file: !126, line: 65, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_cookie", file: !263, line: 55, size: 278656, elements: !264)
!263 = !DIFile(filename: "./src/htsbauth.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "2c305fa8769d56cd3c433c11e4cc3006")
!264 = !{!265, !266, !270}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !262, file: !263, line: 56, baseType: !28, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !263, line: 57, baseType: !267, size: 262144, offset: 32)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 262144, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 32768)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !262, file: !263, line: 58, baseType: !271, size: 16448, offset: 262208)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "bauth_chain", file: !263, line: 42, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bauth_chain", file: !263, line: 44, size: 16448, elements: !273)
!273 = !{!274, !278, !279}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !272, file: !263, line: 45, baseType: !275, size: 8192)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !272, file: !263, line: 46, baseType: !275, size: 8192, offset: 8192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !263, line: 47, baseType: !280, size: 64, offset: 16384)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "http10", scope: !125, file: !126, line: 359, baseType: !28, size: 32, offset: 4224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !125, file: !126, line: 360, baseType: !28, size: 32, offset: 4256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !125, file: !126, line: 361, baseType: !28, size: 32, offset: 4288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sizehack", scope: !125, file: !126, line: 362, baseType: !28, size: 32, offset: 4320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "urlhack", scope: !125, file: !126, line: 363, baseType: !28, size: 32, offset: 4352)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tolerant", scope: !125, file: !126, line: 364, baseType: !28, size: 32, offset: 4384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parseall", scope: !125, file: !126, line: 365, baseType: !28, size: 32, offset: 4416)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parsedebug", scope: !125, file: !126, line: 366, baseType: !28, size: 32, offset: 4448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "norecatch", scope: !125, file: !126, line: 367, baseType: !28, size: 32, offset: 4480)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "verbosedisplay", scope: !125, file: !126, line: 368, baseType: !28, size: 32, offset: 4512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !125, file: !126, line: 369, baseType: !220, size: 192, offset: 4544)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "maxcache", scope: !125, file: !126, line: 370, baseType: !28, size: 32, offset: 4736)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ftp_proxy", scope: !125, file: !126, line: 372, baseType: !28, size: 32, offset: 4768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "filelist", scope: !125, file: !126, line: 373, baseType: !220, size: 192, offset: 4800)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "urllist", scope: !125, file: !126, line: 374, baseType: !220, size: 192, offset: 4992)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !125, file: !126, line: 375, baseType: !297, size: 128, offset: 5184)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsfilters", file: !126, line: 101, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsfilters", file: !126, line: 103, size: 128, elements: !299)
!299 = !{!300, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !298, file: !126, line: 104, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "filptr", scope: !298, file: !126, line: 105, baseType: !304, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !125, file: !126, line: 376, baseType: !306, size: 64, offset: 5312)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_struct", file: !126, line: 57, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_struct", file: !309, line: 202, size: 98624, elements: !310)
!309 = !DIFile(filename: "./src/htscore.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6879168e7f4510c5fb224772e2174ec4")
!310 = !{!311, !334, !338, !339, !340, !341, !345, !346}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !308, file: !309, line: 204, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_url", file: !126, line: 174, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_url", file: !126, line: 534, size: 640, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !319, file: !126, line: 535, baseType: !67, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !319, file: !126, line: 536, baseType: !67, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !319, file: !126, line: 537, baseType: !67, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cod", scope: !319, file: !126, line: 538, baseType: !67, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "former_adr", scope: !319, file: !126, line: 539, baseType: !67, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "former_fil", scope: !319, file: !126, line: 540, baseType: !67, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "premier", scope: !319, file: !126, line: 542, baseType: !28, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "precedent", scope: !319, file: !126, line: 543, baseType: !28, size: 32, offset: 416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !319, file: !126, line: 544, baseType: !28, size: 32, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pass2", scope: !319, file: !126, line: 545, baseType: !28, size: 32, offset: 480)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "link_import", scope: !319, file: !126, line: 546, baseType: !4, size: 8, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !319, file: !126, line: 548, baseType: !28, size: 32, offset: 544)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !319, file: !126, line: 549, baseType: !28, size: 32, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sav", scope: !308, file: !309, line: 206, baseType: !335, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "coucal", file: !126, line: 210, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct_coucal", file: !126, line: 210, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "adrfil", scope: !308, file: !309, line: 208, baseType: !335, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "former_adrfil", scope: !308, file: !309, line: 210, baseType: !335, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "normalized", scope: !308, file: !309, line: 212, baseType: !28, size: 32, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "normfil", scope: !308, file: !309, line: 213, baseType: !342, size: 16384, offset: 288)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 2048)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "normfil2", scope: !308, file: !309, line: 214, baseType: !342, size: 16384, offset: 16672)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "catbuff", scope: !308, file: !309, line: 215, baseType: !347, size: 65536, offset: 33056)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 65536, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 8192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "liens", scope: !125, file: !126, line: 377, baseType: !351, size: 64, offset: 5376)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lien_tot", scope: !125, file: !126, line: 378, baseType: !28, size: 32, offset: 5440)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "liensbuf", scope: !125, file: !126, line: 379, baseType: !355, size: 64, offset: 5504)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_buffers", file: !126, line: 286, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "lien_buffers", file: !126, line: 286, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "robotsptr", scope: !125, file: !126, line: 380, baseType: !359, size: 64, offset: 5568)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "robots_wizard", file: !126, line: 61, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "robots_wizard", file: !362, line: 42, size: 33856, elements: !363)
!362 = !DIFile(filename: "./src/htsrobots.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a7fd093dda2609f837d8ccf3f2ab843e")
!363 = !{!364, !368, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !361, file: !362, line: 43, baseType: !365, size: 1024)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !361, file: !362, line: 44, baseType: !369, size: 32768, offset: 1024)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 4096)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !361, file: !362, line: 45, baseType: !373, size: 64, offset: 33792)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !125, file: !126, line: 381, baseType: !220, size: 192, offset: 5632)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !125, file: !126, line: 382, baseType: !220, size: 192, offset: 5824)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !125, file: !126, line: 383, baseType: !220, size: 192, offset: 6016)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mimedefs", scope: !125, file: !126, line: 384, baseType: !220, size: 192, offset: 6208)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mod_blacklist", scope: !125, file: !126, line: 385, baseType: !220, size: 192, offset: 6400)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "convert_utf8", scope: !125, file: !126, line: 386, baseType: !28, size: 32, offset: 6592)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !125, file: !126, line: 388, baseType: !28, size: 32, offset: 6624)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "maxfilter", scope: !125, file: !126, line: 389, baseType: !28, size: 32, offset: 6656)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !125, file: !126, line: 391, baseType: !383, size: 64, offset: 6720)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !125, file: !126, line: 393, baseType: !28, size: 32, offset: 6784)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "keyboard", scope: !125, file: !126, line: 394, baseType: !28, size: 32, offset: 6816)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bypass_limits", scope: !125, file: !126, line: 395, baseType: !28, size: 32, offset: 6848)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "background_on_suspend", scope: !125, file: !126, line: 396, baseType: !28, size: 32, offset: 6880)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !125, file: !126, line: 398, baseType: !28, size: 32, offset: 6912)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dir_topindex", scope: !125, file: !126, line: 399, baseType: !28, size: 32, offset: 6944)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks_fun", scope: !125, file: !126, line: 402, baseType: !391, size: 64, offset: 6976)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_callbacks", file: !126, line: 49, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_hts_htmlcheck_callbacks", file: !57, line: 191, size: 3328, elements: !394)
!394 = !{!395, !404, !410, !419, !425, !431, !441, !447, !456, !465, !471, !477, !484, !493, !502, !511, !517, !526, !535, !544, !725, !734, !744, !750, !762, !768}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !393, file: !57, line: 193, baseType: !396, size: 128)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init", file: !57, line: 193, size: 128, elements: !397)
!397 = !{!398, !403}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !396, file: !57, line: 193, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_init", file: !57, line: 83, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !55}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !396, file: !57, line: 193, baseType: !55, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !393, file: !57, line: 194, baseType: !405, size: 128, offset: 128)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uninit", file: !57, line: 194, size: 128, elements: !406)
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !405, file: !57, line: 194, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_uninit", file: !57, line: 84, baseType: !400)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !405, file: !57, line: 194, baseType: !55, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !393, file: !57, line: 195, baseType: !411, size: 128, offset: 256)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "start", file: !57, line: 195, size: 128, elements: !412)
!412 = !{!413, !418}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !411, file: !57, line: 195, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_start", file: !57, line: 85, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!28, !55, !123}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !411, file: !57, line: 195, baseType: !55, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !393, file: !57, line: 196, baseType: !420, size: 128, offset: 384)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "end", file: !57, line: 196, size: 128, elements: !421)
!421 = !{!422, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !420, file: !57, line: 196, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_end", file: !57, line: 86, baseType: !415)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !420, file: !57, line: 196, baseType: !55, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "chopt", scope: !393, file: !57, line: 197, baseType: !426, size: 128, offset: 512)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chopt", file: !57, line: 197, size: 128, elements: !427)
!427 = !{!428, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !426, file: !57, line: 197, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_chopt", file: !57, line: 87, baseType: !415)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !426, file: !57, line: 197, baseType: !55, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "preprocess", scope: !393, file: !57, line: 198, baseType: !432, size: 128, offset: 640)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "preprocess", file: !57, line: 198, size: 128, elements: !433)
!433 = !{!434, !440}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !432, file: !57, line: 198, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_preprocess", file: !57, line: 92, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_process", file: !57, line: 88, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!28, !55, !123, !302, !304, !383, !383}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !432, file: !57, line: 198, baseType: !55, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "postprocess", scope: !393, file: !57, line: 199, baseType: !442, size: 128, offset: 768)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "postprocess", file: !57, line: 199, size: 128, elements: !443)
!443 = !{!444, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !442, file: !57, line: 199, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_postprocess", file: !57, line: 93, baseType: !436)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !442, file: !57, line: 199, baseType: !55, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "check_html", scope: !393, file: !57, line: 200, baseType: !448, size: 128, offset: 896)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_html", file: !57, line: 200, size: 128, elements: !449)
!449 = !{!450, !455}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !448, file: !57, line: 200, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_html", file: !57, line: 94, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!28, !55, !123, !67, !28, !383, !383}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !448, file: !57, line: 200, baseType: !55, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !393, file: !57, line: 201, baseType: !457, size: 128, offset: 1024)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query", file: !57, line: 201, size: 128, elements: !458)
!458 = !{!459, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !457, file: !57, line: 201, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query", file: !57, line: 98, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!383, !55, !123, !383}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !457, file: !57, line: 201, baseType: !55, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "query2", scope: !393, file: !57, line: 202, baseType: !466, size: 128, offset: 1152)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query2", file: !57, line: 202, size: 128, elements: !467)
!467 = !{!468, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !466, file: !57, line: 202, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query2", file: !57, line: 101, baseType: !461)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !466, file: !57, line: 202, baseType: !55, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "query3", scope: !393, file: !57, line: 203, baseType: !472, size: 128, offset: 1280)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query3", file: !57, line: 203, size: 128, elements: !473)
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !472, file: !57, line: 203, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_query3", file: !57, line: 104, baseType: !461)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !472, file: !57, line: 203, baseType: !55, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !393, file: !57, line: 204, baseType: !478, size: 128, offset: 1408)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !57, line: 204, size: 128, elements: !479)
!479 = !{!480, !483}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !478, file: !57, line: 204, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_loop", file: !57, line: 107, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !478, file: !57, line: 204, baseType: !55, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "check_link", scope: !393, file: !57, line: 205, baseType: !485, size: 128, offset: 1536)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_link", file: !57, line: 205, size: 128, elements: !486)
!486 = !{!487, !492}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !485, file: !57, line: 205, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_link", file: !57, line: 112, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!28, !55, !123, !383, !383, !28}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !485, file: !57, line: 205, baseType: !55, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "check_mime", scope: !393, file: !57, line: 206, baseType: !494, size: 128, offset: 1664)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "check_mime", file: !57, line: 206, size: 128, elements: !495)
!495 = !{!496, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !494, file: !57, line: 206, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_check_mime", file: !57, line: 115, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!28, !55, !123, !383, !383, !383, !28}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !494, file: !57, line: 206, baseType: !55, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pause", scope: !393, file: !57, line: 207, baseType: !503, size: 128, offset: 1792)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pause", file: !57, line: 207, size: 128, elements: !504)
!504 = !{!505, !510}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !503, file: !57, line: 207, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_pause", file: !57, line: 119, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !55, !123, !383}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !503, file: !57, line: 207, baseType: !55, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "filesave", scope: !393, file: !57, line: 208, baseType: !512, size: 128, offset: 1920)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave", file: !57, line: 208, size: 128, elements: !513)
!513 = !{!514, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !512, file: !57, line: 208, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave", file: !57, line: 121, baseType: !507)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !512, file: !57, line: 208, baseType: !55, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "filesave2", scope: !393, file: !57, line: 209, baseType: !518, size: 128, offset: 2048)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filesave2", file: !57, line: 209, size: 128, elements: !519)
!519 = !{!520, !525}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !518, file: !57, line: 209, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_filesave2", file: !57, line: 123, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !55, !123, !383, !383, !383, !28, !28, !28}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !518, file: !57, line: 209, baseType: !55, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected", scope: !393, file: !57, line: 210, baseType: !527, size: 128, offset: 2176)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected", file: !57, line: 210, size: 128, elements: !528)
!528 = !{!529, !534}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !527, file: !57, line: 210, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected", file: !57, line: 128, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!28, !55, !123, !67}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !527, file: !57, line: 210, baseType: !55, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "linkdetected2", scope: !393, file: !57, line: 211, baseType: !536, size: 128, offset: 2304)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkdetected2", file: !57, line: 211, size: 128, elements: !537)
!537 = !{!538, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !536, file: !57, line: 211, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_linkdetected2", file: !57, line: 130, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!28, !55, !123, !67, !383}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !536, file: !57, line: 211, baseType: !55, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "xfrstatus", scope: !393, file: !57, line: 212, baseType: !545, size: 128, offset: 2432)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xfrstatus", file: !57, line: 212, size: 128, elements: !546)
!546 = !{!547, !724}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !545, file: !57, line: 212, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_xfrstatus", file: !57, line: 133, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!28, !55, !123, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "lien_back", file: !126, line: 555, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lien_back", file: !126, line: 557, size: 135040, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !571, !572, !573, !574, !575, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "url_adr", scope: !554, file: !126, line: 561, baseType: !342, size: 16384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "url_fil", scope: !554, file: !126, line: 562, baseType: !342, size: 16384, offset: 16384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "url_sav", scope: !554, file: !126, line: 563, baseType: !342, size: 16384, offset: 32768)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "referer_adr", scope: !554, file: !126, line: 564, baseType: !342, size: 16384, offset: 49152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "referer_fil", scope: !554, file: !126, line: 565, baseType: !342, size: 16384, offset: 65536)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "location_buffer", scope: !554, file: !126, line: 566, baseType: !342, size: 16384, offset: 81920)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !554, file: !126, line: 567, baseType: !67, size: 64, offset: 98304)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile_buffer", scope: !554, file: !126, line: 568, baseType: !342, size: 16384, offset: 98368)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "send_too", scope: !554, file: !126, line: 569, baseType: !275, size: 8192, offset: 114752)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !554, file: !126, line: 570, baseType: !28, size: 32, offset: 122944)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !554, file: !126, line: 571, baseType: !28, size: 32, offset: 122976)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "testmode", scope: !554, file: !126, line: 572, baseType: !28, size: 32, offset: 123008)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !554, file: !126, line: 573, baseType: !28, size: 32, offset: 123040)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_refresh", scope: !554, file: !126, line: 574, baseType: !570, size: 64, offset: 123072)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "TStamp", file: !196, line: 284, baseType: !168)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rateout", scope: !554, file: !126, line: 575, baseType: !28, size: 32, offset: 123136)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rateout_time", scope: !554, file: !126, line: 576, baseType: !570, size: 64, offset: 123200)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_nonhtml", scope: !554, file: !126, line: 577, baseType: !195, size: 64, offset: 123264)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "maxfile_html", scope: !554, file: !126, line: 578, baseType: !195, size: 64, offset: 123328)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !554, file: !126, line: 579, baseType: !576, size: 8960, offset: 123392)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsblk", file: !126, line: 484, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsblk", file: !126, line: 486, size: 8960, elements: !578)
!578 = !{!579, !580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !598, !602, !603, !604, !605, !606, !607, !609, !668, !669, !670, !671, !676, !677, !681, !682, !683, !684, !685, !686}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "statuscode", scope: !577, file: !126, line: 487, baseType: !28, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "notmodified", scope: !577, file: !126, line: 488, baseType: !581, size: 16, offset: 32)
!581 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "is_write", scope: !577, file: !126, line: 489, baseType: !581, size: 16, offset: 48)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !577, file: !126, line: 490, baseType: !581, size: 16, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !577, file: !126, line: 491, baseType: !581, size: 16, offset: 80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "empty", scope: !577, file: !126, line: 492, baseType: !581, size: 16, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !577, file: !126, line: 493, baseType: !581, size: 16, offset: 112)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_trailers", scope: !577, file: !126, line: 494, baseType: !581, size: 16, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_t", scope: !577, file: !126, line: 495, baseType: !28, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_max", scope: !577, file: !126, line: 496, baseType: !28, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "adr", scope: !577, file: !126, line: 497, baseType: !67, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !577, file: !126, line: 498, baseType: !67, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !577, file: !126, line: 499, baseType: !140, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !577, file: !126, line: 500, baseType: !195, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !577, file: !126, line: 501, baseType: !595, size: 640, offset: 512)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "contenttype", scope: !577, file: !126, line: 502, baseType: !599, size: 512, offset: 1152)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !577, file: !126, line: 503, baseType: !599, size: 512, offset: 1664)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "contentencoding", scope: !577, file: !126, line: 504, baseType: !599, size: 512, offset: 2176)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !577, file: !126, line: 505, baseType: !67, size: 64, offset: 2688)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "totalsize", scope: !577, file: !126, line: 506, baseType: !195, size: 64, offset: 2752)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "is_file", scope: !577, file: !126, line: 507, baseType: !581, size: 16, offset: 2816)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "soc", scope: !577, file: !126, line: 508, baseType: !608, size: 32, offset: 2848)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "T_SOC", file: !196, line: 323, baseType: !28)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !577, file: !126, line: 509, baseType: !610, size: 224, offset: 2880)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCaddr", file: !611, line: 91, baseType: !612)
!611 = !DIFile(filename: "./src/htsnet.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "c991984e387bd7a1b6a2629888d889ed")
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SOCaddr", file: !611, line: 93, size: 224, elements: !613)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "m_addr", scope: !612, file: !611, line: 103, baseType: !615, size: 224)
!615 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !612, file: !611, line: 94, size: 224, elements: !616)
!616 = !{!617, !625, !645}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !615, file: !611, line: 96, baseType: !618, size: 128)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !619, line: 180, size: 128, elements: !620)
!619 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!620 = !{!621, !624}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !618, file: !619, line: 182, baseType: !622, size: 16)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !623, line: 28, baseType: !170)
!623 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !618, file: !619, line: 183, baseType: !19, size: 112, offset: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !615, file: !611, line: 98, baseType: !626, size: 128)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !627, line: 245, size: 128, elements: !628)
!627 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!628 = !{!629, !630, !635, !642}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !626, file: !627, line: 247, baseType: !622, size: 16)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !626, file: !627, line: 248, baseType: !631, size: 16, offset: 16)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !627, line: 123, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !633, line: 25, baseType: !634)
!633 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !167, line: 40, baseType: !170)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !626, file: !627, line: 249, baseType: !636, size: 32, offset: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !627, line: 31, size: 32, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !636, file: !627, line: 33, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !627, line: 30, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !633, line: 26, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !167, line: 42, baseType: !44)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !626, file: !627, line: 252, baseType: !643, size: 64, offset: 64)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 64, elements: !10)
!644 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !615, file: !611, line: 101, baseType: !646, size: 224)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !627, line: 260, size: 224, elements: !647)
!647 = !{!648, !649, !650, !651, !667}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !646, file: !627, line: 262, baseType: !622, size: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !646, file: !627, line: 263, baseType: !631, size: 16, offset: 16)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !646, file: !627, line: 264, baseType: !640, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !646, file: !627, line: 265, baseType: !652, size: 128, offset: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !627, line: 219, size: 128, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !652, file: !627, line: 226, baseType: !655, size: 128)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !652, file: !627, line: 221, size: 128, elements: !656)
!656 = !{!657, !663, !665}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !655, file: !627, line: 223, baseType: !658, size: 128)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 128, elements: !661)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !633, line: 24, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !167, line: 38, baseType: !644)
!661 = !{!662}
!662 = !DISubrange(count: 16)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !655, file: !627, line: 224, baseType: !664, size: 128)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 128, elements: !10)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !655, file: !627, line: 225, baseType: !666, size: 128)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 128, elements: !109)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !646, file: !627, line: 266, baseType: !640, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "address_size", scope: !577, file: !126, line: 510, baseType: !28, size: 32, offset: 3104)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !577, file: !126, line: 511, baseType: !140, size: 64, offset: 3136)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !577, file: !126, line: 513, baseType: !581, size: 16, offset: 3200)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_con", scope: !577, file: !126, line: 515, baseType: !672, size: 64, offset: 3264)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !674, line: 184, baseType: !675)
!674 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !674, line: 184, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lastmodified", scope: !577, file: !126, line: 517, baseType: !599, size: 512, offset: 3328)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "etag", scope: !577, file: !126, line: 518, baseType: !678, size: 2048, offset: 3840)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cdispo", scope: !577, file: !126, line: 519, baseType: !678, size: 2048, offset: 5888)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "crange", scope: !577, file: !126, line: 520, baseType: !195, size: 64, offset: 7936)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "crange_start", scope: !577, file: !126, line: 521, baseType: !195, size: 64, offset: 8000)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "crange_end", scope: !577, file: !126, line: 522, baseType: !195, size: 64, offset: 8064)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "debugid", scope: !577, file: !126, line: 523, baseType: !28, size: 32, offset: 8128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "req", scope: !577, file: !126, line: 525, baseType: !687, size: 768, offset: 8192)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest", file: !126, line: 463, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest", file: !126, line: 465, size: 768, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent_send", scope: !688, file: !126, line: 466, baseType: !581, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !688, file: !126, line: 467, baseType: !581, size: 16, offset: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "nokeepalive", scope: !688, file: !126, line: 468, baseType: !581, size: 16, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "range_used", scope: !688, file: !126, line: 469, baseType: !581, size: 16, offset: 48)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nocompression", scope: !688, file: !126, line: 470, baseType: !581, size: 16, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flush_garbage", scope: !688, file: !126, line: 471, baseType: !581, size: 16, offset: 80)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "user_agent", scope: !688, file: !126, line: 472, baseType: !383, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "referer", scope: !688, file: !126, line: 473, baseType: !383, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !688, file: !126, line: 474, baseType: !383, size: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_iso", scope: !688, file: !126, line: 475, baseType: !383, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !688, file: !126, line: 476, baseType: !383, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !688, file: !126, line: 477, baseType: !383, size: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !688, file: !126, line: 478, baseType: !703, size: 256, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsrequest_proxy", file: !126, line: 452, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsrequest_proxy", file: !126, line: 454, size: 256, elements: !705)
!705 = !{!706, !707, !708, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !704, file: !126, line: 455, baseType: !28, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !126, line: 456, baseType: !383, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !704, file: !126, line: 457, baseType: !28, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bindhost", scope: !704, file: !126, line: 458, baseType: !383, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "is_update", scope: !554, file: !126, line: 580, baseType: !28, size: 32, offset: 132352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "head_request", scope: !554, file: !126, line: 581, baseType: !28, size: 32, offset: 132384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "range_req_size", scope: !554, file: !126, line: 582, baseType: !195, size: 64, offset: 132416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ka_time_start", scope: !554, file: !126, line: 583, baseType: !570, size: 64, offset: 132480)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "http11", scope: !554, file: !126, line: 585, baseType: !28, size: 32, offset: 132544)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "is_chunk", scope: !554, file: !126, line: 586, baseType: !28, size: 32, offset: 132576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_adr", scope: !554, file: !126, line: 587, baseType: !67, size: 64, offset: 132608)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !554, file: !126, line: 588, baseType: !195, size: 64, offset: 132672)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_blocksize", scope: !554, file: !126, line: 589, baseType: !195, size: 64, offset: 132736)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !554, file: !126, line: 590, baseType: !195, size: 64, offset: 132800)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !554, file: !126, line: 594, baseType: !678, size: 2048, offset: 132864)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "stop_ftp", scope: !554, file: !126, line: 595, baseType: !28, size: 32, offset: 134912)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "finalized", scope: !554, file: !126, line: 596, baseType: !28, size: 32, offset: 134944)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "early_add", scope: !554, file: !126, line: 597, baseType: !28, size: 32, offset: 134976)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !545, file: !57, line: 212, baseType: !55, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "savename", scope: !393, file: !57, line: 213, baseType: !726, size: 128, offset: 2560)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savename", file: !57, line: 213, size: 128, elements: !727)
!727 = !{!728, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !726, file: !57, line: 213, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_savename", file: !57, line: 135, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!28, !55, !123, !383, !383, !383, !383, !67}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !726, file: !57, line: 213, baseType: !55, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sendhead", scope: !393, file: !57, line: 214, baseType: !735, size: 128, offset: 2688)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendhead", file: !57, line: 214, size: 128, elements: !736)
!736 = !{!737, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !735, file: !57, line: 214, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_sendhead", file: !57, line: 142, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!28, !55, !123, !67, !383, !383, !383, !383, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !735, file: !57, line: 214, baseType: !55, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "receivehead", scope: !393, file: !57, line: 215, baseType: !745, size: 128, offset: 2816)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "receivehead", file: !57, line: 215, size: 128, elements: !746)
!746 = !{!747, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !745, file: !57, line: 215, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_receivehead", file: !57, line: 148, baseType: !739)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !745, file: !57, line: 215, baseType: !55, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "detect", scope: !393, file: !57, line: 216, baseType: !751, size: 128, offset: 2944)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "detect", file: !57, line: 216, size: 128, elements: !752)
!752 = !{!753, !761}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !751, file: !57, line: 216, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_detect", file: !57, line: 156, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!28, !55, !123, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmoduleStruct", file: !57, line: 56, baseType: !760)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "htsmoduleStruct", file: !57, line: 56, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !751, file: !57, line: 216, baseType: !55, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !393, file: !57, line: 217, baseType: !763, size: 128, offset: 3072)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse", file: !57, line: 217, size: 128, elements: !764)
!764 = !{!765, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !763, file: !57, line: 217, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_parse", file: !57, line: 158, baseType: !755)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !763, file: !57, line: 217, baseType: !55, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "extsavename", scope: !393, file: !57, line: 219, baseType: !769, size: 128, offset: 3200)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extsavename", file: !57, line: 219, size: 128, elements: !770)
!770 = !{!771, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !769, file: !57, line: 219, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_hts_htmlcheck_extsavename", file: !57, line: 141, baseType: !729)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "carg", scope: !769, file: !57, line: 219, baseType: !55, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "libHandles", scope: !125, file: !126, line: 404, baseType: !775, size: 128, offset: 7040)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandles", file: !126, line: 260, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandles", file: !126, line: 270, size: 128, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !776, file: !126, line: 271, baseType: !28, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !776, file: !126, line: 272, baseType: !780, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "htslibhandle", file: !126, line: 264, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htslibhandle", file: !126, line: 266, size: 128, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "moduleName", scope: !782, file: !126, line: 267, baseType: !67, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !782, file: !126, line: 268, baseType: !61, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !125, file: !126, line: 406, baseType: !787, size: 1126016, offset: 7168)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstate", file: !126, line: 216, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstate", file: !126, line: 218, size: 1126016, elements: !789)
!789 = !{!790, !825, !826, !827, !828, !829, !830, !831, !832, !838, !850, !858, !864, !871, !872, !873, !874, !885, !886, !890, !891, !892, !893, !894, !895, !896, !897, !904, !905, !906, !907}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !788, file: !126, line: 219, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsmutex", file: !126, line: 204, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsmutex_s", file: !794, line: 59, size: 320, elements: !795)
!794 = !DIFile(filename: "./src/htsthread.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "10292f5118e1d20eed3b8b192b447e74")
!795 = !{!796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !793, file: !794, line: 60, baseType: !797, size: 320)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !798, line: 72, baseType: !799)
!798 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !798, line: 67, size: 320, elements: !800)
!800 = !{!801, !820, !824}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !799, file: !798, line: 69, baseType: !802, size: 320)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !803, line: 22, size: 320, elements: !804)
!803 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !802, file: !803, line: 24, baseType: !28, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !802, file: !803, line: 25, baseType: !44, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !802, file: !803, line: 26, baseType: !28, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !802, file: !803, line: 28, baseType: !44, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !802, file: !803, line: 32, baseType: !28, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !802, file: !803, line: 34, baseType: !581, size: 16, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !802, file: !803, line: 35, baseType: !581, size: 16, offset: 176)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !802, file: !803, line: 36, baseType: !813, size: 128, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !814, line: 55, baseType: !815)
!814 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !814, line: 51, size: 128, elements: !816)
!816 = !{!817, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !815, file: !814, line: 53, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !815, file: !814, line: 54, baseType: !818, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !799, file: !798, line: 70, baseType: !821, size: 320)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 40)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !799, file: !798, line: 71, baseType: !168, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !788, file: !126, line: 221, baseType: !28, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exit_xh", scope: !788, file: !126, line: 222, baseType: !28, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "back_add_stats", scope: !788, file: !126, line: 223, baseType: !28, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mimehtml_created", scope: !788, file: !126, line: 225, baseType: !28, size: 32, offset: 160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mimemid", scope: !788, file: !126, line: 226, baseType: !220, size: 192, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mimefp", scope: !788, file: !126, line: 227, baseType: !140, size: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "delayedId", scope: !788, file: !126, line: 228, baseType: !28, size: 32, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "strc", scope: !788, file: !126, line: 230, baseType: !833, size: 32832, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenote_strc", file: !126, line: 121, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filenote_strc", file: !126, line: 123, size: 32832, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lst", scope: !834, file: !126, line: 124, baseType: !140, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !834, file: !126, line: 125, baseType: !369, size: 32768, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !788, file: !126, line: 232, baseType: !839, size: 192, offset: 33344)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacks", file: !126, line: 111, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htscallbacks", file: !126, line: 112, size: 192, elements: !841)
!841 = !{!842, !843, !848}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "moduleHandle", scope: !840, file: !126, line: 113, baseType: !61, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "exitFnc", scope: !840, file: !126, line: 114, baseType: !844, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "htscallbacksfncptr", file: !126, line: 110, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!28}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !126, line: 115, baseType: !849, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "concat", scope: !788, file: !126, line: 233, baseType: !851, size: 1048608, offset: 33536)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "concat_strc", file: !126, line: 131, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_strc", file: !126, line: 133, size: 1048608, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !852, file: !126, line: 134, baseType: !28, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !852, file: !126, line: 135, baseType: !856, size: 1048576, offset: 32)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1048576, elements: !857)
!857 = !{!662, !349}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "usercmd", scope: !788, file: !126, line: 234, baseType: !859, size: 16416, offset: 1082144)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "usercommand_strc", file: !126, line: 153, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usercommand_strc", file: !126, line: 155, size: 16416, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "exe", scope: !860, file: !126, line: 156, baseType: !28, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !860, file: !126, line: 157, baseType: !342, size: 16384, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fspc", scope: !788, file: !126, line: 235, baseType: !865, size: 96, offset: 1098560)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "fspc_strc", file: !126, line: 163, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fspc_strc", file: !126, line: 165, size: 96, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !866, file: !126, line: 166, baseType: !28, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "warning", scope: !866, file: !126, line: 167, baseType: !28, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !866, file: !126, line: 168, baseType: !28, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "userhttptype", scope: !788, file: !126, line: 236, baseType: !67, size: 64, offset: 1098688)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "verif_backblue_done", scope: !788, file: !126, line: 237, baseType: !28, size: 32, offset: 1098752)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "verif_external_status", scope: !788, file: !126, line: 238, baseType: !28, size: 32, offset: 1098784)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache", scope: !788, file: !126, line: 239, baseType: !875, size: 64, offset: 1098816)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_dnscache", file: !126, line: 53, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_dnscache", file: !878, line: 150, size: 704, elements: !879)
!878 = !DIFile(filename: "./src/htslib.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "b8775ab5fd3d72ae1f56a38e4cc386f9")
!879 = !{!880, !882, !883, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !877, file: !878, line: 151, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "iadr", scope: !877, file: !878, line: 152, baseType: !383, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "host_length", scope: !877, file: !878, line: 153, baseType: !68, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "host_addr", scope: !877, file: !878, line: 154, baseType: !599, size: 512, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dns_cache_nthreads", scope: !788, file: !126, line: 240, baseType: !28, size: 32, offset: 1098880)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_errmsg", scope: !788, file: !126, line: 242, baseType: !887, size: 10240, offset: 1098912)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 10240, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_parsing", scope: !788, file: !126, line: 243, baseType: !28, size: 32, offset: 1109152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_done", scope: !788, file: !126, line: 244, baseType: !28, size: 32, offset: 1109184)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_html_poll", scope: !788, file: !126, line: 245, baseType: !28, size: 32, offset: 1109216)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_setpause", scope: !788, file: !126, line: 246, baseType: !28, size: 32, offset: 1109248)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_in_mirror", scope: !788, file: !126, line: 247, baseType: !28, size: 32, offset: 1109280)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_addurl", scope: !788, file: !126, line: 248, baseType: !302, size: 64, offset: 1109312)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_hts_cancel", scope: !788, file: !126, line: 249, baseType: !28, size: 32, offset: 1109376)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !788, file: !126, line: 250, baseType: !898, size: 64, offset: 1109440)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "htsoptstatecancel", file: !126, line: 194, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htsoptstatecancel", file: !126, line: 196, size: 128, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !900, file: !126, line: 197, baseType: !67, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !900, file: !126, line: 198, baseType: !898, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "HTbuff", scope: !788, file: !126, line: 251, baseType: !342, size: 16384, offset: 1109504)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "debug_state", scope: !788, file: !126, line: 252, baseType: !44, size: 32, offset: 1125888)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "tmpnameid", scope: !788, file: !126, line: 253, baseType: !44, size: 32, offset: 1125920)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "is_ended", scope: !788, file: !126, line: 254, baseType: !28, size: 32, offset: 1125952)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "hts_stat_struct", file: !43, line: 70, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hts_stat_struct", file: !126, line: 414, size: 1344, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918, !922, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "HTS_TOTAL_RECV", scope: !910, file: !126, line: 415, baseType: !195, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "stat_bytes", scope: !910, file: !126, line: 416, baseType: !195, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "stat_timestart", scope: !910, file: !126, line: 418, baseType: !570, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "total_packed", scope: !910, file: !126, line: 420, baseType: !195, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "total_unpacked", scope: !910, file: !126, line: 421, baseType: !195, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "total_packedfiles", scope: !910, file: !126, line: 422, baseType: !28, size: 32, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "istat_timestart", scope: !910, file: !126, line: 424, baseType: !919, size: 128, offset: 384)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 128, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 2)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "istat_bytes", scope: !910, file: !126, line: 425, baseType: !923, size: 128, offset: 512)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 128, elements: !920)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "istat_reference01", scope: !910, file: !126, line: 426, baseType: !570, size: 64, offset: 640)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "istat_idlasttimer", scope: !910, file: !126, line: 427, baseType: !28, size: 32, offset: 704)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "stat_files", scope: !910, file: !126, line: 429, baseType: !28, size: 32, offset: 736)
