; ModuleID = 'src/minizip/ioapi.c'
source_filename = "src/minizip/ioapi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.zlib_filefunc64_32_def_s = type { %struct.zlib_filefunc64_def_s, ptr, ptr, ptr }
%struct.zlib_filefunc64_def_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.zlib_filefunc_def_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"r+b\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [3 x i8] c"wb\00", align 1, !dbg !12

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @call_zopen64(ptr noundef %0, ptr noundef %1, i32 noundef %2) #0 !dbg !94 {
  %4 = alloca ptr, align 8
  %5 = alloca ptr, align 8
  %6 = alloca ptr, align 8
  %7 = alloca i32, align 4
  store ptr %0, ptr %5, align 8
  call void @llvm.dbg.declare(metadata ptr %5, metadata !160, metadata !DIExpression()), !dbg !161
  store ptr %1, ptr %6, align 8
  call void @llvm.dbg.declare(metadata ptr %6, metadata !162, metadata !DIExpression()), !dbg !163
  store i32 %2, ptr %7, align 4
  call void @llvm.dbg.declare(metadata ptr %7, metadata !164, metadata !DIExpression()), !dbg !165
  %8 = load ptr, ptr %5, align 8, !dbg !166
  %9 = getelementptr inbounds %struct.zlib_filefunc64_32_def_s, ptr %8, i32 0, i32 0, !dbg !168

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/minizip/ioapi.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "e7fa8173386f38099c38d21f1c1c7527")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 3)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 4)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !3, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !15, globals: !85, splitDebugInlining: false, nameTableKind: None)
!15 = !{!16, !17, !19, !22, !25, !27}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !20, line: 394, baseType: !21)
!20 = !DIFile(filename: "/usr/include/zconf.h", directory: "", checksumkind: CSK_MD5, checksum: "95e83c46958f6395f746c80cc6799e76")
!21 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZPOS64_T", file: !23, line: 118, baseType: !24)
!23 = !DIFile(filename: "src/minizip/ioapi.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a4dac867a80298bfdbdc2d3a375e5352")
!24 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 46, baseType: !21)
!26 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 7, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!32 = !{!33, !35, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !50, !52, !53, !54, !58, !60, !62, !66, !69, !71, !74, !77, !78, !79, !80, !81}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !30, file: !31, line: 51, baseType: !34, size: 32)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !30, file: !31, line: 54, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !30, file: !31, line: 55, baseType: !36, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !30, file: !31, line: 56, baseType: !36, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !30, file: !31, line: 57, baseType: !36, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !30, file: !31, line: 58, baseType: !36, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !30, file: !31, line: 59, baseType: !36, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !30, file: !31, line: 60, baseType: !36, size: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !30, file: !31, line: 61, baseType: !36, size: 64, offset: 512)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !30, file: !31, line: 64, baseType: !36, size: 64, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !30, file: !31, line: 65, baseType: !36, size: 64, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !30, file: !31, line: 66, baseType: !36, size: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !30, file: !31, line: 68, baseType: !48, size: 64, offset: 768)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !31, line: 36, flags: DIFlagFwdDecl)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !30, file: !31, line: 70, baseType: !51, size: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !30, file: !31, line: 72, baseType: !34, size: 32, offset: 896)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !30, file: !31, line: 73, baseType: !34, size: 32, offset: 928)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !30, file: !31, line: 74, baseType: !55, size: 64, offset: 960)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 152, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!57 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !30, file: !31, line: 77, baseType: !59, size: 16, offset: 1024)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !30, file: !31, line: 78, baseType: !61, size: 8, offset: 1040)
!61 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !30, file: !31, line: 79, baseType: !63, size: 8, offset: 1048)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !30, file: !31, line: 81, baseType: !67, size: 64, offset: 1088)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !31, line: 43, baseType: null)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !30, file: !31, line: 89, baseType: !70, size: 64, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 153, baseType: !57)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !30, file: !31, line: 91, baseType: !72, size: 64, offset: 1216)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !31, line: 37, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !30, file: !31, line: 92, baseType: !75, size: 64, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !31, line: 38, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !30, file: !31, line: 93, baseType: !51, size: 64, offset: 1344)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !30, file: !31, line: 94, baseType: !16, size: 64, offset: 1408)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !30, file: !31, line: 95, baseType: !25, size: 64, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !30, file: !31, line: 96, baseType: !34, size: 32, offset: 1536)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !30, file: !31, line: 98, baseType: !82, size: 160, offset: 1568)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 20)
!85 = !{!0, !7, !12}
!86 = !{i32 7, !"Dwarf Version", i32 5}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = !{i32 8, !"PIC Level", i32 2}
!90 = !{i32 7, !"PIE Level", i32 2}
!91 = !{i32 7, !"uwtable", i32 2}
!92 = !{i32 7, !"frame-pointer", i32 2}
!93 = !{!"clang version 16.0.0"}
!94 = distinct !DISubprogram(name: "call_zopen64", scope: !2, file: !2, line: 31, type: !95, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !159)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !98, !112, !34}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !20, line: 409, baseType: !16)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc64_32_def", file: !23, line: 205, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc64_32_def_s", file: !23, line: 199, size: 768, elements: !102)
!102 = !{!103, !144, !149, !154}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "zfile_func64", scope: !101, file: !23, line: 201, baseType: !104, size: 576)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc64_def", file: !23, line: 193, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc64_def_s", file: !23, line: 182, size: 576, elements: !106)
!106 = !{!107, !114, !119, !124, !129, !134, !139, !141, !143}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "zopen64_file", scope: !105, file: !23, line: 184, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "open64_file_func", file: !23, line: 180, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!97, !97, !112, !34}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "zread_file", scope: !105, file: !23, line: 185, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "read_file_func", file: !23, line: 154, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!19, !97, !97, !16, !19}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "zwrite_file", scope: !105, file: !23, line: 186, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "write_file_func", file: !23, line: 155, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!19, !97, !97, !112, !19}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "zflush_file", scope: !105, file: !23, line: 187, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "flush_file_func", file: !23, line: 156, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!34, !97, !97}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ztell64_file", scope: !105, file: !23, line: 188, baseType: !130, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "tell64_file_func", file: !23, line: 178, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!22, !97, !97}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "zseek64_file", scope: !105, file: !23, line: 189, baseType: !135, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "seek64_file_func", file: !23, line: 179, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!57, !97, !97, !22, !34}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "zclose_file", scope: !105, file: !23, line: 190, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "close_file_func", file: !23, line: 157, baseType: !126)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "zerror_file", scope: !105, file: !23, line: 191, baseType: !142, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "testerror_file_func", file: !23, line: 158, baseType: !126)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !105, file: !23, line: 192, baseType: !97, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "zopen32_file", scope: !101, file: !23, line: 202, baseType: !145, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "open_file_func", file: !23, line: 153, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!97, !97, !17, !34}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ztell32_file", scope: !101, file: !23, line: 203, baseType: !150, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "tell_file_func", file: !23, line: 160, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!57, !97, !97}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "zseek32_file", scope: !101, file: !23, line: 204, baseType: !155, size: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "seek_file_func", file: !23, line: 161, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!57, !97, !97, !19, !34}
!159 = !{}
!160 = !DILocalVariable(name: "pfilefunc", arg: 1, scope: !94, file: !2, line: 31, type: !98)
!161 = !DILocation(line: 31, column: 52, scope: !94)
!162 = !DILocalVariable(name: "filename", arg: 2, scope: !94, file: !2, line: 31, type: !112)
!163 = !DILocation(line: 31, column: 73, scope: !94)
!164 = !DILocalVariable(name: "mode", arg: 3, scope: !94, file: !2, line: 31, type: !34)
!165 = !DILocation(line: 31, column: 86, scope: !94)
!166 = !DILocation(line: 33, column: 9, scope: !167)
!167 = distinct !DILexicalBlock(scope: !94, file: !2, line: 33, column: 9)
!168 = !DILocation(line: 33, column: 20, scope: !167)
!169 = !DILocation(line: 33, column: 33, scope: !167)
!170 = !DILocation(line: 33, column: 46, scope: !167)
!171 = !DILocation(line: 33, column: 9, scope: !94)
!172 = !DILocation(line: 34, column: 19, scope: !167)
!173 = !DILocation(line: 34, column: 30, scope: !167)
!174 = !DILocation(line: 34, column: 43, scope: !167)
!175 = !DILocation(line: 34, column: 59, scope: !167)
!176 = !DILocation(line: 34, column: 70, scope: !167)
!177 = !DILocation(line: 34, column: 83, scope: !167)
!178 = !DILocation(line: 34, column: 90, scope: !167)
!179 = !DILocation(line: 34, column: 99, scope: !167)
!180 = !DILocation(line: 34, column: 16, scope: !167)
!181 = !DILocation(line: 34, column: 9, scope: !167)
!182 = !DILocation(line: 37, column: 19, scope: !183)
!183 = distinct !DILexicalBlock(scope: !167, file: !2, line: 36, column: 5)
!184 = !DILocation(line: 37, column: 30, scope: !183)
!185 = !DILocation(line: 37, column: 45, scope: !183)
!186 = !DILocation(line: 37, column: 56, scope: !183)
!187 = !DILocation(line: 37, column: 69, scope: !183)
!188 = !DILocation(line: 37, column: 89, scope: !183)
!189 = !DILocation(line: 37, column: 98, scope: !183)
!190 = !DILocation(line: 37, column: 16, scope: !183)
!191 = !DILocation(line: 37, column: 9, scope: !183)
!192 = !DILocation(line: 39, column: 1, scope: !94)
!193 = distinct !DISubprogram(name: "call_zseek64", scope: !2, file: !2, line: 41, type: !194, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !159)
!194 = !DISubroutineType(types: !195)
!195 = !{!57, !98, !97, !22, !34}
!196 = !DILocalVariable(name: "pfilefunc", arg: 1, scope: !193, file: !2, line: 41, type: !98)
!197 = !DILocation(line: 41, column: 50, scope: !193)
!198 = !DILocalVariable(name: "filestream", arg: 2, scope: !193, file: !2, line: 41, type: !97)
!199 = !DILocation(line: 41, column: 67, scope: !193)
!200 = !DILocalVariable(name: "offset", arg: 3, scope: !193, file: !2, line: 41, type: !22)
!201 = !DILocation(line: 41, column: 88, scope: !193)
!202 = !DILocalVariable(name: "origin", arg: 4, scope: !193, file: !2, line: 41, type: !34)
!203 = !DILocation(line: 41, column: 100, scope: !193)
!204 = !DILocation(line: 43, column: 9, scope: !205)
!205 = distinct !DILexicalBlock(scope: !193, file: !2, line: 43, column: 9)
!206 = !DILocation(line: 43, column: 20, scope: !205)
!207 = !DILocation(line: 43, column: 33, scope: !205)
!208 = !DILocation(line: 43, column: 46, scope: !205)
!209 = !DILocation(line: 43, column: 9, scope: !193)
!210 = !DILocation(line: 44, column: 19, scope: !205)
!211 = !DILocation(line: 44, column: 30, scope: !205)
!212 = !DILocation(line: 44, column: 43, scope: !205)
!213 = !DILocation(line: 44, column: 59, scope: !205)
!214 = !DILocation(line: 44, column: 70, scope: !205)
!215 = !DILocation(line: 44, column: 83, scope: !205)
!216 = !DILocation(line: 44, column: 90, scope: !205)
!217 = !DILocation(line: 44, column: 101, scope: !205)
!218 = !DILocation(line: 44, column: 108, scope: !205)
!219 = !DILocation(line: 44, column: 16, scope: !205)
!220 = !DILocation(line: 44, column: 9, scope: !205)
!221 = !DILocalVariable(name: "offsetTruncated", scope: !222, file: !2, line: 47, type: !19)
!222 = distinct !DILexicalBlock(scope: !205, file: !2, line: 46, column: 5)
!223 = !DILocation(line: 47, column: 15, scope: !222)
!224 = !DILocation(line: 47, column: 40, scope: !222)
!225 = !DILocation(line: 48, column: 13, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !2, line: 48, column: 13)
!227 = !DILocation(line: 48, column: 32, scope: !226)
!228 = !DILocation(line: 48, column: 29, scope: !226)
!229 = !DILocation(line: 48, column: 13, scope: !222)
!230 = !DILocation(line: 49, column: 13, scope: !226)
!231 = !DILocation(line: 51, column: 23, scope: !226)
!232 = !DILocation(line: 51, column: 34, scope: !226)
!233 = !DILocation(line: 51, column: 49, scope: !226)
!234 = !DILocation(line: 51, column: 60, scope: !226)
!235 = !DILocation(line: 51, column: 73, scope: !226)
!236 = !DILocation(line: 51, column: 80, scope: !226)
!237 = !DILocation(line: 51, column: 91, scope: !226)
!238 = !DILocation(line: 51, column: 107, scope: !226)
!239 = !DILocation(line: 51, column: 20, scope: !226)
!240 = !DILocation(line: 51, column: 13, scope: !226)
!241 = !DILocation(line: 53, column: 1, scope: !193)
!242 = distinct !DISubprogram(name: "call_ztell64", scope: !2, file: !2, line: 55, type: !243, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !159)
!243 = !DISubroutineType(types: !244)
!244 = !{!22, !98, !97}
!245 = !DILocalVariable(name: "pfilefunc", arg: 1, scope: !242, file: !2, line: 55, type: !98)
!246 = !DILocation(line: 55, column: 54, scope: !242)
!247 = !DILocalVariable(name: "filestream", arg: 2, scope: !242, file: !2, line: 55, type: !97)
!248 = !DILocation(line: 55, column: 71, scope: !242)
!249 = !DILocation(line: 57, column: 9, scope: !250)
!250 = distinct !DILexicalBlock(scope: !242, file: !2, line: 57, column: 9)
!251 = !DILocation(line: 57, column: 20, scope: !250)
!252 = !DILocation(line: 57, column: 33, scope: !250)
!253 = !DILocation(line: 57, column: 46, scope: !250)
!254 = !DILocation(line: 57, column: 9, scope: !242)
!255 = !DILocation(line: 58, column: 19, scope: !250)
!256 = !DILocation(line: 58, column: 30, scope: !250)
!257 = !DILocation(line: 58, column: 43, scope: !250)
!258 = !DILocation(line: 58, column: 59, scope: !250)
!259 = !DILocation(line: 58, column: 70, scope: !250)
!260 = !DILocation(line: 58, column: 83, scope: !250)
!261 = !DILocation(line: 58, column: 90, scope: !250)
!262 = !DILocation(line: 58, column: 16, scope: !250)
!263 = !DILocation(line: 58, column: 9, scope: !250)
!264 = !DILocalVariable(name: "tell_uLong", scope: !265, file: !2, line: 61, type: !19)
!265 = distinct !DILexicalBlock(scope: !250, file: !2, line: 60, column: 5)
!266 = !DILocation(line: 61, column: 15, scope: !265)
!267 = !DILocation(line: 61, column: 31, scope: !265)
!268 = !DILocation(line: 61, column: 42, scope: !265)
!269 = !DILocation(line: 61, column: 57, scope: !265)
!270 = !DILocation(line: 61, column: 68, scope: !265)
!271 = !DILocation(line: 61, column: 81, scope: !265)
!272 = !DILocation(line: 61, column: 88, scope: !265)
!273 = !DILocation(line: 61, column: 28, scope: !265)
!274 = !DILocation(line: 62, column: 14, scope: !275)
!275 = distinct !DILexicalBlock(scope: !265, file: !2, line: 62, column: 13)
!276 = !DILocation(line: 62, column: 26, scope: !275)
!277 = !DILocation(line: 62, column: 13, scope: !265)
!278 = !DILocation(line: 63, column: 13, scope: !275)
!279 = !DILocation(line: 65, column: 20, scope: !275)
!280 = !DILocation(line: 65, column: 13, scope: !275)
!281 = !DILocation(line: 67, column: 1, scope: !242)
!282 = distinct !DISubprogram(name: "fill_zlib_filefunc64_32_def_from_filefunc32", scope: !2, file: !2, line: 69, type: !283, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !159)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285, !286}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc_def", file: !23, line: 176, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc_def_s", file: !23, line: 165, size: 576, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "zopen_file", scope: !289, file: !23, line: 167, baseType: !145, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "zread_file", scope: !289, file: !23, line: 168, baseType: !115, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "zwrite_file", scope: !289, file: !23, line: 169, baseType: !120, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "zflush_file", scope: !289, file: !23, line: 170, baseType: !125, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ztell_file", scope: !289, file: !23, line: 171, baseType: !150, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "zseek_file", scope: !289, file: !23, line: 172, baseType: !155, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "zclose_file", scope: !289, file: !23, line: 173, baseType: !140, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "zerror_file", scope: !289, file: !23, line: 174, baseType: !142, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !289, file: !23, line: 175, baseType: !97, size: 64, offset: 512)
!300 = !DILocalVariable(name: "p_filefunc64_32", arg: 1, scope: !282, file: !2, line: 69, type: !285)
!301 = !DILocation(line: 69, column: 74, scope: !282)
!302 = !DILocalVariable(name: "p_filefunc32", arg: 2, scope: !282, file: !2, line: 69, type: !286)
!303 = !DILocation(line: 69, column: 115, scope: !282)
!304 = !DILocation(line: 71, column: 5, scope: !282)
!305 = !DILocation(line: 71, column: 22, scope: !282)
!306 = !DILocation(line: 71, column: 35, scope: !282)
!307 = !DILocation(line: 71, column: 48, scope: !282)
!308 = !DILocation(line: 72, column: 37, scope: !282)
!309 = !DILocation(line: 72, column: 51, scope: !282)
!310 = !DILocation(line: 72, column: 5, scope: !282)
!311 = !DILocation(line: 72, column: 22, scope: !282)
!312 = !DILocation(line: 72, column: 35, scope: !282)
!313 = !DILocation(line: 73, column: 49, scope: !282)
!314 = !DILocation(line: 73, column: 63, scope: !282)
!315 = !DILocation(line: 73, column: 5, scope: !282)
!316 = !DILocation(line: 73, column: 22, scope: !282)
!317 = !DILocation(line: 73, column: 35, scope: !282)
!318 = !DILocation(line: 73, column: 47, scope: !282)
!319 = !DILocation(line: 74, column: 48, scope: !282)
!320 = !DILocation(line: 74, column: 62, scope: !282)
!321 = !DILocation(line: 74, column: 5, scope: !282)
!322 = !DILocation(line: 74, column: 22, scope: !282)
!323 = !DILocation(line: 74, column: 35, scope: !282)
!324 = !DILocation(line: 74, column: 46, scope: !282)
!325 = !DILocation(line: 75, column: 49, scope: !282)
!326 = !DILocation(line: 75, column: 63, scope: !282)
!327 = !DILocation(line: 75, column: 5, scope: !282)
!328 = !DILocation(line: 75, column: 22, scope: !282)
!329 = !DILocation(line: 75, column: 35, scope: !282)
!330 = !DILocation(line: 75, column: 47, scope: !282)
!331 = !DILocation(line: 76, column: 49, scope: !282)
!332 = !DILocation(line: 76, column: 63, scope: !282)
!333 = !DILocation(line: 76, column: 5, scope: !282)
!334 = !DILocation(line: 76, column: 22, scope: !282)
!335 = !DILocation(line: 76, column: 35, scope: !282)
!336 = !DILocation(line: 76, column: 47, scope: !282)
!337 = !DILocation(line: 77, column: 5, scope: !282)
!338 = !DILocation(line: 77, column: 22, scope: !282)
!339 = !DILocation(line: 77, column: 35, scope: !282)
!340 = !DILocation(line: 77, column: 48, scope: !282)
!341 = !DILocation(line: 78, column: 5, scope: !282)
!342 = !DILocation(line: 78, column: 22, scope: !282)
!343 = !DILocation(line: 78, column: 35, scope: !282)
!344 = !DILocation(line: 78, column: 48, scope: !282)
!345 = !DILocation(line: 79, column: 49, scope: !282)
!346 = !DILocation(line: 79, column: 63, scope: !282)
!347 = !DILocation(line: 79, column: 5, scope: !282)
!348 = !DILocation(line: 79, column: 22, scope: !282)
!349 = !DILocation(line: 79, column: 35, scope: !282)
!350 = !DILocation(line: 79, column: 47, scope: !282)
!351 = !DILocation(line: 80, column: 49, scope: !282)
!352 = !DILocation(line: 80, column: 63, scope: !282)
!353 = !DILocation(line: 80, column: 5, scope: !282)
!354 = !DILocation(line: 80, column: 22, scope: !282)
!355 = !DILocation(line: 80, column: 35, scope: !282)
!356 = !DILocation(line: 80, column: 47, scope: !282)
!357 = !DILocation(line: 81, column: 44, scope: !282)
!358 = !DILocation(line: 81, column: 58, scope: !282)
!359 = !DILocation(line: 81, column: 5, scope: !282)
!360 = !DILocation(line: 81, column: 22, scope: !282)
!361 = !DILocation(line: 81, column: 35, scope: !282)
!362 = !DILocation(line: 81, column: 42, scope: !282)
!363 = !DILocation(line: 82, column: 37, scope: !282)
!364 = !DILocation(line: 82, column: 51, scope: !282)
!365 = !DILocation(line: 82, column: 5, scope: !282)
!366 = !DILocation(line: 82, column: 22, scope: !282)
!367 = !DILocation(line: 82, column: 35, scope: !282)
!368 = !DILocation(line: 83, column: 37, scope: !282)
!369 = !DILocation(line: 83, column: 51, scope: !282)
