; ModuleID = 'src/proxy/main.c'
source_filename = "src/proxy/main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [67 x i8] c"ProxyTrack %s, build proxies upon HTTrack Website Copier Archives\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"0.5\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [61 x i8] c"Copyright (C) 1998-2015 Xavier Roche and other contributors\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [70 x i8] c"This program is free software: you can redistribute it and/or modify\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [70 x i8] c"it under the terms of the GNU General Public License as published by\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [67 x i8] c"the Free Software Foundation, either version 3 of the License, or\0A\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [37 x i8] c"(at your option) any later version.\0A\00", align 1, !dbg !31
@.str.8 = private unnamed_addr constant [47 x i8] c"*** This version is a development release ***\0A\00", align 1, !dbg !36
@.str.9 = private unnamed_addr constant [10 x i8] c"--convert\00", align 1, !dbg !41
@stderr = external global ptr, align 8

!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "PT_Indexes", file: !155, line: 43, baseType: !156)
!155 = !DIFile(filename: "src/proxy/store.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "9785946b503d39f34aeb925b5fa1a2c6")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PT_Indexes", file: !155, line: 40, flags: DIFlagFwdDecl)
!158 = !DILocation(line: 70, column: 14, scope: !128)
!159 = !DILocation(line: 92, column: 3, scope: !128)
!160 = !DILocation(line: 94, column: 3, scope: !128)
!161 = !DILocation(line: 95, column: 3, scope: !128)
!162 = !DILocation(line: 96, column: 3, scope: !128)
!163 = !DILocation(line: 97, column: 3, scope: !128)
!164 = !DILocation(line: 98, column: 3, scope: !128)
!165 = !DILocation(line: 99, column: 3, scope: !128)
!166 = !DILocation(line: 100, column: 3, scope: !128)
!167 = !DILocation(line: 101, column: 3, scope: !128)
!168 = !DILocation(line: 102, column: 3, scope: !128)
!169 = !DILocation(line: 103, column: 7, scope: !170)
!170 = distinct !DILexicalBlock(scope: !128, file: !2, line: 103, column: 7)
!171 = !DILocation(line: 103, column: 12, scope: !170)
!172 = !DILocation(line: 104, column: 7, scope: !170)
!173 = !DILocation(line: 104, column: 18, scope: !170)
!174 = !DILocation(line: 104, column: 11, scope: !170)
!175 = !DILocation(line: 104, column: 40, scope: !170)
!176 = !DILocation(line: 105, column: 11, scope: !170)
!177 = !DILocation(line: 105, column: 29, scope: !170)
!178 = !DILocation(line: 105, column: 38, scope: !170)
!179 = !DILocation(line: 105, column: 16, scope: !170)
!180 = !DILocation(line: 106, column: 15, scope: !170)
!181 = !DILocation(line: 106, column: 32, scope: !170)
!182 = !DILocation(line: 106, column: 41, scope: !170)
!183 = !DILocation(line: 106, column: 19, scope: !170)
!184 = !DILocation(line: 103, column: 7, scope: !128)
!185 = !DILocation(line: 110, column: 13, scope: !186)
!186 = distinct !DILexicalBlock(scope: !170, file: !2, line: 109, column: 7)
!187 = !DILocation(line: 110, column: 5, scope: !186)
!188 = !DILocation(line: 111, column: 13, scope: !186)
!189 = !DILocation(line: 113, column: 13, scope: !186)
!190 = !DILocation(line: 111, column: 5, scope: !186)
!191 = !DILocation(line: 114, column: 13, scope: !186)
!192 = !DILocation(line: 116, column: 13, scope: !186)
!193 = !DILocation(line: 114, column: 5, scope: !186)
!194 = !DILocation(line: 117, column: 13, scope: !186)
!195 = !DILocation(line: 117, column: 5, scope: !186)
!196 = !DILocation(line: 118, column: 13, scope: !186)
!197 = !DILocation(line: 120, column: 13, scope: !186)
!198 = !DILocation(line: 118, column: 5, scope: !186)
!199 = !DILocation(line: 121, column: 13, scope: !186)
!200 = !DILocation(line: 123, column: 13, scope: !186)
!201 = !DILocation(line: 121, column: 5, scope: !186)
!202 = !DILocation(line: 124, column: 5, scope: !186)
!203 = !DILocation(line: 126, column: 11, scope: !128)
!204 = !DILocation(line: 126, column: 9, scope: !128)
!205 = !DILocation(line: 127, column: 9, scope: !206)
!206 = distinct !DILexicalBlock(scope: !128, file: !2, line: 127, column: 3)
!207 = !DILocation(line: 127, column: 7, scope: !206)
!208 = !DILocation(line: 127, column: 14, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !2, line: 127, column: 3)
!210 = !DILocation(line: 127, column: 18, scope: !209)
!211 = !DILocation(line: 127, column: 16, scope: !209)
!212 = !DILocation(line: 127, column: 3, scope: !206)
!213 = !DILocation(line: 128, column: 9, scope: !214)
!214 = distinct !DILexicalBlock(scope: !215, file: !2, line: 128, column: 9)
!215 = distinct !DILexicalBlock(scope: !209, file: !2, line: 127, column: 29)
!216 = !DILocation(line: 128, column: 14, scope: !214)
!217 = !DILocation(line: 128, column: 20, scope: !214)
!218 = !DILocation(line: 128, column: 9, scope: !215)
!219 = !DILocation(line: 129, column: 18, scope: !220)
!220 = distinct !DILexicalBlock(scope: !221, file: !2, line: 129, column: 11)
!221 = distinct !DILexicalBlock(scope: !214, file: !2, line: 128, column: 28)
!222 = !DILocation(line: 129, column: 23, scope: !220)
!223 = !DILocation(line: 129, column: 11, scope: !220)
!224 = !DILocation(line: 129, column: 37, scope: !220)
!225 = !DILocation(line: 129, column: 11, scope: !221)
!226 = !DILocation(line: 130, column: 13, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !2, line: 130, column: 13)
!228 = distinct !DILexicalBlock(scope: !220, file: !2, line: 129, column: 43)
!229 = !DILocation(line: 130, column: 15, scope: !227)
!230 = !DILocation(line: 130, column: 21, scope: !227)
!231 = !DILocation(line: 130, column: 19, scope: !227)
!232 = !DILocation(line: 130, column: 13, scope: !228)
!233 = !DILocalVariable(name: "line", scope: !234, file: !2, line: 131, type: !147)
!234 = distinct !DILexicalBlock(scope: !227, file: !2, line: 130, column: 27)
!235 = !DILocation(line: 131, column: 16, scope: !234)
!236 = !DILocalVariable(name: "fp", scope: !234, file: !2, line: 132, type: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !239, line: 7, baseType: !240)
!239 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !241, line: 49, size: 1728, elements: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !258, !260, !261, !262, !266, !268, !270, !274, !277, !279, !282, !285, !286, !287, !291, !292}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !240, file: !241, line: 51, baseType: !118, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !240, file: !241, line: 54, baseType: !132, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !240, file: !241, line: 55, baseType: !132, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !240, file: !241, line: 56, baseType: !132, size: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !240, file: !241, line: 57, baseType: !132, size: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !240, file: !241, line: 58, baseType: !132, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !240, file: !241, line: 59, baseType: !132, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !240, file: !241, line: 60, baseType: !132, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !240, file: !241, line: 61, baseType: !132, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !240, file: !241, line: 64, baseType: !132, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !240, file: !241, line: 65, baseType: !132, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !240, file: !241, line: 66, baseType: !132, size: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !240, file: !241, line: 68, baseType: !256, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !241, line: 36, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !240, file: !241, line: 70, baseType: !259, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !240, file: !241, line: 72, baseType: !118, size: 32, offset: 896)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !240, file: !241, line: 73, baseType: !118, size: 32, offset: 928)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !240, file: !241, line: 74, baseType: !263, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !264, line: 152, baseType: !265)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!265 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !240, file: !241, line: 77, baseType: !267, size: 16, offset: 1024)
!267 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !240, file: !241, line: 78, baseType: !269, size: 8, offset: 1040)
!269 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !240, file: !241, line: 79, baseType: !271, size: 8, offset: 1048)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 1)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !240, file: !241, line: 81, baseType: !275, size: 64, offset: 1088)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !241, line: 43, baseType: null)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !240, file: !241, line: 89, baseType: !278, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !264, line: 153, baseType: !265)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !240, file: !241, line: 91, baseType: !280, size: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !241, line: 37, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !240, file: !241, line: 92, baseType: !283, size: 64, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !241, line: 38, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !240, file: !241, line: 93, baseType: !259, size: 64, offset: 1344)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !240, file: !241, line: 94, baseType: !117, size: 64, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !240, file: !241, line: 95, baseType: !288, size: 64, offset: 1472)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !289, line: 46, baseType: !290)
!289 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!290 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !240, file: !241, line: 96, baseType: !118, size: 32, offset: 1536)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !240, file: !241, line: 98, baseType: !293, size: 160, offset: 1568)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 20)
!296 = !DILocation(line: 132, column: 17, scope: !234)
!297 = !DILocation(line: 132, column: 28, scope: !234)
!298 = !DILocation(line: 132, column: 33, scope: !234)
!299 = !DILocation(line: 132, column: 22, scope: !234)
!300 = !DILocation(line: 134, column: 15, scope: !301)
!301 = distinct !DILexicalBlock(scope: !234, file: !2, line: 134, column: 15)
!302 = !DILocation(line: 134, column: 18, scope: !301)
!303 = !DILocation(line: 134, column: 15, scope: !234)
!304 = !DILocation(line: 135, column: 21, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !2, line: 134, column: 27)
!306 = !DILocation(line: 135, column: 67, scope: !305)
!307 = !DILocation(line: 135, column: 72, scope: !305)
!308 = !DILocation(line: 135, column: 13, scope: !305)
!309 = !DILocation(line: 136, column: 13, scope: !305)
!310 = !DILocation(line: 138, column: 11, scope: !234)
!311 = !DILocation(line: 138, column: 24, scope: !234)
!312 = !DILocation(line: 138, column: 28, scope: !234)
!313 = !DILocation(line: 138, column: 17, scope: !234)
!314 = !DILocalVariable(name: "itemsAdded", scope: !315, file: !2, line: 139, type: !118)
!315 = distinct !DILexicalBlock(scope: !234, file: !2, line: 138, column: 40)
!316 = !DILocation(line: 139, column: 17, scope: !315)
!317 = !DILocation(line: 139, column: 42, scope: !315)
!318 = !DILocation(line: 139, column: 49, scope: !315)
!319 = !DILocation(line: 139, column: 30, scope: !315)
!320 = !DILocation(line: 141, column: 17, scope: !321)
!321 = distinct !DILexicalBlock(scope: !315, file: !2, line: 141, column: 17)
!322 = !DILocation(line: 141, column: 28, scope: !321)
!323 = !DILocation(line: 141, column: 17, scope: !315)
!324 = !DILocation(line: 142, column: 23, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !2, line: 141, column: 33)
!326 = !DILocation(line: 142, column: 67, scope: !325)
!327 = !DILocation(line: 143, column: 23, scope: !325)
!328 = !DILocation(line: 142, column: 15, scope: !325)
!329 = !DILocation(line: 144, column: 13, scope: !325)
!330 = !DILocation(line: 144, column: 24, scope: !331)
!331 = distinct !DILexicalBlock(scope: !321, file: !2, line: 144, column: 24)
!332 = !DILocation(line: 144, column: 35, scope: !331)
!333 = !DILocation(line: 144, column: 24, scope: !321)
!334 = !DILocation(line: 145, column: 23, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !2, line: 144, column: 41)
!336 = !DILocation(line: 145, column: 67, scope: !335)
!337 = !DILocation(line: 145, column: 15, scope: !335)
!338 = !DILocation(line: 146, column: 13, scope: !335)
!339 = !DILocation(line: 147, column: 23, scope: !340)
!340 = distinct !DILexicalBlock(scope: !331, file: !2, line: 146, column: 20)
!341 = !DILocation(line: 147, column: 64, scope: !340)
!342 = !DILocation(line: 147, column: 15, scope: !340)
!343 = distinct !{!343, !310, !344, !345}
!344 = !DILocation(line: 149, column: 11, scope: !234)
!345 = !{!"llvm.loop.mustprogress"}
!346 = !DILocation(line: 150, column: 18, scope: !234)
!347 = !DILocation(line: 150, column: 11, scope: !234)
!348 = !DILocation(line: 151, column: 9, scope: !234)
!349 = !DILocation(line: 152, column: 7, scope: !228)
!350 = !DILocation(line: 153, column: 17, scope: !351)
!351 = distinct !DILexicalBlock(scope: !220, file: !2, line: 152, column: 14)
!352 = !DILocation(line: 153, column: 43, scope: !351)
!353 = !DILocation(line: 153, column: 48, scope: !351)
!354 = !DILocation(line: 153, column: 9, scope: !351)
!355 = !DILocation(line: 154, column: 9, scope: !351)
!356 = !DILocation(line: 156, column: 5, scope: !221)
!357 = !DILocalVariable(name: "itemsAdded", scope: !358, file: !2, line: 157, type: !118)
!358 = distinct !DILexicalBlock(scope: !214, file: !2, line: 156, column: 12)
