; ModuleID = 'src/minizip/mztools.c'
source_filename = "src/minizip/mztools.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"wb\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !9

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @unzRepair(ptr noundef %0, ptr noundef %1, ptr noundef %2, ptr noundef %3, ptr noundef %4) #0 !dbg !29 {
  %6 = alloca ptr, align 8
  %7 = alloca ptr, align 8
  %8 = alloca ptr, align 8
  %9 = alloca ptr, align 8
  %10 = alloca ptr, align 8
  %11 = alloca i32, align 4
  %12 = alloca ptr, align 8
  %13 = alloca ptr, align 8
  %14 = alloca ptr, align 8
  %15 = alloca i32, align 4
  %16 = alloca i64, align 8
  %17 = alloca [30 x i8], align 16
  %18 = alloca [1024 x i8], align 16
  %19 = alloca [1024 x i8], align 16
  %20 = alloca i32, align 4
  %21 = alloca i32, align 4
  %22 = alloca i32, align 4
  %23 = alloca i32, align 4
  %24 = alloca i32, align 4
  %25 = alloca i32, align 4
  %26 = alloca i32, align 4
  %27 = alloca i32, align 4
  %28 = alloca i32, align 4
  %29 = alloca i32, align 4
  %30 = alloca i32, align 4
  %31 = alloca i32, align 4
  %32 = alloca i32, align 4
  %33 = alloca i32, align 4
  %34 = alloca ptr, align 8
  %35 = alloca [46 x i8], align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/minizip/mztools.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "34f2b8eef97864ae77a101d3496706bf")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 3)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 37, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !11, isLocal: true, isDefinition: true)
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !12)
!12 = !{!13}
!13 = !DISubrange(count: 1)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !15, globals: !20, splitDebugInlining: false, nameTableKind: None)
!15 = !{!16, !17, !18, !19}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!20 = !{!0, !7, !9}
!21 = !{i32 7, !"Dwarf Version", i32 5}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 4}
!24 = !{i32 8, !"PIC Level", i32 2}
!25 = !{i32 7, !"PIE Level", i32 2}
!26 = !{i32 7, !"uwtable", i32 2}
!27 = !{i32 7, !"frame-pointer", i32 2}
!28 = !{!"clang version 16.0.0"}
!29 = distinct !DISubprogram(name: "unzRepair", scope: !2, file: !2, line: 31, type: !30, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !38)
!30 = !DISubroutineType(types: !31)
!31 = !{!18, !32, !32, !32, !34, !34}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !36, line: 394, baseType: !37)
!36 = !DIFile(filename: "/usr/include/zconf.h", directory: "", checksumkind: CSK_MD5, checksum: "95e83c46958f6395f746c80cc6799e76")
!37 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!38 = !{}
!39 = !DILocalVariable(name: "file", arg: 1, scope: !29, file: !2, line: 31, type: !32)
!40 = !DILocation(line: 31, column: 35, scope: !29)
!41 = !DILocalVariable(name: "fileOut", arg: 2, scope: !29, file: !2, line: 31, type: !32)
!42 = !DILocation(line: 31, column: 53, scope: !29)
!43 = !DILocalVariable(name: "fileOutTmp", arg: 3, scope: !29, file: !2, line: 32, type: !32)
!44 = !DILocation(line: 32, column: 35, scope: !29)
!45 = !DILocalVariable(name: "nRecovered", arg: 4, scope: !29, file: !2, line: 32, type: !34)
!46 = !DILocation(line: 32, column: 54, scope: !29)
!47 = !DILocalVariable(name: "bytesRecovered", arg: 5, scope: !29, file: !2, line: 33, type: !34)
!48 = !DILocation(line: 33, column: 30, scope: !29)
!49 = !DILocalVariable(name: "err", scope: !29, file: !2, line: 35, type: !18)
!50 = !DILocation(line: 35, column: 7, scope: !29)
!51 = !DILocalVariable(name: "fpZip", scope: !29, file: !2, line: 36, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !54, line: 7, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!57 = !{!58, !59, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !74, !76, !77, !78, !82, !84, !86, !87, !90, !92, !95, !98, !99, !100, !103, !104}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 51, baseType: !18, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 54, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 55, baseType: !60, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 56, baseType: !60, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 57, baseType: !60, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 58, baseType: !60, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 59, baseType: !60, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 60, baseType: !60, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 61, baseType: !60, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 64, baseType: !60, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 65, baseType: !60, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 66, baseType: !60, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 68, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 36, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 70, baseType: !75, size: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 72, baseType: !18, size: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 73, baseType: !18, size: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 74, baseType: !79, size: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !80, line: 152, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!81 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 77, baseType: !83, size: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 78, baseType: !85, size: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 79, baseType: !11, size: 8, offset: 1048)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 81, baseType: !88, size: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 43, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 89, baseType: !91, size: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !80, line: 153, baseType: !81)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !55, file: !56, line: 91, baseType: !93, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !56, line: 37, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !55, file: !56, line: 92, baseType: !96, size: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !56, line: 38, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !55, file: !56, line: 93, baseType: !75, size: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !55, file: !56, line: 94, baseType: !16, size: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 95, baseType: !101, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !37)
!102 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 96, baseType: !18, size: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 98, baseType: !105, size: 160, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DILocation(line: 36, column: 9, scope: !29)
!109 = !DILocation(line: 36, column: 23, scope: !29)
!110 = !DILocation(line: 36, column: 17, scope: !29)
!111 = !DILocalVariable(name: "fpOut", scope: !29, file: !2, line: 37, type: !52)
!112 = !DILocation(line: 37, column: 9, scope: !29)
!113 = !DILocation(line: 37, column: 23, scope: !29)
!114 = !DILocation(line: 37, column: 17, scope: !29)
!115 = !DILocalVariable(name: "fpOutCD", scope: !29, file: !2, line: 38, type: !52)
!116 = !DILocation(line: 38, column: 9, scope: !29)
!117 = !DILocation(line: 38, column: 25, scope: !29)
!118 = !DILocation(line: 38, column: 19, scope: !29)
!119 = !DILocation(line: 39, column: 7, scope: !120)
!120 = distinct !DILexicalBlock(scope: !29, file: !2, line: 39, column: 7)
!121 = !DILocation(line: 39, column: 13, scope: !120)
!122 = !DILocation(line: 39, column: 21, scope: !120)
!123 = !DILocation(line: 39, column: 25, scope: !120)
!124 = !DILocation(line: 39, column: 31, scope: !120)
!125 = !DILocation(line: 39, column: 7, scope: !29)
!126 = !DILocalVariable(name: "entries", scope: !127, file: !2, line: 40, type: !18)
!127 = distinct !DILexicalBlock(scope: !120, file: !2, line: 39, column: 40)
!128 = !DILocation(line: 40, column: 9, scope: !127)
!129 = !DILocalVariable(name: "totalBytes", scope: !127, file: !2, line: 41, type: !35)
!130 = !DILocation(line: 41, column: 11, scope: !127)
!131 = !DILocalVariable(name: "header", scope: !127, file: !2, line: 42, type: !132)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 30)
!135 = !DILocation(line: 42, column: 10, scope: !127)
!136 = !DILocalVariable(name: "filename", scope: !127, file: !2, line: 43, type: !137)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 1024)
!140 = !DILocation(line: 43, column: 10, scope: !127)
!141 = !DILocalVariable(name: "extra", scope: !127, file: !2, line: 44, type: !137)
!142 = !DILocation(line: 44, column: 10, scope: !127)
!143 = !DILocalVariable(name: "offset", scope: !127, file: !2, line: 45, type: !18)
!144 = !DILocation(line: 45, column: 9, scope: !127)
!145 = !DILocalVariable(name: "offsetCD", scope: !127, file: !2, line: 46, type: !18)
!146 = !DILocation(line: 46, column: 9, scope: !127)
!147 = !DILocation(line: 47, column: 5, scope: !127)
!148 = !DILocation(line: 47, column: 19, scope: !127)
!149 = !DILocation(line: 47, column: 34, scope: !127)
!150 = !DILocation(line: 47, column: 13, scope: !127)
!151 = !DILocation(line: 47, column: 41, scope: !127)
!152 = !DILocalVariable(name: "currentOffset", scope: !153, file: !2, line: 48, type: !18)
!153 = distinct !DILexicalBlock(scope: !127, file: !2, line: 47, column: 49)
!154 = !DILocation(line: 48, column: 11, scope: !153)
!155 = !DILocation(line: 48, column: 27, scope: !153)
!156 = !DILocation(line: 51, column: 11, scope: !157)
!157 = distinct !DILexicalBlock(scope: !153, file: !2, line: 51, column: 11)
!158 = !DILocation(line: 51, column: 27, scope: !157)
!159 = !DILocation(line: 51, column: 11, scope: !153)
!160 = !DILocalVariable(name: "version", scope: !161, file: !2, line: 52, type: !162)
!161 = distinct !DILexicalBlock(scope: !157, file: !2, line: 51, column: 42)
!162 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!163 = !DILocation(line: 52, column: 22, scope: !161)
!164 = !DILocation(line: 52, column: 32, scope: !161)
!165 = !DILocalVariable(name: "gpflag", scope: !161, file: !2, line: 53, type: !162)
!166 = !DILocation(line: 53, column: 22, scope: !161)
!167 = !DILocation(line: 53, column: 31, scope: !161)
