; ModuleID = 'src/minizip/zip.c'
source_filename = "src/minizip/zip.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.zip64_internal = type { %struct.zlib_filefunc64_32_def_s, ptr, %struct.linkedlist_data_s, i32, %struct.curfile64_info, i64, i64, i64, ptr }
%struct.zlib_filefunc64_32_def_s = type { %struct.zlib_filefunc64_def_s, ptr, ptr, ptr }
%struct.zlib_filefunc64_def_s = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.linkedlist_data_s = type { ptr, ptr }
%struct.curfile64_info = type { %struct.z_stream_s, i32, i32, i64, ptr, i64, i64, i64, i64, i32, i32, [65536 x i8], i64, i64, i32, i32, i64, i64, i64, [3 x i64], ptr, i32 }
%struct.z_stream_s = type { ptr, i32, i64, ptr, i32, i64, ptr, ptr, ptr, ptr, ptr, i32, i64, i64 }
%struct.zip_fileinfo = type { %struct.tm_zip_s, i64, i64, i64 }
%struct.tm_zip_s = type { i32, i32, i32, i32, i32, i32 }
%struct.linkedlist_datablock_internal_s = type { ptr, i64, i64, i64, [4080 x i8] }

@zip_copyright = dso_local constant [79 x i8] c" zip 1.01 Copyright 1998-2004 Gilles Vollant - http://www.winimage.com/zLibDll\00", align 16, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1, !dbg !186
@.str.1 = private unnamed_addr constant [7 x i8] c"1.2.11\00", align 1, !dbg !191
@crypthead.calls = internal global i32 0, align 4, !dbg !196

; Function Attrs: noinline nounwind optnone uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "zip_copyright", scope: !2, file: !3, line: 98, type: !204, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !185, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/minizip/zip.c", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "f85a91e83fcac3c493f48855b5b30a33")
!4 = !{!5, !6, !177, !26, !118, !125, !34, !69, !130, !135, !24, !28, !180, !182, !51, !99, !181, !119, !183, !88}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip64_internal", file: !3, line: 181, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 165, size: 527680, elements: !9)
!9 = !{!10, !82, !83, !103, !104, !173, !174, !175, !176}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z_filefunc", scope: !8, file: !3, line: 167, baseType: !11, size: 768)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc64_32_def", file: !12, line: 205, baseType: !13)
!12 = !DIFile(filename: "src/minizip/ioapi.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "a4dac867a80298bfdbdc2d3a375e5352")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc64_32_def_s", file: !12, line: 199, size: 768, elements: !14)
!14 = !{!15, !64, !72, !77}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "zfile_func64", scope: !13, file: !12, line: 201, baseType: !16, size: 576)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc64_def", file: !12, line: 193, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc64_def_s", file: !12, line: 182, size: 576, elements: !18)
!18 = !{!19, !29, !36, !41, !46, !53, !59, !61, !63}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "zopen64_file", scope: !17, file: !12, line: 184, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "open64_file_func", file: !12, line: 180, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !24, !26, !28}
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !25, line: 409, baseType: !5)
!25 = !DIFile(filename: "/usr/include/zconf.h", directory: "", checksumkind: CSK_MD5, checksum: "95e83c46958f6395f746c80cc6799e76")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "zread_file", scope: !17, file: !12, line: 185, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "read_file_func", file: !12, line: 154, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !24, !24, !5, !34}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !25, line: 394, baseType: !35)
!35 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "zwrite_file", scope: !17, file: !12, line: 186, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "write_file_func", file: !12, line: 155, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!34, !24, !24, !26, !34}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "zflush_file", scope: !17, file: !12, line: 187, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "flush_file_func", file: !12, line: 156, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!28, !24, !24}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ztell64_file", scope: !17, file: !12, line: 188, baseType: !47, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "tell64_file_func", file: !12, line: 178, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !24, !24}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZPOS64_T", file: !12, line: 118, baseType: !52)
!52 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "zseek64_file", scope: !17, file: !12, line: 189, baseType: !54, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "seek64_file_func", file: !12, line: 179, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !24, !24, !51, !28}
!58 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "zclose_file", scope: !17, file: !12, line: 190, baseType: !60, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "close_file_func", file: !12, line: 157, baseType: !43)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "zerror_file", scope: !17, file: !12, line: 191, baseType: !62, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "testerror_file_func", file: !12, line: 158, baseType: !43)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !17, file: !12, line: 192, baseType: !24, size: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "zopen32_file", scope: !13, file: !12, line: 202, baseType: !65, size: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "open_file_func", file: !12, line: 153, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!24, !24, !69, !28}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ztell32_file", scope: !13, file: !12, line: 203, baseType: !73, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "tell_file_func", file: !12, line: 160, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!58, !24, !24}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "zseek32_file", scope: !13, file: !12, line: 204, baseType: !78, size: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "seek_file_func", file: !12, line: 161, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!58, !24, !24, !34, !28}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "filestream", scope: !8, file: !3, line: 168, baseType: !24, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "central_dir", scope: !8, file: !3, line: 169, baseType: !84, size: 128, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "linkedlist_data", file: !3, line: 127, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkedlist_data_s", file: !3, line: 123, size: 128, elements: !86)
!86 = !{!87, !102}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "first_block", scope: !85, file: !3, line: 125, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "linkedlist_datablock_internal", file: !3, line: 121, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linkedlist_datablock_internal_s", file: !3, line: 114, size: 32896, elements: !91)
!91 = !{!92, !94, !95, !96, !97}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next_datablock", scope: !90, file: !3, line: 116, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_this_block", scope: !90, file: !3, line: 117, baseType: !34, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "filled_in_this_block", scope: !90, file: !3, line: 118, baseType: !34, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !90, file: !3, line: 119, baseType: !34, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !3, line: 120, baseType: !98, size: 32640, offset: 256)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32640, elements: !100)
!99 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!100 = !{!101}
!101 = !DISubrange(count: 4080)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "last_block", scope: !85, file: !3, line: 126, baseType: !88, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "in_opened_file_inzip", scope: !8, file: !3, line: 170, baseType: !28, size: 32, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ci", scope: !8, file: !3, line: 171, baseType: !105, size: 526400, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "curfile64_info", file: !3, line: 163, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 130, size: 526400, elements: !107)
!107 = !{!108, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !157, !158, !159, !160, !161, !162, !163, !164, !168, !172}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !106, file: !3, line: 132, baseType: !109, size: 896)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !110, line: 106, baseType: !111)
!110 = !DIFile(filename: "/usr/include/zlib.h", directory: "", checksumkind: CSK_MD5, checksum: "69c0882c2071430ea4822b4f6c1edd30")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !110, line: 86, size: 896, elements: !112)
!112 = !{!113, !117, !120, !121, !122, !123, !124, !126, !129, !134, !139, !140, !141, !142}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !111, file: !110, line: 87, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !25, line: 400, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !25, line: 391, baseType: !99)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !111, file: !110, line: 88, baseType: !118, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !25, line: 393, baseType: !119)
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !111, file: !110, line: 89, baseType: !34, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !111, file: !110, line: 91, baseType: !114, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !111, file: !110, line: 92, baseType: !118, size: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !111, file: !110, line: 93, baseType: !34, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !111, file: !110, line: 95, baseType: !125, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !111, file: !110, line: 96, baseType: !127, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !110, line: 84, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !111, file: !110, line: 98, baseType: !130, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !110, line: 81, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!24, !24, !118, !118}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !111, file: !110, line: 99, baseType: !135, size: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !110, line: 82, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !24, !24}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !111, file: !110, line: 100, baseType: !24, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !111, file: !110, line: 102, baseType: !28, size: 32, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !111, file: !110, line: 104, baseType: !34, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !111, file: !110, line: 105, baseType: !34, size: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stream_initialised", scope: !106, file: !3, line: 137, baseType: !28, size: 32, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pos_in_buffered_data", scope: !106, file: !3, line: 138, baseType: !118, size: 32, offset: 928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pos_local_header", scope: !106, file: !3, line: 140, baseType: !51, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "central_header", scope: !106, file: !3, line: 142, baseType: !125, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "size_centralExtra", scope: !106, file: !3, line: 143, baseType: !34, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "size_centralheader", scope: !106, file: !3, line: 144, baseType: !34, size: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size_centralExtraFree", scope: !106, file: !3, line: 145, baseType: !34, size: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !3, line: 146, baseType: !34, size: 64, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !106, file: !3, line: 148, baseType: !28, size: 32, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !106, file: !3, line: 149, baseType: !28, size: 32, offset: 1376)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_data", scope: !106, file: !3, line: 150, baseType: !154, size: 524288, offset: 1408)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 524288, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 65536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dosDate", scope: !106, file: !3, line: 151, baseType: !34, size: 64, offset: 525696)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !106, file: !3, line: 152, baseType: !34, size: 64, offset: 525760)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !106, file: !3, line: 153, baseType: !28, size: 32, offset: 525824)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "zip64", scope: !106, file: !3, line: 154, baseType: !28, size: 32, offset: 525856)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pos_zip64extrainfo", scope: !106, file: !3, line: 155, baseType: !51, size: 64, offset: 525888)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "totalCompressedData", scope: !106, file: !3, line: 156, baseType: !51, size: 64, offset: 525952)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "totalUncompressedData", scope: !106, file: !3, line: 157, baseType: !51, size: 64, offset: 526016)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !106, file: !3, line: 159, baseType: !165, size: 192, offset: 526080)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 3)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pcrc_32_tab", scope: !106, file: !3, line: 160, baseType: !169, size: 64, offset: 526272)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_crc_t", file: !25, line: 429, baseType: !119)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "crypt_header_size", scope: !106, file: !3, line: 161, baseType: !28, size: 32, offset: 526336)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "begin_pos", scope: !8, file: !3, line: 173, baseType: !51, size: 64, offset: 527424)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "add_position_when_writting_offset", scope: !8, file: !3, line: 174, baseType: !51, size: 64, offset: 527488)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "number_entry", scope: !8, file: !3, line: 175, baseType: !51, size: 64, offset: 527552)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "globalcomment", scope: !8, file: !3, line: 178, baseType: !125, size: 64, offset: 527616)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "zipFile", file: !178, line: 69, baseType: !179)
!178 = !DIFile(filename: "src/minizip/zip.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "e2067124d539336fa48f8e1adc0a9592")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidp", file: !25, line: 410, baseType: !5)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!185 = !{!0, !186, !191, !196}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1096, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1221, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 56, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 7)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "calls", scope: !198, file: !199, line: 101, type: !119, isLocal: true, isDefinition: true)
!198 = distinct !DISubprogram(name: "crypthead", scope: !199, file: !199, line: 90, type: !200, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !203)
!199 = !DIFile(filename: "src/minizip/crypt.h", directory: "/home/raj/httrack-3.48.21", checksumkind: CSK_MD5, checksum: "6e72c46776f0db175ec8f15144a3c250")
!200 = !DISubroutineType(types: !201)
!201 = !{!28, !69, !182, !28, !202, !169, !35}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!203 = !{}
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 632, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 79)
!207 = !{i32 7, !"Dwarf Version", i32 5}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{i32 1, !"wchar_size", i32 4}
!210 = !{i32 8, !"PIC Level", i32 2}
!211 = !{i32 7, !"PIE Level", i32 2}
!212 = !{i32 7, !"uwtable", i32 2}
!213 = !{i32 7, !"frame-pointer", i32 2}
!214 = !{!"clang version 16.0.0"}
!215 = distinct !DISubprogram(name: "zipOpen3", scope: !3, file: !3, line: 849, type: !216, scopeLine: 850, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!216 = !DISubroutineType(types: !217)
!217 = !{!177, !26, !28, !218, !220}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "zipcharpc", file: !178, line: 109, baseType: !69)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!221 = !DILocalVariable(name: "pathname", arg: 1, scope: !215, file: !3, line: 849, type: !26)
!222 = !DILocation(line: 849, column: 46, scope: !215)
!223 = !DILocalVariable(name: "append", arg: 2, scope: !215, file: !3, line: 849, type: !28)
!224 = !DILocation(line: 849, column: 60, scope: !215)
!225 = !DILocalVariable(name: "globalcomment", arg: 3, scope: !215, file: !3, line: 849, type: !218)
!226 = !DILocation(line: 849, column: 79, scope: !215)
!227 = !DILocalVariable(name: "pzlib_filefunc64_32_def", arg: 4, scope: !215, file: !3, line: 849, type: !220)
!228 = !DILocation(line: 849, column: 118, scope: !215)
!229 = !DILocalVariable(name: "ziinit", scope: !215, file: !3, line: 851, type: !7)
!230 = !DILocation(line: 851, column: 20, scope: !215)
!231 = !DILocalVariable(name: "zi", scope: !215, file: !3, line: 852, type: !6)
!232 = !DILocation(line: 852, column: 21, scope: !215)
!233 = !DILocalVariable(name: "err", scope: !215, file: !3, line: 853, type: !28)
!234 = !DILocation(line: 853, column: 9, scope: !215)
!235 = !DILocation(line: 855, column: 12, scope: !215)
!236 = !DILocation(line: 855, column: 23, scope: !215)
!237 = !DILocation(line: 855, column: 36, scope: !215)
!238 = !DILocation(line: 856, column: 12, scope: !215)
!239 = !DILocation(line: 856, column: 23, scope: !215)
!240 = !DILocation(line: 856, column: 36, scope: !215)
!241 = !DILocation(line: 857, column: 9, scope: !242)
!242 = distinct !DILexicalBlock(scope: !215, file: !3, line: 857, column: 9)
!243 = !DILocation(line: 857, column: 32, scope: !242)
!244 = !DILocation(line: 857, column: 9, scope: !215)
!245 = !DILocation(line: 858, column: 39, scope: !242)
!246 = !DILocation(line: 858, column: 50, scope: !242)
!247 = !DILocation(line: 858, column: 9, scope: !242)
!248 = !DILocation(line: 860, column: 16, scope: !242)
!249 = !DILocation(line: 860, column: 30, scope: !242)
!250 = !DILocation(line: 860, column: 29, scope: !242)
!251 = !DILocation(line: 862, column: 25, scope: !215)
!252 = !DILocation(line: 862, column: 12, scope: !215)
!253 = !DILocation(line: 862, column: 23, scope: !215)
!254 = !DILocation(line: 868, column: 16, scope: !255)
!255 = distinct !DILexicalBlock(scope: !215, file: !3, line: 868, column: 9)
!256 = !DILocation(line: 868, column: 27, scope: !255)
!257 = !DILocation(line: 868, column: 9, scope: !215)
!258 = !DILocation(line: 869, column: 9, scope: !255)
!259 = !DILocation(line: 871, column: 9, scope: !260)
!260 = distinct !DILexicalBlock(scope: !215, file: !3, line: 871, column: 9)
!261 = !DILocation(line: 871, column: 16, scope: !260)
!262 = !DILocation(line: 871, column: 9, scope: !215)
!263 = !DILocation(line: 872, column: 9, scope: !260)
!264 = !DILocation(line: 874, column: 24, scope: !215)
!265 = !DILocation(line: 874, column: 12, scope: !215)
!266 = !DILocation(line: 874, column: 22, scope: !215)
!267 = !DILocation(line: 875, column: 12, scope: !215)
!268 = !DILocation(line: 875, column: 33, scope: !215)
!269 = !DILocation(line: 876, column: 12, scope: !215)
!270 = !DILocation(line: 876, column: 15, scope: !215)
!271 = !DILocation(line: 876, column: 34, scope: !215)
!272 = !DILocation(line: 877, column: 12, scope: !215)
!273 = !DILocation(line: 877, column: 25, scope: !215)
!274 = !DILocation(line: 878, column: 12, scope: !215)
!275 = !DILocation(line: 878, column: 46, scope: !215)
!276 = !DILocation(line: 879, column: 30, scope: !215)
!277 = !DILocation(line: 879, column: 5, scope: !215)
!278 = !DILocation(line: 883, column: 27, scope: !215)
!279 = !DILocation(line: 883, column: 8, scope: !215)
!280 = !DILocation(line: 884, column: 9, scope: !281)
!281 = distinct !DILexicalBlock(scope: !215, file: !3, line: 884, column: 9)
!282 = !DILocation(line: 884, column: 11, scope: !281)
!283 = !DILocation(line: 884, column: 9, scope: !215)
!284 = !DILocation(line: 886, column: 9, scope: !285)
!285 = distinct !DILexicalBlock(scope: !281, file: !3, line: 885, column: 5)
!286 = !DILocation(line: 887, column: 9, scope: !285)
!287 = !DILocation(line: 892, column: 12, scope: !215)
!288 = !DILocation(line: 892, column: 26, scope: !215)
!289 = !DILocation(line: 893, column: 9, scope: !290)
!290 = distinct !DILexicalBlock(scope: !215, file: !3, line: 893, column: 9)
!291 = !DILocation(line: 893, column: 16, scope: !290)
!292 = !DILocation(line: 893, column: 9, scope: !215)
!293 = !DILocation(line: 896, column: 13, scope: !294)
!294 = distinct !DILexicalBlock(scope: !290, file: !3, line: 894, column: 5)
!295 = !DILocation(line: 896, column: 11, scope: !294)
!296 = !DILocation(line: 897, column: 5, scope: !294)
!297 = !DILocation(line: 899, column: 9, scope: !298)
!298 = distinct !DILexicalBlock(scope: !215, file: !3, line: 899, column: 9)
!299 = !DILocation(line: 899, column: 9, scope: !215)
!300 = !DILocation(line: 901, column: 31, scope: !301)
!301 = distinct !DILexicalBlock(scope: !298, file: !3, line: 900, column: 5)
!302 = !DILocation(line: 901, column: 8, scope: !301)
!303 = !DILocation(line: 901, column: 22, scope: !301)
!304 = !DILocation(line: 902, column: 5, scope: !301)
!305 = !DILocation(line: 905, column: 9, scope: !306)
!306 = distinct !DILexicalBlock(scope: !215, file: !3, line: 905, column: 9)
!307 = !DILocation(line: 905, column: 13, scope: !306)
!308 = !DILocation(line: 905, column: 9, scope: !215)
!309 = !DILocation(line: 908, column: 9, scope: !310)
!310 = distinct !DILexicalBlock(scope: !311, file: !3, line: 908, column: 9)
!311 = distinct !DILexicalBlock(scope: !312, file: !3, line: 908, column: 9)
!312 = distinct !DILexicalBlock(scope: !306, file: !3, line: 906, column: 5)
!313 = !DILocation(line: 908, column: 9, scope: !311)
!314 = !DILocation(line: 910, column: 9, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !3, line: 910, column: 9)
!316 = distinct !DILexicalBlock(scope: !312, file: !3, line: 910, column: 9)
!317 = !DILocation(line: 910, column: 9, scope: !316)
!318 = !DILocation(line: 911, column: 9, scope: !312)
!319 = !DILocation(line: 915, column: 10, scope: !320)
!320 = distinct !DILexicalBlock(scope: !306, file: !3, line: 914, column: 5)
!321 = !DILocation(line: 915, column: 15, scope: !320)
!322 = !DILocation(line: 916, column: 25, scope: !320)
!323 = !DILocation(line: 916, column: 9, scope: !320)
!324 = !DILocation(line: 918, column: 1, scope: !215)
!325 = distinct !DISubprogram(name: "init_linkedlist", scope: !3, file: !3, line: 213, type: !326, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !203)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!329 = !DILocalVariable(name: "ll", arg: 1, scope: !325, file: !3, line: 213, type: !328)
!330 = !DILocation(line: 213, column: 45, scope: !325)
!331 = !DILocation(line: 215, column: 23, scope: !325)
!332 = !DILocation(line: 215, column: 27, scope: !325)
!333 = !DILocation(line: 215, column: 38, scope: !325)
!334 = !DILocation(line: 215, column: 5, scope: !325)
!335 = !DILocation(line: 215, column: 9, scope: !325)
!336 = !DILocation(line: 215, column: 21, scope: !325)
!337 = !DILocation(line: 216, column: 1, scope: !325)
!338 = distinct !DISubprogram(name: "LoadCentralDirectoryRecord", scope: !3, file: !3, line: 640, type: !339, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !203)
!339 = !DISubroutineType(types: !340)
!340 = !{!28, !6}
!341 = !DILocalVariable(name: "pziinit", arg: 1, scope: !338, file: !3, line: 640, type: !6)
!342 = !DILocation(line: 640, column: 54, scope: !338)
!343 = !DILocalVariable(name: "err", scope: !338, file: !3, line: 642, type: !28)
!344 = !DILocation(line: 642, column: 7, scope: !338)
!345 = !DILocalVariable(name: "byte_before_the_zipfile", scope: !338, file: !3, line: 643, type: !51)
!346 = !DILocation(line: 643, column: 12, scope: !338)
!347 = !DILocalVariable(name: "size_central_dir", scope: !338, file: !3, line: 645, type: !51)
!348 = !DILocation(line: 645, column: 12, scope: !338)
!349 = !DILocalVariable(name: "offset_central_dir", scope: !338, file: !3, line: 646, type: !51)
!350 = !DILocation(line: 646, column: 12, scope: !338)
!351 = !DILocalVariable(name: "central_pos", scope: !338, file: !3, line: 647, type: !51)
!352 = !DILocation(line: 647, column: 12, scope: !338)
!353 = !DILocalVariable(name: "uL", scope: !338, file: !3, line: 648, type: !34)
!354 = !DILocation(line: 648, column: 9, scope: !338)
!355 = !DILocalVariable(name: "number_disk", scope: !338, file: !3, line: 650, type: !34)
!356 = !DILocation(line: 650, column: 9, scope: !338)
!357 = !DILocalVariable(name: "number_disk_with_CD", scope: !338, file: !3, line: 652, type: !34)
!358 = !DILocation(line: 652, column: 9, scope: !338)
!359 = !DILocalVariable(name: "number_entry", scope: !338, file: !3, line: 654, type: !51)
!360 = !DILocation(line: 654, column: 12, scope: !338)
!361 = !DILocalVariable(name: "number_entry_CD", scope: !338, file: !3, line: 655, type: !51)
!362 = !DILocation(line: 655, column: 12, scope: !338)
!363 = !DILocalVariable(name: "VersionMadeBy", scope: !338, file: !3, line: 658, type: !34)
!364 = !DILocation(line: 658, column: 9, scope: !338)
!365 = !DILocalVariable(name: "VersionNeeded", scope: !338, file: !3, line: 659, type: !34)
!366 = !DILocation(line: 659, column: 9, scope: !338)
!367 = !DILocalVariable(name: "size_comment", scope: !338, file: !3, line: 660, type: !34)
!368 = !DILocation(line: 660, column: 9, scope: !338)
!369 = !DILocalVariable(name: "hasZIP64Record", scope: !338, file: !3, line: 662, type: !28)
!370 = !DILocation(line: 662, column: 7, scope: !338)
!371 = !DILocation(line: 665, column: 48, scope: !338)
!372 = !DILocation(line: 665, column: 57, scope: !338)
!373 = !DILocation(line: 665, column: 68, scope: !338)
!374 = !DILocation(line: 665, column: 77, scope: !338)
!375 = !DILocation(line: 665, column: 17, scope: !338)
!376 = !DILocation(line: 665, column: 15, scope: !338)
!377 = !DILocation(line: 666, column: 6, scope: !378)
!378 = distinct !DILexicalBlock(scope: !338, file: !3, line: 666, column: 6)
!379 = !DILocation(line: 666, column: 18, scope: !378)
!380 = !DILocation(line: 666, column: 6, scope: !338)
!381 = !DILocation(line: 668, column: 20, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !3, line: 667, column: 3)
!383 = !DILocation(line: 669, column: 3, scope: !382)
!384 = !DILocation(line: 670, column: 11, scope: !385)
!385 = distinct !DILexicalBlock(scope: !378, file: !3, line: 670, column: 11)
!386 = !DILocation(line: 670, column: 23, scope: !385)
!387 = !DILocation(line: 670, column: 11, scope: !378)
!388 = !DILocation(line: 672, column: 48, scope: !389)
!389 = distinct !DILexicalBlock(scope: !385, file: !3, line: 671, column: 3)
!390 = !DILocation(line: 672, column: 57, scope: !389)
!391 = !DILocation(line: 672, column: 68, scope: !389)
!392 = !DILocation(line: 672, column: 77, scope: !389)
!393 = !DILocation(line: 672, column: 19, scope: !389)
!394 = !DILocation(line: 672, column: 17, scope: !389)
!395 = !DILocation(line: 673, column: 3, scope: !389)
!396 = !DILocation(line: 680, column: 6, scope: !397)
!397 = distinct !DILexicalBlock(scope: !338, file: !3, line: 680, column: 6)
!398 = !DILocation(line: 680, column: 6, scope: !338)
!399 = !DILocalVariable(name: "sizeEndOfCentralDirectory", scope: !400, file: !3, line: 682, type: !51)
!400 = distinct !DILexicalBlock(scope: !397, file: !3, line: 681, column: 3)
!401 = !DILocation(line: 682, column: 14, scope: !400)
!402 = !DILocation(line: 683, column: 9, scope: !403)
!403 = distinct !DILexicalBlock(scope: !400, file: !3, line: 683, column: 9)
!404 = !DILocation(line: 683, column: 96, scope: !403)
!405 = !DILocation(line: 683, column: 9, scope: !400)
!406 = !DILocation(line: 684, column: 10, scope: !403)
!407 = !DILocation(line: 684, column: 7, scope: !403)
!408 = !DILocation(line: 687, column: 29, scope: !409)
!409 = distinct !DILexicalBlock(scope: !400, file: !3, line: 687, column: 9)
!410 = !DILocation(line: 687, column: 38, scope: !409)
!411 = !DILocation(line: 687, column: 50, scope: !409)
!412 = !DILocation(line: 687, column: 59, scope: !409)
!413 = !DILocation(line: 687, column: 9, scope: !409)
!414 = !DILocation(line: 687, column: 74, scope: !409)
!415 = !DILocation(line: 687, column: 9, scope: !400)
!416 = !DILocation(line: 688, column: 10, scope: !409)
!417 = !DILocation(line: 688, column: 7, scope: !409)
!418 = !DILocation(line: 691, column: 31, scope: !419)
!419 = distinct !DILexicalBlock(scope: !400, file: !3, line: 691, column: 9)
!420 = !DILocation(line: 691, column: 40, scope: !419)
!421 = !DILocation(line: 691, column: 52, scope: !419)
!422 = !DILocation(line: 691, column: 61, scope: !419)
!423 = !DILocation(line: 691, column: 9, scope: !419)
!424 = !DILocation(line: 691, column: 100, scope: !419)
!425 = !DILocation(line: 691, column: 9, scope: !400)
!426 = !DILocation(line: 692, column: 10, scope: !419)
!427 = !DILocation(line: 692, column: 7, scope: !419)
!428 = !DILocation(line: 695, column: 30, scope: !429)
!429 = distinct !DILexicalBlock(scope: !400, file: !3, line: 695, column: 9)
!430 = !DILocation(line: 695, column: 39, scope: !429)
!431 = !DILocation(line: 695, column: 51, scope: !429)
!432 = !DILocation(line: 695, column: 60, scope: !429)
!433 = !DILocation(line: 695, column: 9, scope: !429)
!434 = !DILocation(line: 695, column: 87, scope: !429)
!435 = !DILocation(line: 695, column: 9, scope: !400)
!436 = !DILocation(line: 696, column: 10, scope: !429)
!437 = !DILocation(line: 696, column: 7, scope: !429)
!438 = !DILocation(line: 699, column: 30, scope: !439)
!439 = distinct !DILexicalBlock(scope: !400, file: !3, line: 699, column: 9)
!440 = !DILocation(line: 699, column: 39, scope: !439)
!441 = !DILocation(line: 699, column: 51, scope: !439)
!442 = !DILocation(line: 699, column: 60, scope: !439)
!443 = !DILocation(line: 699, column: 9, scope: !439)
!444 = !DILocation(line: 699, column: 87, scope: !439)
!445 = !DILocation(line: 699, column: 9, scope: !400)
!446 = !DILocation(line: 700, column: 10, scope: !439)
!447 = !DILocation(line: 700, column: 7, scope: !439)
!448 = !DILocation(line: 703, column: 29, scope: !449)
!449 = distinct !DILexicalBlock(scope: !400, file: !3, line: 703, column: 9)
!450 = !DILocation(line: 703, column: 38, scope: !449)
!451 = !DILocation(line: 703, column: 50, scope: !449)
!452 = !DILocation(line: 703, column: 59, scope: !449)
!453 = !DILocation(line: 703, column: 9, scope: !449)
!454 = !DILocation(line: 703, column: 83, scope: !449)
!455 = !DILocation(line: 703, column: 9, scope: !400)
!456 = !DILocation(line: 704, column: 10, scope: !449)
!457 = !DILocation(line: 704, column: 7, scope: !449)
!458 = !DILocation(line: 707, column: 29, scope: !459)
!459 = distinct !DILexicalBlock(scope: !400, file: !3, line: 707, column: 9)
!460 = !DILocation(line: 707, column: 38, scope: !459)
!461 = !DILocation(line: 707, column: 50, scope: !459)
!462 = !DILocation(line: 707, column: 59, scope: !459)
!463 = !DILocation(line: 707, column: 9, scope: !459)
!464 = !DILocation(line: 707, column: 91, scope: !459)
!465 = !DILocation(line: 707, column: 9, scope: !400)
!466 = !DILocation(line: 708, column: 10, scope: !459)
!467 = !DILocation(line: 708, column: 7, scope: !459)
!468 = !DILocation(line: 711, column: 31, scope: !469)
!469 = distinct !DILexicalBlock(scope: !400, file: !3, line: 711, column: 9)
!470 = !DILocation(line: 711, column: 40, scope: !469)
!471 = !DILocation(line: 711, column: 52, scope: !469)
!472 = !DILocation(line: 711, column: 61, scope: !469)
!473 = !DILocation(line: 711, column: 9, scope: !469)
!474 = !DILocation(line: 711, column: 87, scope: !469)
!475 = !DILocation(line: 711, column: 9, scope: !400)
!476 = !DILocation(line: 712, column: 10, scope: !469)
!477 = !DILocation(line: 712, column: 7, scope: !469)
!478 = !DILocation(line: 715, column: 31, scope: !479)
!479 = distinct !DILexicalBlock(scope: !400, file: !3, line: 715, column: 9)
!480 = !DILocation(line: 715, column: 40, scope: !479)
!481 = !DILocation(line: 715, column: 52, scope: !479)
!482 = !DILocation(line: 715, column: 61, scope: !479)
!483 = !DILocation(line: 715, column: 9, scope: !479)
!484 = !DILocation(line: 715, column: 89, scope: !479)
!485 = !DILocation(line: 715, column: 9, scope: !400)
!486 = !DILocation(line: 716, column: 10, scope: !479)
!487 = !DILocation(line: 716, column: 7, scope: !479)
!488 = !DILocation(line: 718, column: 10, scope: !489)
!489 = distinct !DILexicalBlock(scope: !400, file: !3, line: 718, column: 9)
!490 = !DILocation(line: 718, column: 27, scope: !489)
!491 = !DILocation(line: 718, column: 25, scope: !489)
!492 = !DILocation(line: 718, column: 41, scope: !489)
!493 = !DILocation(line: 718, column: 45, scope: !489)
!494 = !DILocation(line: 718, column: 64, scope: !489)
!495 = !DILocation(line: 718, column: 69, scope: !489)
!496 = !DILocation(line: 718, column: 73, scope: !489)
!497 = !DILocation(line: 718, column: 84, scope: !489)
!498 = !DILocation(line: 718, column: 9, scope: !400)
!499 = !DILocation(line: 719, column: 10, scope: !489)
!500 = !DILocation(line: 719, column: 7, scope: !489)
!501 = !DILocation(line: 722, column: 31, scope: !502)
!502 = distinct !DILexicalBlock(scope: !400, file: !3, line: 722, column: 9)
!503 = !DILocation(line: 722, column: 40, scope: !502)
!504 = !DILocation(line: 722, column: 52, scope: !502)
!505 = !DILocation(line: 722, column: 61, scope: !502)
!506 = !DILocation(line: 722, column: 9, scope: !502)
!507 = !DILocation(line: 722, column: 90, scope: !502)
!508 = !DILocation(line: 722, column: 9, scope: !400)
!509 = !DILocation(line: 723, column: 10, scope: !502)
!510 = !DILocation(line: 723, column: 7, scope: !502)
!511 = !DILocation(line: 727, column: 31, scope: !512)
!512 = distinct !DILexicalBlock(scope: !400, file: !3, line: 727, column: 9)
!513 = !DILocation(line: 727, column: 40, scope: !512)
!514 = !DILocation(line: 727, column: 52, scope: !512)
!515 = !DILocation(line: 727, column: 61, scope: !512)
!516 = !DILocation(line: 727, column: 9, scope: !512)
!517 = !DILocation(line: 727, column: 92, scope: !512)
!518 = !DILocation(line: 727, column: 9, scope: !400)
!519 = !DILocation(line: 728, column: 10, scope: !512)
!520 = !DILocation(line: 728, column: 7, scope: !512)
!521 = !DILocation(line: 732, column: 18, scope: !400)
!522 = !DILocation(line: 733, column: 3, scope: !400)
!523 = !DILocation(line: 737, column: 9, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 737, column: 9)
!525 = distinct !DILexicalBlock(scope: !397, file: !3, line: 735, column: 3)
!526 = !DILocation(line: 737, column: 94, scope: !524)
!527 = !DILocation(line: 737, column: 9, scope: !525)
!528 = !DILocation(line: 738, column: 10, scope: !524)
!529 = !DILocation(line: 738, column: 7, scope: !524)
!530 = !DILocation(line: 741, column: 29, scope: !531)
!531 = distinct !DILexicalBlock(scope: !525, file: !3, line: 741, column: 9)
!532 = !DILocation(line: 741, column: 38, scope: !531)
!533 = !DILocation(line: 741, column: 50, scope: !531)
!534 = !DILocation(line: 741, column: 59, scope: !531)
!535 = !DILocation(line: 741, column: 9, scope: !531)
!536 = !DILocation(line: 741, column: 74, scope: !531)
!537 = !DILocation(line: 741, column: 9, scope: !525)
!538 = !DILocation(line: 742, column: 10, scope: !531)
!539 = !DILocation(line: 742, column: 7, scope: !531)
!540 = !DILocation(line: 745, column: 30, scope: !541)
!541 = distinct !DILexicalBlock(scope: !525, file: !3, line: 745, column: 9)
!542 = !DILocation(line: 745, column: 39, scope: !541)
!543 = !DILocation(line: 745, column: 51, scope: !541)
!544 = !DILocation(line: 745, column: 60, scope: !541)
!545 = !DILocation(line: 745, column: 9, scope: !541)
!546 = !DILocation(line: 745, column: 84, scope: !541)
!547 = !DILocation(line: 745, column: 9, scope: !525)
!548 = !DILocation(line: 746, column: 10, scope: !541)
!549 = !DILocation(line: 746, column: 7, scope: !541)
!550 = !DILocation(line: 749, column: 30, scope: !551)
!551 = distinct !DILexicalBlock(scope: !525, file: !3, line: 749, column: 9)
!552 = !DILocation(line: 749, column: 39, scope: !551)
!553 = !DILocation(line: 749, column: 51, scope: !551)
!554 = !DILocation(line: 749, column: 60, scope: !551)
!555 = !DILocation(line: 749, column: 9, scope: !551)
!556 = !DILocation(line: 749, column: 92, scope: !551)
!557 = !DILocation(line: 749, column: 9, scope: !525)
!558 = !DILocation(line: 750, column: 10, scope: !551)
!559 = !DILocation(line: 750, column: 7, scope: !551)
!560 = !DILocation(line: 753, column: 18, scope: !525)
!561 = !DILocation(line: 754, column: 30, scope: !562)
!562 = distinct !DILexicalBlock(scope: !525, file: !3, line: 754, column: 9)
!563 = !DILocation(line: 754, column: 39, scope: !562)
!564 = !DILocation(line: 754, column: 51, scope: !562)
!565 = !DILocation(line: 754, column: 60, scope: !562)
!566 = !DILocation(line: 754, column: 9, scope: !562)
!567 = !DILocation(line: 754, column: 76, scope: !562)
!568 = !DILocation(line: 754, column: 9, scope: !525)
!569 = !DILocation(line: 755, column: 10, scope: !562)
!570 = !DILocation(line: 755, column: 7, scope: !562)
!571 = !DILocation(line: 757, column: 22, scope: !562)
!572 = !DILocation(line: 757, column: 20, scope: !562)
!573 = !DILocation(line: 760, column: 21, scope: !525)
!574 = !DILocation(line: 761, column: 30, scope: !575)
!575 = distinct !DILexicalBlock(scope: !525, file: !3, line: 761, column: 9)
!576 = !DILocation(line: 761, column: 39, scope: !575)
!577 = !DILocation(line: 761, column: 51, scope: !575)
!578 = !DILocation(line: 761, column: 60, scope: !575)
!579 = !DILocation(line: 761, column: 9, scope: !575)
!580 = !DILocation(line: 761, column: 76, scope: !575)
!581 = !DILocation(line: 761, column: 9, scope: !525)
!582 = !DILocation(line: 762, column: 10, scope: !575)
!583 = !DILocation(line: 762, column: 7, scope: !575)
!584 = !DILocation(line: 764, column: 25, scope: !575)
!585 = !DILocation(line: 764, column: 23, scope: !575)
!586 = !DILocation(line: 766, column: 10, scope: !587)
!587 = distinct !DILexicalBlock(scope: !525, file: !3, line: 766, column: 9)
!588 = !DILocation(line: 766, column: 27, scope: !587)
!589 = !DILocation(line: 766, column: 25, scope: !587)
!590 = !DILocation(line: 766, column: 41, scope: !587)
!591 = !DILocation(line: 766, column: 45, scope: !587)
!592 = !DILocation(line: 766, column: 64, scope: !587)
!593 = !DILocation(line: 766, column: 69, scope: !587)
!594 = !DILocation(line: 766, column: 73, scope: !587)
!595 = !DILocation(line: 766, column: 84, scope: !587)
!596 = !DILocation(line: 766, column: 9, scope: !525)
!597 = !DILocation(line: 767, column: 10, scope: !587)
!598 = !DILocation(line: 767, column: 7, scope: !587)
!599 = !DILocation(line: 770, column: 22, scope: !525)
!600 = !DILocation(line: 771, column: 29, scope: !601)
!601 = distinct !DILexicalBlock(scope: !525, file: !3, line: 771, column: 9)
!602 = !DILocation(line: 771, column: 38, scope: !601)
!603 = !DILocation(line: 771, column: 50, scope: !601)
!604 = !DILocation(line: 771, column: 59, scope: !601)
!605 = !DILocation(line: 771, column: 9, scope: !601)
!606 = !DILocation(line: 771, column: 75, scope: !601)
!607 = !DILocation(line: 771, column: 9, scope: !525)
!608 = !DILocation(line: 772, column: 10, scope: !601)
!609 = !DILocation(line: 772, column: 7, scope: !601)
!610 = !DILocation(line: 774, column: 26, scope: !601)
!611 = !DILocation(line: 774, column: 24, scope: !601)
!612 = !DILocation(line: 777, column: 24, scope: !525)
!613 = !DILocation(line: 778, column: 29, scope: !614)
!614 = distinct !DILexicalBlock(scope: !525, file: !3, line: 778, column: 9)
!615 = !DILocation(line: 778, column: 38, scope: !614)
!616 = !DILocation(line: 778, column: 50, scope: !614)
!617 = !DILocation(line: 778, column: 59, scope: !614)
!618 = !DILocation(line: 778, column: 9, scope: !614)
!619 = !DILocation(line: 778, column: 75, scope: !614)
!620 = !DILocation(line: 778, column: 9, scope: !525)
!621 = !DILocation(line: 779, column: 10, scope: !614)
!622 = !DILocation(line: 779, column: 7, scope: !614)
!623 = !DILocation(line: 781, column: 28, scope: !614)
!624 = !DILocation(line: 781, column: 26, scope: !614)
!625 = !DILocation(line: 785, column: 30, scope: !626)
!626 = distinct !DILexicalBlock(scope: !525, file: !3, line: 785, column: 9)
!627 = !DILocation(line: 785, column: 39, scope: !626)
!628 = !DILocation(line: 785, column: 51, scope: !626)
!629 = !DILocation(line: 785, column: 60, scope: !626)
!630 = !DILocation(line: 785, column: 9, scope: !626)
!631 = !DILocation(line: 785, column: 86, scope: !626)
!632 = !DILocation(line: 785, column: 9, scope: !525)
!633 = !DILocation(line: 786, column: 10, scope: !626)
!634 = !DILocation(line: 786, column: 7, scope: !626)
!635 = !DILocation(line: 789, column: 8, scope: !636)
!636 = distinct !DILexicalBlock(scope: !338, file: !3, line: 789, column: 7)
!637 = !DILocation(line: 789, column: 20, scope: !636)
!638 = !DILocation(line: 789, column: 39, scope: !636)
!639 = !DILocation(line: 789, column: 38, scope: !636)
!640 = !DILocation(line: 789, column: 19, scope: !636)
!641 = !DILocation(line: 789, column: 57, scope: !636)
!642 = !DILocation(line: 790, column: 6, scope: !636)
!643 = !DILocation(line: 790, column: 9, scope: !636)
!644 = !DILocation(line: 789, column: 7, scope: !338)
!645 = !DILocation(line: 791, column: 8, scope: !636)
!646 = !DILocation(line: 791, column: 5, scope: !636)
!647 = !DILocation(line: 793, column: 7, scope: !648)
!648 = distinct !DILexicalBlock(scope: !338, file: !3, line: 793, column: 7)
!649 = !DILocation(line: 793, column: 10, scope: !648)
!650 = !DILocation(line: 793, column: 7, scope: !338)
!651 = !DILocation(line: 795, column: 5, scope: !652)
!652 = distinct !DILexicalBlock(scope: !648, file: !3, line: 794, column: 3)
!653 = !DILocation(line: 796, column: 5, scope: !652)
!654 = !DILocation(line: 799, column: 7, scope: !655)
!655 = distinct !DILexicalBlock(scope: !338, file: !3, line: 799, column: 7)
!656 = !DILocation(line: 799, column: 19, scope: !655)
!657 = !DILocation(line: 799, column: 7, scope: !338)
!658 = !DILocation(line: 801, column: 37, scope: !659)
!659 = distinct !DILexicalBlock(scope: !655, file: !3, line: 800, column: 3)
!660 = !DILocation(line: 801, column: 5, scope: !659)
!661 = !DILocation(line: 801, column: 14, scope: !659)
!662 = !DILocation(line: 801, column: 28, scope: !659)
!663 = !DILocation(line: 802, column: 9, scope: !664)
!664 = distinct !DILexicalBlock(scope: !659, file: !3, line: 802, column: 9)
!665 = !DILocation(line: 802, column: 18, scope: !664)
!666 = !DILocation(line: 802, column: 9, scope: !659)
!667 = !DILocation(line: 804, column: 22, scope: !668)
!668 = distinct !DILexicalBlock(scope: !664, file: !3, line: 803, column: 5)
!669 = !DILocation(line: 804, column: 20, scope: !668)
!670 = !DILocation(line: 805, column: 7, scope: !668)
!671 = !DILocation(line: 805, column: 16, scope: !668)
!672 = !DILocation(line: 805, column: 30, scope: !668)
!673 = !DILocation(line: 805, column: 43, scope: !668)
!674 = !DILocation(line: 806, column: 5, scope: !668)
!675 = !DILocation(line: 807, column: 3, scope: !659)
!676 = !DILocation(line: 809, column: 29, scope: !338)
!677 = !DILocation(line: 809, column: 44, scope: !338)
!678 = !DILocation(line: 809, column: 63, scope: !338)
!679 = !DILocation(line: 809, column: 62, scope: !338)
!680 = !DILocation(line: 809, column: 41, scope: !338)
!681 = !DILocation(line: 809, column: 27, scope: !338)
!682 = !DILocation(line: 810, column: 48, scope: !338)
!683 = !DILocation(line: 810, column: 3, scope: !338)
!684 = !DILocation(line: 810, column: 12, scope: !338)
!685 = !DILocation(line: 810, column: 46, scope: !338)
!686 = !DILocalVariable(name: "size_central_dir_to_read", scope: !687, file: !3, line: 813, type: !51)
!687 = distinct !DILexicalBlock(scope: !338, file: !3, line: 812, column: 3)
!688 = !DILocation(line: 813, column: 14, scope: !687)
!689 = !DILocation(line: 813, column: 41, scope: !687)
!690 = !DILocalVariable(name: "buf_size", scope: !687, file: !3, line: 814, type: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !692, line: 46, baseType: !35)
!692 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!693 = !DILocation(line: 814, column: 12, scope: !687)
!694 = !DILocalVariable(name: "buf_read", scope: !687, file: !3, line: 815, type: !5)
!695 = !DILocation(line: 815, column: 11, scope: !687)
!696 = !DILocation(line: 815, column: 29, scope: !687)
!697 = !DILocation(line: 816, column: 9, scope: !698)
!698 = distinct !DILexicalBlock(scope: !687, file: !3, line: 816, column: 9)
!699 = !DILocation(line: 816, column: 129, scope: !698)
!700 = !DILocation(line: 816, column: 9, scope: !687)
!701 = !DILocation(line: 817, column: 10, scope: !698)
!702 = !DILocation(line: 817, column: 7, scope: !698)
!703 = !DILocation(line: 819, column: 5, scope: !687)
!704 = !DILocation(line: 819, column: 13, scope: !687)
!705 = !DILocation(line: 819, column: 37, scope: !687)
!706 = !DILocation(line: 819, column: 41, scope: !687)
!707 = !DILocation(line: 819, column: 45, scope: !687)
!708 = !DILocation(line: 819, column: 48, scope: !687)
!709 = !DILocation(line: 0, scope: !687)
!710 = !DILocalVariable(name: "read_this", scope: !711, file: !3, line: 821, type: !51)
!711 = distinct !DILexicalBlock(scope: !687, file: !3, line: 820, column: 5)
!712 = !DILocation(line: 821, column: 16, scope: !711)
!713 = !DILocation(line: 822, column: 11, scope: !714)
!714 = distinct !DILexicalBlock(scope: !711, file: !3, line: 822, column: 11)
!715 = !DILocation(line: 822, column: 23, scope: !714)
!716 = !DILocation(line: 822, column: 21, scope: !714)
!717 = !DILocation(line: 822, column: 11, scope: !711)
!718 = !DILocation(line: 823, column: 21, scope: !714)
!719 = !DILocation(line: 823, column: 19, scope: !714)
!720 = !DILocation(line: 823, column: 9, scope: !714)
!721 = !DILocation(line: 825, column: 11, scope: !722)
!722 = distinct !DILexicalBlock(scope: !711, file: !3, line: 825, column: 11)
!723 = !DILocation(line: 825, column: 90, scope: !722)
!724 = !DILocation(line: 825, column: 87, scope: !722)
!725 = !DILocation(line: 825, column: 11, scope: !711)
!726 = !DILocation(line: 826, column: 12, scope: !722)
!727 = !DILocation(line: 826, column: 9, scope: !722)
!728 = !DILocation(line: 828, column: 11, scope: !729)
!729 = distinct !DILexicalBlock(scope: !711, file: !3, line: 828, column: 11)
!730 = !DILocation(line: 828, column: 14, scope: !729)
!731 = !DILocation(line: 828, column: 11, scope: !711)
!732 = !DILocation(line: 829, column: 38, scope: !729)
!733 = !DILocation(line: 829, column: 47, scope: !729)
!734 = !DILocation(line: 829, column: 59, scope: !729)
!735 = !DILocation(line: 829, column: 76, scope: !729)
!736 = !DILocation(line: 829, column: 15, scope: !729)
!737 = !DILocation(line: 829, column: 13, scope: !729)
!738 = !DILocation(line: 829, column: 9, scope: !729)
!739 = !DILocation(line: 831, column: 33, scope: !711)
!740 = !DILocation(line: 831, column: 31, scope: !711)
!741 = distinct !{!741, !703, !742, !743}
!742 = !DILocation(line: 832, column: 5, scope: !687)
!743 = !{!"llvm.loop.mustprogress"}
!744 = !DILocation(line: 833, column: 5, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !3, line: 833, column: 5)
!746 = distinct !DILexicalBlock(scope: !687, file: !3, line: 833, column: 5)
!747 = !DILocation(line: 833, column: 5, scope: !746)
!748 = !DILocation(line: 835, column: 24, scope: !338)
!749 = !DILocation(line: 835, column: 3, scope: !338)
!750 = !DILocation(line: 835, column: 12, scope: !338)
!751 = !DILocation(line: 835, column: 22, scope: !338)
!752 = !DILocation(line: 836, column: 27, scope: !338)
!753 = !DILocation(line: 836, column: 3, scope: !338)
!754 = !DILocation(line: 836, column: 12, scope: !338)
!755 = !DILocation(line: 836, column: 25, scope: !338)
!756 = !DILocation(line: 838, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !338, file: !3, line: 838, column: 7)
!758 = !DILocation(line: 838, column: 124, scope: !757)
!759 = !DILocation(line: 838, column: 7, scope: !338)
!760 = !DILocation(line: 839, column: 8, scope: !757)
!761 = !DILocation(line: 839, column: 5, scope: !757)
!762 = !DILocation(line: 841, column: 10, scope: !338)
!763 = !DILocation(line: 841, column: 3, scope: !338)
!764 = !DILocation(line: 842, column: 1, scope: !338)
!765 = distinct !DISubprogram(name: "zipOpen2", scope: !3, file: !3, line: 920, type: !766, scopeLine: 921, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!766 = !DISubroutineType(types: !767)
!767 = !{!177, !69, !28, !218, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "zlib_filefunc_def", file: !12, line: 176, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_filefunc_def_s", file: !12, line: 165, size: 576, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "zopen_file", scope: !770, file: !12, line: 167, baseType: !65, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "zread_file", scope: !770, file: !12, line: 168, baseType: !30, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "zwrite_file", scope: !770, file: !12, line: 169, baseType: !37, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "zflush_file", scope: !770, file: !12, line: 170, baseType: !42, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ztell_file", scope: !770, file: !12, line: 171, baseType: !73, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "zseek_file", scope: !770, file: !12, line: 172, baseType: !78, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "zclose_file", scope: !770, file: !12, line: 173, baseType: !60, size: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "zerror_file", scope: !770, file: !12, line: 174, baseType: !62, size: 64, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !770, file: !12, line: 175, baseType: !24, size: 64, offset: 512)
!781 = !DILocalVariable(name: "pathname", arg: 1, scope: !765, file: !3, line: 920, type: !69)
!782 = !DILocation(line: 920, column: 46, scope: !765)
!783 = !DILocalVariable(name: "append", arg: 2, scope: !765, file: !3, line: 920, type: !28)
!784 = !DILocation(line: 920, column: 60, scope: !765)
!785 = !DILocalVariable(name: "globalcomment", arg: 3, scope: !765, file: !3, line: 920, type: !218)
!786 = !DILocation(line: 920, column: 79, scope: !765)
!787 = !DILocalVariable(name: "pzlib_filefunc32_def", arg: 4, scope: !765, file: !3, line: 920, type: !768)
!788 = !DILocation(line: 920, column: 113, scope: !765)
!789 = !DILocation(line: 922, column: 9, scope: !790)
!790 = distinct !DILexicalBlock(scope: !765, file: !3, line: 922, column: 9)
!791 = !DILocation(line: 922, column: 30, scope: !790)
!792 = !DILocation(line: 922, column: 9, scope: !765)
!793 = !DILocalVariable(name: "zlib_filefunc64_32_def_fill", scope: !794, file: !3, line: 924, type: !11)
!794 = distinct !DILexicalBlock(scope: !790, file: !3, line: 923, column: 5)
!795 = !DILocation(line: 924, column: 32, scope: !794)
!796 = !DILocation(line: 925, column: 82, scope: !794)
!797 = !DILocation(line: 925, column: 9, scope: !794)
!798 = !DILocation(line: 926, column: 25, scope: !794)
!799 = !DILocation(line: 926, column: 35, scope: !794)
!800 = !DILocation(line: 926, column: 43, scope: !794)
!801 = !DILocation(line: 926, column: 16, scope: !794)
!802 = !DILocation(line: 926, column: 9, scope: !794)
!803 = !DILocation(line: 929, column: 25, scope: !790)
!804 = !DILocation(line: 929, column: 35, scope: !790)
!805 = !DILocation(line: 929, column: 43, scope: !790)
!806 = !DILocation(line: 929, column: 16, scope: !790)
!807 = !DILocation(line: 929, column: 9, scope: !790)
!808 = !DILocation(line: 930, column: 1, scope: !765)
!809 = distinct !DISubprogram(name: "zipOpen2_64", scope: !3, file: !3, line: 932, type: !810, scopeLine: 933, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!810 = !DISubroutineType(types: !811)
!811 = !{!177, !26, !28, !218, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!813 = !DILocalVariable(name: "pathname", arg: 1, scope: !809, file: !3, line: 932, type: !26)
!814 = !DILocation(line: 932, column: 49, scope: !809)
!815 = !DILocalVariable(name: "append", arg: 2, scope: !809, file: !3, line: 932, type: !28)
!816 = !DILocation(line: 932, column: 63, scope: !809)
!817 = !DILocalVariable(name: "globalcomment", arg: 3, scope: !809, file: !3, line: 932, type: !218)
!818 = !DILocation(line: 932, column: 82, scope: !809)
!819 = !DILocalVariable(name: "pzlib_filefunc_def", arg: 4, scope: !809, file: !3, line: 932, type: !812)
!820 = !DILocation(line: 932, column: 118, scope: !809)
!821 = !DILocation(line: 934, column: 9, scope: !822)
!822 = distinct !DILexicalBlock(scope: !809, file: !3, line: 934, column: 9)
!823 = !DILocation(line: 934, column: 28, scope: !822)
!824 = !DILocation(line: 934, column: 9, scope: !809)
!825 = !DILocalVariable(name: "zlib_filefunc64_32_def_fill", scope: !826, file: !3, line: 936, type: !11)
!826 = distinct !DILexicalBlock(scope: !822, file: !3, line: 935, column: 5)
!827 = !DILocation(line: 936, column: 32, scope: !826)
!828 = !DILocation(line: 937, column: 37, scope: !826)
!829 = !DILocation(line: 937, column: 53, scope: !826)
!830 = !DILocation(line: 937, column: 52, scope: !826)
!831 = !DILocation(line: 938, column: 37, scope: !826)
!832 = !DILocation(line: 938, column: 50, scope: !826)
!833 = !DILocation(line: 939, column: 37, scope: !826)
!834 = !DILocation(line: 939, column: 50, scope: !826)
!835 = !DILocation(line: 940, column: 25, scope: !826)
!836 = !DILocation(line: 940, column: 35, scope: !826)
!837 = !DILocation(line: 940, column: 43, scope: !826)
!838 = !DILocation(line: 940, column: 16, scope: !826)
!839 = !DILocation(line: 940, column: 9, scope: !826)
!840 = !DILocation(line: 943, column: 25, scope: !822)
!841 = !DILocation(line: 943, column: 35, scope: !822)
!842 = !DILocation(line: 943, column: 43, scope: !822)
!843 = !DILocation(line: 943, column: 16, scope: !822)
!844 = !DILocation(line: 943, column: 9, scope: !822)
!845 = !DILocation(line: 944, column: 1, scope: !809)
!846 = distinct !DISubprogram(name: "zipOpen", scope: !3, file: !3, line: 948, type: !847, scopeLine: 949, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!847 = !DISubroutineType(types: !848)
!848 = !{!177, !69, !28}
!849 = !DILocalVariable(name: "pathname", arg: 1, scope: !846, file: !3, line: 948, type: !69)
!850 = !DILocation(line: 948, column: 45, scope: !846)
!851 = !DILocalVariable(name: "append", arg: 2, scope: !846, file: !3, line: 948, type: !28)
!852 = !DILocation(line: 948, column: 59, scope: !846)
!853 = !DILocation(line: 950, column: 34, scope: !846)
!854 = !DILocation(line: 950, column: 43, scope: !846)
!855 = !DILocation(line: 950, column: 12, scope: !846)
!856 = !DILocation(line: 950, column: 5, scope: !846)
!857 = distinct !DISubprogram(name: "zipOpen64", scope: !3, file: !3, line: 953, type: !858, scopeLine: 954, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!858 = !DISubroutineType(types: !859)
!859 = !{!177, !26, !28}
!860 = !DILocalVariable(name: "pathname", arg: 1, scope: !857, file: !3, line: 953, type: !26)
!861 = !DILocation(line: 953, column: 47, scope: !857)
!862 = !DILocalVariable(name: "append", arg: 2, scope: !857, file: !3, line: 953, type: !28)
!863 = !DILocation(line: 953, column: 61, scope: !857)
!864 = !DILocation(line: 955, column: 21, scope: !857)
!865 = !DILocation(line: 955, column: 30, scope: !857)
!866 = !DILocation(line: 955, column: 12, scope: !857)
!867 = !DILocation(line: 955, column: 5, scope: !857)
!868 = distinct !DISubprogram(name: "zipOpenNewFileInZip4_64", scope: !3, file: !3, line: 1055, type: !869, scopeLine: 1062, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!869 = !DISubroutineType(types: !870)
!870 = !{!28, !177, !69, !871, !26, !118, !26, !118, !69, !28, !28, !28, !28, !28, !28, !69, !34, !34, !34, !28}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "zip_fileinfo", file: !178, line: 107, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 99, size: 384, elements: !875)
!875 = !{!876, !886, !887, !888}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tmz_date", scope: !874, file: !178, line: 101, baseType: !877, size: 192)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "tm_zip", file: !178, line: 97, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zip_s", file: !178, line: 89, size: 192, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !878, file: !178, line: 91, baseType: !118, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !878, file: !178, line: 92, baseType: !118, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !878, file: !178, line: 93, baseType: !118, size: 32, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !878, file: !178, line: 94, baseType: !118, size: 32, offset: 96)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !878, file: !178, line: 95, baseType: !118, size: 32, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !878, file: !178, line: 96, baseType: !118, size: 32, offset: 160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dosDate", scope: !874, file: !178, line: 102, baseType: !34, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "internal_fa", scope: !874, file: !178, line: 105, baseType: !34, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "external_fa", scope: !874, file: !178, line: 106, baseType: !34, size: 64, offset: 320)
!889 = !DILocalVariable(name: "file", arg: 1, scope: !868, file: !3, line: 1055, type: !177)
!890 = !DILocation(line: 1055, column: 53, scope: !868)
!891 = !DILocalVariable(name: "filename", arg: 2, scope: !868, file: !3, line: 1055, type: !69)
!892 = !DILocation(line: 1055, column: 71, scope: !868)
!893 = !DILocalVariable(name: "zipfi", arg: 3, scope: !868, file: !3, line: 1055, type: !871)
!894 = !DILocation(line: 1055, column: 101, scope: !868)
!895 = !DILocalVariable(name: "extrafield_local", arg: 4, scope: !868, file: !3, line: 1056, type: !26)
!896 = !DILocation(line: 1056, column: 54, scope: !868)
!897 = !DILocalVariable(name: "size_extrafield_local", arg: 5, scope: !868, file: !3, line: 1056, type: !118)
!898 = !DILocation(line: 1056, column: 77, scope: !868)
!899 = !DILocalVariable(name: "extrafield_global", arg: 6, scope: !868, file: !3, line: 1057, type: !26)
!900 = !DILocation(line: 1057, column: 54, scope: !868)
!901 = !DILocalVariable(name: "size_extrafield_global", arg: 7, scope: !868, file: !3, line: 1057, type: !118)
!902 = !DILocation(line: 1057, column: 78, scope: !868)
!903 = !DILocalVariable(name: "comment", arg: 8, scope: !868, file: !3, line: 1058, type: !69)
!904 = !DILocation(line: 1058, column: 54, scope: !868)
!905 = !DILocalVariable(name: "method", arg: 9, scope: !868, file: !3, line: 1058, type: !28)
!906 = !DILocation(line: 1058, column: 67, scope: !868)
!907 = !DILocalVariable(name: "level", arg: 10, scope: !868, file: !3, line: 1058, type: !28)
!908 = !DILocation(line: 1058, column: 79, scope: !868)
!909 = !DILocalVariable(name: "raw", arg: 11, scope: !868, file: !3, line: 1058, type: !28)
!910 = !DILocation(line: 1058, column: 90, scope: !868)
!911 = !DILocalVariable(name: "windowBits", arg: 12, scope: !868, file: !3, line: 1059, type: !28)
!912 = !DILocation(line: 1059, column: 46, scope: !868)
!913 = !DILocalVariable(name: "memLevel", arg: 13, scope: !868, file: !3, line: 1059, type: !28)
!914 = !DILocation(line: 1059, column: 61, scope: !868)
!915 = !DILocalVariable(name: "strategy", arg: 14, scope: !868, file: !3, line: 1059, type: !28)
!916 = !DILocation(line: 1059, column: 75, scope: !868)
!917 = !DILocalVariable(name: "password", arg: 15, scope: !868, file: !3, line: 1060, type: !69)
!918 = !DILocation(line: 1060, column: 54, scope: !868)
!919 = !DILocalVariable(name: "crcForCrypting", arg: 16, scope: !868, file: !3, line: 1060, type: !34)
!920 = !DILocation(line: 1060, column: 70, scope: !868)
!921 = !DILocalVariable(name: "versionMadeBy", arg: 17, scope: !868, file: !3, line: 1061, type: !34)
!922 = !DILocation(line: 1061, column: 48, scope: !868)
!923 = !DILocalVariable(name: "flagBase", arg: 18, scope: !868, file: !3, line: 1061, type: !34)
!924 = !DILocation(line: 1061, column: 69, scope: !868)
!925 = !DILocalVariable(name: "zip64", arg: 19, scope: !868, file: !3, line: 1061, type: !28)
!926 = !DILocation(line: 1061, column: 83, scope: !868)
!927 = !DILocalVariable(name: "zi", scope: !868, file: !3, line: 1063, type: !6)
!928 = !DILocation(line: 1063, column: 21, scope: !868)
!929 = !DILocalVariable(name: "size_filename", scope: !868, file: !3, line: 1064, type: !118)
!930 = !DILocation(line: 1064, column: 10, scope: !868)
!931 = !DILocalVariable(name: "size_comment", scope: !868, file: !3, line: 1065, type: !118)
!932 = !DILocation(line: 1065, column: 10, scope: !868)
!933 = !DILocalVariable(name: "i", scope: !868, file: !3, line: 1066, type: !118)
!934 = !DILocation(line: 1066, column: 10, scope: !868)
!935 = !DILocalVariable(name: "err", scope: !868, file: !3, line: 1067, type: !28)
!936 = !DILocation(line: 1067, column: 9, scope: !868)
!937 = !DILocation(line: 1075, column: 9, scope: !938)
!938 = distinct !DILexicalBlock(scope: !868, file: !3, line: 1075, column: 9)
!939 = !DILocation(line: 1075, column: 14, scope: !938)
