; ModuleID = './src/protocols/pubsub/sub.c'
source_filename = "./src/protocols/pubsub/sub.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_sub = type { %struct.nn_sockbase, %struct.nn_excl, %struct.nn_trie }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_excl = type { ptr, ptr, ptr }
%struct.nn_trie = type { ptr }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@nn_sub_socktype_struct = internal global %struct.nn_socktype { i32 1, i32 33, i32 2, ptr @nn_sub_create, ptr @nn_sub_ispeer, %struct.nn_list_item { ptr inttoptr (i64 -1 to ptr), ptr inttoptr (i64 -1 to ptr) } }, align 8, !dbg !0
@nn_sub_socktype = dso_local global ptr @nn_sub_socktype_struct, align 8, !dbg !129
@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !153
@.str.1 = private unnamed_addr constant [29 x i8] c"./src/protocols/pubsub/sub.c\00", align 1, !dbg !158

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_sub_socktype_struct", scope: !2, file: !7, line: 200, type: !132, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !128, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/protocols/pubsub/sub.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc5b88244588f3d83f199a6fde916715")
!4 = !{!5, !126, !28}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sub", file: !7, line: 37, size: 384, elements: !8)
!7 = !DIFile(filename: "./src/protocols/pubsub/sub.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc5b88244588f3d83f199a6fde916715")
!8 = !{!9, !82, !89}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !6, file: !7, line: 38, baseType: !10, size: 128)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !11, line: 123, size: 128, elements: !12)
!11 = !DIFile(filename: "./src/protocols/pubsub/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!12 = !{!13, !79}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !10, file: !11, line: 124, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !11, line: 84, size: 704, elements: !17)
!17 = !{!18, !23, !24, !31, !35, !36, !37, !41, !63, !64, !73}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !16, file: !11, line: 87, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !16, file: !11, line: 90, baseType: !19, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !16, file: !11, line: 97, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !22, !29}
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !11, line: 56, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !16, file: !11, line: 98, baseType: !32, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !22, !29}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !16, file: !11, line: 99, baseType: !32, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !16, file: !11, line: 100, baseType: !32, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !16, file: !11, line: 104, baseType: !38, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!28, !22}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !16, file: !11, line: 108, baseType: !42, size: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!28, !22, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !47, line: 30, size: 512, elements: !48)
!47 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!48 = !{!49, !62}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !46, file: !47, line: 33, baseType: !50, size: 256)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !51, line: 39, size: 256, elements: !52)
!51 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !50, file: !51, line: 40, baseType: !54, size: 256)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 256, elements: !60)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !56, line: 24, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !58, line: 38, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !{!61}
!61 = !DISubrange(count: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !46, file: !47, line: 36, baseType: !50, size: 256, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !16, file: !11, line: 112, baseType: !42, size: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !16, file: !11, line: 115, baseType: !65, size: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!28, !22, !28, !28, !68, !70}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!72 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !16, file: !11, line: 119, baseType: !74, size: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!28, !22, !28, !28, !77, !78}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !10, file: !11, line: 125, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !11, line: 125, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !6, file: !7, line: 39, baseType: !83, size: 192, offset: 128)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_excl", file: !84, line: 33, size: 192, elements: !85)
!84 = !DIFile(filename: "./src/protocols/pubsub/../utils/excl.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f0be91890d61f5b1f69020e9c0441656")
!85 = !{!86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !83, file: !84, line: 37, baseType: !29, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "inpipe", scope: !83, file: !84, line: 40, baseType: !29, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "outpipe", scope: !83, file: !84, line: 43, baseType: !29, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "trie", scope: !6, file: !7, line: 40, baseType: !90, size: 64, offset: 320)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_trie", file: !91, line: 87, size: 64, elements: !92)
!91 = !DIFile(filename: "./src/protocols/pubsub/trie.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "c4b73a9cd9b6d491981dbd0f39fd735b")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !90, file: !91, line: 90, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_trie_node", file: !91, line: 44, size: 192, elements: !96)
!96 = !{!97, !101, !102, !103, !107}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !95, file: !91, line: 47, baseType: !98, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 26, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !58, line: 42, baseType: !100)
!100 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !91, line: 51, baseType: !55, size: 8, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_len", scope: !95, file: !91, line: 57, baseType: !55, size: 8, offset: 40)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !95, file: !91, line: 58, baseType: !104, size: 80, offset: 48)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 80, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !95, file: !91, line: 83, baseType: !108, size: 64, offset: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !95, file: !91, line: 63, size: 64, elements: !109)
!109 = !{!110, !117}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", scope: !108, file: !91, line: 70, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !108, file: !91, line: 68, size: 64, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !111, file: !91, line: 69, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "dense", scope: !108, file: !91, line: 82, baseType: !118, size: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !108, file: !91, line: 77, size: 32, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !118, file: !91, line: 78, baseType: !55, size: 8)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !118, file: !91, line: 79, baseType: !55, size: 8, offset: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nbr", scope: !118, file: !91, line: 80, baseType: !123, size: 16, offset: 16)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 25, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !58, line: 40, baseType: !125)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!128 = !{!129, !0, !153, !158, !163, !165}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "nn_sub_socktype", scope: !2, file: !7, line: 209, type: !131, isLocal: false, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !11, line: 160, size: 384, elements: !133)
!133 = !{!134, !135, !136, !137, !142, !146}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !11, line: 163, baseType: !28, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !132, file: !11, line: 164, baseType: !28, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !11, line: 167, baseType: !28, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !132, file: !11, line: 173, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!28, !77, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !132, file: !11, line: 179, baseType: !143, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!28, !28}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !132, file: !11, line: 183, baseType: !147, size: 128, offset: 256)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !148, line: 26, size: 128, elements: !149)
!148 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!149 = !{!150, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !148, line: 27, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !148, line: 28, baseType: !151, size: 64, offset: 64)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !7, line: 188, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 184, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 23)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !7, line: 188, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 232, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 29)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "nn_sub_sockbase_vfptr", scope: !2, file: !7, line: 60, type: !15, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !7, line: 138, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 136, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 17)
!170 = !{i32 7, !"Dwarf Version", i32 5}
!171 = !{i32 2, !"Debug Info Version", i32 3}
!172 = !{i32 1, !"wchar_size", i32 4}
!173 = !{i32 8, !"PIC Level", i32 2}
!174 = !{i32 7, !"PIE Level", i32 2}
!175 = !{i32 7, !"uwtable", i32 2}
!176 = !{i32 7, !"frame-pointer", i32 2}
!177 = !{!"clang version 16.0.0"}
!178 = distinct !DISubprogram(name: "nn_sub_create", scope: !7, file: !7, line: 183, type: !139, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!179 = !{}
!180 = !DILocalVariable(name: "hint", arg: 1, scope: !178, file: !7, line: 183, type: !77)
!181 = !DILocation(line: 183, column: 33, scope: !178)
!182 = !DILocalVariable(name: "sockbase", arg: 2, scope: !178, file: !7, line: 183, type: !141)
!183 = !DILocation(line: 183, column: 60, scope: !178)
!184 = !DILocalVariable(name: "self", scope: !178, file: !7, line: 185, type: !5)
!185 = !DILocation(line: 185, column: 20, scope: !178)
!186 = !DILocation(line: 187, column: 12, scope: !178)
!187 = !DILocation(line: 187, column: 10, scope: !178)
!188 = !DILocation(line: 188, column: 5, scope: !178)
!189 = !DILocation(line: 188, column: 5, scope: !190)
!190 = distinct !DILexicalBlock(scope: !191, file: !7, line: 188, column: 5)
!191 = distinct !DILexicalBlock(scope: !178, file: !7, line: 188, column: 5)
!192 = !DILocation(line: 188, column: 5, scope: !191)
!193 = !DILocation(line: 188, column: 5, scope: !194)
!194 = distinct !DILexicalBlock(scope: !190, file: !7, line: 188, column: 5)
!195 = !DILocation(line: 189, column: 18, scope: !178)
!196 = !DILocation(line: 189, column: 48, scope: !178)
!197 = !DILocation(line: 189, column: 5, scope: !178)
!198 = !DILocation(line: 190, column: 18, scope: !178)
!199 = !DILocation(line: 190, column: 24, scope: !178)
!200 = !DILocation(line: 190, column: 6, scope: !178)
!201 = !DILocation(line: 190, column: 15, scope: !178)
!202 = !DILocation(line: 192, column: 5, scope: !178)
!203 = distinct !DISubprogram(name: "nn_sub_ispeer", scope: !7, file: !7, line: 195, type: !144, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!204 = !DILocalVariable(name: "socktype", arg: 1, scope: !203, file: !7, line: 195, type: !28)
!205 = !DILocation(line: 195, column: 31, scope: !203)
!206 = !DILocation(line: 197, column: 12, scope: !203)
!207 = !DILocation(line: 197, column: 21, scope: !203)
!208 = !DILocation(line: 197, column: 5, scope: !203)
!209 = distinct !DISubprogram(name: "nn_sub_init", scope: !7, file: !7, line: 74, type: !210, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
