; ModuleID = './src/protocols/reqrep/req.c'
source_filename = "./src/protocols/reqrep/req.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_req = type { %struct.nn_xreq, %struct.nn_fsm, i32, i32, %struct.nn_msg, %struct.nn_msg, %struct.nn_timer, i32 }
%struct.nn_xreq = type { %struct.nn_sockbase, %struct.nn_lb, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_lb = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_list = type { ptr, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }
%struct.nn_timer = type { %struct.nn_fsm, i32, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_timer, %struct.nn_fsm_event, ptr, i32 }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_req_socktype_struct", scope: !2, file: !7, line: 662, type: !299, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !295, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/protocols/reqrep/req.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3fc0a639fd0fd0decd51ff1d747131c9")
!4 = !{!5, !293, !32, !294}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_req", file: !7, line: 64, size: 9856, elements: !8)
!7 = !DIFile(filename: "./src/protocols/reqrep/req.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3fc0a639fd0fd0decd51ff1d747131c9")
!8 = !{!9, !124, !154, !155, !159, !160, !161, !292}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "xreq", scope: !6, file: !7, line: 67, baseType: !10, size: 6400)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xreq", file: !11, line: 31, size: 6400, elements: !12)
!11 = !DIFile(filename: "./src/protocols/reqrep/xreq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "d37700c5acb0e83007a808d09ccb4f66")
!12 = !{!13, !86, !119}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !10, file: !11, line: 32, baseType: !14, size: 128)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !15, line: 123, size: 128, elements: !16)
!15 = !DIFile(filename: "./src/protocols/reqrep/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!16 = !{!17, !83}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !14, file: !15, line: 124, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !15, line: 84, size: 704, elements: !21)
!21 = !{!22, !27, !28, !35, !39, !40, !41, !45, !67, !68, !77}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !20, file: !15, line: 87, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !20, file: !15, line: 90, baseType: !23, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !20, file: !15, line: 97, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !26, !33}
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !15, line: 56, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !20, file: !15, line: 98, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !26, !33}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !20, file: !15, line: 99, baseType: !36, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !20, file: !15, line: 100, baseType: !36, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !20, file: !15, line: 104, baseType: !42, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!32, !26}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !20, file: !15, line: 108, baseType: !46, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!32, !26, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !51, line: 30, size: 512, elements: !52)
!51 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!52 = !{!53, !66}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !50, file: !51, line: 33, baseType: !54, size: 256)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !55, line: 39, size: 256, elements: !56)
!55 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !54, file: !55, line: 40, baseType: !58, size: 256)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !60, line: 24, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !62, line: 38, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !50, file: !51, line: 36, baseType: !54, size: 256, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !20, file: !15, line: 112, baseType: !46, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !20, file: !15, line: 115, baseType: !69, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!32, !26, !32, !32, !72, !74}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!76 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !20, file: !15, line: 119, baseType: !78, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!32, !26, !32, !32, !81, !82}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !14, file: !15, line: 125, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !15, line: 125, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !10, file: !11, line: 33, baseType: !87, size: 3136, offset: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_lb", file: !88, line: 36, size: 3136, elements: !89)
!88 = !DIFile(filename: "./src/protocols/reqrep/../utils/lb.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "6c310e327bfaa067523d8902ab9b4696")
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !87, file: !88, line: 37, baseType: !91, size: 3136)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !92, line: 45, size: 3136, elements: !93)
!92 = !DIFile(filename: "./src/protocols/reqrep/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!93 = !{!94, !118}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !91, file: !92, line: 46, baseType: !95, size: 3072)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 3072, elements: !116)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !92, line: 40, size: 192, elements: !97)
!97 = !{!98, !109}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !96, file: !92, line: 41, baseType: !99, size: 128)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !100, line: 31, size: 128, elements: !101)
!100 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!101 = !{!102, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !99, file: !100, line: 32, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !100, line: 26, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !100, line: 27, baseType: !103, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !100, line: 28, baseType: !103, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !99, file: !100, line: 33, baseType: !103, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !96, file: !92, line: 42, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !92, line: 34, size: 256, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !111, file: !92, line: 35, baseType: !33, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !111, file: !92, line: 36, baseType: !32, size: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !111, file: !92, line: 37, baseType: !104, size: 128, offset: 128)
!116 = !{!117}
!117 = !DISubrange(count: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !91, file: !92, line: 47, baseType: !32, size: 32, offset: 3072)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "fq", scope: !10, file: !11, line: 34, baseType: !120, size: 3136, offset: 3264)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !121, line: 37, size: 3136, elements: !122)
!121 = !DIFile(filename: "./src/protocols/reqrep/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !120, file: !121, line: 38, baseType: !91, size: 3136)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !6, file: !7, line: 70, baseType: !125, size: 640, offset: 6400)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !126, line: 66, size: 640, elements: !127)
!126 = !DIFile(filename: "./src/protocols/reqrep/../../aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!127 = !{!128, !134, !135, !136, !137, !138, !141}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !125, file: !126, line: 67, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !126, line: 58, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !32, !32, !81}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !125, file: !126, line: 68, baseType: !32, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !125, file: !126, line: 69, baseType: !32, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !125, file: !126, line: 70, baseType: !81, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !125, file: !126, line: 71, baseType: !133, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !125, file: !126, line: 72, baseType: !139, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !15, line: 32, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !125, file: !126, line: 73, baseType: !142, size: 320, offset: 320)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !126, line: 34, size: 320, elements: !143)
!143 = !{!144, !145, !146, !147, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !142, file: !126, line: 35, baseType: !133, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !142, file: !126, line: 36, baseType: !32, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !142, file: !126, line: 37, baseType: !81, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !126, line: 38, baseType: !32, size: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !142, file: !126, line: 39, baseType: !149, size: 64, offset: 256)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !150, line: 33, size: 64, elements: !151)
!150 = !DIFile(filename: "./src/protocols/reqrep/../../aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !150, line: 34, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !6, file: !7, line: 71, baseType: !32, size: 32, offset: 7040)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reqid", scope: !6, file: !7, line: 75, baseType: !156, size: 32, offset: 7072)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !60, line: 26, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 42, baseType: !158)
!158 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !6, file: !7, line: 78, baseType: !50, size: 512, offset: 7104)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !6, file: !7, line: 81, baseType: !50, size: 512, offset: 7616)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !6, file: !7, line: 84, baseType: !162, size: 1664, offset: 8128)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timer", file: !163, line: 32, size: 1664, elements: !164)
!163 = !DIFile(filename: "./src/protocols/reqrep/../../aio/timer.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "36b8c8892aa99fc49b85b12a9caf893a")
!164 = !{!165, !166, !167, !173, !174, !187, !188, !291}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !162, file: !163, line: 33, baseType: !125, size: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !162, file: !163, line: 34, baseType: !32, size: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "start_task", scope: !162, file: !163, line: 35, baseType: !168, size: 128, offset: 704)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !169, line: 48, size: 128, elements: !170)
!169 = !DIFile(filename: "./src/protocols/reqrep/../../aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !168, file: !169, line: 49, baseType: !133, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !168, file: !169, line: 50, baseType: !149, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "stop_task", scope: !162, file: !163, line: 36, baseType: !168, size: 128, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "wtimer", scope: !162, file: !163, line: 37, baseType: !175, size: 256, offset: 960)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !176, line: 37, size: 256, elements: !177)
!176 = !DIFile(filename: "./src/protocols/reqrep/../../aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !175, file: !176, line: 38, baseType: !133, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !175, file: !176, line: 39, baseType: !180, size: 192, offset: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !181, line: 32, size: 192, elements: !182)
!181 = !DIFile(filename: "./src/protocols/reqrep/../../aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !180, file: !181, line: 33, baseType: !104, size: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !180, file: !181, line: 34, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !60, line: 27, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !62, line: 45, baseType: !76)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !162, file: !163, line: 38, baseType: !142, size: 320, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !162, file: !163, line: 39, baseType: !189, size: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !169, line: 53, size: 1408, elements: !191)
!191 = !{!192, !228, !233, !234, !240, !267, !268, !278}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !190, file: !169, line: 54, baseType: !193, size: 320)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !194, line: 32, size: 320, elements: !195)
!194 = !DIFile(filename: "./src/protocols/reqrep/../../aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !193, file: !194, line: 36, baseType: !197, size: 320)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !198, line: 72, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !198, line: 67, size: 320, elements: !200)
!200 = !{!201, !221, !226}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !199, file: !198, line: 69, baseType: !202, size: 320)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !203, line: 22, size: 320, elements: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!204 = !{!205, !206, !207, !208, !209, !210, !212, !213}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !202, file: !203, line: 24, baseType: !32, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !202, file: !203, line: 25, baseType: !158, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !202, file: !203, line: 26, baseType: !32, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !202, file: !203, line: 28, baseType: !158, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !202, file: !203, line: 32, baseType: !32, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !202, file: !203, line: 34, baseType: !211, size: 16, offset: 160)
!211 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !202, file: !203, line: 35, baseType: !211, size: 16, offset: 176)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !202, file: !203, line: 36, baseType: !214, size: 128, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !215, line: 55, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !215, line: 51, size: 128, elements: !217)
!217 = !{!218, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !216, file: !215, line: 53, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !216, file: !215, line: 54, baseType: !219, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !199, file: !198, line: 70, baseType: !222, size: 320)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 320, elements: !224)
!223 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!224 = !{!225}
!225 = !DISubrange(count: 40)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !199, file: !198, line: 71, baseType: !227, size: 64)
!227 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !190, file: !169, line: 55, baseType: !229, size: 128, offset: 320)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !150, line: 37, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !229, file: !150, line: 38, baseType: !153, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !229, file: !150, line: 39, baseType: !153, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !190, file: !169, line: 56, baseType: !149, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !190, file: !169, line: 57, baseType: !235, size: 64, offset: 512)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !236, line: 25, size: 64, elements: !237)
!236 = !DIFile(filename: "src/utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !235, file: !236, line: 26, baseType: !32, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !235, file: !236, line: 27, baseType: !32, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !190, file: !169, line: 58, baseType: !241, size: 320, offset: 576)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !242, line: 31, size: 320, elements: !243)
!242 = !DIFile(filename: "./src/protocols/reqrep/../../aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!243 = !{!244, !245, !246, !247, !255, !266}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !241, file: !242, line: 34, baseType: !32, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !241, file: !242, line: 37, baseType: !32, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !241, file: !242, line: 40, baseType: !32, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !241, file: !242, line: 43, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !250, line: 36, size: 64, elements: !251)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!251 = !{!252, !253, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !249, file: !250, line: 38, baseType: !32, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !249, file: !250, line: 39, baseType: !211, size: 16, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !249, file: !250, line: 40, baseType: !211, size: 16, offset: 48)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !241, file: !242, line: 52, baseType: !256, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !242, line: 48, size: 128, elements: !258)
!258 = !{!259, !264, !265}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !257, file: !242, line: 49, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !242, line: 27, size: 32, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !261, file: !242, line: 28, baseType: !32, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !257, file: !242, line: 50, baseType: !32, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !242, line: 51, baseType: !32, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !241, file: !242, line: 55, baseType: !32, size: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !190, file: !169, line: 59, baseType: !261, size: 32, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !190, file: !169, line: 60, baseType: !269, size: 256, offset: 960)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !181, line: 37, size: 256, elements: !270)
!270 = !{!271, !277}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !269, file: !181, line: 38, baseType: !272, size: 128)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !273, line: 31, size: 128, elements: !274)
!273 = !DIFile(filename: "./src/protocols/reqrep/../../aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !272, file: !273, line: 33, baseType: !185, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !272, file: !273, line: 34, baseType: !185, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !269, file: !181, line: 39, baseType: !99, size: 128, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !190, file: !169, line: 61, baseType: !279, size: 192, offset: 1216)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !280, line: 25, size: 192, elements: !281)
!280 = !DIFile(filename: "src/utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!281 = !{!282, !288, !289}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !279, file: !280, line: 27, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !285, line: 28, baseType: !286)
!285 = !DIFile(filename: "./src/protocols/reqrep/../../aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!286 = !DISubroutineType(types: !287)
!287 = !{null, !81}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !279, file: !280, line: 28, baseType: !81, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !279, file: !280, line: 29, baseType: !290, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !198, line: 27, baseType: !76)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !162, file: !163, line: 40, baseType: !32, size: 32, offset: 1600)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "resend_ivl", scope: !6, file: !7, line: 87, baseType: !32, size: 32, offset: 9792)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!295 = !{!296, !0, !314, !319, !324, !329, !334, !339, !341}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "nn_req_socktype", scope: !2, file: !7, line: 671, type: !298, isLocal: false, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !15, line: 160, size: 384, elements: !300)
!300 = !{!301, !302, !303, !304, !309, !313}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !299, file: !15, line: 163, baseType: !32, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !299, file: !15, line: 164, baseType: !32, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !15, line: 167, baseType: !32, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !299, file: !15, line: 173, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!32, !81, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !299, file: !15, line: 179, baseType: !310, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!32, !32}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !299, file: !15, line: 183, baseType: !104, size: 128, offset: 256)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !7, line: 655, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 184, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 23)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !7, line: 655, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 232, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 29)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !7, line: 399, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 240, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 30)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !7, line: 399, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 16, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 2)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !7, line: 647, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 136, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 17)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "nn_req_sockbase_vfptr", scope: !2, file: !7, line: 111, type: !19, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !7, line: 280, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 272, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 34)
!346 = !{i32 7, !"Dwarf Version", i32 5}
!347 = !{i32 2, !"Debug Info Version", i32 3}
!348 = !{i32 1, !"wchar_size", i32 4}
!349 = !{i32 8, !"PIC Level", i32 2}
!350 = !{i32 7, !"PIE Level", i32 2}
!351 = !{i32 7, !"uwtable", i32 2}
!352 = !{i32 7, !"frame-pointer", i32 2}
!353 = !{!"clang version 16.0.0"}
!354 = distinct !DISubprogram(name: "nn_req_create", scope: !7, file: !7, line: 650, type: !306, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !355)
!355 = !{}
!356 = !DILocalVariable(name: "hint", arg: 1, scope: !354, file: !7, line: 650, type: !81)
!357 = !DILocation(line: 650, column: 33, scope: !354)
!358 = !DILocalVariable(name: "sockbase", arg: 2, scope: !354, file: !7, line: 650, type: !308)
!359 = !DILocation(line: 650, column: 60, scope: !354)
!360 = !DILocalVariable(name: "self", scope: !354, file: !7, line: 652, type: !5)
!361 = !DILocation(line: 652, column: 20, scope: !354)
!362 = !DILocation(line: 654, column: 12, scope: !354)
!363 = !DILocation(line: 654, column: 10, scope: !354)
!364 = !DILocation(line: 655, column: 5, scope: !354)
!365 = !DILocation(line: 655, column: 5, scope: !366)
!366 = distinct !DILexicalBlock(scope: !367, file: !7, line: 655, column: 5)
!367 = distinct !DILexicalBlock(scope: !354, file: !7, line: 655, column: 5)
!368 = !DILocation(line: 655, column: 5, scope: !367)
!369 = !DILocation(line: 655, column: 5, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !7, line: 655, column: 5)
!371 = !DILocation(line: 656, column: 18, scope: !354)
!372 = !DILocation(line: 656, column: 48, scope: !354)
!373 = !DILocation(line: 656, column: 5, scope: !354)
!374 = !DILocation(line: 657, column: 18, scope: !354)
