; ModuleID = './src/protocols/reqrep/xrep.c'
source_filename = "./src/protocols/reqrep/xrep.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_xrep = type { %struct.nn_sockbase, i32, %struct.nn_hash, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_hash = type { i32, i32, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_list = type { ptr, ptr }
%struct.nn_xrep_data = type { ptr, %struct.nn_hash_item, %struct.nn_fq_data, i32 }
%struct.nn_hash_item = type { i32, %struct.nn_list_item }
%struct.nn_fq_data = type { %struct.nn_priolist_data }
%struct.nn_priolist_data = type { ptr, i32, %struct.nn_list_item }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"./src/protocols/reqrep/xrep.c\00", align 1, !dbg !7

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/protocols/reqrep/xrep.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "5744c9460835e6af6aea5bf73ac460e8")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 30)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 17)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !9, isLocal: true, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 34)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "nn_xrep_socktype_struct", scope: !26, file: !2, line: 270, type: !172, isLocal: true, isDefinition: true)
!26 = distinct !DICompileUnit(language: DW_LANG_C11, file: !27, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !28, globals: !168, splitDebugInlining: false, nameTableKind: None)
!27 = !DIFile(filename: "src/protocols/reqrep/xrep.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "5744c9460835e6af6aea5bf73ac460e8")
!28 = !{!29, !151, !152, !52, !166, !167}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xrep", file: !31, line: 44, size: 3456, elements: !32)
!31 = !DIFile(filename: "./src/protocols/reqrep/xrep.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "eef17bee18eaa6f75cd0f553afca7c85")
!32 = !{!33, !106, !110, !128}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !30, file: !31, line: 46, baseType: !34, size: 128)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !35, line: 123, size: 128, elements: !36)
!35 = !DIFile(filename: "./src/protocols/reqrep/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!36 = !{!37, !103}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !34, file: !35, line: 124, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !35, line: 84, size: 704, elements: !41)
!41 = !{!42, !47, !48, !55, !59, !60, !61, !65, !87, !88, !97}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !40, file: !35, line: 87, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !40, file: !35, line: 90, baseType: !43, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !40, file: !35, line: 97, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !46, !53}
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !35, line: 56, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !40, file: !35, line: 98, baseType: !56, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !46, !53}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !40, file: !35, line: 99, baseType: !56, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !40, file: !35, line: 100, baseType: !56, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !40, file: !35, line: 104, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!52, !46}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !40, file: !35, line: 108, baseType: !66, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!52, !46, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !71, line: 30, size: 512, elements: !72)
!71 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!72 = !{!73, !86}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !70, file: !71, line: 33, baseType: !74, size: 256)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !75, line: 39, size: 256, elements: !76)
!75 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !74, file: !75, line: 40, baseType: !78, size: 256)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, elements: !84)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !80, line: 24, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !82, line: 38, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !{!85}
!85 = !DISubrange(count: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !70, file: !71, line: 36, baseType: !74, size: 256, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !40, file: !35, line: 112, baseType: !66, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !40, file: !35, line: 115, baseType: !89, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!52, !46, !52, !52, !92, !94}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!96 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !40, file: !35, line: 119, baseType: !98, size: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!52, !46, !52, !52, !101, !102}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !34, file: !35, line: 125, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !35, line: 125, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !30, file: !31, line: 49, baseType: !107, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !80, line: 26, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !82, line: 42, baseType: !109)
!109 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "outpipes", scope: !30, file: !31, line: 52, baseType: !111, size: 128, offset: 192)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hash", file: !112, line: 39, size: 128, elements: !113)
!112 = !DIFile(filename: "./src/protocols/reqrep/../../utils/hash.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "68acf226c9801fc7f4ff61503e6babca")
!113 = !{!114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !111, file: !112, line: 40, baseType: !107, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !111, file: !112, line: 41, baseType: !107, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !111, file: !112, line: 42, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !119, line: 31, size: 128, elements: !120)
!119 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!120 = !{!121, !127}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !118, file: !119, line: 32, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !119, line: 26, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !119, line: 27, baseType: !122, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !119, line: 28, baseType: !122, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !118, file: !119, line: 33, baseType: !122, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "inpipes", scope: !30, file: !31, line: 55, baseType: !129, size: 3136, offset: 320)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !130, line: 37, size: 3136, elements: !131)
!130 = !DIFile(filename: "./src/protocols/reqrep/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !129, file: !130, line: 38, baseType: !133, size: 3136)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !134, line: 45, size: 3136, elements: !135)
!134 = !DIFile(filename: "./src/protocols/reqrep/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!135 = !{!136, !150}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !133, file: !134, line: 46, baseType: !137, size: 3072)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 3072, elements: !148)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !134, line: 40, size: 192, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !138, file: !134, line: 41, baseType: !118, size: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !138, file: !134, line: 42, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !134, line: 34, size: 256, elements: !144)
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !143, file: !134, line: 35, baseType: !53, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !143, file: !134, line: 36, baseType: !52, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !143, file: !134, line: 37, baseType: !123, size: 128, offset: 128)
!148 = !{!149}
!149 = !DISubrange(count: 16)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !133, file: !134, line: 47, baseType: !52, size: 32, offset: 3072)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xrep_data", file: !31, line: 37, size: 576, elements: !154)
!154 = !{!155, !156, !161, !165}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !153, file: !31, line: 38, baseType: !53, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "outitem", scope: !153, file: !31, line: 39, baseType: !157, size: 192, offset: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hash_item", file: !112, line: 34, size: 192, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !157, file: !112, line: 35, baseType: !107, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !157, file: !112, line: 36, baseType: !123, size: 128, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "initem", scope: !153, file: !31, line: 40, baseType: !162, size: 256, offset: 256)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq_data", file: !130, line: 33, size: 256, elements: !163)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !162, file: !130, line: 34, baseType: !143, size: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !31, line: 41, baseType: !107, size: 32, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!168 = !{!0, !7, !12, !17, !19, !169, !24, !187}
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "nn_xrep_socktype", scope: !26, file: !2, line: 279, type: !171, isLocal: false, isDefinition: true)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !35, line: 160, size: 384, elements: !173)
!173 = !{!174, !175, !176, !177, !182, !186}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !172, file: !35, line: 163, baseType: !52, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !172, file: !35, line: 164, baseType: !52, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !35, line: 167, baseType: !52, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !172, file: !35, line: 173, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!52, !101, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !172, file: !35, line: 179, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!52, !52}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !172, file: !35, line: 183, baseType: !123, size: 128, offset: 256)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "nn_xrep_sockbase_vfptr", scope: !26, file: !2, line: 41, type: !39, isLocal: true, isDefinition: true)
!189 = !{i32 7, !"Dwarf Version", i32 5}
!190 = !{i32 2, !"Debug Info Version", i32 3}
!191 = !{i32 1, !"wchar_size", i32 4}
!192 = !{i32 8, !"PIC Level", i32 2}
!193 = !{i32 7, !"PIE Level", i32 2}
!194 = !{i32 7, !"uwtable", i32 2}
!195 = !{i32 7, !"frame-pointer", i32 2}
!196 = !{!"clang version 16.0.0"}
!197 = distinct !DISubprogram(name: "nn_xrep_init", scope: !2, file: !2, line: 55, type: !198, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !29, !38, !101}
!200 = !{}
!201 = !DILocalVariable(name: "self", arg: 1, scope: !197, file: !2, line: 55, type: !29)
!202 = !DILocation(line: 55, column: 36, scope: !197)
!203 = !DILocalVariable(name: "vfptr", arg: 2, scope: !197, file: !2, line: 55, type: !38)
!204 = !DILocation(line: 55, column: 74, scope: !197)
!205 = !DILocalVariable(name: "hint", arg: 3, scope: !197, file: !2, line: 56, type: !101)
!206 = !DILocation(line: 56, column: 11, scope: !197)
!207 = !DILocation(line: 58, column: 24, scope: !197)
!208 = !DILocation(line: 58, column: 30, scope: !197)
!209 = !DILocation(line: 58, column: 40, scope: !197)
!210 = !DILocation(line: 58, column: 47, scope: !197)
!211 = !DILocation(line: 58, column: 5, scope: !197)
!212 = !DILocation(line: 62, column: 26, scope: !197)
!213 = !DILocation(line: 62, column: 32, scope: !197)
!214 = !DILocation(line: 62, column: 5, scope: !197)
!215 = !DILocation(line: 64, column: 20, scope: !197)
!216 = !DILocation(line: 64, column: 26, scope: !197)
!217 = !DILocation(line: 64, column: 5, scope: !197)
!218 = !DILocation(line: 65, column: 18, scope: !197)
!219 = !DILocation(line: 65, column: 24, scope: !197)
!220 = !DILocation(line: 65, column: 5, scope: !197)
!221 = !DILocation(line: 66, column: 1, scope: !197)
!222 = distinct !DISubprogram(name: "nn_xrep_term", scope: !2, file: !2, line: 68, type: !223, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !200)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !29}
!225 = !DILocalVariable(name: "self", arg: 1, scope: !222, file: !2, line: 68, type: !29)
!226 = !DILocation(line: 68, column: 36, scope: !222)
!227 = !DILocation(line: 70, column: 18, scope: !222)
!228 = !DILocation(line: 70, column: 24, scope: !222)
!229 = !DILocation(line: 70, column: 5, scope: !222)
!230 = !DILocation(line: 71, column: 20, scope: !222)
!231 = !DILocation(line: 71, column: 26, scope: !222)
!232 = !DILocation(line: 71, column: 5, scope: !222)
!233 = !DILocation(line: 72, column: 24, scope: !222)
!234 = !DILocation(line: 72, column: 30, scope: !222)
!235 = !DILocation(line: 72, column: 5, scope: !222)
!236 = !DILocation(line: 73, column: 1, scope: !222)
!237 = distinct !DISubprogram(name: "nn_xrep_add", scope: !2, file: !2, line: 85, type: !50, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !200)
!238 = !DILocalVariable(name: "self", arg: 1, scope: !237, file: !2, line: 85, type: !46)
!239 = !DILocation(line: 85, column: 38, scope: !237)
!240 = !DILocalVariable(name: "pipe", arg: 2, scope: !237, file: !2, line: 85, type: !53)
!241 = !DILocation(line: 85, column: 60, scope: !237)
!242 = !DILocalVariable(name: "xrep", scope: !237, file: !2, line: 87, type: !29)
!243 = !DILocation(line: 87, column: 21, scope: !237)
!244 = !DILocalVariable(name: "data", scope: !237, file: !2, line: 88, type: !152)
!245 = !DILocation(line: 88, column: 26, scope: !237)
!246 = !DILocation(line: 90, column: 12, scope: !237)
!247 = !DILocation(line: 90, column: 10, scope: !237)
!248 = !DILocation(line: 92, column: 12, scope: !237)
