; ModuleID = './src/protocols/reqrep/xreq.c'
source_filename = "./src/protocols/reqrep/xreq.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_xreq = type { %struct.nn_sockbase, %struct.nn_lb, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_lb = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_list = type { ptr, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_xreq_data = type { %struct.nn_lb_data, %struct.nn_fq_data }
%struct.nn_lb_data = type { %struct.nn_priolist_data }
%struct.nn_priolist_data = type { ptr, i32, %struct.nn_list_item }
%struct.nn_fq_data = type { %struct.nn_priolist_data }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [17 x i8] c"%s [%d] (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"./src/protocols/reqrep/xreq.c\00", align 1, !dbg !7

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/protocols/reqrep/xreq.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b4942e3f56362d8f726fa40dc53b7ed9")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 17)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 30)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !9, isLocal: true, isDefinition: true)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !16, isLocal: true, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !17)
!17 = !{!18}
!18 = !DISubrange(count: 23)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !16, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(scope: null, file: !2, line: 177, type: !23, isLocal: true, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 34)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "nn_xreq_socktype_struct", scope: !28, file: !2, line: 217, type: !151, isLocal: true, isDefinition: true)
!28 = distinct !DICompileUnit(language: DW_LANG_C11, file: !29, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !30, globals: !147, splitDebugInlining: false, nameTableKind: None)
!29 = !DIFile(filename: "src/protocols/reqrep/xreq.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b4942e3f56362d8f726fa40dc53b7ed9")
!30 = !{!31, !146, !54}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xreq", file: !33, line: 31, size: 6400, elements: !34)
!33 = !DIFile(filename: "./src/protocols/reqrep/xreq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "d37700c5acb0e83007a808d09ccb4f66")
!34 = !{!35, !108, !141}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !32, file: !33, line: 32, baseType: !36, size: 128)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !37, line: 123, size: 128, elements: !38)
!37 = !DIFile(filename: "./src/protocols/reqrep/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!38 = !{!39, !105}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !36, file: !37, line: 124, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !37, line: 84, size: 704, elements: !43)
!43 = !{!44, !49, !50, !57, !61, !62, !63, !67, !89, !90, !99}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !42, file: !37, line: 87, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !42, file: !37, line: 90, baseType: !45, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !42, file: !37, line: 97, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !48, !55}
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !37, line: 56, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !42, file: !37, line: 98, baseType: !58, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !48, !55}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !42, file: !37, line: 99, baseType: !58, size: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !42, file: !37, line: 100, baseType: !58, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !42, file: !37, line: 104, baseType: !64, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!54, !48}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !42, file: !37, line: 108, baseType: !68, size: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!54, !48, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !73, line: 30, size: 512, elements: !74)
!73 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!74 = !{!75, !88}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !72, file: !73, line: 33, baseType: !76, size: 256)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !77, line: 39, size: 256, elements: !78)
!77 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !76, file: !77, line: 40, baseType: !80, size: 256)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 256, elements: !86)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !82, line: 24, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !84, line: 38, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87}
!87 = !DISubrange(count: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !72, file: !73, line: 36, baseType: !76, size: 256, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !42, file: !37, line: 112, baseType: !68, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !42, file: !37, line: 115, baseType: !91, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!54, !48, !54, !54, !94, !96}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!98 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !42, file: !37, line: 119, baseType: !100, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!54, !48, !54, !54, !103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !36, file: !37, line: 125, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !37, line: 125, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !32, file: !33, line: 33, baseType: !109, size: 3136, offset: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_lb", file: !110, line: 36, size: 3136, elements: !111)
!110 = !DIFile(filename: "./src/protocols/reqrep/../utils/lb.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "6c310e327bfaa067523d8902ab9b4696")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !109, file: !110, line: 37, baseType: !113, size: 3136)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !114, line: 45, size: 3136, elements: !115)
!114 = !DIFile(filename: "./src/protocols/reqrep/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!115 = !{!116, !140}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !113, file: !114, line: 46, baseType: !117, size: 3072)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 3072, elements: !138)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !114, line: 40, size: 192, elements: !119)
!119 = !{!120, !131}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !118, file: !114, line: 41, baseType: !121, size: 128)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !122, line: 31, size: 128, elements: !123)
!122 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!123 = !{!124, !130}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !121, file: !122, line: 32, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !122, line: 26, size: 128, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !122, line: 27, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !122, line: 28, baseType: !125, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !121, file: !122, line: 33, baseType: !125, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !118, file: !114, line: 42, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !114, line: 34, size: 256, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !133, file: !114, line: 35, baseType: !55, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !133, file: !114, line: 36, baseType: !54, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !133, file: !114, line: 37, baseType: !126, size: 128, offset: 128)
!138 = !{!139}
!139 = !DISubrange(count: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !113, file: !114, line: 47, baseType: !54, size: 32, offset: 3072)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fq", scope: !32, file: !33, line: 34, baseType: !142, size: 3136, offset: 3264)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !143, line: 37, size: 3136, elements: !144)
!143 = !DIFile(filename: "./src/protocols/reqrep/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !142, file: !143, line: 38, baseType: !113, size: 3136)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!147 = !{!0, !7, !12, !14, !19, !21, !148, !26, !166}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "nn_xreq_socktype", scope: !28, file: !2, line: 226, type: !150, isLocal: false, isDefinition: true)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !37, line: 160, size: 384, elements: !152)
!152 = !{!153, !154, !155, !156, !161, !165}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !151, file: !37, line: 163, baseType: !54, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !151, file: !37, line: 164, baseType: !54, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !151, file: !37, line: 167, baseType: !54, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !151, file: !37, line: 173, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!54, !103, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !151, file: !37, line: 179, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!54, !54}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !151, file: !37, line: 183, baseType: !126, size: 128, offset: 256)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "nn_xreq_sockbase_vfptr", scope: !28, file: !2, line: 42, type: !41, isLocal: true, isDefinition: true)
!168 = !{i32 7, !"Dwarf Version", i32 5}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{i32 1, !"wchar_size", i32 4}
!171 = !{i32 8, !"PIC Level", i32 2}
!172 = !{i32 7, !"PIE Level", i32 2}
!173 = !{i32 7, !"uwtable", i32 2}
!174 = !{i32 7, !"frame-pointer", i32 2}
!175 = !{!"clang version 16.0.0"}
!176 = distinct !DISubprogram(name: "nn_xreq_init", scope: !2, file: !2, line: 56, type: !177, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !179)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !31, !40, !103}
!179 = !{}
!180 = !DILocalVariable(name: "self", arg: 1, scope: !176, file: !2, line: 56, type: !31)
!181 = !DILocation(line: 56, column: 36, scope: !176)
!182 = !DILocalVariable(name: "vfptr", arg: 2, scope: !176, file: !2, line: 56, type: !40)
!183 = !DILocation(line: 56, column: 74, scope: !176)
!184 = !DILocalVariable(name: "hint", arg: 3, scope: !176, file: !2, line: 57, type: !103)
!185 = !DILocation(line: 57, column: 11, scope: !176)
!186 = !DILocation(line: 59, column: 24, scope: !176)
!187 = !DILocation(line: 59, column: 30, scope: !176)
!188 = !DILocation(line: 59, column: 40, scope: !176)
!189 = !DILocation(line: 59, column: 47, scope: !176)
!190 = !DILocation(line: 59, column: 5, scope: !176)
!191 = !DILocation(line: 60, column: 18, scope: !176)
!192 = !DILocation(line: 60, column: 24, scope: !176)
!193 = !DILocation(line: 60, column: 5, scope: !176)
!194 = !DILocation(line: 61, column: 18, scope: !176)
!195 = !DILocation(line: 61, column: 24, scope: !176)
!196 = !DILocation(line: 61, column: 5, scope: !176)
!197 = !DILocation(line: 62, column: 1, scope: !176)
!198 = distinct !DISubprogram(name: "nn_xreq_term", scope: !2, file: !2, line: 64, type: !199, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !179)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !31}
!201 = !DILocalVariable(name: "self", arg: 1, scope: !198, file: !2, line: 64, type: !31)
!202 = !DILocation(line: 64, column: 36, scope: !198)
!203 = !DILocation(line: 66, column: 18, scope: !198)
!204 = !DILocation(line: 66, column: 24, scope: !198)
!205 = !DILocation(line: 66, column: 5, scope: !198)
!206 = !DILocation(line: 67, column: 18, scope: !198)
!207 = !DILocation(line: 67, column: 24, scope: !198)
!208 = !DILocation(line: 67, column: 5, scope: !198)
!209 = !DILocation(line: 68, column: 24, scope: !198)
!210 = !DILocation(line: 68, column: 30, scope: !198)
!211 = !DILocation(line: 68, column: 5, scope: !198)
!212 = !DILocation(line: 69, column: 1, scope: !198)
!213 = distinct !DISubprogram(name: "nn_xreq_add", scope: !2, file: !2, line: 81, type: !52, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !179)
!214 = !DILocalVariable(name: "self", arg: 1, scope: !213, file: !2, line: 81, type: !48)
!215 = !DILocation(line: 81, column: 38, scope: !213)
!216 = !DILocalVariable(name: "pipe", arg: 2, scope: !213, file: !2, line: 81, type: !55)
!217 = !DILocation(line: 81, column: 60, scope: !213)
!218 = !DILocalVariable(name: "rc", scope: !213, file: !2, line: 83, type: !54)
!219 = !DILocation(line: 83, column: 9, scope: !213)
!220 = !DILocalVariable(name: "xreq", scope: !213, file: !2, line: 84, type: !31)
!221 = !DILocation(line: 84, column: 21, scope: !213)
!222 = !DILocalVariable(name: "data", scope: !213, file: !2, line: 85, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xreq_data", file: !2, line: 34, size: 512, elements: !225)
!225 = !{!226, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lb", scope: !224, file: !2, line: 35, baseType: !227, size: 256)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_lb_data", file: !110, line: 32, size: 256, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !227, file: !110, line: 33, baseType: !133, size: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fq", scope: !224, file: !2, line: 36, baseType: !231, size: 256, offset: 256)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq_data", file: !143, line: 33, size: 256, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !231, file: !143, line: 34, baseType: !133, size: 256)
!234 = !DILocation(line: 85, column: 26, scope: !213)
!235 = !DILocalVariable(name: "sndprio", scope: !213, file: !2, line: 86, type: !54)
!236 = !DILocation(line: 86, column: 9, scope: !213)
!237 = !DILocalVariable(name: "sz", scope: !213, file: !2, line: 87, type: !96)
!238 = !DILocation(line: 87, column: 12, scope: !213)
!239 = !DILocation(line: 89, column: 12, scope: !213)
!240 = !DILocation(line: 89, column: 10, scope: !213)
!241 = !DILocation(line: 91, column: 8, scope: !213)
!242 = !DILocation(line: 92, column: 31, scope: !213)
!243 = !DILocation(line: 92, column: 37, scope: !213)
!244 = !DILocation(line: 92, column: 10, scope: !213)
!245 = !DILocation(line: 92, column: 8, scope: !213)
!246 = !DILocation(line: 93, column: 5, scope: !213)
!247 = !DILocation(line: 93, column: 5, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !2, line: 93, column: 5)
!249 = distinct !DILexicalBlock(scope: !213, file: !2, line: 93, column: 5)
!250 = !DILocation(line: 93, column: 5, scope: !249)
!251 = !DILocation(line: 93, column: 5, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !2, line: 93, column: 5)
!253 = !DILocation(line: 94, column: 5, scope: !213)
!254 = !DILocation(line: 94, column: 5, scope: !255)
!255 = distinct !DILexicalBlock(scope: !256, file: !2, line: 94, column: 5)
!256 = distinct !DILexicalBlock(scope: !213, file: !2, line: 94, column: 5)
!257 = !DILocation(line: 94, column: 5, scope: !256)
!258 = !DILocation(line: 94, column: 5, scope: !259)
!259 = distinct !DILexicalBlock(scope: !255, file: !2, line: 94, column: 5)
!260 = !DILocation(line: 96, column: 12, scope: !213)
!261 = !DILocation(line: 96, column: 10, scope: !213)
!262 = !DILocation(line: 97, column: 5, scope: !213)
!263 = !DILocation(line: 97, column: 5, scope: !264)
!264 = distinct !DILexicalBlock(scope: !265, file: !2, line: 97, column: 5)
!265 = distinct !DILexicalBlock(scope: !213, file: !2, line: 97, column: 5)
!266 = !DILocation(line: 97, column: 5, scope: !265)
!267 = !DILocation(line: 97, column: 5, scope: !268)
!268 = distinct !DILexicalBlock(scope: !264, file: !2, line: 97, column: 5)
!269 = !DILocation(line: 98, column: 22, scope: !213)
!270 = !DILocation(line: 98, column: 28, scope: !213)
!271 = !DILocation(line: 98, column: 5, scope: !213)
!272 = !DILocation(line: 99, column: 17, scope: !213)
!273 = !DILocation(line: 99, column: 23, scope: !213)
!274 = !DILocation(line: 99, column: 27, scope: !213)
!275 = !DILocation(line: 99, column: 34, scope: !213)
!276 = !DILocation(line: 99, column: 40, scope: !213)
!277 = !DILocation(line: 99, column: 44, scope: !213)
!278 = !DILocation(line: 99, column: 5, scope: !213)
!279 = !DILocation(line: 100, column: 17, scope: !213)
!280 = !DILocation(line: 100, column: 23, scope: !213)
!281 = !DILocation(line: 100, column: 27, scope: !213)
!282 = !DILocation(line: 100, column: 34, scope: !213)
!283 = !DILocation(line: 100, column: 40, scope: !213)
!284 = !DILocation(line: 100, column: 5, scope: !213)
!285 = !DILocation(line: 101, column: 5, scope: !213)
!286 = distinct !DISubprogram(name: "nn_xreq_rm", scope: !2, file: !2, line: 104, type: !59, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !179)
!287 = !DILocalVariable(name: "self", arg: 1, scope: !286, file: !2, line: 104, type: !48)
!288 = !DILocation(line: 104, column: 38, scope: !286)
!289 = !DILocalVariable(name: "pipe", arg: 2, scope: !286, file: !2, line: 104, type: !55)
!290 = !DILocation(line: 104, column: 60, scope: !286)
!291 = !DILocalVariable(name: "xreq", scope: !286, file: !2, line: 106, type: !31)
