; ModuleID = 'finedb-cli.c'
source_filename = "finedb-cli.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_s = type { ptr, ptr, i32, i32 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.ybin_s = type { ptr, i64 }

@.str = private unnamed_addr constant [5 x i8] c"help\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [4 x i8] c"use\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [4 x i8] c"get\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"del\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [4 x i8] c"put\00", align 1, !dbg !16
@.str.5 = private unnamed_addr constant [4 x i8] c"add\00", align 1, !dbg !18
@.str.6 = private unnamed_addr constant [7 x i8] c"update\00", align 1, !dbg !20
@.str.7 = private unnamed_addr constant [4 x i8] c"inc\00", align 1, !dbg !25
@.str.8 = private unnamed_addr constant [4 x i8] c"dec\00", align 1, !dbg !27
@.str.9 = private unnamed_addr constant [6 x i8] c"start\00", align 1, !dbg !29
@.str.10 = private unnamed_addr constant [7 x i8] c"commit\00", align 1, !dbg !34
@.str.11 = private unnamed_addr constant [9 x i8] c"rollback\00", align 1, !dbg !36
@.str.12 = private unnamed_addr constant [5 x i8] c"ping\00", align 1, !dbg !41
@.str.13 = private unnamed_addr constant [5 x i8] c"sync\00", align 1, !dbg !43

!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 507, type: !82, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 512, type: !162, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !49, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !2, line: 513, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 12)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !2, line: 531, type: !188, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 537, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 44)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !2, line: 539, type: !162, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 646, type: !3, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 650, type: !49, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !2, line: 652, type: !38, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !2, line: 654, type: !22, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !2, line: 656, type: !31, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !2, line: 670, type: !31, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !2, line: 674, type: !31, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !22, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !2, line: 678, type: !3, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 680, type: !117, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 682, type: !3, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 684, type: !31, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 686, type: !117, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 1088, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 17)
!275 = !{i32 7, !"Dwarf Version", i32 5}
!276 = !{i32 2, !"Debug Info Version", i32 3}
!277 = !{i32 1, !"wchar_size", i32 4}
!278 = !{i32 8, !"PIC Level", i32 2}
!279 = !{i32 7, !"PIE Level", i32 2}
!280 = !{i32 7, !"uwtable", i32 2}
!281 = !{!"clang version 16.0.0"}
!282 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 75, type: !283, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !287)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !285, !286}
!285 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!287 = !{!288, !289, !290, !309, !310, !314, !315, !318, !373, !377, !378, !379, !380, !386, !387}
!288 = !DILocalVariable(name: "argc", arg: 1, scope: !282, file: !2, line: 75, type: !285)
!289 = !DILocalVariable(name: "argv", arg: 2, scope: !282, file: !2, line: 75, type: !286)
!290 = !DILocalVariable(name: "cli", scope: !282, file: !2, line: 76, type: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_t", file: !2, line: 32, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cli_s", file: !2, line: 27, size: 192, elements: !293)
!293 = !{!294, !306, !307, !308}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "finedb", scope: !292, file: !2, line: 28, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_client_t", file: !63, line: 41, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_client_s", file: !63, line: 35, size: 192, elements: !298)
!298 = !{!299, !300, !302, !303, !305}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !297, file: !63, line: 36, baseType: !73, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !297, file: !63, line: 37, baseType: !301, size: 16, offset: 64)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !297, file: !63, line: 38, baseType: !285, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !297, file: !63, line: 39, baseType: !304, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybool_t", file: !57, line: 52, baseType: !56)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !297, file: !63, line: 40, baseType: !304, size: 32, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !292, file: !2, line: 29, baseType: !73, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "in_transaction", scope: !292, file: !2, line: 30, baseType: !304, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "autocheck", scope: !292, file: !2, line: 31, baseType: !304, size: 32, offset: 160)
!309 = !DILocalVariable(name: "hostname", scope: !282, file: !2, line: 77, type: !73)
!310 = !DILocalVariable(name: "history_file", scope: !282, file: !2, line: 78, type: !311)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 4096)
!314 = !DILocalVariable(name: "interactive_mode", scope: !282, file: !2, line: 79, type: !304)
!315 = !DILocalVariable(name: "home", scope: !316, file: !2, line: 100, type: !73)
!316 = distinct !DILexicalBlock(scope: !317, file: !2, line: 99, column: 24)
!317 = distinct !DILexicalBlock(scope: !282, file: !2, line: 99, column: 6)
!318 = !DILocalVariable(name: "hist", scope: !319, file: !2, line: 103, type: !321)
!319 = distinct !DILexicalBlock(scope: !320, file: !2, line: 102, column: 40)
!320 = distinct !DILexicalBlock(scope: !316, file: !2, line: 102, column: 7)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !323, line: 7, baseType: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !325, line: 49, size: 1728, elements: !326)
!325 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !342, !344, !345, !346, !350, !351, !353, !357, !360, !362, !365, !368, !369, !370, !371, !372}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !324, file: !325, line: 51, baseType: !285, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !324, file: !325, line: 54, baseType: !73, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !324, file: !325, line: 55, baseType: !73, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !324, file: !325, line: 56, baseType: !73, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !324, file: !325, line: 57, baseType: !73, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !324, file: !325, line: 58, baseType: !73, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !324, file: !325, line: 59, baseType: !73, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !324, file: !325, line: 60, baseType: !73, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !324, file: !325, line: 61, baseType: !73, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !324, file: !325, line: 64, baseType: !73, size: 64, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !324, file: !325, line: 65, baseType: !73, size: 64, offset: 640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !324, file: !325, line: 66, baseType: !73, size: 64, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !324, file: !325, line: 68, baseType: !340, size: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !325, line: 36, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !324, file: !325, line: 70, baseType: !343, size: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !324, file: !325, line: 72, baseType: !285, size: 32, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !324, file: !325, line: 73, baseType: !285, size: 32, offset: 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !324, file: !325, line: 74, baseType: !347, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !348, line: 152, baseType: !349)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!349 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !324, file: !325, line: 77, baseType: !301, size: 16, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !324, file: !325, line: 78, baseType: !352, size: 8, offset: 1040)
!352 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !324, file: !325, line: 79, baseType: !354, size: 8, offset: 1048)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 1)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !324, file: !325, line: 81, baseType: !358, size: 64, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !325, line: 43, baseType: null)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !324, file: !325, line: 89, baseType: !361, size: 64, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !348, line: 153, baseType: !349)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !324, file: !325, line: 91, baseType: !363, size: 64, offset: 1216)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !325, line: 37, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !324, file: !325, line: 92, baseType: !366, size: 64, offset: 1280)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !325, line: 38, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !324, file: !325, line: 93, baseType: !343, size: 64, offset: 1344)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !324, file: !325, line: 94, baseType: !72, size: 64, offset: 1408)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !324, file: !325, line: 95, baseType: !74, size: 64, offset: 1472)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !324, file: !325, line: 96, baseType: !285, size: 32, offset: 1536)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !324, file: !325, line: 98, baseType: !105, size: 160, offset: 1568)
!373 = !DILocalVariable(name: "buff", scope: !374, file: !2, line: 115, type: !311)
!374 = distinct !DILexicalBlock(scope: !375, file: !2, line: 114, column: 13)
!375 = distinct !DILexicalBlock(scope: !376, file: !2, line: 114, column: 2)
!376 = distinct !DILexicalBlock(scope: !282, file: !2, line: 114, column: 2)
!377 = !DILocalVariable(name: "line", scope: !374, file: !2, line: 115, type: !73)
!378 = !DILocalVariable(name: "pt", scope: !374, file: !2, line: 115, type: !73)
!379 = !DILocalVariable(name: "cmd", scope: !374, file: !2, line: 115, type: !73)
!380 = !DILocalVariable(name: "bufsz", scope: !381, file: !2, line: 118, type: !383)
!381 = distinct !DILexicalBlock(scope: !382, file: !2, line: 117, column: 26)
!382 = distinct !DILexicalBlock(scope: !374, file: !2, line: 117, column: 7)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !384, line: 220, baseType: !385)
!384 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !348, line: 194, baseType: !349)
!386 = !DILocalVariable(name: "linesz", scope: !381, file: !2, line: 118, type: !383)
!387 = !DILabel(scope: !374, name: "reloop", file: !2, line: 199)
!388 = !DILocation(line: 0, scope: !282)
!389 = !DILocation(line: 76, column: 2, scope: !282)
!390 = !DILocation(line: 76, column: 8, scope: !282)
!391 = !DILocation(line: 78, column: 2, scope: !282)
!392 = !DILocation(line: 78, column: 7, scope: !282)
!393 = !DILocation(line: 81, column: 2, scope: !282)
!394 = !DILocation(line: 82, column: 6, scope: !282)
!395 = !DILocation(line: 82, column: 16, scope: !282)
!396 = !{!397, !399, i64 20}
!397 = !{!"cli_s", !398, i64 0, !398, i64 8, !399, i64 16, !399, i64 20}
!398 = !{!"any pointer", !399, i64 0}
!399 = !{!"omnipotent char", !400, i64 0}
!400 = !{!"Simple C/C++ TBAA"}
!401 = !DILocation(line: 83, column: 16, scope: !402)
!402 = distinct !DILexicalBlock(scope: !282, file: !2, line: 83, column: 6)
!403 = !DILocation(line: 83, column: 19, scope: !402)
!404 = !{!398, !398, i64 0}
!405 = !{!399, !399, i64 0}
!406 = !DILocation(line: 83, column: 30, scope: !402)
!407 = !DILocation(line: 83, column: 6, scope: !282)
!408 = !DILocation(line: 85, column: 16, scope: !409)
!409 = distinct !DILexicalBlock(scope: !282, file: !2, line: 85, column: 6)
!410 = !DILocation(line: 85, column: 27, scope: !409)
!411 = !DILocation(line: 85, column: 20, scope: !409)
!412 = !DILocation(line: 85, column: 6, scope: !282)
!413 = !DILocation(line: 88, column: 20, scope: !414)
!414 = distinct !DILexicalBlock(scope: !282, file: !2, line: 88, column: 6)
!415 = !DILocation(line: 88, column: 18, scope: !414)
!416 = !{!397, !398, i64 0}
!417 = !DILocation(line: 88, column: 52, scope: !414)
!418 = !DILocation(line: 88, column: 6, scope: !282)
!419 = !DILocation(line: 89, column: 3, scope: !420)
!420 = distinct !DILexicalBlock(scope: !414, file: !2, line: 88, column: 61)
!421 = !DILocation(line: 90, column: 3, scope: !420)
!422 = !DILocation(line: 91, column: 3, scope: !420)
!423 = !DILocation(line: 93, column: 6, scope: !424)
!424 = distinct !DILexicalBlock(scope: !282, file: !2, line: 93, column: 6)
!425 = !DILocation(line: 93, column: 33, scope: !424)
!426 = !DILocation(line: 93, column: 6, scope: !282)
!427 = !DILocation(line: 94, column: 73, scope: !428)
!428 = distinct !DILexicalBlock(scope: !424, file: !2, line: 93, column: 47)
!429 = !DILocation(line: 94, column: 3, scope: !428)
!430 = !DILocation(line: 95, column: 3, scope: !428)
!431 = !DILocation(line: 96, column: 3, scope: !428)
!432 = !DILocation(line: 99, column: 6, scope: !282)
!433 = !DILocation(line: 0, scope: !316)
!434 = !DILocation(line: 102, column: 15, scope: !320)
!435 = !DILocation(line: 102, column: 31, scope: !320)
!436 = !DILocation(line: 102, column: 7, scope: !316)
!437 = !DILocation(line: 105, column: 4, scope: !319)
!438 = !DILocation(line: 106, column: 16, scope: !439)
!439 = distinct !DILexicalBlock(scope: !319, file: !2, line: 106, column: 8)
!440 = !DILocation(line: 0, scope: !319)
!441 = !DILocation(line: 106, column: 43, scope: !439)
!442 = !DILocation(line: 106, column: 8, scope: !319)
!443 = !DILocation(line: 107, column: 5, scope: !444)
!444 = distinct !DILexicalBlock(scope: !439, file: !2, line: 106, column: 52)
!445 = !DILocation(line: 108, column: 5, scope: !444)
!446 = !DILocation(line: 109, column: 4, scope: !444)
!447 = !DILocation(line: 110, column: 4, scope: !319)
!448 = !DILocation(line: 111, column: 3, scope: !319)
!449 = !DILocation(line: 114, column: 2, scope: !282)
!450 = !DILocation(line: 115, column: 3, scope: !374)
!451 = !DILocation(line: 115, column: 8, scope: !374)
!452 = !DILocation(line: 0, scope: !374)
!453 = !DILocation(line: 117, column: 7, scope: !374)
!454 = !DILocation(line: 0, scope: !381)
!455 = !DILocation(line: 120, column: 20, scope: !381)
!456 = !DILocation(line: 120, column: 49, scope: !381)
!457 = !DILocation(line: 120, column: 4, scope: !381)
!458 = !DILocation(line: 121, column: 31, scope: !459)
!459 = distinct !DILexicalBlock(scope: !381, file: !2, line: 120, column: 54)
!460 = !DILocation(line: 121, column: 39, scope: !459)
!461 = !DILocation(line: 121, column: 17, scope: !459)
!462 = !DILocation(line: 122, column: 5, scope: !459)
!463 = !DILocation(line: 123, column: 20, scope: !459)
!464 = !DILocation(line: 123, column: 31, scope: !459)
!465 = !DILocation(line: 123, column: 12, scope: !459)
!466 = !DILocation(line: 123, column: 5, scope: !459)
!467 = !DILocation(line: 125, column: 5, scope: !459)
!468 = !DILocation(line: 125, column: 16, scope: !459)
!469 = !DILocation(line: 126, column: 9, scope: !470)
!470 = distinct !DILexicalBlock(scope: !459, file: !2, line: 126, column: 9)
!471 = !DILocation(line: 126, column: 9, scope: !459)
!472 = !DILocation(line: 127, column: 6, scope: !470)
!473 = distinct !{!473, !457, !474}
!474 = !DILocation(line: 129, column: 4, scope: !381)
!475 = !DILocation(line: 131, column: 47, scope: !476)
!476 = distinct !DILexicalBlock(scope: !382, file: !2, line: 130, column: 10)
!477 = !{!397, !398, i64 8}
!478 = !DILocation(line: 131, column: 43, scope: !476)
!479 = !DILocation(line: 131, column: 4, scope: !476)
!480 = !DILocation(line: 132, column: 16, scope: !481)
!481 = distinct !DILexicalBlock(scope: !476, file: !2, line: 132, column: 8)
!482 = !DILocation(line: 132, column: 33, scope: !481)
!483 = !DILocation(line: 132, column: 8, scope: !476)
!484 = !DILocation(line: 136, column: 3, scope: !374)
!485 = distinct !{!485, !484, !484}
!486 = !DILocation(line: 139, column: 3, scope: !374)
!487 = !DILocation(line: 140, column: 3, scope: !374)
!488 = !DILocation(line: 142, column: 3, scope: !374)
!489 = !DILocation(line: 142, column: 10, scope: !374)
!490 = !DILocation(line: 142, column: 14, scope: !374)
!491 = !DILocation(line: 143, column: 4, scope: !374)
!492 = distinct !{!492, !488, !493}
!493 = !DILocation(line: 143, column: 6, scope: !374)
!494 = !DILocation(line: 144, column: 9, scope: !374)
!495 = !DILocation(line: 145, column: 3, scope: !374)
!496 = distinct !{!496, !495, !495}
!497 = !DILocation(line: 147, column: 7, scope: !498)
!498 = distinct !DILexicalBlock(scope: !374, file: !2, line: 147, column: 7)
!499 = !DILocation(line: 147, column: 14, scope: !498)
!500 = !DILocation(line: 147, column: 7, scope: !374)
!501 = !DILocation(line: 151, column: 8, scope: !502)
!502 = distinct !DILexicalBlock(scope: !374, file: !2, line: 151, column: 7)
!503 = !DILocation(line: 151, column: 32, scope: !502)
!504 = !DILocation(line: 151, column: 36, scope: !502)
!505 = !DILocation(line: 151, column: 7, scope: !374)
!506 = !DILocation(line: 152, column: 4, scope: !502)
!507 = !DILocation(line: 153, column: 8, scope: !508)
!508 = distinct !DILexicalBlock(scope: !374, file: !2, line: 153, column: 7)
!509 = !DILocation(line: 153, column: 32, scope: !508)
!510 = !DILocation(line: 207, column: 2, scope: !511, inlinedAt: !515)
!511 = distinct !DISubprogram(name: "command_help", scope: !2, file: !2, line: 206, type: !512, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !514)
!512 = !DISubroutineType(types: !513)
!513 = !{null}
!514 = !{}
!515 = distinct !DILocation(line: 154, column: 4, scope: !516)
!516 = distinct !DILexicalBlock(scope: !508, file: !2, line: 153, column: 50)
!517 = !DILocation(line: 223, column: 2, scope: !511, inlinedAt: !515)
!518 = !DILocation(line: 155, column: 4, scope: !516)
!519 = !DILocation(line: 157, column: 15, scope: !520)
!520 = distinct !DILexicalBlock(scope: !508, file: !2, line: 157, column: 14)
!521 = !DILocation(line: 157, column: 14, scope: !508)
!522 = !DILocalVariable(name: "cli", arg: 1, scope: !523, file: !2, line: 259, type: !526)
!523 = distinct !DISubprogram(name: "command_sync", scope: !2, file: !2, line: 259, type: !524, scopeLine: 259, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !527)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!527 = !{!522}
!528 = !DILocation(line: 0, scope: !523, inlinedAt: !529)
!529 = distinct !DILocation(line: 158, column: 4, scope: !530)
!530 = distinct !DILexicalBlock(scope: !520, file: !2, line: 157, column: 40)
!531 = !DILocation(line: 260, column: 19, scope: !523, inlinedAt: !529)
!532 = !DILocation(line: 260, column: 2, scope: !523, inlinedAt: !529)
!533 = !DILocation(line: 261, column: 2, scope: !523, inlinedAt: !529)
!534 = !DILocation(line: 262, column: 2, scope: !523, inlinedAt: !529)
!535 = !DILocation(line: 159, column: 4, scope: !530)
!536 = !DILocation(line: 161, column: 15, scope: !537)
!537 = distinct !DILexicalBlock(scope: !520, file: !2, line: 161, column: 14)
!538 = !DILocation(line: 161, column: 14, scope: !520)
!539 = !DILocalVariable(name: "cli", arg: 1, scope: !540, file: !2, line: 265, type: !526)
!540 = distinct !DISubprogram(name: "command_async", scope: !2, file: !2, line: 265, type: !524, scopeLine: 265, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !541)
!541 = !{!539}
!542 = !DILocation(line: 0, scope: !540, inlinedAt: !543)
!543 = distinct !DILocation(line: 162, column: 4, scope: !544)
!544 = distinct !DILexicalBlock(scope: !537, file: !2, line: 161, column: 41)
!545 = !DILocation(line: 266, column: 20, scope: !540, inlinedAt: !543)
!546 = !DILocation(line: 266, column: 2, scope: !540, inlinedAt: !543)
!547 = !DILocation(line: 267, column: 2, scope: !540, inlinedAt: !543)
!548 = !DILocation(line: 268, column: 2, scope: !540, inlinedAt: !543)
!549 = !DILocation(line: 163, column: 4, scope: !544)
!550 = !DILocation(line: 167, column: 8, scope: !551)
!551 = distinct !DILexicalBlock(scope: !374, file: !2, line: 167, column: 7)
!552 = !DILocation(line: 167, column: 7, scope: !374)
!553 = !DILocation(line: 168, column: 4, scope: !551)
!554 = !DILocation(line: 169, column: 13, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !2, line: 169, column: 12)
!556 = !DILocation(line: 169, column: 12, scope: !551)
!557 = !DILocation(line: 170, column: 4, scope: !555)
!558 = !DILocation(line: 171, column: 13, scope: !559)
!559 = distinct !DILexicalBlock(scope: !555, file: !2, line: 171, column: 12)
!560 = !DILocation(line: 171, column: 12, scope: !555)
!561 = !DILocation(line: 172, column: 4, scope: !559)
!562 = !DILocation(line: 173, column: 13, scope: !563)
!563 = distinct !DILexicalBlock(scope: !559, file: !2, line: 173, column: 12)
!564 = !DILocation(line: 173, column: 12, scope: !559)
!565 = !DILocation(line: 174, column: 4, scope: !563)
!566 = !DILocation(line: 175, column: 13, scope: !567)
!567 = distinct !DILexicalBlock(scope: !563, file: !2, line: 175, column: 12)
!568 = !DILocation(line: 175, column: 12, scope: !563)
!569 = !DILocation(line: 176, column: 4, scope: !567)
!570 = !DILocation(line: 177, column: 13, scope: !571)
!571 = distinct !DILexicalBlock(scope: !567, file: !2, line: 177, column: 12)
!572 = !DILocation(line: 177, column: 12, scope: !567)
!573 = !DILocation(line: 178, column: 4, scope: !571)
!574 = !DILocation(line: 179, column: 13, scope: !575)
!575 = distinct !DILexicalBlock(scope: !571, file: !2, line: 179, column: 12)
!576 = !DILocation(line: 179, column: 12, scope: !571)
!577 = !DILocation(line: 181, column: 13, scope: !578)
!578 = distinct !DILexicalBlock(scope: !575, file: !2, line: 181, column: 12)
!579 = !DILocation(line: 181, column: 12, scope: !575)
!580 = !DILocation(line: 183, column: 13, scope: !581)
!581 = distinct !DILexicalBlock(scope: !578, file: !2, line: 183, column: 12)
!582 = !DILocation(line: 183, column: 12, scope: !578)
!583 = !DILocation(line: 184, column: 4, scope: !581)
!584 = !DILocation(line: 185, column: 13, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !2, line: 185, column: 12)
!586 = !DILocation(line: 185, column: 12, scope: !581)
!587 = !DILocation(line: 186, column: 4, scope: !585)
!588 = !DILocation(line: 191, column: 13, scope: !589)
!589 = distinct !DILexicalBlock(scope: !585, file: !2, line: 191, column: 12)
!590 = !DILocation(line: 191, column: 12, scope: !585)
!591 = !DILocation(line: 192, column: 4, scope: !589)
!592 = !DILocation(line: 193, column: 13, scope: !593)
!593 = distinct !DILexicalBlock(scope: !589, file: !2, line: 193, column: 12)
!594 = !DILocation(line: 193, column: 12, scope: !589)
!595 = !DILocation(line: 194, column: 4, scope: !593)
!596 = !DILocation(line: 196, column: 4, scope: !597)
!597 = distinct !DILexicalBlock(scope: !593, file: !2, line: 195, column: 8)
!598 = !DILocation(line: 197, column: 4, scope: !597)
!599 = !DILocation(line: 199, column: 1, scope: !374)
!600 = !DILocation(line: 200, column: 3, scope: !374)
!601 = !DILocation(line: 201, column: 2, scope: !375)
!602 = !DILocation(line: 203, column: 1, scope: !282)
!603 = !DISubprogram(name: "bzero", scope: !604, file: !604, line: 42, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!604 = !DIFile(filename: "/usr/include/strings.h", directory: "", checksumkind: CSK_MD5, checksum: "7444da68ad94ab9f25ff447750787173")
!605 = !DISubroutineType(types: !606)
!606 = !{null, !72, !74}
!607 = !DISubprogram(name: "strcmp", scope: !608, file: !608, line: 156, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!608 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!609 = !DISubroutineType(types: !610)
!610 = !{!285, !611, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!613 = !DISubprogram(name: "finedb_create", scope: !63, file: !63, line: 50, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!614 = !DISubroutineType(types: !615)
!615 = !{!295, !611, !301}
!616 = distinct !DISubprogram(name: "printf_color", scope: !2, file: !2, line: 665, type: !617, scopeLine: 665, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !611, !73, null}
!619 = !{!620, !621, !622, !634}
!620 = !DILocalVariable(name: "color", arg: 1, scope: !616, file: !2, line: 665, type: !611)
!621 = !DILocalVariable(name: "s", arg: 2, scope: !616, file: !2, line: 665, type: !73)
!622 = !DILocalVariable(name: "ap", scope: !616, file: !2, line: 666, type: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !624, line: 22, baseType: !625)
!624 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stdarg.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !626, baseType: !627)
!626 = !DIFile(filename: "finedb-cli.c", directory: "/home/raj/FineDB/src/cli")
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 192, elements: !355)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !628, file: !626, line: 642, baseType: !58, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !628, file: !626, line: 642, baseType: !58, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !628, file: !626, line: 642, baseType: !72, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !628, file: !626, line: 642, baseType: !72, size: 64, offset: 128)
!634 = !DILocalVariable(name: "i", scope: !616, file: !2, line: 667, type: !285)
!635 = !DILocation(line: 0, scope: !616)
!636 = !DILocation(line: 666, column: 2, scope: !616)
!637 = !DILocation(line: 666, column: 10, scope: !616)
!638 = !DILocation(line: 669, column: 2, scope: !616)
!639 = !DILocation(line: 670, column: 7, scope: !640)
!640 = distinct !DILexicalBlock(scope: !616, file: !2, line: 670, column: 6)
!641 = !DILocation(line: 670, column: 6, scope: !616)
!642 = !DILocation(line: 672, column: 12, scope: !643)
!643 = distinct !DILexicalBlock(scope: !640, file: !2, line: 672, column: 11)
!644 = !DILocation(line: 672, column: 11, scope: !640)
!645 = !DILocation(line: 674, column: 12, scope: !646)
!646 = distinct !DILexicalBlock(scope: !643, file: !2, line: 674, column: 11)
!647 = !DILocation(line: 674, column: 11, scope: !643)
!648 = !DILocation(line: 676, column: 12, scope: !649)
!649 = distinct !DILexicalBlock(scope: !646, file: !2, line: 676, column: 11)
!650 = !DILocation(line: 676, column: 11, scope: !646)
!651 = !DILocation(line: 678, column: 12, scope: !652)
!652 = distinct !DILexicalBlock(scope: !649, file: !2, line: 678, column: 11)
!653 = !DILocation(line: 678, column: 11, scope: !649)
!654 = !DILocation(line: 680, column: 12, scope: !655)
!655 = distinct !DILexicalBlock(scope: !652, file: !2, line: 680, column: 11)
!656 = !DILocation(line: 680, column: 11, scope: !652)
!657 = !DILocation(line: 682, column: 12, scope: !658)
!658 = distinct !DILexicalBlock(scope: !655, file: !2, line: 682, column: 11)
!659 = !DILocation(line: 682, column: 11, scope: !655)
!660 = !DILocation(line: 686, column: 2, scope: !616)
!661 = !DILocalVariable(name: "__fmt", arg: 1, scope: !662, file: !663, line: 39, type: !666)
!662 = distinct !DISubprogram(name: "vprintf", scope: !663, file: !663, line: 39, type: !664, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !668)
!663 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!664 = !DISubroutineType(types: !665)
!665 = !{!285, !666, !667}
!666 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !611)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!668 = !{!661, !669}
!669 = !DILocalVariable(name: "__arg", arg: 2, scope: !662, file: !663, line: 39, type: !667)
!670 = !DILocation(line: 0, scope: !662, inlinedAt: !671)
!671 = distinct !DILocation(line: 687, column: 2, scope: !616)
!672 = !DILocation(line: 41, column: 20, scope: !662, inlinedAt: !671)
!673 = !{!674}
!674 = distinct !{!674, !675, !"vprintf: argument 0"}
!675 = distinct !{!675, !"vprintf"}
!676 = !DILocation(line: 41, column: 10, scope: !662, inlinedAt: !671)
!677 = !DILocation(line: 688, column: 2, scope: !616)
!678 = !DILocation(line: 689, column: 2, scope: !616)
!679 = !DILocation(line: 690, column: 1, scope: !616)
!680 = !DISubprogram(name: "printf", scope: !681, file: !681, line: 356, type: !682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!681 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!682 = !DISubroutineType(types: !683)
!683 = !{!285, !666, null}
!684 = !DISubprogram(name: "exit", scope: !685, file: !685, line: 624, type: !686, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !514)
!685 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!686 = !DISubroutineType(types: !687)
!687 = !{null, !285}
!688 = !DISubprogram(name: "finedb_connect", scope: !63, file: !63, line: 65, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!689 = !DISubroutineType(types: !690)
!690 = !{!285, !295}
!691 = !DISubprogram(name: "getenv", scope: !685, file: !685, line: 641, type: !692, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!692 = !DISubroutineType(types: !693)
!693 = !{!73, !611}
!694 = !DISubprogram(name: "snprintf", scope: !681, file: !681, line: 378, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!695 = !DISubroutineType(types: !696)
!696 = !{!285, !697, !74, !666, null}
!697 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !73)
!698 = !DISubprogram(name: "fopen", scope: !681, file: !681, line: 258, type: !699, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!699 = !DISubroutineType(types: !700)
!700 = !{!321, !666, !666}
!701 = !DISubprogram(name: "fclose", scope: !681, file: !681, line: 178, type: !702, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!702 = !DISubroutineType(types: !703)
!703 = !{!285, !321}
!704 = !DISubprogram(name: "linenoiseHistoryLoad", scope: !705, file: !705, line: 53, type: !706, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!705 = !DIFile(filename: "../../lib/linenoise/linenoise.h", directory: "/home/raj/FineDB/src/cli", checksumkind: CSK_MD5, checksum: "f1ded1c74c65db7d30c5f45ba2e5463d")
!706 = !DISubroutineType(types: !707)
!707 = !{!285, !73}
!708 = !DISubprogram(name: "linenoiseSetCompletionCallback", scope: !705, file: !705, line: 46, type: !709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenoiseCompletionCallback", file: !705, line: 45, baseType: !713)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !611, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "linenoiseCompletions", file: !705, line: 43, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linenoiseCompletions", file: !705, line: 40, size: 128, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !717, file: !705, line: 41, baseType: !74, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cvec", scope: !717, file: !705, line: 42, baseType: !286, size: 64, offset: 64)
!721 = distinct !DISubprogram(name: "cli_completion", scope: !2, file: !2, line: 622, type: !713, scopeLine: 622, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !722)
!722 = !{!723, !724, !725, !726, !727}
!723 = !DILocalVariable(name: "buf", arg: 1, scope: !721, file: !2, line: 622, type: !611)
!724 = !DILocalVariable(name: "lc", arg: 2, scope: !721, file: !2, line: 622, type: !715)
!725 = !DILocalVariable(name: "i", scope: !721, file: !2, line: 623, type: !58)
!726 = !DILocalVariable(name: "bufsz", scope: !721, file: !2, line: 624, type: !74)
!727 = !DILocalVariable(name: "cmd", scope: !728, file: !2, line: 627, type: !73)
!728 = distinct !DILexicalBlock(scope: !729, file: !2, line: 626, column: 32)
!729 = distinct !DILexicalBlock(scope: !730, file: !2, line: 626, column: 2)
!730 = distinct !DILexicalBlock(scope: !721, file: !2, line: 626, column: 2)
!731 = !DILocation(line: 0, scope: !721)
!732 = !DILocation(line: 624, column: 17, scope: !721)
!733 = !DILocation(line: 626, column: 14, scope: !729)
!734 = !DILocation(line: 626, column: 2, scope: !730)
!735 = !DILocation(line: 0, scope: !728)
!736 = !DILocation(line: 629, column: 7, scope: !737)
!737 = distinct !DILexicalBlock(scope: !728, file: !2, line: 629, column: 7)
!738 = !DILocation(line: 629, column: 19, scope: !737)
!739 = !DILocation(line: 629, column: 7, scope: !728)
!740 = !DILocation(line: 631, column: 8, scope: !741)
!741 = distinct !DILexicalBlock(scope: !728, file: !2, line: 631, column: 7)
!742 = !DILocation(line: 631, column: 7, scope: !728)
!743 = !DILocation(line: 632, column: 4, scope: !741)
!744 = !DILocation(line: 626, column: 27, scope: !729)
!745 = distinct !{!745, !734, !746}
!746 = !DILocation(line: 633, column: 2, scope: !730)
!747 = !DILocation(line: 634, column: 1, scope: !721)
!748 = !DISubprogram(name: "read", scope: !384, file: !384, line: 371, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!749 = !DISubroutineType(types: !750)
!750 = !{!383, !285, !72, !74}
!751 = !DISubprogram(name: "malloc", scope: !685, file: !685, line: 540, type: !752, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!752 = !DISubroutineType(types: !753)
!753 = !{!72, !74}
!754 = !DISubprogram(name: "free", scope: !685, file: !685, line: 555, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !72}
!757 = !DISubprogram(name: "linenoise", scope: !705, file: !705, line: 49, type: !692, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!758 = !DISubprogram(name: "linenoiseHistoryAdd", scope: !705, file: !705, line: 50, type: !759, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!759 = !DISubroutineType(types: !760)
!760 = !{!285, !611}
!761 = !DISubprogram(name: "linenoiseHistorySave", scope: !705, file: !705, line: 52, type: !706, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!762 = !DISubprogram(name: "strcasecmp", scope: !604, file: !604, line: 116, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !514)
!763 = !DILocation(line: 207, column: 2, scope: !511)
!764 = !DILocation(line: 223, column: 2, scope: !511)
!765 = !DILocation(line: 224, column: 1, scope: !511)
!766 = !DILocation(line: 0, scope: !523)
!767 = !DILocation(line: 260, column: 19, scope: !523)
!768 = !DILocation(line: 260, column: 2, scope: !523)
!769 = !DILocation(line: 261, column: 2, scope: !523)
!770 = !DILocation(line: 262, column: 2, scope: !523)
!771 = !DILocation(line: 263, column: 1, scope: !523)
!772 = !DILocation(line: 0, scope: !540)
!773 = !DILocation(line: 266, column: 20, scope: !540)
!774 = !DILocation(line: 266, column: 2, scope: !540)
!775 = !DILocation(line: 267, column: 2, scope: !540)
!776 = !DILocation(line: 268, column: 2, scope: !540)
!777 = !DILocation(line: 269, column: 1, scope: !540)
!778 = distinct !DISubprogram(name: "command_use", scope: !2, file: !2, line: 227, type: !779, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !526, !73}
!781 = !{!782, !783, !784}
!782 = !DILocalVariable(name: "cli", arg: 1, scope: !778, file: !2, line: 227, type: !526)
!783 = !DILocalVariable(name: "pt", arg: 2, scope: !778, file: !2, line: 227, type: !73)
!784 = !DILocalVariable(name: "rc", scope: !778, file: !2, line: 228, type: !285)
!785 = !DILocation(line: 0, scope: !778)
!786 = !DILocalVariable(name: "cli", arg: 1, scope: !787, file: !2, line: 523, type: !526)
!787 = distinct !DISubprogram(name: "check_connection", scope: !2, file: !2, line: 523, type: !788, scopeLine: 523, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{!285, !526}
!790 = !{!786}
!791 = !DILocation(line: 0, scope: !787, inlinedAt: !792)
!792 = distinct !DILocation(line: 231, column: 7, scope: !793)
!793 = distinct !DILexicalBlock(scope: !778, file: !2, line: 231, column: 6)
!794 = !DILocation(line: 524, column: 12, scope: !795, inlinedAt: !792)
!795 = distinct !DILexicalBlock(scope: !787, file: !2, line: 524, column: 6)
!796 = !DILocation(line: 524, column: 7, scope: !795, inlinedAt: !792)
!797 = !DILocation(line: 524, column: 6, scope: !787, inlinedAt: !792)
!798 = !DILocation(line: 527, column: 24, scope: !799, inlinedAt: !792)
!799 = distinct !DILexicalBlock(scope: !787, file: !2, line: 527, column: 6)
!800 = !DILocation(line: 527, column: 7, scope: !799, inlinedAt: !792)
!801 = !DILocation(line: 527, column: 6, scope: !787, inlinedAt: !792)
!802 = !DILocation(line: 530, column: 26, scope: !803, inlinedAt: !792)
!803 = distinct !DILexicalBlock(scope: !787, file: !2, line: 530, column: 6)
!804 = !DILocation(line: 530, column: 6, scope: !803, inlinedAt: !792)
!805 = !DILocation(line: 530, column: 34, scope: !803, inlinedAt: !792)
!806 = !DILocation(line: 530, column: 6, scope: !787, inlinedAt: !792)
!807 = !DILocation(line: 531, column: 3, scope: !808, inlinedAt: !792)
!808 = distinct !DILexicalBlock(scope: !803, file: !2, line: 530, column: 48)
!809 = !DILocation(line: 231, column: 6, scope: !778)
!810 = !DILocation(line: 535, column: 11, scope: !811, inlinedAt: !792)
!811 = distinct !DILexicalBlock(scope: !787, file: !2, line: 535, column: 6)
!812 = !{!397, !399, i64 16}
!813 = !DILocation(line: 535, column: 6, scope: !811, inlinedAt: !792)
!814 = !DILocation(line: 535, column: 6, scope: !787, inlinedAt: !792)
!815 = !DILocation(line: 536, column: 23, scope: !816, inlinedAt: !792)
!816 = distinct !DILexicalBlock(scope: !811, file: !2, line: 535, column: 27)
!817 = !DILocation(line: 538, column: 2, scope: !816, inlinedAt: !792)
!818 = !DILocation(line: 0, scope: !811, inlinedAt: !792)
!819 = !DILocation(line: 234, column: 7, scope: !820)
!820 = distinct !DILexicalBlock(scope: !778, file: !2, line: 234, column: 6)
!821 = !DILocation(line: 234, column: 18, scope: !820)
!822 = !DILocation(line: 234, column: 22, scope: !820)
!823 = !DILocation(line: 234, column: 6, scope: !778)
!824 = !DILocation(line: 236, column: 31, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !2, line: 236, column: 7)
!826 = distinct !DILexicalBlock(scope: !820, file: !2, line: 234, column: 49)
!827 = !DILocation(line: 236, column: 13, scope: !825)
!828 = !DILocation(line: 236, column: 46, scope: !825)
!829 = !DILocation(line: 236, column: 7, scope: !826)
!830 = !DILocation(line: 237, column: 4, scope: !831)
!831 = distinct !DILexicalBlock(scope: !825, file: !2, line: 236, column: 52)
!832 = !DILocation(line: 239, column: 3, scope: !831)
!833 = !DILocation(line: 240, column: 4, scope: !834)
!834 = distinct !DILexicalBlock(scope: !825, file: !2, line: 239, column: 10)
!835 = !DILocation(line: 241, column: 4, scope: !834)
!836 = !DILocation(line: 246, column: 31, scope: !837)
!837 = distinct !DILexicalBlock(scope: !838, file: !2, line: 246, column: 7)
!838 = distinct !DILexicalBlock(scope: !820, file: !2, line: 244, column: 9)
!839 = !DILocation(line: 246, column: 13, scope: !837)
!840 = !DILocation(line: 246, column: 44, scope: !837)
!841 = !DILocation(line: 246, column: 7, scope: !838)
!842 = !DILocation(line: 247, column: 4, scope: !843)
!843 = distinct !DILexicalBlock(scope: !837, file: !2, line: 246, column: 50)
!844 = !DILocation(line: 249, column: 3, scope: !843)
!845 = !DILocation(line: 250, column: 4, scope: !846)
!846 = distinct !DILexicalBlock(scope: !837, file: !2, line: 249, column: 10)
!847 = !DILocation(line: 251, column: 18, scope: !846)
!848 = !DILocation(line: 251, column: 16, scope: !846)
!849 = !DILocation(line: 252, column: 4, scope: !846)
!850 = !DILocation(line: 256, column: 1, scope: !778)
!851 = distinct !DISubprogram(name: "command_get", scope: !2, file: !2, line: 272, type: !779, scopeLine: 272, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !852)
!852 = !{!853, !854, !855, !856, !857, !864, !865}
!853 = !DILocalVariable(name: "cli", arg: 1, scope: !851, file: !2, line: 272, type: !526)
!854 = !DILocalVariable(name: "pt", arg: 2, scope: !851, file: !2, line: 272, type: !73)
!855 = !DILocalVariable(name: "pt2", scope: !851, file: !2, line: 273, type: !73)
!856 = !DILocalVariable(name: "key", scope: !851, file: !2, line: 273, type: !73)
!857 = !DILocalVariable(name: "bkey", scope: !851, file: !2, line: 274, type: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybin_t", file: !859, line: 33, baseType: !860)
!859 = !DIFile(filename: "../../lib/ylib/ybin.h", directory: "/home/raj/FineDB/src/cli", checksumkind: CSK_MD5, checksum: "7abd7d5e6afd31e8416cab6f0a6bf3b3")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ybin_s", file: !859, line: 27, size: 128, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !860, file: !859, line: 28, baseType: !72, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !860, file: !859, line: 29, baseType: !74, size: 64, offset: 64)
!864 = !DILocalVariable(name: "bdata", scope: !851, file: !2, line: 274, type: !858)
!865 = !DILocalVariable(name: "rc", scope: !851, file: !2, line: 275, type: !285)
!866 = !DILocation(line: 0, scope: !851)
!867 = !DILocation(line: 274, column: 2, scope: !851)
!868 = !DILocation(line: 274, column: 9, scope: !851)
!869 = !DILocation(line: 274, column: 15, scope: !851)
!870 = !DILocation(line: 277, column: 2, scope: !851)
!871 = distinct !{!871, !870, !870}
!872 = !DILocation(line: 279, column: 3, scope: !873)
!873 = distinct !DILexicalBlock(scope: !874, file: !2, line: 278, column: 18)
!874 = distinct !DILexicalBlock(scope: !851, file: !2, line: 278, column: 6)
!875 = !DILocation(line: 280, column: 3, scope: !873)
!876 = !DILocation(line: 281, column: 3, scope: !873)
!877 = !DILocation(line: 283, column: 4, scope: !851)
!878 = !DILocation(line: 284, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !851, file: !2, line: 284, column: 6)
!880 = !DILocation(line: 284, column: 6, scope: !851)
!881 = !DILocation(line: 285, column: 3, scope: !882)
!882 = distinct !DILexicalBlock(scope: !879, file: !2, line: 284, column: 12)
!883 = !DILocation(line: 286, column: 3, scope: !882)
!884 = !DILocation(line: 287, column: 3, scope: !882)
!885 = !DILocation(line: 291, column: 13, scope: !886)
!886 = distinct !DILexicalBlock(scope: !851, file: !2, line: 291, column: 6)
!887 = !DILocation(line: 291, column: 31, scope: !886)
!888 = !DILocation(line: 291, column: 6, scope: !851)
!889 = !DILocation(line: 292, column: 3, scope: !890)
!890 = distinct !DILexicalBlock(scope: !886, file: !2, line: 291, column: 40)
!891 = !DILocation(line: 293, column: 3, scope: !890)
!892 = !DILocation(line: 294, column: 3, scope: !890)
!893 = !DILocation(line: 296, column: 7, scope: !851)
!894 = !DILocation(line: 0, scope: !787, inlinedAt: !895)
!895 = distinct !DILocation(line: 299, column: 7, scope: !896)
!896 = distinct !DILexicalBlock(scope: !851, file: !2, line: 299, column: 6)
!897 = !DILocation(line: 524, column: 12, scope: !795, inlinedAt: !895)
!898 = !DILocation(line: 524, column: 7, scope: !795, inlinedAt: !895)
!899 = !DILocation(line: 524, column: 6, scope: !787, inlinedAt: !895)
!900 = !DILocation(line: 527, column: 24, scope: !799, inlinedAt: !895)
!901 = !DILocation(line: 527, column: 7, scope: !799, inlinedAt: !895)
!902 = !DILocation(line: 527, column: 6, scope: !787, inlinedAt: !895)
!903 = !DILocation(line: 530, column: 26, scope: !803, inlinedAt: !895)
!904 = !DILocation(line: 530, column: 6, scope: !803, inlinedAt: !895)
!905 = !DILocation(line: 530, column: 34, scope: !803, inlinedAt: !895)
!906 = !DILocation(line: 530, column: 6, scope: !787, inlinedAt: !895)
!907 = !DILocation(line: 531, column: 3, scope: !808, inlinedAt: !895)
!908 = !DILocation(line: 299, column: 6, scope: !851)
!909 = !DILocation(line: 535, column: 11, scope: !811, inlinedAt: !895)
!910 = !DILocation(line: 535, column: 6, scope: !811, inlinedAt: !895)
!911 = !DILocation(line: 535, column: 6, scope: !787, inlinedAt: !895)
!912 = !DILocation(line: 536, column: 23, scope: !816, inlinedAt: !895)
!913 = !DILocation(line: 538, column: 2, scope: !816, inlinedAt: !895)
!914 = !DILocation(line: 0, scope: !811, inlinedAt: !895)
!915 = !DILocation(line: 302, column: 2, scope: !851)
!916 = !DILocation(line: 303, column: 23, scope: !851)
!917 = !DILocation(line: 303, column: 2, scope: !851)
!918 = !DILocation(line: 304, column: 23, scope: !851)
!919 = !DILocation(line: 304, column: 7, scope: !851)
!920 = !DILocation(line: 305, column: 6, scope: !921)
!921 = distinct !DILexicalBlock(scope: !851, file: !2, line: 305, column: 6)
!922 = !DILocation(line: 305, column: 6, scope: !851)
!923 = !DILocation(line: 306, column: 3, scope: !924)
!924 = distinct !DILexicalBlock(scope: !921, file: !2, line: 305, column: 10)
!925 = !DILocation(line: 307, column: 3, scope: !924)
