; ModuleID = '/home/raj/coturn/src/apps/rfc5769/rfc5769check.c'
source_filename = "/home/raj/coturn/src/apps/rfc5769/rfc5769check.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stun_tid = type { [12 x i8] }
%union.ioa_addr = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._oauth_token = type { %struct._oauth_encrypted_block }
%struct._oauth_encrypted_block = type { i16, [256 x i8], i16, [128 x i8], i64, i32 }
%struct._oauth_key = type { [129 x i8], [257 x i8], i64, i32, i32, i32, [257 x i8], i64, [257 x i8], i64 }
%struct._oauth_key_data = type { [129 x i8], [257 x i8], i64, i32, i32, [65 x i8] }
%struct._oauth_key_data_raw = type { [129 x i8], [257 x i8], i64, i32, [65 x i8], [128 x i8] }
%struct._encoded_oauth_token = type { [1024 x i8], i64 }

@.str = private unnamed_addr constant [19 x i8] c"\0Afield %s %lu==>>\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [7 x i8] c"\\x%02x\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [15 x i8] c"\0A<<==field %s\0A\00", align 1, !dbg !12
@print_extra = internal global i32 0, align 4, !dbg !17
@.str.3 = private unnamed_addr constant [7 x i8] c"stdout\00", align 1, !dbg !72

!623 = !DILocalVariable(name: "buf", scope: !618, file: !2, line: 406, type: !624)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 648, elements: !620)
!625 = !DILocation(line: 406, column: 11, scope: !618)
!626 = !DILocation(line: 407, column: 3, scope: !618)
!627 = !DILocation(line: 411, column: 49, scope: !628)
!628 = distinct !DILexicalBlock(scope: !618, file: !2, line: 409, column: 3)
!629 = !DILocation(line: 411, column: 10, scope: !628)
!630 = !DILocation(line: 411, column: 8, scope: !628)
!631 = !DILocation(line: 412, column: 4, scope: !628)
!632 = !DILocation(line: 414, column: 8, scope: !633)
!633 = distinct !DILexicalBlock(scope: !628, file: !2, line: 414, column: 8)
!634 = !DILocation(line: 414, column: 8, scope: !628)
!635 = !DILocation(line: 415, column: 5, scope: !636)
!636 = distinct !DILexicalBlock(scope: !633, file: !2, line: 414, column: 13)
!637 = !DILocation(line: 416, column: 4, scope: !636)
!638 = !DILocation(line: 416, column: 15, scope: !639)
!639 = distinct !DILexicalBlock(scope: !633, file: !2, line: 416, column: 15)
!640 = !DILocation(line: 416, column: 19, scope: !639)
!641 = !DILocation(line: 416, column: 15, scope: !633)
!642 = !DILocation(line: 417, column: 5, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !2, line: 416, column: 25)
!644 = !DILocation(line: 418, column: 5, scope: !643)
!645 = !DILocalVariable(name: "uname", scope: !646, file: !2, line: 423, type: !382)
!646 = distinct !DILexicalBlock(scope: !618, file: !2, line: 422, column: 3)
!647 = !DILocation(line: 423, column: 12, scope: !646)
!648 = !DILocalVariable(name: "realm", scope: !646, file: !2, line: 424, type: !382)
!649 = !DILocation(line: 424, column: 12, scope: !646)
!650 = !DILocalVariable(name: "upwd", scope: !646, file: !2, line: 425, type: !382)
!651 = !DILocation(line: 425, column: 12, scope: !646)
!652 = !DILocation(line: 426, column: 19, scope: !646)
!653 = !DILocation(line: 426, column: 4, scope: !646)
!654 = !DILocation(line: 428, column: 72, scope: !646)
!655 = !DILocation(line: 428, column: 97, scope: !646)
!656 = !DILocation(line: 428, column: 104, scope: !646)
!657 = !DILocation(line: 428, column: 111, scope: !646)
!658 = !DILocation(line: 428, column: 117, scope: !646)
!659 = !DILocation(line: 428, column: 10, scope: !646)
!660 = !DILocation(line: 428, column: 8, scope: !646)
!661 = !DILocation(line: 429, column: 4, scope: !646)
!662 = !DILocation(line: 431, column: 8, scope: !663)
!663 = distinct !DILexicalBlock(scope: !646, file: !2, line: 431, column: 8)
!664 = !DILocation(line: 431, column: 12, scope: !663)
!665 = !DILocation(line: 431, column: 8, scope: !646)
!666 = !DILocation(line: 432, column: 5, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !2, line: 431, column: 17)
!668 = !DILocation(line: 433, column: 4, scope: !667)
!669 = !DILocation(line: 433, column: 15, scope: !670)
!670 = distinct !DILexicalBlock(scope: !663, file: !2, line: 433, column: 15)
!671 = !DILocation(line: 433, column: 19, scope: !670)
!672 = !DILocation(line: 433, column: 15, scope: !663)
!673 = !DILocation(line: 434, column: 5, scope: !674)
!674 = distinct !DILexicalBlock(scope: !670, file: !2, line: 433, column: 25)
!675 = !DILocation(line: 435, column: 5, scope: !674)
!676 = !DILocation(line: 437, column: 5, scope: !677)
!677 = distinct !DILexicalBlock(scope: !670, file: !2, line: 436, column: 11)
!678 = !DILocation(line: 438, column: 5, scope: !677)
!679 = !DILocation(line: 443, column: 4, scope: !680)
!680 = distinct !DILexicalBlock(scope: !618, file: !2, line: 442, column: 3)
!681 = !DILocation(line: 443, column: 12, scope: !680)
!682 = !DILocation(line: 445, column: 49, scope: !680)
!683 = !DILocation(line: 445, column: 10, scope: !680)
!684 = !DILocation(line: 445, column: 8, scope: !680)
!685 = !DILocation(line: 446, column: 4, scope: !680)
!686 = !DILocation(line: 448, column: 9, scope: !687)
!687 = distinct !DILexicalBlock(scope: !680, file: !2, line: 448, column: 8)
!688 = !DILocation(line: 448, column: 8, scope: !680)
!689 = !DILocation(line: 449, column: 5, scope: !690)
!690 = distinct !DILexicalBlock(scope: !687, file: !2, line: 448, column: 14)
!691 = !DILocation(line: 450, column: 4, scope: !690)
!692 = !DILocation(line: 450, column: 15, scope: !693)
!693 = distinct !DILexicalBlock(scope: !687, file: !2, line: 450, column: 15)
!694 = !DILocation(line: 450, column: 19, scope: !693)
!695 = !DILocation(line: 450, column: 15, scope: !687)
!696 = !DILocation(line: 451, column: 5, scope: !697)
!697 = distinct !DILexicalBlock(scope: !693, file: !2, line: 450, column: 25)
!698 = !DILocation(line: 452, column: 5, scope: !697)
!699 = !DILocalVariable(name: "addr4", scope: !700, file: !2, line: 457, type: !701)
!700 = distinct !DILexicalBlock(scope: !618, file: !2, line: 456, column: 3)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !702, line: 48, baseType: !703)
!702 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !702, line: 44, size: 224, elements: !704)
!704 = !{!705, !713, !727}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !703, file: !702, line: 45, baseType: !706, size: 128)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !707, line: 180, size: 128, elements: !708)
!707 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!708 = !{!709, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !706, file: !707, line: 182, baseType: !710, size: 16)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !711, line: 28, baseType: !58)
!711 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !706, file: !707, line: 183, baseType: !240, size: 112, offset: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !703, file: !702, line: 46, baseType: !714, size: 128)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !715, line: 245, size: 128, elements: !716)
!715 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!716 = !{!717, !718, !720, !725}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !714, file: !715, line: 247, baseType: !710, size: 16)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !714, file: !715, line: 248, baseType: !719, size: 16, offset: 16)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !715, line: 123, baseType: !54)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !714, file: !715, line: 249, baseType: !721, size: 32, offset: 32)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !715, line: 31, size: 32, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !721, file: !715, line: 33, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !715, line: 30, baseType: !60)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !714, file: !715, line: 252, baseType: !726, size: 64, offset: 64)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !267)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !703, file: !702, line: 47, baseType: !728, size: 224)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !715, line: 260, size: 224, elements: !729)
!729 = !{!730, !731, !732, !733, !745}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !728, file: !715, line: 262, baseType: !710, size: 16)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !728, file: !715, line: 263, baseType: !719, size: 16, offset: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !728, file: !715, line: 264, baseType: !60, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !728, file: !715, line: 265, baseType: !734, size: 128, offset: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !715, line: 219, size: 128, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !734, file: !715, line: 226, baseType: !737, size: 128)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !734, file: !715, line: 221, size: 128, elements: !738)
!738 = !{!739, !741, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !737, file: !715, line: 223, baseType: !740, size: 128)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !216)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !737, file: !715, line: 224, baseType: !742, size: 128)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !267)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !737, file: !715, line: 225, baseType: !744, size: 128)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !221)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !728, file: !715, line: 266, baseType: !60, size: 32, offset: 192)
!746 = !DILocation(line: 457, column: 13, scope: !700)
!747 = !DILocalVariable(name: "addr4_test", scope: !700, file: !2, line: 458, type: !701)
!748 = !DILocation(line: 458, column: 13, scope: !700)
!749 = !DILocation(line: 460, column: 4, scope: !700)
!750 = !DILocation(line: 462, column: 39, scope: !700)
!751 = !DILocation(line: 462, column: 10, scope: !700)
!752 = !DILocation(line: 462, column: 8, scope: !700)
!753 = !DILocation(line: 463, column: 7, scope: !754)
!754 = distinct !DILexicalBlock(scope: !700, file: !2, line: 463, column: 7)
!755 = !DILocation(line: 463, column: 11, scope: !754)
!756 = !DILocation(line: 463, column: 7, scope: !700)
!757 = !DILocation(line: 464, column: 5, scope: !758)
!758 = distinct !DILexicalBlock(scope: !754, file: !2, line: 463, column: 16)
!759 = !DILocation(line: 465, column: 5, scope: !758)
!760 = !DILocation(line: 468, column: 4, scope: !700)
!761 = !DILocation(line: 469, column: 7, scope: !762)
!762 = distinct !DILexicalBlock(scope: !700, file: !2, line: 469, column: 7)
!763 = !DILocation(line: 469, column: 7, scope: !700)
!764 = !DILocation(line: 470, column: 5, scope: !765)
!765 = distinct !DILexicalBlock(scope: !762, file: !2, line: 469, column: 36)
!766 = !DILocation(line: 471, column: 4, scope: !765)
!767 = !DILocation(line: 472, column: 5, scope: !768)
!768 = distinct !DILexicalBlock(scope: !762, file: !2, line: 471, column: 11)
!769 = !DILocation(line: 473, column: 5, scope: !768)
!770 = !DILocalVariable(name: "respv6", scope: !771, file: !2, line: 479, type: !772)
!771 = distinct !DILexicalBlock(scope: !328, file: !2, line: 478, column: 2)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 744, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 93)
!775 = !DILocation(line: 479, column: 23, scope: !771)
!776 = !DILocalVariable(name: "buf", scope: !771, file: !2, line: 494, type: !777)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 744, elements: !773)
!778 = !DILocation(line: 494, column: 11, scope: !771)
!779 = !DILocation(line: 497, column: 4, scope: !780)
!780 = distinct !DILexicalBlock(scope: !771, file: !2, line: 496, column: 3)
!781 = !DILocation(line: 499, column: 49, scope: !780)
!782 = !DILocation(line: 499, column: 10, scope: !780)
!783 = !DILocation(line: 499, column: 8, scope: !780)
!784 = !DILocation(line: 500, column: 4, scope: !780)
!785 = !DILocation(line: 502, column: 8, scope: !786)
!786 = distinct !DILexicalBlock(scope: !780, file: !2, line: 502, column: 8)
!787 = !DILocation(line: 502, column: 8, scope: !780)
!788 = !DILocation(line: 503, column: 5, scope: !789)
!789 = distinct !DILexicalBlock(scope: !786, file: !2, line: 502, column: 13)
!790 = !DILocation(line: 504, column: 4, scope: !789)
!791 = !DILocation(line: 504, column: 15, scope: !792)
!792 = distinct !DILexicalBlock(scope: !786, file: !2, line: 504, column: 15)
!793 = !DILocation(line: 504, column: 19, scope: !792)
!794 = !DILocation(line: 504, column: 15, scope: !786)
!795 = !DILocation(line: 505, column: 5, scope: !796)
!796 = distinct !DILexicalBlock(scope: !792, file: !2, line: 504, column: 25)
!797 = !DILocation(line: 506, column: 5, scope: !796)
!798 = !DILocalVariable(name: "uname", scope: !799, file: !2, line: 511, type: !382)
!799 = distinct !DILexicalBlock(scope: !771, file: !2, line: 510, column: 3)
!800 = !DILocation(line: 511, column: 12, scope: !799)
!801 = !DILocalVariable(name: "realm", scope: !799, file: !2, line: 512, type: !382)
!802 = !DILocation(line: 512, column: 12, scope: !799)
!803 = !DILocalVariable(name: "upwd", scope: !799, file: !2, line: 513, type: !382)
!804 = !DILocation(line: 513, column: 12, scope: !799)
!805 = !DILocation(line: 514, column: 19, scope: !799)
!806 = !DILocation(line: 514, column: 4, scope: !799)
!807 = !DILocation(line: 516, column: 72, scope: !799)
!808 = !DILocation(line: 516, column: 97, scope: !799)
!809 = !DILocation(line: 516, column: 104, scope: !799)
!810 = !DILocation(line: 516, column: 111, scope: !799)
!811 = !DILocation(line: 516, column: 117, scope: !799)
!812 = !DILocation(line: 516, column: 10, scope: !799)
!813 = !DILocation(line: 516, column: 8, scope: !799)
!814 = !DILocation(line: 517, column: 4, scope: !799)
!815 = !DILocation(line: 519, column: 8, scope: !816)
!816 = distinct !DILexicalBlock(scope: !799, file: !2, line: 519, column: 8)
!817 = !DILocation(line: 519, column: 12, scope: !816)
!818 = !DILocation(line: 519, column: 8, scope: !799)
!819 = !DILocation(line: 520, column: 5, scope: !820)
!820 = distinct !DILexicalBlock(scope: !816, file: !2, line: 519, column: 17)
!821 = !DILocation(line: 521, column: 4, scope: !820)
!822 = !DILocation(line: 521, column: 15, scope: !823)
!823 = distinct !DILexicalBlock(scope: !816, file: !2, line: 521, column: 15)
!824 = !DILocation(line: 521, column: 19, scope: !823)
!825 = !DILocation(line: 521, column: 15, scope: !816)
!826 = !DILocation(line: 522, column: 5, scope: !827)
!827 = distinct !DILexicalBlock(scope: !823, file: !2, line: 521, column: 25)
!828 = !DILocation(line: 523, column: 5, scope: !827)
!829 = !DILocation(line: 525, column: 5, scope: !830)
!830 = distinct !DILexicalBlock(scope: !823, file: !2, line: 524, column: 11)
!831 = !DILocation(line: 526, column: 5, scope: !830)
!832 = !DILocation(line: 531, column: 4, scope: !833)
!833 = distinct !DILexicalBlock(scope: !771, file: !2, line: 530, column: 3)
!834 = !DILocation(line: 531, column: 12, scope: !833)
!835 = !DILocation(line: 533, column: 49, scope: !833)
!836 = !DILocation(line: 533, column: 10, scope: !833)
!837 = !DILocation(line: 533, column: 8, scope: !833)
!838 = !DILocation(line: 534, column: 4, scope: !833)
!839 = !DILocation(line: 536, column: 9, scope: !840)
!840 = distinct !DILexicalBlock(scope: !833, file: !2, line: 536, column: 8)
!841 = !DILocation(line: 536, column: 8, scope: !833)
!842 = !DILocation(line: 537, column: 5, scope: !843)
!843 = distinct !DILexicalBlock(scope: !840, file: !2, line: 536, column: 14)
!844 = !DILocation(line: 538, column: 4, scope: !843)
!845 = !DILocation(line: 538, column: 15, scope: !846)
!846 = distinct !DILexicalBlock(scope: !840, file: !2, line: 538, column: 15)
!847 = !DILocation(line: 538, column: 19, scope: !846)
!848 = !DILocation(line: 538, column: 15, scope: !840)
!849 = !DILocation(line: 539, column: 5, scope: !850)
!850 = distinct !DILexicalBlock(scope: !846, file: !2, line: 538, column: 25)
!851 = !DILocation(line: 540, column: 5, scope: !850)
!852 = !DILocalVariable(name: "addr6", scope: !853, file: !2, line: 545, type: !701)
!853 = distinct !DILexicalBlock(scope: !771, file: !2, line: 544, column: 3)
!854 = !DILocation(line: 545, column: 13, scope: !853)
!855 = !DILocalVariable(name: "addr6_test", scope: !853, file: !2, line: 546, type: !701)
!856 = !DILocation(line: 546, column: 13, scope: !853)
!857 = !DILocation(line: 548, column: 4, scope: !853)
!858 = !DILocation(line: 550, column: 39, scope: !853)
!859 = !DILocation(line: 550, column: 10, scope: !853)
!860 = !DILocation(line: 550, column: 8, scope: !853)
!861 = !DILocation(line: 552, column: 8, scope: !862)
!862 = distinct !DILexicalBlock(scope: !853, file: !2, line: 552, column: 8)
!863 = !DILocation(line: 552, column: 12, scope: !862)
!864 = !DILocation(line: 552, column: 8, scope: !853)
!865 = !DILocation(line: 553, column: 5, scope: !866)
!866 = distinct !DILexicalBlock(scope: !862, file: !2, line: 552, column: 17)
!867 = !DILocation(line: 554, column: 5, scope: !866)
!868 = !DILocation(line: 557, column: 4, scope: !853)
!869 = !DILocation(line: 558, column: 8, scope: !870)
!870 = distinct !DILexicalBlock(scope: !853, file: !2, line: 558, column: 8)
!871 = !DILocation(line: 558, column: 8, scope: !853)
!872 = !DILocation(line: 559, column: 5, scope: !873)
!873 = distinct !DILexicalBlock(scope: !870, file: !2, line: 558, column: 38)
!874 = !DILocation(line: 560, column: 4, scope: !873)
!875 = !DILocation(line: 561, column: 5, scope: !876)
!876 = distinct !DILexicalBlock(scope: !870, file: !2, line: 560, column: 11)
!877 = !DILocation(line: 562, column: 5, scope: !876)
!878 = !DILocation(line: 568, column: 6, scope: !879)
!879 = distinct !DILexicalBlock(scope: !880, file: !2, line: 568, column: 6)
!880 = distinct !DILexicalBlock(scope: !328, file: !2, line: 567, column: 2)
!881 = !DILocation(line: 568, column: 19, scope: !879)
!882 = !DILocation(line: 568, column: 6, scope: !880)
!883 = !DILocation(line: 569, column: 4, scope: !879)
!884 = !DILocation(line: 572, column: 2, scope: !328)
!885 = distinct !DISubprogram(name: "check_oauth", scope: !2, file: !2, line: 63, type: !886, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !19, retainedNodes: !291)
!886 = !DISubroutineType(types: !887)
!887 = !{!32}
!888 = !DILocalVariable(name: "server_name", scope: !885, file: !2, line: 65, type: !889)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 264, elements: !87)
!890 = !DILocation(line: 65, column: 13, scope: !885)
!891 = !DILocalVariable(name: "i_encs", scope: !885, file: !2, line: 67, type: !289)
!892 = !DILocation(line: 67, column: 9, scope: !885)
!893 = !DILocalVariable(name: "long_term_key", scope: !885, file: !2, line: 69, type: !889)
!894 = !DILocation(line: 69, column: 13, scope: !885)
!895 = !DILocalVariable(name: "ltp_output_length", scope: !885, file: !2, line: 71, type: !289)
!896 = !DILocation(line: 71, column: 9, scope: !885)
!897 = !DILocalVariable(name: "base64encoded_ltp", scope: !885, file: !2, line: 73, type: !68)
!898 = !DILocation(line: 73, column: 14, scope: !885)
!899 = !DILocation(line: 73, column: 71, scope: !885)
!900 = !DILocation(line: 74, column: 20, scope: !885)
!901 = !DILocation(line: 74, column: 13, scope: !885)
!902 = !DILocation(line: 73, column: 34, scope: !885)
!903 = !DILocalVariable(name: "mac_key", scope: !885, file: !2, line: 77, type: !889)
!904 = !DILocation(line: 77, column: 13, scope: !885)
!905 = !DILocalVariable(name: "mac_key_length", scope: !885, file: !2, line: 78, type: !906)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!907 = !DILocation(line: 78, column: 15, scope: !885)
!908 = !DILocation(line: 78, column: 37, scope: !885)
!909 = !DILocation(line: 78, column: 30, scope: !885)
!910 = !DILocalVariable(name: "token_timestamp", scope: !885, file: !2, line: 79, type: !911)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!912 = !DILocation(line: 79, column: 17, scope: !885)
!913 = !DILocalVariable(name: "token_lifetime", scope: !885, file: !2, line: 80, type: !914)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!915 = !DILocation(line: 80, column: 17, scope: !885)
!916 = !DILocalVariable(name: "kid", scope: !885, file: !2, line: 82, type: !889)
!917 = !DILocation(line: 82, column: 13, scope: !885)
!918 = !DILocalVariable(name: "key_timestamp", scope: !885, file: !2, line: 83, type: !919)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !921, line: 108, baseType: !60)
!921 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!922 = !DILocation(line: 83, column: 20, scope: !885)
!923 = !DILocalVariable(name: "key_lifetime", scope: !885, file: !2, line: 84, type: !919)
!924 = !DILocation(line: 84, column: 20, scope: !885)
!925 = !DILocalVariable(name: "gcm_nonce", scope: !885, file: !2, line: 86, type: !926)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 104, elements: !147)
!927 = !DILocation(line: 86, column: 13, scope: !885)
!928 = !DILocation(line: 91, column: 16, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !2, line: 91, column: 4)
!930 = distinct !DILexicalBlock(scope: !931, file: !2, line: 89, column: 3)
!931 = distinct !DILexicalBlock(scope: !885, file: !2, line: 88, column: 2)
!932 = !DILocation(line: 91, column: 9, scope: !929)
!933 = !DILocation(line: 91, column: 26, scope: !934)
!934 = distinct !DILexicalBlock(scope: !929, file: !2, line: 91, column: 4)
!935 = !DILocation(line: 91, column: 21, scope: !934)
!936 = !DILocation(line: 91, column: 4, scope: !929)
!937 = !DILocation(line: 93, column: 35, scope: !938)
!938 = distinct !DILexicalBlock(scope: !934, file: !2, line: 91, column: 45)
!939 = !DILocation(line: 93, column: 30, scope: !938)
!940 = !DILocation(line: 93, column: 5, scope: !938)
!941 = !DILocation(line: 95, column: 8, scope: !942)
!942 = distinct !DILexicalBlock(scope: !938, file: !2, line: 95, column: 8)
!943 = !DILocation(line: 95, column: 8, scope: !938)
!944 = !DILocation(line: 96, column: 6, scope: !942)
!945 = !DILocalVariable(name: "ot", scope: !938, file: !2, line: 98, type: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_token", file: !31, line: 253, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_token", file: !31, line: 249, size: 3264, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "enc_block", scope: !947, file: !31, line: 250, baseType: !950, size: 3264)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_encrypted_block", file: !31, line: 247, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_encrypted_block", file: !31, line: 238, size: 3264, elements: !952)
!952 = !{!953, !954, !958, !959, !963, !964}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_length", scope: !951, file: !31, line: 239, baseType: !54, size: 16)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !951, file: !31, line: 240, baseType: !955, size: 2048, offset: 16)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "key_length", scope: !951, file: !31, line: 241, baseType: !54, size: 16, offset: 2064)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mac_key", scope: !951, file: !31, line: 242, baseType: !960, size: 1024, offset: 2080)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !951, file: !31, line: 243, baseType: !66, size: 64, offset: 3136)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !951, file: !31, line: 244, baseType: !60, size: 32, offset: 3200)
!965 = !DILocation(line: 98, column: 17, scope: !938)
!966 = !DILocation(line: 99, column: 5, scope: !938)
!967 = !DILocation(line: 100, column: 41, scope: !938)
!968 = !DILocation(line: 100, column: 31, scope: !938)
!969 = !DILocation(line: 100, column: 8, scope: !938)
!970 = !DILocation(line: 100, column: 18, scope: !938)
!971 = !DILocation(line: 100, column: 29, scope: !938)
!972 = !DILocation(line: 101, column: 5, scope: !938)
!973 = !DILocalVariable(name: "szdst", scope: !974, file: !2, line: 101, type: !289)
!974 = distinct !DILexicalBlock(scope: !975, file: !2, line: 101, column: 5)
!975 = distinct !DILexicalBlock(scope: !976, file: !2, line: 101, column: 5)
!976 = distinct !DILexicalBlock(scope: !977, file: !2, line: 101, column: 5)
!977 = distinct !DILexicalBlock(scope: !978, file: !2, line: 101, column: 5)
!978 = distinct !DILexicalBlock(scope: !938, file: !2, line: 101, column: 5)
!979 = !DILocation(line: 101, column: 5, scope: !974)
!980 = !DILocation(line: 101, column: 5, scope: !978)
!981 = !DILocation(line: 102, column: 8, scope: !938)
!982 = !DILocation(line: 102, column: 18, scope: !938)
!983 = !DILocation(line: 102, column: 28, scope: !938)
!984 = !DILocation(line: 103, column: 8, scope: !938)
!985 = !DILocation(line: 103, column: 18, scope: !938)
!986 = !DILocation(line: 103, column: 27, scope: !938)
!987 = !DILocalVariable(name: "dot", scope: !938, file: !2, line: 105, type: !946)
!988 = !DILocation(line: 105, column: 17, scope: !938)
!989 = !DILocation(line: 106, column: 5, scope: !938)
!990 = !DILocalVariable(name: "key", scope: !938, file: !2, line: 107, type: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key", file: !31, line: 236, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key", file: !31, line: 223, size: 7616, elements: !993)
!993 = !{!994, !998, !1002, !1003, !1004, !1005, !1007, !1008, !1009, !1010}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !992, file: !31, line: 224, baseType: !995, size: 1032)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1032, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 129)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !992, file: !31, line: 225, baseType: !999, size: 2056, offset: 1032)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2056, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 257)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key_size", scope: !992, file: !31, line: 226, baseType: !289, size: 64, offset: 3136)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !992, file: !31, line: 227, baseType: !920, size: 32, offset: 3200)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !992, file: !31, line: 228, baseType: !920, size: 32, offset: 3232)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !992, file: !31, line: 229, baseType: !1006, size: 32, offset: 3264)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENC_ALG", file: !31, line: 187, baseType: !40)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_key", scope: !992, file: !31, line: 230, baseType: !999, size: 2056, offset: 3296)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_key_size", scope: !992, file: !31, line: 231, baseType: !289, size: 64, offset: 5376)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "auth_key", scope: !992, file: !31, line: 232, baseType: !999, size: 2056, offset: 5440)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "auth_key_size", scope: !992, file: !31, line: 233, baseType: !289, size: 64, offset: 7552)
!1011 = !DILocation(line: 107, column: 15, scope: !938)
!1012 = !DILocation(line: 108, column: 5, scope: !938)
!1013 = !DILocalVariable(name: "okd", scope: !1014, file: !2, line: 111, type: !1015)
!1014 = distinct !DILexicalBlock(scope: !938, file: !2, line: 110, column: 5)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data", file: !31, line: 221, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data", file: !31, line: 212, size: 3840, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !1016, file: !31, line: 213, baseType: !995, size: 1032)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !1016, file: !31, line: 214, baseType: !999, size: 2056, offset: 1032)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key_size", scope: !1016, file: !31, line: 215, baseType: !289, size: 64, offset: 3136)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1016, file: !31, line: 216, baseType: !920, size: 32, offset: 3200)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !1016, file: !31, line: 217, baseType: !920, size: 32, offset: 3232)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !1016, file: !31, line: 218, baseType: !1024, size: 520, offset: 3264)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 65)
!1027 = !DILocation(line: 111, column: 21, scope: !1014)
!1028 = !DILocation(line: 112, column: 6, scope: !1014)
!1029 = !DILocalVariable(name: "okdr", scope: !1030, file: !2, line: 115, type: !1031)
!1030 = distinct !DILexicalBlock(scope: !1014, file: !2, line: 114, column: 6)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data_raw", file: !1032, line: 144, baseType: !1033)
!1032 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data_raw", file: !1032, line: 135, size: 4800, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !1033, file: !1032, line: 136, baseType: !995, size: 1032)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !1033, file: !1032, line: 137, baseType: !999, size: 2056, offset: 1032)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1033, file: !1032, line: 138, baseType: !66, size: 64, offset: 3136)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !1033, file: !1032, line: 139, baseType: !60, size: 32, offset: 3200)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !1033, file: !1032, line: 140, baseType: !1024, size: 520, offset: 3232)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !1033, file: !1032, line: 141, baseType: !1041, size: 1024, offset: 3752)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !961)
!1042 = !DILocation(line: 115, column: 27, scope: !1030)
!1043 = !DILocation(line: 116, column: 8, scope: !1030)
!1044 = !DILocation(line: 118, column: 7, scope: !1030)
!1045 = !DILocalVariable(name: "szdst", scope: !1046, file: !2, line: 118, type: !289)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 118, column: 7)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !2, line: 118, column: 7)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !2, line: 118, column: 7)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !2, line: 118, column: 7)
!1050 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 118, column: 7)
!1051 = !DILocation(line: 118, column: 7, scope: !1046)
!1052 = !DILocation(line: 118, column: 7, scope: !1050)
!1053 = !DILocation(line: 119, column: 7, scope: !1030)
!1054 = !DILocation(line: 119, column: 7, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !2, line: 119, column: 7)
!1056 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 119, column: 7)
!1057 = !DILocation(line: 119, column: 7, scope: !1056)
!1058 = !DILocalVariable(name: "szdst", scope: !1059, file: !2, line: 119, type: !289)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 119, column: 7)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !2, line: 119, column: 7)
!1061 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 119, column: 7)
!1062 = !DILocation(line: 119, column: 7, scope: !1059)
!1063 = !DILocation(line: 119, column: 7, scope: !1061)
!1064 = !DILocation(line: 120, column: 7, scope: !1030)
!1065 = !DILocation(line: 120, column: 7, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 120, column: 7)
!1067 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 120, column: 7)
!1068 = !DILocation(line: 120, column: 7, scope: !1067)
!1069 = !DILocalVariable(name: "szdst", scope: !1070, file: !2, line: 120, type: !289)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !2, line: 120, column: 7)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 120, column: 7)
!1072 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 120, column: 7)
!1073 = !DILocation(line: 120, column: 7, scope: !1070)
!1074 = !DILocation(line: 120, column: 7, scope: !1072)
!1075 = !DILocation(line: 121, column: 12, scope: !1030)
!1076 = !DILocation(line: 121, column: 22, scope: !1030)
!1077 = !DILocation(line: 122, column: 12, scope: !1030)
!1078 = !DILocation(line: 122, column: 21, scope: !1030)
!1079 = !DILocation(line: 124, column: 7, scope: !1030)
!1080 = !DILocalVariable(name: "err_msg", scope: !1030, file: !2, line: 126, type: !1081)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8200, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 1025)
!1084 = !DILocation(line: 126, column: 12, scope: !1030)
!1085 = !DILocalVariable(name: "err_msg_size", scope: !1030, file: !2, line: 127, type: !289)
!1086 = !DILocation(line: 127, column: 14, scope: !1030)
!1087 = !DILocation(line: 129, column: 46, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 129, column: 11)
!1089 = !DILocation(line: 130, column: 9, scope: !1088)
!1090 = !DILocation(line: 129, column: 11, scope: !1088)
!1091 = !DILocation(line: 130, column: 23, scope: !1088)
!1092 = !DILocation(line: 129, column: 11, scope: !1030)
!1093 = !DILocation(line: 131, column: 16, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1088, file: !2, line: 130, column: 28)
!1095 = !DILocation(line: 131, column: 32, scope: !1094)
!1096 = !DILocation(line: 131, column: 8, scope: !1094)
!1097 = !DILocation(line: 132, column: 8, scope: !1094)
!1098 = !DILocation(line: 137, column: 8, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !938, file: !2, line: 137, column: 8)
!1100 = !DILocation(line: 137, column: 8, scope: !938)
!1101 = !DILocation(line: 138, column: 34, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 137, column: 21)
!1103 = !DILocation(line: 138, column: 30, scope: !1102)
!1104 = !DILocation(line: 138, column: 48, scope: !1102)
!1105 = !DILocation(line: 138, column: 6, scope: !1102)
!1106 = !DILocation(line: 139, column: 33, scope: !1102)
!1107 = !DILocation(line: 139, column: 29, scope: !1102)
!1108 = !DILocation(line: 139, column: 46, scope: !1102)
!1109 = !DILocation(line: 139, column: 6, scope: !1102)
!1110 = !DILocation(line: 140, column: 5, scope: !1102)
!1111 = !DILocalVariable(name: "etoken", scope: !1112, file: !2, line: 143, type: !1113)
!1112 = distinct !DILexicalBlock(scope: !938, file: !2, line: 142, column: 5)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "encoded_oauth_token", file: !31, line: 262, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_encoded_oauth_token", file: !31, line: 257, size: 8256, elements: !1115)
!1115 = !{!1116, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !1114, file: !31, line: 258, baseType: !1117, size: 8192)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !31, line: 259, baseType: !289, size: 64, offset: 8192)
!1121 = !DILocation(line: 143, column: 26, scope: !1112)
!1122 = !DILocation(line: 144, column: 6, scope: !1112)
!1123 = !DILocation(line: 146, column: 47, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 146, column: 10)
!1125 = !DILocation(line: 147, column: 35, scope: !1124)
!1126 = !DILocation(line: 146, column: 10, scope: !1124)
!1127 = !DILocation(line: 147, column: 46, scope: !1124)
!1128 = !DILocation(line: 146, column: 10, scope: !1112)
!1129 = !DILocation(line: 148, column: 15, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1124, file: !2, line: 147, column: 51)
!1131 = !DILocation(line: 148, column: 7, scope: !1130)
!1132 = !DILocation(line: 150, column: 7, scope: !1130)
!1133 = !DILocation(line: 153, column: 9, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 153, column: 9)
!1135 = !DILocation(line: 153, column: 9, scope: !1112)
!1136 = !DILocation(line: 154, column: 46, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 153, column: 22)
!1138 = !DILocation(line: 154, column: 39, scope: !1137)
!1139 = !DILocation(line: 154, column: 59, scope: !1137)
!1140 = !DILocation(line: 154, column: 7, scope: !1137)
!1141 = !DILocation(line: 155, column: 6, scope: !1137)
!1142 = !DILocation(line: 157, column: 47, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 157, column: 10)
!1144 = !DILocation(line: 157, column: 10, scope: !1143)
!1145 = !DILocation(line: 158, column: 20, scope: !1143)
!1146 = !DILocation(line: 157, column: 10, scope: !1112)
!1147 = !DILocation(line: 159, column: 15, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1143, file: !2, line: 158, column: 25)
!1149 = !DILocation(line: 159, column: 7, scope: !1148)
!1150 = !DILocation(line: 161, column: 7, scope: !1148)
!1151 = !DILocation(line: 165, column: 27, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !938, file: !2, line: 165, column: 9)
!1153 = !DILocation(line: 165, column: 37, scope: !1152)
!1154 = !DILocation(line: 165, column: 24, scope: !1152)
!1155 = !DILocation(line: 166, column: 19, scope: !1152)
!1156 = !DILocation(line: 166, column: 29, scope: !1152)
!1157 = !DILocation(line: 166, column: 15, scope: !1152)
!1158 = !DILocation(line: 165, column: 9, scope: !1152)
!1159 = !DILocation(line: 165, column: 9, scope: !938)
!1160 = !DILocation(line: 167, column: 14, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1152, file: !2, line: 166, column: 39)
!1162 = !DILocation(line: 168, column: 34, scope: !1161)
!1163 = !DILocation(line: 168, column: 44, scope: !1161)
!1164 = !DILocation(line: 168, column: 30, scope: !1161)
!1165 = !DILocation(line: 169, column: 19, scope: !1161)
!1166 = !DILocation(line: 169, column: 29, scope: !1161)
!1167 = !DILocation(line: 169, column: 16, scope: !1161)
!1168 = !DILocation(line: 167, column: 6, scope: !1161)
!1169 = !DILocation(line: 170, column: 6, scope: !1161)
!1170 = !DILocation(line: 173, column: 12, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !938, file: !2, line: 173, column: 9)
!1172 = !DILocation(line: 173, column: 22, scope: !1171)
!1173 = !DILocation(line: 173, column: 9, scope: !1171)
!1174 = !DILocation(line: 173, column: 40, scope: !1171)
!1175 = !DILocation(line: 173, column: 50, scope: !1171)
!1176 = !DILocation(line: 173, column: 36, scope: !1171)
!1177 = !DILocation(line: 173, column: 33, scope: !1171)
!1178 = !DILocation(line: 173, column: 9, scope: !938)
!1179 = !DILocation(line: 174, column: 14, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1171, file: !2, line: 173, column: 62)
!1181 = !DILocation(line: 175, column: 32, scope: !1180)
!1182 = !DILocation(line: 175, column: 42, scope: !1180)
!1183 = !DILocation(line: 175, column: 22, scope: !1180)
!1184 = !DILocation(line: 176, column: 17, scope: !1180)
