; ModuleID = './mdb.c'
source_filename = "./mdb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MDB_txn = type { ptr, ptr, i64, i64, ptr, ptr, %union.anon.4, ptr, ptr, ptr, ptr, i32, i32, i32, i32 }
%union.anon.4 = type { ptr }
%struct.MDB_dbx = type { %struct.MDB_val, ptr, ptr, ptr, ptr }
%struct.MDB_val = type { i64, ptr }
%struct.MDB_env = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, [2 x ptr], ptr, i64, i64, i64, ptr, ptr, i32, %struct.MDB_pgstate, ptr, ptr, ptr, i32, i32 }
%struct.MDB_pgstate = type { i64, ptr, ptr }
%struct.MDB_meta = type { i32, i32, ptr, i64, [2 x %struct.MDB_db], i64, i64 }
%struct.MDB_db = type { i32, i16, i16, i64, i64, i64, i64, i64 }
%struct.MDB_rxbody = type { i64, i32, i64 }
%struct.MDB_txbody = type { i32, i32, %union.pthread_mutex_t, i64, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.MDB_txninfo = type { %union.anon, %union.anon.0, [1 x %struct.MDB_reader] }
%union.anon = type { %struct.MDB_txbody }
%union.anon.0 = type { %union.pthread_mutex_t, [24 x i8] }
%struct.MDB_reader = type { %union.anon.1 }
%union.anon.1 = type { %struct.MDB_rxbody, [40 x i8] }
%struct.MDB_ntxn = type { %struct.MDB_txn, %struct.MDB_pgstate }

!513 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!514 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!515 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!516 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!517 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!518 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!519 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!520 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!521 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!522 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!523 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!524 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!525 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!526 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!527 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!528 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!529 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!530 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!531 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!532 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!533 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!534 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!535 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!536 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!537 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!538 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!539 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!540 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!541 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!542 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!543 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!544 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!545 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!546 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!547 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!548 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!549 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!550 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!551 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!552 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!553 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!554 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!555 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!556 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!557 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!558 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!559 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!560 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!561 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!562 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!563 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!564 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!565 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!566 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!567 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!568 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!569 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!570 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!571 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!572 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!573 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!574 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!575 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!576 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!577 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!578 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!579 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!580 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!581 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!582 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!583 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!584 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!585 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!586 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!587 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!588 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!589 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!590 = !DIEnumerator(name: "_SC_MINSIGSTKSZ", value: 249)
!591 = !DIEnumerator(name: "_SC_SIGSTKSZ", value: 250)
!592 = !{!593, !594, !619, !620, !622, !865, !871, !800, !650, !347, !872, !609, !803, !821, !612, !881, !882, !671, !768, !884, !885, !828, !737, !886, !888}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_db", file: !2, line: 749, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_db", file: !2, line: 740, size: 384, elements: !597)
!597 = !{!598, !603, !607, !608, !615, !616, !617, !618}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "md_pad", scope: !596, file: !2, line: 741, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !600, line: 26, baseType: !601)
!600 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !602, line: 42, baseType: !347)
!602 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!603 = !DIDerivedType(tag: DW_TAG_member, name: "md_flags", scope: !596, file: !2, line: 742, baseType: !604, size: 16, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !600, line: 25, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !602, line: 40, baseType: !606)
!606 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "md_depth", scope: !596, file: !2, line: 743, baseType: !604, size: 16, offset: 48)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "md_branch_pages", scope: !596, file: !2, line: 744, baseType: !609, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgno_t", file: !2, line: 271, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_ID", file: !611, line: 45, baseType: !612)
!611 = !DIFile(filename: "./midl.h", directory: "/home/raj/FineDB/lib/lmdb", checksumkind: CSK_MD5, checksum: "6d1cee80969f26031bba0df557f605a0")
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !613, line: 46, baseType: !614)
!613 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!614 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "md_leaf_pages", scope: !596, file: !2, line: 745, baseType: !609, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "md_overflow_pages", scope: !596, file: !2, line: 746, baseType: !609, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "md_entries", scope: !596, file: !2, line: 747, baseType: !612, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "md_root", scope: !596, file: !2, line: 748, baseType: !609, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_cursor", file: !346, line: 210, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_cursor", file: !2, line: 874, size: 3136, elements: !626)
!626 = !{!627, !628, !629, !662, !854, !855, !856, !857, !858, !859, !860, !861, !863}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mc_next", scope: !625, file: !2, line: 876, baseType: !623, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mc_orig", scope: !625, file: !2, line: 878, baseType: !623, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mc_xcursor", scope: !625, file: !2, line: 880, baseType: !630, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_xcursor", file: !2, line: 916, size: 3968, elements: !632)
!632 = !{!633, !634, !635, !661}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mx_cursor", scope: !631, file: !2, line: 918, baseType: !624, size: 3136)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mx_db", scope: !631, file: !2, line: 920, baseType: !595, size: 384, offset: 3136)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mx_dbx", scope: !631, file: !2, line: 922, baseType: !636, size: 384, offset: 3520)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_dbx", file: !2, line: 804, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_dbx", file: !2, line: 798, size: 384, elements: !638)
!638 = !{!639, !645, !653, !654, !660}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "md_name", scope: !637, file: !2, line: 799, baseType: !640, size: 128)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_val", file: !346, line: 226, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_val", file: !346, line: 223, size: 128, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mv_size", scope: !641, file: !346, line: 224, baseType: !612, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mv_data", scope: !641, file: !346, line: 225, baseType: !593, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "md_cmp", scope: !637, file: !2, line: 800, baseType: !646, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_cmp_func", file: !346, line: 229, baseType: !648)
!648 = !DISubroutineType(types: !649)
!649 = !{!650, !651, !651}
!650 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "md_dcmp", scope: !637, file: !2, line: 801, baseType: !646, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "md_rel", scope: !637, file: !2, line: 802, baseType: !655, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_rel_func", file: !346, line: 245, baseType: !657)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !659, !593, !593, !593}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "md_relctx", scope: !637, file: !2, line: 803, baseType: !593, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mx_dbflag", scope: !631, file: !2, line: 924, baseType: !621, size: 8, offset: 3904)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mc_txn", scope: !625, file: !2, line: 882, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_txn", file: !346, line: 204, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_txn", file: !2, line: 809, size: 832, elements: !666)
!666 = !{!667, !668, !669, !670, !672, !839, !840, !846, !847, !848, !849, !850, !851, !852, !853}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mt_parent", scope: !665, file: !2, line: 810, baseType: !663, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mt_child", scope: !665, file: !2, line: 811, baseType: !663, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mt_next_pgno", scope: !665, file: !2, line: 812, baseType: !609, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mt_txnid", scope: !665, file: !2, line: 817, baseType: !671, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "txnid_t", file: !2, line: 276, baseType: !610)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mt_env", scope: !665, file: !2, line: 818, baseType: !673, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_env", file: !346, line: 197, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_env", file: !2, line: 935, size: 1536, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !686, !687, !691, !692, !693, !766, !782, !783, !784, !787, !788, !790, !792, !794, !802, !826, !829, !837, !838}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "me_fd", scope: !675, file: !2, line: 936, baseType: !650, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "me_lfd", scope: !675, file: !2, line: 937, baseType: !650, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "me_mfd", scope: !675, file: !2, line: 938, baseType: !650, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "me_flags", scope: !675, file: !2, line: 945, baseType: !599, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "me_psize", scope: !675, file: !2, line: 946, baseType: !347, size: 32, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "me_maxreaders", scope: !675, file: !2, line: 947, baseType: !347, size: 32, offset: 160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "me_numreaders", scope: !675, file: !2, line: 948, baseType: !347, size: 32, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "me_numdbs", scope: !675, file: !2, line: 949, baseType: !685, size: 32, offset: 224)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_dbi", file: !346, line: 207, baseType: !347)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "me_maxdbs", scope: !675, file: !2, line: 950, baseType: !685, size: 32, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "me_pid", scope: !675, file: !2, line: 951, baseType: !688, size: 32, offset: 288)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !689, line: 97, baseType: !690)
!689 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !602, line: 154, baseType: !650)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "me_path", scope: !675, file: !2, line: 952, baseType: !619, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "me_map", scope: !675, file: !2, line: 953, baseType: !619, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "me_txns", scope: !675, file: !2, line: 954, baseType: !694, size: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_txninfo", file: !2, line: 556, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_txninfo", file: !2, line: 534, size: 1536, elements: !697)
!697 = !{!698, !744, !749}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mt1", scope: !696, file: !2, line: 544, baseType: !699, size: 512)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !696, file: !2, line: 535, size: 512, elements: !700)
!700 = !{!701, !740}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mtb", scope: !699, file: !2, line: 536, baseType: !702, size: 512)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_txbody", file: !2, line: 531, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_txbody", file: !2, line: 507, size: 512, elements: !704)
!704 = !{!705, !706, !707, !738, !739}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mtb_magic", scope: !703, file: !2, line: 510, baseType: !599, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mtb_version", scope: !703, file: !2, line: 512, baseType: !599, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mtb_mutex", scope: !703, file: !2, line: 519, baseType: !708, size: 320, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !709, line: 72, baseType: !710)
!709 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !709, line: 67, size: 320, elements: !711)
!711 = !{!712, !732, !736}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !710, file: !709, line: 69, baseType: !713, size: 320)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !714, line: 22, size: 320, elements: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!715 = !{!716, !717, !718, !719, !720, !721, !723, !724}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !713, file: !714, line: 24, baseType: !650, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !713, file: !714, line: 25, baseType: !347, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !713, file: !714, line: 26, baseType: !650, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !713, file: !714, line: 28, baseType: !347, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !713, file: !714, line: 32, baseType: !650, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !713, file: !714, line: 34, baseType: !722, size: 16, offset: 160)
!722 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !713, file: !714, line: 35, baseType: !722, size: 16, offset: 176)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !713, file: !714, line: 36, baseType: !725, size: 128, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !726, line: 55, baseType: !727)
!726 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !726, line: 51, size: 128, elements: !728)
!728 = !{!729, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !727, file: !726, line: 53, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !727, file: !726, line: 54, baseType: !730, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !710, file: !709, line: 70, baseType: !733, size: 320)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 40)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !710, file: !709, line: 71, baseType: !737, size: 64)
!737 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mtb_txnid", scope: !703, file: !2, line: 525, baseType: !671, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mtb_numreaders", scope: !703, file: !2, line: 530, baseType: !347, size: 32, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !699, file: !2, line: 543, baseType: !741, size: 512)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mt2", scope: !696, file: !2, line: 554, baseType: !745, size: 512, offset: 512)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !696, file: !2, line: 545, size: 512, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mt2_wmutex", scope: !745, file: !2, line: 550, baseType: !708, size: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !745, file: !2, line: 553, baseType: !741, size: 512)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mti_readers", scope: !696, file: !2, line: 555, baseType: !750, size: 512, offset: 1024)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 512, elements: !89)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_reader", file: !2, line: 491, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_reader", file: !2, line: 481, size: 512, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mru", scope: !752, file: !2, line: 490, baseType: !755, size: 512)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !752, file: !2, line: 482, size: 512, elements: !756)
!756 = !{!757, !765}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mrx", scope: !755, file: !2, line: 483, baseType: !758, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_rxbody", file: !2, line: 478, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_rxbody", file: !2, line: 465, size: 192, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mrb_txnid", scope: !759, file: !2, line: 473, baseType: !671, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mrb_pid", scope: !759, file: !2, line: 475, baseType: !688, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mrb_tid", scope: !759, file: !2, line: 477, baseType: !764, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !709, line: 27, baseType: !614)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !755, file: !2, line: 489, baseType: !741, size: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "me_metas", scope: !675, file: !2, line: 955, baseType: !767, size: 128, offset: 512)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 128, elements: !778)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_meta", file: !2, line: 778, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_meta", file: !2, line: 763, size: 1088, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !780, !781}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mm_magic", scope: !770, file: !2, line: 766, baseType: !599, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mm_version", scope: !770, file: !2, line: 768, baseType: !599, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mm_address", scope: !770, file: !2, line: 769, baseType: !593, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mm_mapsize", scope: !770, file: !2, line: 770, baseType: !612, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mm_dbs", scope: !770, file: !2, line: 771, baseType: !777, size: 768, offset: 192)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 768, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 2)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mm_last_pg", scope: !770, file: !2, line: 776, baseType: !609, size: 64, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mm_txnid", scope: !770, file: !2, line: 777, baseType: !671, size: 64, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "me_txn", scope: !675, file: !2, line: 956, baseType: !663, size: 64, offset: 640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "me_mapsize", scope: !675, file: !2, line: 957, baseType: !612, size: 64, offset: 704)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "me_size", scope: !675, file: !2, line: 958, baseType: !785, size: 64, offset: 768)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !689, line: 85, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !602, line: 152, baseType: !737)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "me_maxpg", scope: !675, file: !2, line: 959, baseType: !609, size: 64, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "me_dbxs", scope: !675, file: !2, line: 960, baseType: !789, size: 64, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "me_dbflags", scope: !675, file: !2, line: 961, baseType: !791, size: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "me_txkey", scope: !675, file: !2, line: 962, baseType: !793, size: 32, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !709, line: 49, baseType: !347)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "me_pgstate", scope: !675, file: !2, line: 963, baseType: !795, size: 192, offset: 1088)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_pgstate", file: !2, line: 932, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_pgstate", file: !2, line: 928, size: 192, elements: !797)
!797 = !{!798, !799, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mf_pglast", scope: !796, file: !2, line: 929, baseType: !671, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mf_pghead", scope: !796, file: !2, line: 930, baseType: !800, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mf_pgfree", scope: !796, file: !2, line: 931, baseType: !800, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "me_dpages", scope: !675, file: !2, line: 967, baseType: !803, size: 64, offset: 1280)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_page", file: !2, line: 596, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_page", file: !2, line: 563, size: 192, elements: !806)
!806 = !{!807, !812, !813, !814, !824}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mp_p", scope: !805, file: !2, line: 569, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !805, file: !2, line: 566, size: 64, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "p_pgno", scope: !808, file: !2, line: 567, baseType: !609, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "p_next", scope: !808, file: !2, line: 568, baseType: !593, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mp_pad", scope: !805, file: !2, line: 570, baseType: !604, size: 16, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mp_flags", scope: !805, file: !2, line: 584, baseType: !604, size: 16, offset: 80)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mp_pb", scope: !805, file: !2, line: 594, baseType: !815, size: 32, offset: 96)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !805, file: !2, line: 588, size: 32, elements: !816)
!816 = !{!817, !823}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !815, file: !2, line: 592, baseType: !818, size: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !815, file: !2, line: 589, size: 32, elements: !819)
!819 = !{!820, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pb_lower", scope: !818, file: !2, line: 590, baseType: !821, size: 16)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "indx_t", file: !2, line: 395, baseType: !604)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pb_upper", scope: !818, file: !2, line: 591, baseType: !821, size: 16, offset: 16)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pb_pages", scope: !815, file: !2, line: 593, baseType: !599, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ptrs", scope: !805, file: !2, line: 595, baseType: !825, size: 16, offset: 128)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 16, elements: !89)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "me_free_pgs", scope: !675, file: !2, line: 969, baseType: !827, size: 64, offset: 1344)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_IDL", file: !611, line: 53, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "me_dirty_list", scope: !675, file: !2, line: 971, baseType: !830, size: 64, offset: 1408)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_ID2L", file: !611, line: 137, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_ID2", file: !611, line: 130, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_ID2", file: !611, line: 127, size: 128, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !833, file: !611, line: 128, baseType: !610, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mptr", scope: !833, file: !611, line: 129, baseType: !593, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "me_maxfree_1pg", scope: !675, file: !2, line: 973, baseType: !347, size: 32, offset: 1472)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "me_nodemax", scope: !675, file: !2, line: 975, baseType: !347, size: 32, offset: 1504)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mt_free_pgs", scope: !665, file: !2, line: 821, baseType: !827, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mt_u", scope: !665, file: !2, line: 825, baseType: !841, size: 64, offset: 384)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !665, file: !2, line: 822, size: 64, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_list", scope: !841, file: !2, line: 823, baseType: !830, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !841, file: !2, line: 824, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mt_dbxs", scope: !665, file: !2, line: 827, baseType: !789, size: 64, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "mt_dbs", scope: !665, file: !2, line: 829, baseType: !594, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mt_cursors", scope: !665, file: !2, line: 840, baseType: !622, size: 64, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mt_dbflags", scope: !665, file: !2, line: 842, baseType: !620, size: 64, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mt_numdbs", scope: !665, file: !2, line: 846, baseType: !685, size: 32, offset: 704)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mt_flags", scope: !665, file: !2, line: 856, baseType: !347, size: 32, offset: 736)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mt_dirty_room", scope: !665, file: !2, line: 858, baseType: !347, size: 32, offset: 768)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mt_toggle", scope: !665, file: !2, line: 862, baseType: !347, size: 32, offset: 800)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mc_dbi", scope: !625, file: !2, line: 884, baseType: !685, size: 32, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mc_db", scope: !625, file: !2, line: 886, baseType: !594, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mc_dbx", scope: !625, file: !2, line: 888, baseType: !789, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mc_dbflag", scope: !625, file: !2, line: 890, baseType: !620, size: 64, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mc_snum", scope: !625, file: !2, line: 891, baseType: !606, size: 16, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mc_top", scope: !625, file: !2, line: 892, baseType: !606, size: 16, offset: 528)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mc_flags", scope: !625, file: !2, line: 906, baseType: !347, size: 32, offset: 544)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mc_pg", scope: !625, file: !2, line: 907, baseType: !862, size: 2048, offset: 576)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 2048, elements: !322)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mc_ki", scope: !625, file: !2, line: 908, baseType: !864, size: 512, offset: 2624)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 512, elements: !322)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_ntxn", file: !2, line: 989, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_ntxn", file: !2, line: 986, size: 1024, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_txn", scope: !867, file: !2, line: 987, baseType: !664, size: 832)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_pgstate", scope: !867, file: !2, line: 988, baseType: !795, size: 192, offset: 832)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_node", file: !2, line: 661, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_node", file: !2, line: 635, size: 80, elements: !875)
!875 = !{!876, !878, !879, !880}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mn_offset", scope: !874, file: !2, line: 644, baseType: !877, size: 32)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 32, elements: !778)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mn_flags", scope: !874, file: !2, line: 658, baseType: !606, size: 16, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mn_ksize", scope: !874, file: !2, line: 659, baseType: !606, size: 16, offset: 48)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "mn_data", scope: !874, file: !2, line: 660, baseType: !88, size: 8, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_xcursor", file: !2, line: 925, baseType: !631)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !689, line: 108, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !602, line: 194, baseType: !737)
!890 = !{!0, !7, !12, !17, !22, !26, !31, !36, !38, !40, !45, !50, !55, !57, !59, !61, !66, !71, !76, !81, !86, !91, !96, !101, !103, !105, !110, !115, !120, !125, !130, !132, !137, !142, !145, !150, !155, !160, !165, !170, !175, !177, !182, !187, !891, !190, !193, !198, !203, !208, !213, !218, !223, !225, !230, !233, !238, !240, !245, !250, !252, !255, !258, !263, !266, !271, !276, !281, !283, !285, !288, !290, !292, !294, !299, !301, !306, !309, !311, !313, !315, !317, !319, !324, !326, !328, !333, !335, !338, !340}
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "mdb_errstr", scope: !342, file: !2, line: 1076, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 1088, elements: !248)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!895 = !{i32 7, !"Dwarf Version", i32 5}
!896 = !{i32 2, !"Debug Info Version", i32 3}
!897 = !{i32 1, !"wchar_size", i32 4}
!898 = !{i32 8, !"PIC Level", i32 2}
!899 = !{i32 7, !"uwtable", i32 2}
!900 = !{!"clang version 16.0.0"}
!901 = distinct !DISubprogram(name: "mdb_version", scope: !2, file: !2, line: 1067, type: !902, scopeLine: 1068, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !905)
!902 = !DISubroutineType(types: !903)
!903 = !{!619, !904, !904, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!905 = !{!906, !907, !908}
!906 = !DILocalVariable(name: "major", arg: 1, scope: !901, file: !2, line: 1067, type: !904)
!907 = !DILocalVariable(name: "minor", arg: 2, scope: !901, file: !2, line: 1067, type: !904)
!908 = !DILocalVariable(name: "patch", arg: 3, scope: !901, file: !2, line: 1067, type: !904)
!909 = !DILocation(line: 0, scope: !901)
!910 = !DILocation(line: 1069, column: 6, scope: !911)
!911 = distinct !DILexicalBlock(scope: !901, file: !2, line: 1069, column: 6)
!912 = !DILocation(line: 1069, column: 6, scope: !901)
!913 = !DILocation(line: 1069, column: 20, scope: !911)
!914 = !{!915, !915, i64 0}
!915 = !{!"int", !916, i64 0}
!916 = !{!"omnipotent char", !917, i64 0}
!917 = !{!"Simple C/C++ TBAA"}
!918 = !DILocation(line: 1069, column: 13, scope: !911)
!919 = !DILocation(line: 1070, column: 6, scope: !920)
!920 = distinct !DILexicalBlock(scope: !901, file: !2, line: 1070, column: 6)
!921 = !DILocation(line: 1070, column: 6, scope: !901)
!922 = !DILocation(line: 1070, column: 20, scope: !920)
!923 = !DILocation(line: 1070, column: 13, scope: !920)
!924 = !DILocation(line: 1071, column: 6, scope: !925)
!925 = distinct !DILexicalBlock(scope: !901, file: !2, line: 1071, column: 6)
!926 = !DILocation(line: 1071, column: 6, scope: !901)
!927 = !DILocation(line: 1071, column: 20, scope: !925)
!928 = !DILocation(line: 1071, column: 13, scope: !925)
!929 = !DILocation(line: 1072, column: 2, scope: !901)
!930 = distinct !DISubprogram(name: "mdb_strerror", scope: !2, file: !2, line: 1097, type: !931, scopeLine: 1098, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!619, !650}
!933 = !{!934, !935}
!934 = !DILocalVariable(name: "err", arg: 1, scope: !930, file: !2, line: 1097, type: !650)
!935 = !DILocalVariable(name: "i", scope: !930, file: !2, line: 1099, type: !650)
!936 = !DILocation(line: 0, scope: !930)
!937 = !DILocation(line: 1100, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !930, file: !2, line: 1100, column: 6)
!939 = !DILocation(line: 1100, column: 6, scope: !930)
!940 = !DILocation(line: 1103, column: 26, scope: !941)
!941 = distinct !DILexicalBlock(scope: !930, file: !2, line: 1103, column: 6)
!942 = !DILocation(line: 1105, column: 10, scope: !943)
!943 = distinct !DILexicalBlock(scope: !941, file: !2, line: 1103, column: 54)
!944 = !DILocation(line: 1105, column: 3, scope: !943)
!945 = !DILocation(line: 1108, column: 9, scope: !930)
!946 = !DILocation(line: 1108, column: 2, scope: !930)
!947 = !DILocation(line: 1109, column: 1, scope: !930)
!948 = !DISubprogram(name: "strerror", scope: !949, file: !949, line: 419, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!949 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!950 = !{}
!951 = distinct !DISubprogram(name: "mdb_cmp", scope: !2, file: !2, line: 1244, type: !952, scopeLine: 1245, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !954)
!952 = !DISubroutineType(types: !953)
!953 = !{!650, !663, !685, !651, !651}
!954 = !{!955, !956, !957, !958}
!955 = !DILocalVariable(name: "txn", arg: 1, scope: !951, file: !2, line: 1244, type: !663)
!956 = !DILocalVariable(name: "dbi", arg: 2, scope: !951, file: !2, line: 1244, type: !685)
!957 = !DILocalVariable(name: "a", arg: 3, scope: !951, file: !2, line: 1244, type: !651)
!958 = !DILocalVariable(name: "b", arg: 4, scope: !951, file: !2, line: 1244, type: !651)
!959 = !DILocation(line: 0, scope: !951)
!960 = !DILocation(line: 1246, column: 14, scope: !951)
!961 = !{!962, !963, i64 56}
!962 = !{!"MDB_txn", !963, i64 0, !963, i64 8, !964, i64 16, !964, i64 24, !963, i64 32, !963, i64 40, !916, i64 48, !963, i64 56, !963, i64 64, !963, i64 72, !963, i64 80, !915, i64 88, !915, i64 92, !915, i64 96, !915, i64 100}
!963 = !{!"any pointer", !916, i64 0}
!964 = !{!"long", !916, i64 0}
!965 = !DILocation(line: 1246, column: 9, scope: !951)
!966 = !DILocation(line: 1246, column: 27, scope: !951)
!967 = !{!968, !963, i64 16}
!968 = !{!"MDB_dbx", !969, i64 0, !963, i64 16, !963, i64 24, !963, i64 32, !963, i64 40}
!969 = !{!"MDB_val", !964, i64 0, !963, i64 8}
!970 = !DILocation(line: 1246, column: 2, scope: !951)
!971 = distinct !DISubprogram(name: "mdb_dcmp", scope: !2, file: !2, line: 1250, type: !952, scopeLine: 1251, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DILocalVariable(name: "txn", arg: 1, scope: !971, file: !2, line: 1250, type: !663)
!974 = !DILocalVariable(name: "dbi", arg: 2, scope: !971, file: !2, line: 1250, type: !685)
!975 = !DILocalVariable(name: "a", arg: 3, scope: !971, file: !2, line: 1250, type: !651)
!976 = !DILocalVariable(name: "b", arg: 4, scope: !971, file: !2, line: 1250, type: !651)
!977 = !DILocation(line: 0, scope: !971)
!978 = !DILocation(line: 1252, column: 14, scope: !971)
!979 = !DILocation(line: 1252, column: 9, scope: !971)
!980 = !DILocation(line: 1252, column: 27, scope: !971)
!981 = !{!968, !963, i64 24}
!982 = !DILocation(line: 1252, column: 2, scope: !971)
!983 = distinct !DISubprogram(name: "mdb_env_sync", scope: !2, file: !2, line: 1688, type: !984, scopeLine: 1689, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !986)
!984 = !DISubroutineType(types: !985)
!985 = !{!650, !673, !650}
!986 = !{!987, !988, !989, !990}
!987 = !DILocalVariable(name: "env", arg: 1, scope: !983, file: !2, line: 1688, type: !673)
!988 = !DILocalVariable(name: "force", arg: 2, scope: !983, file: !2, line: 1688, type: !650)
!989 = !DILocalVariable(name: "rc", scope: !983, file: !2, line: 1690, type: !650)
!990 = !DILocalVariable(name: "flags", scope: !991, file: !2, line: 1693, type: !650)
!991 = distinct !DILexicalBlock(scope: !992, file: !2, line: 1692, column: 37)
!992 = distinct !DILexicalBlock(scope: !993, file: !2, line: 1692, column: 7)
!993 = distinct !DILexicalBlock(scope: !994, file: !2, line: 1691, column: 52)
!994 = distinct !DILexicalBlock(scope: !983, file: !2, line: 1691, column: 6)
!995 = !DILocation(line: 0, scope: !983)
!996 = !DILocation(line: 1691, column: 6, scope: !994)
!997 = !DILocation(line: 0, scope: !994)
!998 = !{!999, !915, i64 12}
!999 = !{!"MDB_env", !915, i64 0, !915, i64 4, !915, i64 8, !915, i64 12, !915, i64 16, !915, i64 20, !915, i64 24, !915, i64 28, !915, i64 32, !915, i64 36, !963, i64 40, !963, i64 48, !963, i64 56, !916, i64 64, !963, i64 80, !964, i64 88, !964, i64 96, !964, i64 104, !963, i64 112, !963, i64 120, !915, i64 128, !1000, i64 136, !963, i64 160, !963, i64 168, !963, i64 176, !915, i64 184, !915, i64 188}
!1000 = !{!"MDB_pgstate", !964, i64 0, !963, i64 8, !963, i64 16}
!1001 = !DILocation(line: 1691, column: 12, scope: !994)
!1002 = !DILocation(line: 1692, column: 21, scope: !992)
!1003 = !DILocation(line: 1692, column: 7, scope: !993)
!1004 = !DILocation(line: 1693, column: 32, scope: !991)
!1005 = !DILocation(line: 1693, column: 48, scope: !991)
!1006 = !DILocation(line: 1693, column: 16, scope: !991)
!1007 = !DILocation(line: 0, scope: !991)
!1008 = !DILocation(line: 1695, column: 8, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !991, file: !2, line: 1695, column: 8)
!1010 = !{!999, !963, i64 48}
!1011 = !{!999, !964, i64 88}
!1012 = !DILocation(line: 1695, column: 8, scope: !991)
!1013 = !DILocation(line: 1702, column: 27, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !2, line: 1702, column: 8)
!1015 = distinct !DILexicalBlock(scope: !992, file: !2, line: 1701, column: 10)
!1016 = !{!999, !915, i64 0}
!1017 = !DILocation(line: 1702, column: 8, scope: !1014)
!1018 = !DILocation(line: 1702, column: 8, scope: !1015)
!1019 = !DILocation(line: 0, scope: !992)
!1020 = !DILocation(line: 1706, column: 2, scope: !983)
!1021 = !DISubprogram(name: "msync", scope: !1022, file: !1022, line: 89, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!1022 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/mman.h", directory: "", checksumkind: CSK_MD5, checksum: "93a87cc3b0558893646eb0c257165272")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!650, !593, !612, !650}
!1025 = !DISubprogram(name: "__errno_location", scope: !1026, file: !1026, line: 37, type: !1027, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!1026 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!904}
!1029 = !DISubprogram(name: "fdatasync", scope: !1030, file: !1030, line: 1150, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!1030 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!650, !650}
!1033 = distinct !DISubprogram(name: "mdb_txn_renew", scope: !2, file: !2, line: 1902, type: !1034, scopeLine: 1903, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1036)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!650, !663}
!1036 = !{!1037, !1038}
!1037 = !DILocalVariable(name: "txn", arg: 1, scope: !1033, file: !2, line: 1902, type: !663)
!1038 = !DILocalVariable(name: "rc", scope: !1033, file: !2, line: 1904, type: !650)
!1039 = !DILocation(line: 0, scope: !1033)
!1040 = !DILocation(line: 1906, column: 7, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1033, file: !2, line: 1906, column: 6)
!1042 = !DILocation(line: 1906, column: 11, scope: !1041)
!1043 = !DILocation(line: 1906, column: 19, scope: !1041)
!1044 = !DILocation(line: 1906, column: 14, scope: !1041)
!1045 = !DILocation(line: 1906, column: 6, scope: !1033)
!1046 = !DILocation(line: 1909, column: 11, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1033, file: !2, line: 1909, column: 6)
!1048 = !{!962, !963, i64 32}
!1049 = !DILocation(line: 1909, column: 19, scope: !1047)
!1050 = !DILocation(line: 1909, column: 28, scope: !1047)
!1051 = !DILocation(line: 1909, column: 6, scope: !1033)
!1052 = !DILocation(line: 1914, column: 7, scope: !1033)
!1053 = !DILocation(line: 1920, column: 2, scope: !1033)
!1054 = !DILocation(line: 1921, column: 1, scope: !1033)
!1055 = distinct !DISubprogram(name: "mdb_txn_renew0", scope: !2, file: !2, line: 1808, type: !1034, scopeLine: 1809, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063, !1068, !1071}
!1057 = !DILocalVariable(name: "txn", arg: 1, scope: !1055, file: !2, line: 1808, type: !663)
!1058 = !DILocalVariable(name: "env", scope: !1055, file: !2, line: 1810, type: !673)
!1059 = !DILocalVariable(name: "i", scope: !1055, file: !2, line: 1811, type: !347)
!1060 = !DILocalVariable(name: "x", scope: !1055, file: !2, line: 1812, type: !604)
!1061 = !DILocalVariable(name: "rc", scope: !1055, file: !2, line: 1813, type: !650)
!1062 = !DILocalVariable(name: "new_notls", scope: !1055, file: !2, line: 1813, type: !650)
!1063 = !DILocalVariable(name: "r", scope: !1064, file: !2, line: 1825, type: !845)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 1824, column: 10)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !2, line: 1820, column: 7)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 1819, column: 38)
!1067 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 1819, column: 6)
!1068 = !DILocalVariable(name: "pid", scope: !1069, file: !2, line: 1831, type: !688)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !2, line: 1830, column: 11)
!1070 = distinct !DILexicalBlock(scope: !1064, file: !2, line: 1827, column: 8)
!1071 = !DILocalVariable(name: "tid", scope: !1069, file: !2, line: 1832, type: !764)
!1072 = !DILocation(line: 0, scope: !1055)
!1073 = !DILocation(line: 1810, column: 22, scope: !1055)
!1074 = !DILocation(line: 1816, column: 24, scope: !1055)
!1075 = !{!999, !915, i64 28}
!1076 = !DILocation(line: 1816, column: 7, scope: !1055)
!1077 = !DILocation(line: 1816, column: 17, scope: !1055)
!1078 = !{!962, !915, i64 88}
!1079 = !DILocation(line: 1817, column: 22, scope: !1055)
!1080 = !{!999, !963, i64 112}
!1081 = !DILocation(line: 1817, column: 7, scope: !1055)
!1082 = !DILocation(line: 1817, column: 15, scope: !1055)
!1083 = !DILocation(line: 1819, column: 11, scope: !1067)
!1084 = !{!962, !915, i64 92}
!1085 = !DILocation(line: 1819, column: 20, scope: !1067)
!1086 = !DILocation(line: 0, scope: !1067)
!1087 = !{!999, !963, i64 56}
!1088 = !DILocation(line: 1819, column: 6, scope: !1055)
!1089 = !DILocation(line: 1820, column: 8, scope: !1065)
!1090 = !DILocation(line: 1820, column: 7, scope: !1066)
!1091 = !DILocalVariable(name: "env", arg: 1, scope: !1092, file: !2, line: 2786, type: !1095)
!1092 = distinct !DISubprogram(name: "mdb_env_pick_meta", scope: !2, file: !2, line: 2786, type: !1093, scopeLine: 2787, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1097)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!650, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!1097 = !{!1091}
!1098 = !DILocation(line: 0, scope: !1092, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 1821, column: 8, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 1820, column: 22)
!1101 = !DILocation(line: 2788, column: 15, scope: !1092, inlinedAt: !1099)
!1102 = !DILocation(line: 2788, column: 10, scope: !1092, inlinedAt: !1099)
!1103 = !{!963, !963, i64 0}
!1104 = !DILocation(line: 2788, column: 28, scope: !1092, inlinedAt: !1099)
!1105 = !{!1106, !964, i64 128}
!1106 = !{!"MDB_meta", !915, i64 0, !915, i64 4, !963, i64 8, !964, i64 16, !916, i64 24, !964, i64 120, !964, i64 128}
!1107 = !DILocation(line: 2788, column: 39, scope: !1092, inlinedAt: !1099)
!1108 = !DILocation(line: 2788, column: 57, scope: !1092, inlinedAt: !1099)
!1109 = !DILocation(line: 2788, column: 37, scope: !1092, inlinedAt: !1099)
!1110 = !DILocation(line: 1822, column: 20, scope: !1100)
!1111 = !DILocation(line: 1822, column: 38, scope: !1100)
!1112 = !DILocation(line: 1824, column: 3, scope: !1100)
!1113 = !DILocation(line: 1825, column: 26, scope: !1064)
!1114 = !DILocation(line: 1825, column: 35, scope: !1064)
!1115 = !DILocation(line: 1825, column: 20, scope: !1064)
!1116 = !DILocation(line: 1825, column: 55, scope: !1064)
!1117 = !DILocation(line: 1825, column: 60, scope: !1064)
!1118 = !{!916, !916, i64 0}
!1119 = !DILocation(line: 1826, column: 30, scope: !1064)
!1120 = !{!999, !915, i64 128}
!1121 = !DILocation(line: 1826, column: 5, scope: !1064)
!1122 = !DILocation(line: 0, scope: !1064)
!1123 = !DILocation(line: 1827, column: 8, scope: !1070)
!1124 = !DILocation(line: 1827, column: 8, scope: !1064)
!1125 = !DILocation(line: 1828, column: 12, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 1828, column: 9)
!1127 = distinct !DILexicalBlock(scope: !1070, file: !2, line: 1827, column: 11)
!1128 = !DILocation(line: 1828, column: 27, scope: !1126)
!1129 = !{!999, !915, i64 36}
!1130 = !DILocation(line: 1828, column: 19, scope: !1126)
!1131 = !DILocation(line: 1828, column: 34, scope: !1126)
!1132 = !DILocation(line: 1828, column: 40, scope: !1126)
!1133 = !DILocation(line: 1828, column: 49, scope: !1126)
!1134 = !DILocation(line: 1828, column: 9, scope: !1127)
!1135 = !DILocation(line: 1831, column: 22, scope: !1069)
!1136 = !DILocation(line: 0, scope: !1069)
!1137 = !DILocation(line: 1832, column: 21, scope: !1069)
!1138 = !DILocation(line: 1834, column: 5, scope: !1069)
!1139 = !DILocation(line: 1835, column: 16, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !2, line: 1835, column: 5)
!1141 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 1835, column: 5)
!1142 = !DILocation(line: 1835, column: 5, scope: !1141)
!1143 = !DILocation(line: 1836, column: 10, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !2, line: 1836, column: 10)
!1145 = !DILocation(line: 1836, column: 39, scope: !1144)
!1146 = !DILocation(line: 1836, column: 46, scope: !1144)
!1147 = !DILocation(line: 1836, column: 10, scope: !1140)
!1148 = !DILocation(line: 1835, column: 48, scope: !1140)
!1149 = distinct !{!1149, !1142, !1150, !1151}
!1150 = !DILocation(line: 1837, column: 7, scope: !1141)
!1151 = !{!"llvm.loop.mustprogress"}
!1152 = !DILocation(line: 1835, scope: !1141)
!1153 = !DILocation(line: 1838, column: 19, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 1838, column: 9)
!1155 = !{!999, !915, i64 20}
!1156 = !DILocation(line: 1838, column: 11, scope: !1154)
!1157 = !DILocation(line: 1838, column: 9, scope: !1069)
!1158 = !DILocation(line: 1839, column: 6, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 1838, column: 34)
!1160 = !DILocation(line: 1840, column: 6, scope: !1159)
!1161 = !DILocation(line: 1842, column: 5, scope: !1069)
!1162 = !DILocation(line: 1842, column: 34, scope: !1069)
!1163 = !DILocation(line: 1842, column: 41, scope: !1069)
!1164 = !DILocation(line: 1843, column: 10, scope: !1069)
!1165 = !DILocation(line: 1843, column: 34, scope: !1069)
!1166 = !DILocation(line: 1843, column: 41, scope: !1069)
!1167 = !DILocation(line: 1844, column: 19, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 1844, column: 9)
!1169 = !DILocation(line: 1844, column: 28, scope: !1168)
!1170 = !DILocation(line: 1844, column: 11, scope: !1168)
!1171 = !DILocation(line: 1844, column: 9, scope: !1069)
!1172 = !DILocation(line: 1845, column: 38, scope: !1168)
!1173 = !DILocation(line: 1845, column: 35, scope: !1168)
!1174 = !DILocation(line: 1847, column: 31, scope: !1069)
!1175 = !DILocation(line: 1847, column: 40, scope: !1069)
!1176 = !DILocation(line: 1845, column: 6, scope: !1168)
!1177 = !DILocation(line: 1847, column: 10, scope: !1069)
!1178 = !DILocation(line: 1847, column: 24, scope: !1069)
!1179 = !{!999, !915, i64 24}
!1180 = !DILocation(line: 1848, column: 5, scope: !1069)
!1181 = !DILocation(line: 1849, column: 15, scope: !1069)
!1182 = !DILocation(line: 1849, column: 10, scope: !1069)
!1183 = !DILocation(line: 1850, column: 23, scope: !1069)
!1184 = !DILocation(line: 1850, column: 32, scope: !1069)
!1185 = !DILocation(line: 1851, column: 10, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 1851, column: 9)
!1187 = !DILocation(line: 1851, column: 20, scope: !1186)
!1188 = !DILocation(line: 1851, column: 52, scope: !1186)
!1189 = !DILocation(line: 1851, column: 27, scope: !1186)
!1190 = !DILocation(line: 1851, column: 26, scope: !1186)
!1191 = !DILocation(line: 1851, column: 9, scope: !1069)
!1192 = !DILocation(line: 1852, column: 9, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1186, file: !2, line: 1851, column: 67)
!1194 = !DILocation(line: 1852, column: 16, scope: !1193)
!1195 = !DILocation(line: 1853, column: 6, scope: !1193)
!1196 = !DILocation(line: 1813, column: 10, scope: !1055)
!1197 = !DILocation(line: 1825, column: 16, scope: !1064)
!1198 = !DILocation(line: 1856, column: 39, scope: !1064)
!1199 = !DILocation(line: 1856, column: 48, scope: !1064)
!1200 = !DILocation(line: 1856, column: 32, scope: !1064)
!1201 = !DILocation(line: 0, scope: !1065)
!1202 = !{!962, !964, i64 24}
!1203 = !DILocation(line: 1859, column: 20, scope: !1066)
!1204 = !DILocation(line: 1859, column: 8, scope: !1066)
!1205 = !DILocation(line: 1859, column: 18, scope: !1066)
!1206 = !{!962, !915, i64 100}
!1207 = !DILocation(line: 1860, column: 23, scope: !1066)
!1208 = !DILocation(line: 1860, column: 54, scope: !1066)
!1209 = !{!1106, !964, i64 120}
!1210 = !DILocation(line: 1860, column: 64, scope: !1066)
!1211 = !DILocation(line: 1860, column: 8, scope: !1066)
!1212 = !DILocation(line: 1860, column: 21, scope: !1066)
!1213 = !{!962, !964, i64 16}
!1214 = !DILocation(line: 1861, column: 2, scope: !1066)
!1215 = !DILocation(line: 1862, column: 3, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1067, file: !2, line: 1861, column: 9)
!1217 = !DILocation(line: 1864, column: 24, scope: !1216)
!1218 = !DILocation(line: 1864, column: 33, scope: !1216)
!1219 = !DILocation(line: 1864, column: 8, scope: !1216)
!1220 = !DILocation(line: 1865, column: 20, scope: !1216)
!1221 = !DILocation(line: 1865, column: 8, scope: !1216)
!1222 = !DILocation(line: 1865, column: 18, scope: !1216)
!1223 = !DILocation(line: 1866, column: 23, scope: !1216)
!1224 = !DILocation(line: 1866, column: 54, scope: !1216)
!1225 = !DILocation(line: 1866, column: 64, scope: !1216)
!1226 = !DILocation(line: 1866, column: 8, scope: !1216)
!1227 = !DILocation(line: 1866, column: 21, scope: !1216)
!1228 = !DILocation(line: 1867, column: 16, scope: !1216)
!1229 = !DILocation(line: 1872, column: 8, scope: !1216)
!1230 = !DILocation(line: 1872, column: 22, scope: !1216)
!1231 = !{!962, !915, i64 96}
!1232 = !DILocation(line: 1873, column: 31, scope: !1216)
!1233 = !{!999, !963, i64 176}
!1234 = !DILocation(line: 1873, column: 8, scope: !1216)
!1235 = !DILocation(line: 1873, column: 24, scope: !1216)
!1236 = !DILocation(line: 1874, column: 31, scope: !1216)
!1237 = !{!1238, !964, i64 0}
!1238 = !{!"MDB_ID2", !964, i64 0, !963, i64 8}
!1239 = !DILocation(line: 1875, column: 27, scope: !1216)
!1240 = !{!999, !963, i64 168}
!1241 = !DILocation(line: 1875, column: 8, scope: !1216)
!1242 = !DILocation(line: 1875, column: 20, scope: !1216)
!1243 = !{!962, !963, i64 40}
!1244 = !DILocation(line: 1876, column: 23, scope: !1216)
!1245 = !{!964, !964, i64 0}
!1246 = !DILocation(line: 1877, column: 8, scope: !1216)
!1247 = !DILocation(line: 1877, column: 15, scope: !1216)
!1248 = !{!999, !963, i64 80}
!1249 = !DILocation(line: 1881, column: 41, scope: !1055)
!1250 = !DILocation(line: 1881, column: 14, scope: !1055)
!1251 = !{!962, !963, i64 64}
!1252 = !DILocation(line: 1881, column: 22, scope: !1055)
!1253 = !DILocation(line: 1881, column: 53, scope: !1055)
!1254 = !DILocation(line: 1881, column: 2, scope: !1055)
!1255 = !DILocation(line: 1882, column: 19, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !2, line: 1882, column: 2)
!1257 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 1882, column: 2)
!1258 = !DILocation(line: 1882, column: 13, scope: !1256)
!1259 = !DILocation(line: 1882, column: 2, scope: !1257)
!1260 = !DILocation(line: 1883, column: 12, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1256, file: !2, line: 1882, column: 35)
!1262 = !{!999, !963, i64 120}
!1263 = !DILocation(line: 1883, column: 7, scope: !1261)
!1264 = !{!1265, !1265, i64 0}
!1265 = !{!"short", !916, i64 0}
!1266 = !DILocation(line: 1884, column: 31, scope: !1261)
!1267 = !DILocation(line: 1884, column: 8, scope: !1261)
!1268 = !DILocation(line: 1884, column: 18, scope: !1261)
!1269 = !DILocation(line: 1884, column: 27, scope: !1261)
!1270 = !{!1271, !1265, i64 4}
!1271 = !{!"MDB_db", !915, i64 0, !1265, i64 4, !1265, i64 6, !964, i64 8, !964, i64 16, !964, i64 24, !964, i64 32, !964, i64 40}
!1272 = !DILocation(line: 1885, column: 24, scope: !1261)
!1273 = !DILocation(line: 1885, column: 8, scope: !1261)
!1274 = !{!962, !963, i64 80}
!1275 = !DILocation(line: 1885, column: 3, scope: !1261)
!1276 = !DILocation(line: 1885, column: 22, scope: !1261)
!1277 = !DILocation(line: 1882, column: 31, scope: !1256)
!1278 = distinct !{!1278, !1259, !1279, !1151}
!1279 = !DILocation(line: 1886, column: 2, scope: !1257)
!1280 = !DILocation(line: 1887, column: 28, scope: !1055)
!1281 = !DILocation(line: 1887, column: 23, scope: !1055)
!1282 = !DILocation(line: 1887, column: 42, scope: !1055)
!1283 = !DILocation(line: 1887, column: 7, scope: !1055)
!1284 = !DILocation(line: 1887, column: 21, scope: !1055)
!1285 = !DILocation(line: 1889, column: 11, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1055, file: !2, line: 1889, column: 6)
!1287 = !{!999, !964, i64 104}
!1288 = !DILocation(line: 1889, column: 27, scope: !1286)
!1289 = !DILocation(line: 1889, column: 20, scope: !1286)
!1290 = !DILocation(line: 1889, column: 6, scope: !1055)
!1291 = !DILocation(line: 1890, column: 3, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1286, file: !2, line: 1889, column: 41)
!1293 = !DILocation(line: 1891, column: 7, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1292, file: !2, line: 1891, column: 7)
!1295 = !DILocation(line: 1891, column: 7, scope: !1292)
!1296 = !DILocation(line: 1892, column: 9, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1294, file: !2, line: 1891, column: 18)
!1298 = !DILocation(line: 1892, column: 14, scope: !1297)
!1299 = !DILocation(line: 1892, column: 22, scope: !1297)
!1300 = !DILocation(line: 1892, column: 29, scope: !1297)
!1301 = !DILocation(line: 1893, column: 21, scope: !1297)
!1302 = !DILocation(line: 1894, column: 3, scope: !1297)
!1303 = !DILocation(line: 1899, column: 1, scope: !1055)
!1304 = distinct !DISubprogram(name: "mdb_txn_begin", scope: !2, file: !2, line: 1924, type: !1305, scopeLine: 1925, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1308)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!650, !673, !663, !347, !1307}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!1308 = !{!1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318}
!1309 = !DILocalVariable(name: "env", arg: 1, scope: !1304, file: !2, line: 1924, type: !673)
!1310 = !DILocalVariable(name: "parent", arg: 2, scope: !1304, file: !2, line: 1924, type: !663)
!1311 = !DILocalVariable(name: "flags", arg: 3, scope: !1304, file: !2, line: 1924, type: !347)
!1312 = !DILocalVariable(name: "ret", arg: 4, scope: !1304, file: !2, line: 1924, type: !1307)
!1313 = !DILocalVariable(name: "txn", scope: !1304, file: !2, line: 1926, type: !663)
!1314 = !DILocalVariable(name: "ntxn", scope: !1304, file: !2, line: 1927, type: !865)
!1315 = !DILocalVariable(name: "rc", scope: !1304, file: !2, line: 1928, type: !650)
!1316 = !DILocalVariable(name: "size", scope: !1304, file: !2, line: 1928, type: !650)
!1317 = !DILocalVariable(name: "tsize", scope: !1304, file: !2, line: 1928, type: !650)
!1318 = !DILocalVariable(name: "i", scope: !1319, file: !2, line: 1965, type: !347)
!1319 = distinct !DILexicalBlock(scope: !1320, file: !2, line: 1964, column: 14)
!1320 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 1964, column: 6)
!1321 = !DILocation(line: 0, scope: !1304)
!1322 = !DILocation(line: 1930, column: 11, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 1930, column: 6)
!1324 = !DILocation(line: 1930, column: 20, scope: !1323)
!1325 = !DILocation(line: 1930, column: 6, scope: !1304)
!1326 = !DILocation(line: 1934, column: 21, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 1934, column: 6)
!1328 = !DILocation(line: 1934, column: 35, scope: !1327)
!1329 = !DILocation(line: 1936, column: 6, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 1936, column: 6)
!1331 = !DILocation(line: 1936, column: 6, scope: !1304)
!1332 = !DILocation(line: 1938, column: 15, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1334, file: !2, line: 1938, column: 7)
!1334 = distinct !DILexicalBlock(scope: !1330, file: !2, line: 1936, column: 14)
!1335 = !{!962, !963, i64 8}
!1336 = !DILocation(line: 1938, column: 7, scope: !1333)
!1337 = !DILocation(line: 1938, column: 24, scope: !1333)
!1338 = !DILocation(line: 1939, column: 37, scope: !1333)
!1339 = !DILocation(line: 1939, column: 46, scope: !1333)
!1340 = !DILocation(line: 1939, column: 64, scope: !1333)
!1341 = !DILocation(line: 1946, column: 22, scope: !1304)
!1342 = !{!999, !915, i64 32}
!1343 = !DILocation(line: 1946, column: 17, scope: !1304)
!1344 = !DILocation(line: 1946, column: 32, scope: !1304)
!1345 = !DILocation(line: 1946, column: 15, scope: !1304)
!1346 = !DILocation(line: 1947, column: 6, scope: !1304)
!1347 = !DILocation(line: 1950, column: 23, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 1950, column: 6)
!1349 = !DILocation(line: 1950, column: 13, scope: !1348)
!1350 = !DILocation(line: 1950, column: 30, scope: !1348)
!1351 = !DILocation(line: 1950, column: 6, scope: !1304)
!1352 = !DILocation(line: 1954, column: 40, scope: !1304)
!1353 = !DILocation(line: 1954, column: 7, scope: !1304)
!1354 = !DILocation(line: 1954, column: 14, scope: !1304)
!1355 = !DILocation(line: 1955, column: 6, scope: !1304)
!1356 = !DILocation(line: 1956, column: 8, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1358, file: !2, line: 1955, column: 26)
!1358 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 1955, column: 6)
!1359 = !DILocation(line: 1956, column: 17, scope: !1357)
!1360 = !DILocation(line: 1957, column: 51, scope: !1357)
!1361 = !DILocation(line: 1958, column: 2, scope: !1357)
!1362 = !DILocation(line: 1959, column: 49, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1358, file: !2, line: 1958, column: 9)
!1364 = !DILocation(line: 1959, column: 8, scope: !1363)
!1365 = !DILocation(line: 1959, column: 19, scope: !1363)
!1366 = !{!962, !963, i64 72}
!1367 = !DILocation(line: 1960, column: 55, scope: !1363)
!1368 = !DILocation(line: 0, scope: !1358)
!1369 = !DILocation(line: 1962, column: 7, scope: !1304)
!1370 = !DILocation(line: 1962, column: 14, scope: !1304)
!1371 = !DILocation(line: 1964, column: 6, scope: !1304)
!1372 = !DILocation(line: 1966, column: 26, scope: !1319)
!1373 = !DILocation(line: 1966, column: 8, scope: !1319)
!1374 = !DILocation(line: 1966, column: 24, scope: !1319)
!1375 = !DILocation(line: 1967, column: 8, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 1967, column: 7)
!1377 = !DILocation(line: 1967, column: 29, scope: !1376)
!1378 = !DILocation(line: 1968, column: 25, scope: !1376)
!1379 = !DILocation(line: 1968, column: 11, scope: !1376)
!1380 = !DILocation(line: 1968, column: 23, scope: !1376)
!1381 = !DILocation(line: 1967, column: 7, scope: !1319)
!1382 = !DILocation(line: 1970, column: 19, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1376, file: !2, line: 1969, column: 3)
!1384 = !DILocation(line: 1974, column: 27, scope: !1319)
!1385 = !DILocation(line: 1974, column: 8, scope: !1319)
!1386 = !DILocation(line: 1974, column: 17, scope: !1319)
!1387 = !DILocation(line: 1976, column: 32, scope: !1319)
!1388 = !DILocation(line: 1976, column: 8, scope: !1319)
!1389 = !DILocation(line: 1976, column: 22, scope: !1319)
!1390 = !DILocation(line: 1977, column: 13, scope: !1319)
!1391 = !DILocation(line: 1977, column: 31, scope: !1319)
!1392 = !DILocation(line: 1978, column: 23, scope: !1319)
!1393 = !DILocation(line: 1979, column: 31, scope: !1319)
!1394 = !DILocation(line: 1979, column: 8, scope: !1319)
!1395 = !DILocation(line: 1979, column: 21, scope: !1319)
!1396 = !DILocation(line: 1980, column: 11, scope: !1319)
!1397 = !DILocation(line: 1980, column: 20, scope: !1319)
!1398 = !DILocation(line: 1981, column: 18, scope: !1319)
!1399 = !{!962, !963, i64 0}
!1400 = !DILocation(line: 1982, column: 28, scope: !1319)
!1401 = !DILocation(line: 1982, column: 8, scope: !1319)
!1402 = !DILocation(line: 1982, column: 18, scope: !1319)
!1403 = !DILocation(line: 1983, column: 26, scope: !1319)
!1404 = !DILocation(line: 1983, column: 8, scope: !1319)
!1405 = !DILocation(line: 1983, column: 16, scope: !1319)
!1406 = !DILocation(line: 1984, column: 15, scope: !1319)
!1407 = !DILocation(line: 1984, column: 31, scope: !1319)
!1408 = !DILocation(line: 1984, column: 39, scope: !1319)
!1409 = !DILocation(line: 1984, column: 54, scope: !1319)
!1410 = !DILocation(line: 1984, column: 3, scope: !1319)
!1411 = !DILocation(line: 0, scope: !1319)
!1412 = !DILocation(line: 1986, column: 20, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1414, file: !2, line: 1986, column: 3)
!1414 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 1986, column: 3)
!1415 = !DILocation(line: 1986, column: 14, scope: !1413)
!1416 = !DILocation(line: 1986, column: 3, scope: !1414)
!1417 = !DILocation(line: 1987, column: 33, scope: !1413)
!1418 = !DILocation(line: 1987, column: 25, scope: !1413)
!1419 = !DILocation(line: 1987, column: 47, scope: !1413)
!1420 = !DILocation(line: 1987, column: 9, scope: !1413)
!1421 = !DILocation(line: 1987, column: 4, scope: !1413)
!1422 = !DILocation(line: 1987, column: 23, scope: !1413)
!1423 = !DILocation(line: 1986, column: 32, scope: !1413)
!1424 = distinct !{!1424, !1416, !1425, !1151}
!1425 = !DILocation(line: 1987, column: 50, scope: !1414)
!1426 = !DILocation(line: 1990, column: 9, scope: !1319)
!1427 = !DILocation(line: 1990, column: 28, scope: !1319)
!1428 = !{i64 0, i64 8, !1245, i64 8, i64 8, !1103, i64 16, i64 8, !1103}
!1429 = !DILocation(line: 1991, column: 12, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 1991, column: 7)
!1431 = !{!999, !963, i64 144}
!1432 = !DILocation(line: 1991, column: 7, scope: !1430)
!1433 = !DILocation(line: 1991, column: 7, scope: !1319)
!1434 = !DILocation(line: 1992, column: 11, scope: !1435)
!1435 = distinct !DILexicalBlock(scope: !1430, file: !2, line: 1991, column: 23)
!1436 = !DILocation(line: 1993, column: 36, scope: !1435)
!1437 = !DILocation(line: 1993, column: 21, scope: !1435)
!1438 = !DILocation(line: 1993, column: 19, scope: !1435)
!1439 = !DILocation(line: 1994, column: 8, scope: !1440)
!1440 = distinct !DILexicalBlock(scope: !1435, file: !2, line: 1994, column: 8)
!1441 = !DILocation(line: 1994, column: 8, scope: !1435)
!1442 = !DILocation(line: 1995, column: 46, scope: !1440)
!1443 = !{!1444, !963, i64 112}
!1444 = !{!"MDB_ntxn", !962, i64 0, !1000, i64 104}
!1445 = !DILocation(line: 1995, column: 57, scope: !1440)
!1446 = !DILocation(line: 1995, column: 5, scope: !1440)
!1447 = !DILocation(line: 1999, column: 25, scope: !1319)
!1448 = !DILocation(line: 1999, column: 8, scope: !1319)
!1449 = !DILocation(line: 1999, column: 18, scope: !1319)
!1450 = !{!999, !963, i64 152}
!1451 = !DILocation(line: 2002, column: 7, scope: !1319)
!1452 = !DILocation(line: 2001, column: 9, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 2000, column: 7)
!1454 = !DILocation(line: 2002, column: 7, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 2002, column: 7)
!1456 = !DILocation(line: 2003, column: 4, scope: !1455)
!1457 = !DILocation(line: 2007, column: 6, scope: !1304)
!1458 = !DILocation(line: 1970, column: 4, scope: !1383)
!1459 = !DILocation(line: 1971, column: 4, scope: !1383)
!1460 = !DILocation(line: 2005, column: 8, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !1320, file: !2, line: 2004, column: 9)
!1462 = !DILocation(line: 2007, column: 6, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1304, file: !2, line: 2007, column: 6)
!1464 = !DILocation(line: 2008, column: 3, scope: !1463)
!1465 = !DILocation(line: 2010, column: 8, scope: !1466)
!1466 = distinct !DILexicalBlock(scope: !1463, file: !2, line: 2009, column: 7)
!1467 = !DILocation(line: 2017, column: 1, scope: !1304)
!1468 = !DISubprogram(name: "calloc", scope: !1469, file: !1469, line: 543, type: !1470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!1469 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!593, !612, !612}
!1472 = !DISubprogram(name: "malloc", scope: !1469, file: !1469, line: 540, type: !1473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!593, !612}
!1475 = !DISubprogram(name: "mdb_midl_alloc", scope: !611, file: !611, line: 84, type: !1476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!827, !650}
!1478 = !DISubprogram(name: "free", scope: !1469, file: !1469, line: 555, type: !1479, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !950)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{null, !593}
!1481 = distinct !DISubprogram(name: "mdb_cursor_shadow", scope: !2, file: !2, line: 1711, type: !1482, scopeLine: 1712, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1484)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!650, !663, !663}
!1484 = !{!1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1503}
!1485 = !DILocalVariable(name: "src", arg: 1, scope: !1481, file: !2, line: 1711, type: !663)
!1486 = !DILocalVariable(name: "dst", arg: 2, scope: !1481, file: !2, line: 1711, type: !663)
!1487 = !DILocalVariable(name: "mc", scope: !1481, file: !2, line: 1713, type: !623)
!1488 = !DILocalVariable(name: "m2", scope: !1481, file: !2, line: 1713, type: !623)
!1489 = !DILocalVariable(name: "i", scope: !1481, file: !2, line: 1714, type: !347)
!1490 = !DILocalVariable(name: "j", scope: !1481, file: !2, line: 1714, type: !347)
!1491 = !DILocalVariable(name: "size", scope: !1481, file: !2, line: 1714, type: !347)
!1492 = !DILocalVariable(name: "mx", scope: !1493, file: !2, line: 1739, type: !882)
!1493 = distinct !DILexicalBlock(scope: !1494, file: !2, line: 1738, column: 25)
!1494 = distinct !DILexicalBlock(scope: !1495, file: !2, line: 1738, column: 9)
!1495 = distinct !DILexicalBlock(scope: !1496, file: !2, line: 1721, column: 54)
!1496 = distinct !DILexicalBlock(scope: !1497, file: !2, line: 1721, column: 4)
!1497 = distinct !DILexicalBlock(scope: !1498, file: !2, line: 1721, column: 4)
!1498 = distinct !DILexicalBlock(scope: !1499, file: !2, line: 1717, column: 27)
!1499 = distinct !DILexicalBlock(scope: !1500, file: !2, line: 1717, column: 7)
!1500 = distinct !DILexicalBlock(scope: !1501, file: !2, line: 1716, column: 34)
!1501 = distinct !DILexicalBlock(scope: !1502, file: !2, line: 1716, column: 2)
!1502 = distinct !DILexicalBlock(scope: !1481, file: !2, line: 1716, column: 2)
!1503 = !DILocalVariable(name: "mx2", scope: !1493, file: !2, line: 1739, type: !882)
!1504 = !DILocation(line: 0, scope: !1481)
!1505 = !DILocation(line: 1716, column: 12, scope: !1501)
!1506 = !DILocation(line: 1716, column: 2, scope: !1502)
!1507 = !DILocation(line: 1717, column: 12, scope: !1499)
!1508 = !DILocation(line: 1717, column: 7, scope: !1499)
!1509 = !DILocation(line: 1717, column: 7, scope: !1500)
!1510 = !DILocation(line: 1719, column: 28, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1498, file: !2, line: 1719, column: 8)
!1512 = !{!1513, !963, i64 16}
!1513 = !{!"MDB_cursor", !963, i64 0, !963, i64 8, !963, i64 16, !963, i64 24, !915, i64 32, !963, i64 40, !963, i64 48, !963, i64 56, !1265, i64 64, !1265, i64 66, !915, i64 68, !916, i64 72, !916, i64 328}
!1514 = !DILocation(line: 1719, column: 8, scope: !1511)
!1515 = !DILocation(line: 1719, column: 8, scope: !1498)
!1516 = !DILocation(line: 1721, column: 4, scope: !1497)
!1517 = !DILocation(line: 1722, column: 10, scope: !1495)
!1518 = !DILocation(line: 1723, column: 10, scope: !1519)
!1519 = distinct !DILexicalBlock(scope: !1495, file: !2, line: 1723, column: 9)
!1520 = !DILocation(line: 1723, column: 9, scope: !1495)
!1521 = !DILocation(line: 1725, column: 9, scope: !1495)
!1522 = !DILocation(line: 1725, column: 17, scope: !1495)
!1523 = !{!1513, !963, i64 8}
!1524 = !DILocation(line: 1726, column: 9, scope: !1495)
!1525 = !DILocation(line: 1726, column: 16, scope: !1495)
!1526 = !{!1513, !963, i64 24}
!1527 = !DILocation(line: 1727, column: 9, scope: !1495)
!1528 = !DILocation(line: 1727, column: 16, scope: !1495)
!1529 = !{!1513, !915, i64 32}
!1530 = !DILocation(line: 1728, column: 23, scope: !1495)
!1531 = !DILocation(line: 1728, column: 18, scope: !1495)
!1532 = !DILocation(line: 1728, column: 9, scope: !1495)
!1533 = !DILocation(line: 1728, column: 15, scope: !1495)
!1534 = !{!1513, !963, i64 40}
!1535 = !DILocation(line: 1729, column: 22, scope: !1495)
!1536 = !{!1513, !963, i64 48}
!1537 = !DILocation(line: 1729, column: 9, scope: !1495)
!1538 = !DILocation(line: 1729, column: 16, scope: !1495)
!1539 = !DILocation(line: 1730, column: 27, scope: !1495)
!1540 = !DILocation(line: 1730, column: 22, scope: !1495)
!1541 = !DILocation(line: 1730, column: 9, scope: !1495)
!1542 = !DILocation(line: 1730, column: 19, scope: !1495)
!1543 = !{!1513, !963, i64 56}
!1544 = !DILocation(line: 1731, column: 23, scope: !1495)
!1545 = !DILocation(line: 1731, column: 9, scope: !1495)
!1546 = !DILocation(line: 1731, column: 17, scope: !1495)
!1547 = !DILocation(line: 1733, column: 24, scope: !1495)
!1548 = !{!1513, !915, i64 68}
!1549 = !DILocation(line: 1733, column: 33, scope: !1495)
!1550 = !DILocation(line: 1733, column: 9, scope: !1495)
!1551 = !DILocation(line: 1733, column: 18, scope: !1495)
!1552 = !DILocation(line: 1734, column: 16, scope: !1553)
!1553 = distinct !DILexicalBlock(scope: !1554, file: !2, line: 1734, column: 5)
!1554 = distinct !DILexicalBlock(scope: !1495, file: !2, line: 1734, column: 5)
!1555 = !DILocation(line: 1734, column: 5, scope: !1554)
!1556 = !DILocation(line: 1734, column: 31, scope: !1553)
!1557 = !DILocation(line: 1735, column: 21, scope: !1558)
!1558 = distinct !DILexicalBlock(scope: !1553, file: !2, line: 1734, column: 35)
!1559 = !DILocation(line: 1735, column: 6, scope: !1558)
!1560 = !DILocation(line: 1735, column: 19, scope: !1558)
!1561 = !DILocation(line: 1736, column: 21, scope: !1558)
!1562 = !DILocation(line: 1736, column: 6, scope: !1558)
!1563 = !DILocation(line: 1736, column: 19, scope: !1558)
!1564 = distinct !{!1564, !1555, !1565, !1151, !1566, !1567}
!1565 = !DILocation(line: 1737, column: 5, scope: !1554)
!1566 = !{!"llvm.loop.isvectorized", i32 1}
!1567 = !{!"llvm.loop.unroll.runtime.disable"}
!1568 = distinct !{!1568, !1555, !1565, !1151, !1566}
!1569 = !DILocation(line: 1738, column: 13, scope: !1494)
!1570 = !DILocation(line: 1738, column: 9, scope: !1494)
!1571 = !DILocation(line: 1738, column: 9, scope: !1495)
!1572 = !DILocation(line: 1740, column: 29, scope: !1493)
!1573 = !DILocation(line: 0, scope: !1493)
!1574 = !DILocation(line: 1741, column: 10, scope: !1493)
!1575 = !DILocation(line: 1741, column: 21, scope: !1493)
!1576 = !DILocation(line: 1742, column: 16, scope: !1493)
!1577 = !DILocation(line: 1743, column: 10, scope: !1493)
!1578 = !DILocation(line: 1743, column: 23, scope: !1493)
!1579 = !{i64 0, i64 4, !914, i64 4, i64 2, !1264, i64 6, i64 2, !1264, i64 8, i64 8, !1245, i64 16, i64 8, !1245, i64 24, i64 8, !1245, i64 32, i64 8, !1245, i64 40, i64 8, !1245}
!1580 = !DILocation(line: 1744, column: 10, scope: !1493)
!1581 = !DILocation(line: 1744, column: 24, scope: !1493)
!1582 = !{i64 0, i64 8, !1245, i64 8, i64 8, !1103, i64 16, i64 8, !1103, i64 24, i64 8, !1103, i64 32, i64 8, !1103, i64 40, i64 8, !1103}
!1583 = !DILocation(line: 1745, column: 27, scope: !1493)
!1584 = !{!1585, !916, i64 488}
!1585 = !{!"MDB_xcursor", !1513, i64 0, !1271, i64 392, !968, i64 440, !916, i64 488}
!1586 = !DILocation(line: 1745, column: 10, scope: !1493)
!1587 = !DILocation(line: 1745, column: 20, scope: !1493)
!1588 = !DILocation(line: 1746, column: 20, scope: !1493)
!1589 = !DILocation(line: 1746, column: 27, scope: !1493)
!1590 = !{!1585, !963, i64 24}
!1591 = !DILocation(line: 1747, column: 44, scope: !1493)
!1592 = !{!1585, !915, i64 32}
!1593 = !DILocation(line: 1747, column: 20, scope: !1493)
!1594 = !DILocation(line: 1747, column: 27, scope: !1493)
!1595 = !DILocation(line: 1748, column: 20, scope: !1493)
!1596 = !DILocation(line: 1748, column: 26, scope: !1493)
!1597 = !{!1585, !963, i64 40}
!1598 = !DILocation(line: 1749, column: 20, scope: !1493)
!1599 = !DILocation(line: 1749, column: 27, scope: !1493)
!1600 = !{!1585, !963, i64 48}
!1601 = !DILocation(line: 1750, column: 20, scope: !1493)
!1602 = !DILocation(line: 1750, column: 30, scope: !1493)
!1603 = !{!1585, !963, i64 56}
!1604 = !DILocation(line: 1751, column: 45, scope: !1493)
!1605 = !DILocation(line: 1751, column: 20, scope: !1493)
!1606 = !DILocation(line: 1751, column: 28, scope: !1493)
!1607 = !DILocation(line: 1753, column: 46, scope: !1493)
!1608 = !{!1585, !915, i64 68}
!1609 = !DILocation(line: 1753, column: 55, scope: !1493)
!1610 = !DILocation(line: 1753, column: 20, scope: !1493)
!1611 = !DILocation(line: 1753, column: 29, scope: !1493)
!1612 = !DILocation(line: 1754, column: 33, scope: !1613)
!1613 = distinct !DILexicalBlock(scope: !1614, file: !2, line: 1754, column: 6)
!1614 = distinct !DILexicalBlock(scope: !1493, file: !2, line: 1754, column: 6)
!1615 = !{!1585, !1265, i64 64}
!1616 = !DILocation(line: 1754, column: 17, scope: !1613)
!1617 = !DILocation(line: 1754, column: 6, scope: !1614)
!1618 = !DILocation(line: 1755, column: 32, scope: !1619)
!1619 = distinct !DILexicalBlock(scope: !1613, file: !2, line: 1754, column: 47)
!1620 = !DILocation(line: 1755, column: 7, scope: !1619)
!1621 = !DILocation(line: 1755, column: 30, scope: !1619)
!1622 = !DILocation(line: 1756, column: 32, scope: !1619)
!1623 = !DILocation(line: 1756, column: 7, scope: !1619)
!1624 = !DILocation(line: 1756, column: 30, scope: !1619)
!1625 = !DILocation(line: 1754, column: 43, scope: !1613)
!1626 = distinct !{!1626, !1617, !1627, !1151}
!1627 = !DILocation(line: 1757, column: 6, scope: !1614)
!1628 = !DILocation(line: 1759, column: 10, scope: !1629)
!1629 = distinct !DILexicalBlock(scope: !1494, file: !2, line: 1758, column: 12)
!1630 = !DILocation(line: 1759, column: 21, scope: !1629)
!1631 = !DILocation(line: 1761, column: 24, scope: !1495)
!1632 = !DILocation(line: 1761, column: 19, scope: !1495)
!1633 = !DILocation(line: 1761, column: 17, scope: !1495)
!1634 = !{!1513, !963, i64 0}
!1635 = !DILocation(line: 1762, column: 24, scope: !1495)
!1636 = !DILocation(line: 1721, scope: !1497)
!1637 = distinct !{!1637, !1516, !1638, !1151}
!1638 = !DILocation(line: 1763, column: 4, scope: !1497)
!1639 = !DILocation(line: 1716, column: 30, scope: !1501)
!1640 = distinct !{!1640, !1506, !1641, !1151}
!1641 = !DILocation(line: 1765, column: 2, scope: !1502)
!1642 = !DILocation(line: 1767, column: 1, scope: !1481)
!1643 = distinct !DISubprogram(name: "mdb_txn_reset0", scope: !2, file: !2, line: 2050, type: !1644, scopeLine: 2051, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1646)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{null, !663}
!1646 = !{!1647, !1648}
!1647 = !DILocalVariable(name: "txn", arg: 1, scope: !1643, file: !2, line: 2050, type: !663)
!1648 = !DILocalVariable(name: "env", scope: !1643, file: !2, line: 2052, type: !673)
!1649 = !DILocation(line: 0, scope: !1643)
!1650 = !DILocation(line: 2052, column: 22, scope: !1643)
!1651 = !DILocalVariable(name: "txn", arg: 1, scope: !1652, file: !2, line: 2021, type: !663)
!1652 = distinct !DISubprogram(name: "mdb_dbis_update", scope: !2, file: !2, line: 2021, type: !1653, scopeLine: 2022, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1655)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !663, !650}
!1655 = !{!1651, !1656, !1657, !1658, !1659, !1660, !1661}
!1656 = !DILocalVariable(name: "keep", arg: 2, scope: !1652, file: !2, line: 2021, type: !650)
!1657 = !DILocalVariable(name: "i", scope: !1652, file: !2, line: 2023, type: !650)
!1658 = !DILocalVariable(name: "n", scope: !1652, file: !2, line: 2024, type: !685)
!1659 = !DILocalVariable(name: "env", scope: !1652, file: !2, line: 2025, type: !673)
!1660 = !DILocalVariable(name: "tdbflags", scope: !1652, file: !2, line: 2026, type: !620)
!1661 = !DILocalVariable(name: "ptr", scope: !1662, file: !2, line: 2033, type: !619)
!1662 = distinct !DILexicalBlock(scope: !1663, file: !2, line: 2032, column: 11)
!1663 = distinct !DILexicalBlock(scope: !1664, file: !2, line: 2030, column: 8)
!1664 = distinct !DILexicalBlock(scope: !1665, file: !2, line: 2029, column: 29)
!1665 = distinct !DILexicalBlock(scope: !1666, file: !2, line: 2029, column: 7)
!1666 = distinct !DILexicalBlock(scope: !1667, file: !2, line: 2028, column: 25)
!1667 = distinct !DILexicalBlock(scope: !1668, file: !2, line: 2028, column: 2)
!1668 = distinct !DILexicalBlock(scope: !1652, file: !2, line: 2028, column: 2)
!1669 = !DILocation(line: 0, scope: !1652, inlinedAt: !1670)
!1670 = distinct !DILocation(line: 2055, column: 2, scope: !1643)
!1671 = !DILocation(line: 2024, column: 19, scope: !1652, inlinedAt: !1670)
!1672 = !DILocation(line: 2026, column: 33, scope: !1652, inlinedAt: !1670)
!1673 = !DILocation(line: 2028, column: 18, scope: !1667, inlinedAt: !1670)
!1674 = !DILocation(line: 2028, column: 2, scope: !1668, inlinedAt: !1670)
!1675 = !DILocation(line: 2028, column: 14, scope: !1667, inlinedAt: !1670)
!1676 = !DILocation(line: 2029, column: 7, scope: !1665, inlinedAt: !1670)
!1677 = !DILocation(line: 2029, column: 19, scope: !1665, inlinedAt: !1670)
!1678 = !DILocation(line: 2029, column: 7, scope: !1666, inlinedAt: !1670)
!1679 = !DILocation(line: 2033, column: 22, scope: !1662, inlinedAt: !1670)
!1680 = !DILocation(line: 2033, column: 41, scope: !1662, inlinedAt: !1670)
!1681 = !{!968, !963, i64 8}
!1682 = !DILocation(line: 0, scope: !1662, inlinedAt: !1670)
!1683 = !DILocation(line: 2035, column: 5, scope: !1662, inlinedAt: !1670)
!1684 = !DILocation(line: 2035, column: 37, scope: !1662, inlinedAt: !1670)
!1685 = !DILocation(line: 2036, column: 10, scope: !1662, inlinedAt: !1670)
!1686 = !DILocation(line: 2036, column: 5, scope: !1662, inlinedAt: !1670)
!1687 = !DILocation(line: 2036, column: 24, scope: !1662, inlinedAt: !1670)
!1688 = !DILocation(line: 2037, column: 5, scope: !1662, inlinedAt: !1670)
!1689 = distinct !{!1689, !1674, !1690, !1151}
!1690 = !DILocation(line: 2040, column: 2, scope: !1668, inlinedAt: !1670)
!1691 = !DILocation(line: 2057, column: 6, scope: !1692)
!1692 = distinct !DILexicalBlock(scope: !1643, file: !2, line: 2057, column: 6)
!1693 = !DILocation(line: 2057, column: 6, scope: !1643)
!1694 = !DILocation(line: 2058, column: 12, scope: !1695)
!1695 = distinct !DILexicalBlock(scope: !1696, file: !2, line: 2058, column: 7)
!1696 = distinct !DILexicalBlock(scope: !1692, file: !2, line: 2057, column: 46)
!1697 = !DILocation(line: 2058, column: 17, scope: !1695)
!1698 = !DILocation(line: 2058, column: 7, scope: !1695)
!1699 = !DILocation(line: 2058, column: 7, scope: !1696)
!1700 = !DILocation(line: 2059, column: 31, scope: !1701)
!1701 = distinct !DILexicalBlock(scope: !1695, file: !2, line: 2058, column: 25)
!1702 = !DILocation(line: 2060, column: 15, scope: !1703)
!1703 = distinct !DILexicalBlock(scope: !1701, file: !2, line: 2060, column: 8)
!1704 = !DILocation(line: 2060, column: 24, scope: !1703)
!1705 = !DILocation(line: 2060, column: 8, scope: !1701)
!1706 = !DILocation(line: 2061, column: 22, scope: !1703)
!1707 = !DILocation(line: 2061, column: 5, scope: !1703)
!1708 = !DILocation(line: 2063, column: 18, scope: !1696)
!1709 = !DILocation(line: 2064, column: 8, scope: !1696)
!1710 = !DILocation(line: 2064, column: 16, scope: !1696)
!1711 = !DILocation(line: 2065, column: 2, scope: !1696)
!1712 = !DILocalVariable(name: "txn", arg: 1, scope: !1713, file: !2, line: 1776, type: !663)
!1713 = distinct !DISubprogram(name: "mdb_cursors_close", scope: !2, file: !2, line: 1776, type: !1714, scopeLine: 1777, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1716)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{null, !663, !347}
!1716 = !{!1712, !1717, !1718, !1719, !1720, !1721, !1722, !1723}
!1717 = !DILocalVariable(name: "merge", arg: 2, scope: !1713, file: !2, line: 1776, type: !347)
!1718 = !DILocalVariable(name: "cursors", scope: !1713, file: !2, line: 1778, type: !622)
!1719 = !DILocalVariable(name: "mc", scope: !1713, file: !2, line: 1778, type: !623)
!1720 = !DILocalVariable(name: "next", scope: !1713, file: !2, line: 1778, type: !623)
!1721 = !DILocalVariable(name: "i", scope: !1713, file: !2, line: 1779, type: !650)
!1722 = !DILocalVariable(name: "j", scope: !1713, file: !2, line: 1779, type: !650)
!1723 = !DILocalVariable(name: "m2", scope: !1724, file: !2, line: 1785, type: !623)
!1724 = distinct !DILexicalBlock(scope: !1725, file: !2, line: 1784, column: 31)
!1725 = distinct !DILexicalBlock(scope: !1726, file: !2, line: 1784, column: 9)
!1726 = distinct !DILexicalBlock(scope: !1727, file: !2, line: 1782, column: 40)
!1727 = distinct !DILexicalBlock(scope: !1728, file: !2, line: 1782, column: 3)
!1728 = distinct !DILexicalBlock(scope: !1729, file: !2, line: 1782, column: 3)
!1729 = distinct !DILexicalBlock(scope: !1730, file: !2, line: 1781, column: 39)
!1730 = distinct !DILexicalBlock(scope: !1731, file: !2, line: 1781, column: 2)
!1731 = distinct !DILexicalBlock(scope: !1713, file: !2, line: 1781, column: 2)
!1732 = !DILocation(line: 0, scope: !1713, inlinedAt: !1733)
!1733 = distinct !DILocation(line: 2066, column: 3, scope: !1734)
!1734 = distinct !DILexicalBlock(scope: !1692, file: !2, line: 2065, column: 9)
!1735 = !DILocation(line: 1778, column: 30, scope: !1713, inlinedAt: !1733)
!1736 = !DILocation(line: 1781, column: 16, scope: !1731, inlinedAt: !1733)
!1737 = !DILocation(line: 1781, column: 31, scope: !1730, inlinedAt: !1733)
!1738 = !DILocation(line: 1781, column: 2, scope: !1731, inlinedAt: !1733)
!1739 = !DILocation(line: 1781, column: 27, scope: !1730, inlinedAt: !1733)
!1740 = !DILocation(line: 1782, column: 13, scope: !1728, inlinedAt: !1733)
!1741 = !DILocation(line: 1782, column: 3, scope: !1728, inlinedAt: !1733)
!1742 = !DILocation(line: 1783, column: 16, scope: !1726, inlinedAt: !1733)
!1743 = !DILocation(line: 1784, column: 13, scope: !1725, inlinedAt: !1733)
!1744 = !DILocation(line: 1793, column: 22, scope: !1745, inlinedAt: !1733)
!1745 = distinct !DILexicalBlock(scope: !1726, file: !2, line: 1793, column: 9)
!1746 = !DILocation(line: 1793, column: 9, scope: !1726, inlinedAt: !1733)
!1747 = !DILocation(line: 1794, column: 6, scope: !1745, inlinedAt: !1733)
!1748 = distinct !{!1748, !1741, !1749, !1151}
!1749 = !DILocation(line: 1795, column: 3, scope: !1728, inlinedAt: !1733)
!1750 = !DILocation(line: 1796, column: 14, scope: !1729, inlinedAt: !1733)
!1751 = distinct !{!1751, !1738, !1752, !1151}
!1752 = !DILocation(line: 1797, column: 2, scope: !1731, inlinedAt: !1733)
!1753 = !DILocation(line: 2068, column: 14, scope: !1754)
!1754 = distinct !DILexicalBlock(scope: !1734, file: !2, line: 2068, column: 7)
!1755 = !DILocation(line: 2068, column: 23, scope: !1754)
!1756 = !DILocation(line: 2068, column: 7, scope: !1734)
!1757 = !DILocalVariable(name: "txn", arg: 1, scope: !1758, file: !2, line: 1294, type: !663)
!1758 = distinct !DISubprogram(name: "mdb_dlist_free", scope: !2, file: !2, line: 1294, type: !1644, scopeLine: 1295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1759)
!1759 = !{!1757, !1760, !1761, !1762, !1763, !1764}
!1760 = !DILocalVariable(name: "env", scope: !1758, file: !2, line: 1296, type: !673)
!1761 = !DILocalVariable(name: "dl", scope: !1758, file: !2, line: 1297, type: !830)
!1762 = !DILocalVariable(name: "i", scope: !1758, file: !2, line: 1298, type: !347)
!1763 = !DILocalVariable(name: "n", scope: !1758, file: !2, line: 1298, type: !347)
!1764 = !DILocalVariable(name: "dp", scope: !1765, file: !2, line: 1301, type: !803)
!1765 = distinct !DILexicalBlock(scope: !1766, file: !2, line: 1300, column: 27)
!1766 = distinct !DILexicalBlock(scope: !1767, file: !2, line: 1300, column: 2)
!1767 = distinct !DILexicalBlock(scope: !1758, file: !2, line: 1300, column: 2)
!1768 = !DILocation(line: 0, scope: !1758, inlinedAt: !1769)
!1769 = distinct !DILocation(line: 2069, column: 4, scope: !1770)
!1770 = distinct !DILexicalBlock(scope: !1754, file: !2, line: 2068, column: 40)
!1771 = !DILocation(line: 1297, column: 21, scope: !1758, inlinedAt: !1769)
!1772 = !DILocation(line: 1297, column: 26, scope: !1758, inlinedAt: !1769)
!1773 = !DILocation(line: 1298, column: 24, scope: !1758, inlinedAt: !1769)
!1774 = !DILocation(line: 1298, column: 18, scope: !1758, inlinedAt: !1769)
!1775 = !DILocation(line: 1300, column: 16, scope: !1766, inlinedAt: !1769)
!1776 = !DILocation(line: 1300, column: 2, scope: !1767, inlinedAt: !1769)
!1777 = !DILocation(line: 1296, column: 22, scope: !1758, inlinedAt: !1769)
!1778 = !DILocation(line: 1301, column: 18, scope: !1765, inlinedAt: !1769)
!1779 = !DILocation(line: 1301, column: 24, scope: !1765, inlinedAt: !1769)
!1780 = !{!1238, !963, i64 8}
!1781 = !DILocation(line: 0, scope: !1765, inlinedAt: !1769)
!1782 = !DILocation(line: 1302, column: 8, scope: !1783, inlinedAt: !1769)
!1783 = distinct !DILexicalBlock(scope: !1765, file: !2, line: 1302, column: 7)
!1784 = !{!1785, !1265, i64 10}
!1785 = !{!"MDB_page", !916, i64 0, !1265, i64 8, !1265, i64 10, !916, i64 12, !916, i64 16}
!1786 = !DILocation(line: 1302, column: 24, scope: !1783, inlinedAt: !1769)
!1787 = !DILocation(line: 1302, column: 31, scope: !1783, inlinedAt: !1769)
!1788 = !DILocation(line: 1302, column: 40, scope: !1783, inlinedAt: !1769)
!1789 = !DILocation(line: 1302, column: 7, scope: !1765, inlinedAt: !1769)
!1790 = !DILocalVariable(name: "env", arg: 1, scope: !1791, file: !2, line: 1285, type: !673)
!1791 = distinct !DISubprogram(name: "mdb_page_free", scope: !2, file: !2, line: 1285, type: !1792, scopeLine: 1286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !1794)
!1792 = !DISubroutineType(types: !1793)
!1793 = !{null, !673, !803}
!1794 = !{!1790, !1795}
!1795 = !DILocalVariable(name: "mp", arg: 2, scope: !1791, file: !2, line: 1285, type: !803)
!1796 = !DILocation(line: 0, scope: !1791, inlinedAt: !1797)
!1797 = distinct !DILocation(line: 1303, column: 4, scope: !1798, inlinedAt: !1769)
!1798 = distinct !DILexicalBlock(scope: !1783, file: !2, line: 1302, column: 46)
!1799 = !DILocation(line: 1287, column: 21, scope: !1791, inlinedAt: !1797)
!1800 = !{!999, !963, i64 160}
!1801 = !DILocation(line: 1287, column: 14, scope: !1791, inlinedAt: !1797)
!1802 = !DILocation(line: 1289, column: 17, scope: !1791, inlinedAt: !1797)
!1803 = !DILocation(line: 1304, column: 3, scope: !1798, inlinedAt: !1769)
!1804 = !DILocation(line: 1307, column: 4, scope: !1805, inlinedAt: !1769)
!1805 = distinct !DILexicalBlock(scope: !1783, file: !2, line: 1304, column: 10)
!1806 = !DILocation(line: 1300, column: 23, scope: !1766, inlinedAt: !1769)
!1807 = distinct !{!1807, !1776, !1808, !1151}
!1808 = !DILocation(line: 1309, column: 2, scope: !1767, inlinedAt: !1769)
!1809 = !DILocation(line: 1310, column: 12, scope: !1758, inlinedAt: !1769)
!1810 = !DILocation(line: 2070, column: 3, scope: !1770)
!1811 = !DILocation(line: 2071, column: 22, scope: !1734)
!1812 = !DILocation(line: 2071, column: 3, scope: !1734)
!1813 = !DILocation(line: 2073, column: 12, scope: !1814)
!1814 = distinct !DILexicalBlock(scope: !1734, file: !2, line: 2073, column: 7)
!1815 = !DILocation(line: 2073, column: 7, scope: !1814)
!1816 = !DILocation(line: 2073, column: 7, scope: !1734)
!1817 = !DILocation(line: 2074, column: 20, scope: !1818)
!1818 = distinct !DILexicalBlock(scope: !1814, file: !2, line: 2073, column: 23)
!1819 = !DILocation(line: 2074, column: 29, scope: !1818)
!1820 = !DILocation(line: 2075, column: 41, scope: !1818)
!1821 = !DILocation(line: 2076, column: 23, scope: !1818)
!1822 = !DILocation(line: 2076, column: 4, scope: !1818)
!1823 = !DILocation(line: 2077, column: 14, scope: !1818)
