; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sched_param = type { i32 }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_attr_t = type { i64, [48 x i8] }
%"class.std::vector" = type { %"struct.std::_Vector_base" }
%"struct.std::_Vector_base" = type { %"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl" }
%"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl" = type { %"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl_data" }
%"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl_data" = type { ptr, ptr, ptr }
%"class.AP_HAL::OpticalFlow" = type { ptr }
%"class.Linux::OpticalFlow_Onboard" = type <{ %"class.AP_HAL::OpticalFlow", ptr, %"class.Linux::VideoIn::Frame", ptr, ptr, ptr, i64, %union.pthread_mutex_t, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, float, float, float, float, i32, i8, [3 x i8], %struct.__pthread_internal_list, %class.Vector3, [4 x i8] }>
%"class.Linux::VideoIn::Frame" = type <{ i32, i32, ptr, i32, [4 x i8] }>
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%class.Vector3 = type { float, float, float }

!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !106, line: 24, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !108, line: 38, baseType: !117)
!117 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!118 = !DISubprogram(name: "enable_ch", linkageName: "_ZN6AP_HAL8RCOutput9enable_chEh", scope: !89, file: !88, line: 41, type: !119, scopeLine: 41, containingType: !89, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !101, !115}
!121 = !DISubprogram(name: "disable_ch", linkageName: "_ZN6AP_HAL8RCOutput10disable_chEh", scope: !89, file: !88, line: 42, type: !119, scopeLine: 42, containingType: !89, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!122 = !DISubprogram(name: "write", linkageName: "_ZN6AP_HAL8RCOutput5writeEht", scope: !89, file: !88, line: 48, type: !123, scopeLine: 48, containingType: !89, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !101, !115, !109}
!125 = !DISubprogram(name: "cork", linkageName: "_ZN6AP_HAL8RCOutput4corkEv", scope: !89, file: !88, line: 58, type: !99, scopeLine: 58, containingType: !89, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!126 = !DISubprogram(name: "push", linkageName: "_ZN6AP_HAL8RCOutput4pushEv", scope: !89, file: !88, line: 67, type: !99, scopeLine: 67, containingType: !89, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!127 = !DISubprogram(name: "read", linkageName: "_ZN6AP_HAL8RCOutput4readEh", scope: !89, file: !88, line: 73, type: !113, scopeLine: 73, containingType: !89, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!128 = !DISubprogram(name: "read", linkageName: "_ZN6AP_HAL8RCOutput4readEPth", scope: !89, file: !88, line: 74, type: !129, scopeLine: 74, containingType: !89, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !101, !131, !115}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!132 = !DISubprogram(name: "read_last_sent", linkageName: "_ZN6AP_HAL8RCOutput14read_last_sentEh", scope: !89, file: !88, line: 77, type: !113, scopeLine: 77, containingType: !89, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!133 = !DISubprogram(name: "read_last_sent", linkageName: "_ZN6AP_HAL8RCOutput14read_last_sentEPth", scope: !89, file: !88, line: 78, type: !129, scopeLine: 78, containingType: !89, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!134 = !DISubprogram(name: "set_safety_pwm", linkageName: "_ZN6AP_HAL8RCOutput14set_safety_pwmEjt", scope: !89, file: !88, line: 84, type: !103, scopeLine: 84, containingType: !89, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!135 = !DISubprogram(name: "set_failsafe_pwm", linkageName: "_ZN6AP_HAL8RCOutput16set_failsafe_pwmEjt", scope: !89, file: !88, line: 89, type: !103, scopeLine: 89, containingType: !89, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!136 = !DISubprogram(name: "force_safety_on", linkageName: "_ZN6AP_HAL8RCOutput15force_safety_onEv", scope: !89, file: !88, line: 96, type: !137, scopeLine: 96, containingType: !89, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !101}
!139 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DISubprogram(name: "force_safety_off", linkageName: "_ZN6AP_HAL8RCOutput16force_safety_offEv", scope: !89, file: !88, line: 101, type: !99, scopeLine: 101, containingType: !89, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!141 = !DISubprogram(name: "set_esc_scaling", linkageName: "_ZN6AP_HAL8RCOutput15set_esc_scalingEtt", scope: !89, file: !88, line: 109, type: !142, scopeLine: 109, containingType: !89, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !101, !109, !109}
!144 = !DISubprogram(name: "enable_sbus_out", linkageName: "_ZN6AP_HAL8RCOutput15enable_sbus_outEt", scope: !89, file: !88, line: 114, type: !145, scopeLine: 114, containingType: !89, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!145 = !DISubroutineType(types: !146)
!146 = !{!139, !101, !109}
!147 = !DISubprogram(name: "set_output_mode", linkageName: "_ZN6AP_HAL8RCOutput15set_output_modeENS0_11output_modeE", scope: !89, file: !88, line: 123, type: !148, scopeLine: 123, containingType: !89, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !101, !87}
!150 = !{!151, !152}
!151 = !DIEnumerator(name: "MODE_PWM_NORMAL", value: 0, isUnsigned: true)
!152 = !DIEnumerator(name: "MODE_PWM_ONESHOT", value: 1, isUnsigned: true)
!153 = !{!154, !109, !155, !110, !320}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RCOutput_Bebop", scope: !157, file: !67, line: 60, size: 1216, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !158, vtableHolder: !89)
!157 = !DINamespace(name: "Linux", scope: null)
!158 = !{!159, !160, !164, !168, !169, !170, !171, !172, !173, !174, !175, !176, !180, !210, !242, !246, !250, !251, !254, !257, !260, !261, !264, !265, !266, !267, !270, !273, !287, !290, !291, !292, !295, !309, !310, !311, !312, !315, !316}
!159 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !156, baseType: !89, flags: DIFlagPublic, extraData: i32 0)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_i2c_sem", scope: !156, file: !67, line: 82, baseType: !161, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Semaphore", scope: !90, file: !163, line: 7, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6AP_HAL9SemaphoreE")
!163 = !DIFile(filename: "ardupilot/libraries/AP_HAL/Semaphores.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "adfc5c77867951e90e4bb54608b881db")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_request_period_us", scope: !156, file: !67, line: 83, baseType: !165, size: 64, offset: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 4)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_period_us", scope: !156, file: !67, line: 84, baseType: !165, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_rpm", scope: !156, file: !67, line: 85, baseType: !165, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_frequency", scope: !156, file: !67, line: 86, baseType: !109, size: 16, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_min_pwm", scope: !156, file: !67, line: 87, baseType: !109, size: 16, offset: 336)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_max_pwm", scope: !156, file: !67, line: 88, baseType: !109, size: 16, offset: 352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_state", scope: !156, file: !67, line: 89, baseType: !115, size: 8, offset: 368)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_corking", scope: !156, file: !67, line: 90, baseType: !139, size: 8, offset: 376)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_max_rpm", scope: !156, file: !67, line: 91, baseType: !109, size: 16, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_thread", scope: !156, file: !67, line: 104, baseType: !177, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !178, line: 27, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!179 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_mutex", scope: !156, file: !67, line: 105, baseType: !181, size: 320, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !178, line: 72, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !178, line: 67, size: 320, flags: DIFlagTypePassByValue, elements: !183, identifier: "_ZTS15pthread_mutex_t")
!183 = !{!184, !204, !208}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !182, file: !178, line: 69, baseType: !185, size: 320)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !186, line: 22, size: 320, flags: DIFlagTypePassByValue, elements: !187, identifier: "_ZTS17__pthread_mutex_s")
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!187 = !{!188, !189, !190, !191, !192, !193, !195, !196}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !185, file: !186, line: 24, baseType: !97, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !185, file: !186, line: 25, baseType: !62, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !185, file: !186, line: 26, baseType: !97, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !185, file: !186, line: 28, baseType: !62, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !185, file: !186, line: 32, baseType: !97, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !185, file: !186, line: 34, baseType: !194, size: 16, offset: 160)
!194 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !185, file: !186, line: 35, baseType: !194, size: 16, offset: 176)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !185, file: !186, line: 36, baseType: !197, size: 128, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !198, line: 55, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !198, line: 51, size: 128, flags: DIFlagTypePassByValue, elements: !200, identifier: "_ZTS23__pthread_internal_list")
!200 = !{!201, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !199, file: !198, line: 53, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !199, file: !198, line: 54, baseType: !202, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !182, file: !178, line: 70, baseType: !205, size: 320)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 40)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !182, file: !178, line: 71, baseType: !209, size: 64)
!209 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_cond", scope: !156, file: !67, line: 106, baseType: !211, size: 384, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !178, line: 80, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !178, line: 75, size: 384, flags: DIFlagTypePassByValue, elements: !213, identifier: "_ZTS14pthread_cond_t")
!213 = !{!214, !238, !240}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !212, file: !178, line: 77, baseType: !215, size: 384)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !198, line: 94, size: 384, flags: DIFlagTypePassByValue, elements: !216, identifier: "_ZTS16__pthread_cond_s")
!216 = !{!217, !229, !230, !234, !235, !236, !237}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !215, file: !198, line: 96, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !219, line: 33, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!220 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !219, line: 25, size: 64, flags: DIFlagTypePassByValue, elements: !221, identifier: "_ZTS21__atomic_wide_counter")
!221 = !{!222, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !220, file: !219, line: 27, baseType: !223, size: 64)
!223 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !220, file: !219, line: 32, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !220, file: !219, line: 28, size: 64, flags: DIFlagTypePassByValue, elements: !226, identifier: "_ZTSN21__atomic_wide_counterUt_E")
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !225, file: !219, line: 30, baseType: !62, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !225, file: !219, line: 31, baseType: !62, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !215, file: !198, line: 97, baseType: !218, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !215, file: !198, line: 98, baseType: !231, size: 64, offset: 128)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 64, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 2)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !215, file: !198, line: 99, baseType: !231, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !215, file: !198, line: 100, baseType: !62, size: 32, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !215, file: !198, line: 101, baseType: !62, size: 32, offset: 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !215, file: !198, line: 102, baseType: !231, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !212, file: !178, line: 78, baseType: !239, size: 384)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 384, elements: !11)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !212, file: !178, line: 79, baseType: !241, size: 64)
!241 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!242 = !DISubprogram(name: "RCOutput_Bebop", scope: !156, file: !67, line: 62, type: !243, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!246 = !DISubprogram(name: "from", linkageName: "_ZN5Linux14RCOutput_Bebop4fromEPN6AP_HAL8RCOutputE", scope: !156, file: !67, line: 64, type: !247, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!247 = !DISubroutineType(types: !248)
!248 = !{!155, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!250 = !DISubprogram(name: "init", linkageName: "_ZN5Linux14RCOutput_Bebop4initEv", scope: !156, file: !67, line: 68, type: !243, scopeLine: 68, containingType: !156, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!251 = !DISubprogram(name: "set_freq", linkageName: "_ZN5Linux14RCOutput_Bebop8set_freqEjt", scope: !156, file: !67, line: 69, type: !252, scopeLine: 69, containingType: !156, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !245, !105, !109}
!254 = !DISubprogram(name: "get_freq", linkageName: "_ZN5Linux14RCOutput_Bebop8get_freqEh", scope: !156, file: !67, line: 70, type: !255, scopeLine: 70, containingType: !156, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!255 = !DISubroutineType(types: !256)
!256 = !{!109, !245, !115}
!257 = !DISubprogram(name: "enable_ch", linkageName: "_ZN5Linux14RCOutput_Bebop9enable_chEh", scope: !156, file: !67, line: 71, type: !258, scopeLine: 71, containingType: !156, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !245, !115}
!260 = !DISubprogram(name: "disable_ch", linkageName: "_ZN5Linux14RCOutput_Bebop10disable_chEh", scope: !156, file: !67, line: 72, type: !258, scopeLine: 72, containingType: !156, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!261 = !DISubprogram(name: "write", linkageName: "_ZN5Linux14RCOutput_Bebop5writeEht", scope: !156, file: !67, line: 73, type: !262, scopeLine: 73, containingType: !156, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !245, !115, !109}
!264 = !DISubprogram(name: "cork", linkageName: "_ZN5Linux14RCOutput_Bebop4corkEv", scope: !156, file: !67, line: 74, type: !243, scopeLine: 74, containingType: !156, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!265 = !DISubprogram(name: "push", linkageName: "_ZN5Linux14RCOutput_Bebop4pushEv", scope: !156, file: !67, line: 75, type: !243, scopeLine: 75, containingType: !156, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!266 = !DISubprogram(name: "read", linkageName: "_ZN5Linux14RCOutput_Bebop4readEh", scope: !156, file: !67, line: 76, type: !255, scopeLine: 76, containingType: !156, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!267 = !DISubprogram(name: "read", linkageName: "_ZN5Linux14RCOutput_Bebop4readEPth", scope: !156, file: !67, line: 77, type: !268, scopeLine: 77, containingType: !156, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !245, !131, !115}
!270 = !DISubprogram(name: "set_esc_scaling", linkageName: "_ZN5Linux14RCOutput_Bebop15set_esc_scalingEtt", scope: !156, file: !67, line: 78, type: !271, scopeLine: 78, containingType: !156, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !245, !109, !109}
!273 = !DISubprogram(name: "read_obs_data", linkageName: "_ZN5Linux14RCOutput_Bebop13read_obs_dataER17BebopBLDC_ObsData", scope: !156, file: !67, line: 79, type: !274, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!274 = !DISubroutineType(types: !275)
!275 = !{!97, !245, !276}
!276 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BebopBLDC_ObsData", file: !67, line: 38, size: 144, flags: DIFlagTypePassByValue, elements: !278, identifier: "_ZTS17BebopBLDC_ObsData")
!278 = !{!279, !280, !282, !283, !284, !285, !286}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rpm", scope: !277, file: !67, line: 40, baseType: !165, size: 64, flags: DIFlagPublic)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rpm_saturated", scope: !277, file: !67, line: 41, baseType: !281, size: 32, offset: 64, flags: DIFlagPublic)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 32, elements: !166)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "batt_mv", scope: !277, file: !67, line: 42, baseType: !109, size: 16, offset: 96, flags: DIFlagPublic)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !277, file: !67, line: 43, baseType: !115, size: 8, offset: 112, flags: DIFlagPublic)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !277, file: !67, line: 44, baseType: !115, size: 8, offset: 120, flags: DIFlagPublic)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "motors_err", scope: !277, file: !67, line: 45, baseType: !115, size: 8, offset: 128, flags: DIFlagPublic)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "temperature", scope: !277, file: !67, line: 46, baseType: !115, size: 8, offset: 136, flags: DIFlagPublic)
!287 = !DISubprogram(name: "_checksum", linkageName: "_ZN5Linux14RCOutput_Bebop9_checksumEPhj", scope: !156, file: !67, line: 93, type: !288, scopeLine: 93, flags: DIFlagPrototyped, spFlags: 0)
!288 = !DISubroutineType(types: !289)
!289 = !{!115, !245, !154, !62}
!290 = !DISubprogram(name: "_start_prop", linkageName: "_ZN5Linux14RCOutput_Bebop11_start_propEv", scope: !156, file: !67, line: 94, type: !243, scopeLine: 94, flags: DIFlagPrototyped, spFlags: 0)
!291 = !DISubprogram(name: "_toggle_gpio", linkageName: "_ZN5Linux14RCOutput_Bebop12_toggle_gpioEh", scope: !156, file: !67, line: 95, type: !258, scopeLine: 95, flags: DIFlagPrototyped, spFlags: 0)
!292 = !DISubprogram(name: "_set_ref_speed", linkageName: "_ZN5Linux14RCOutput_Bebop14_set_ref_speedEPt", scope: !156, file: !67, line: 96, type: !293, scopeLine: 96, flags: DIFlagPrototyped, spFlags: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !245, !131}
!295 = !DISubprogram(name: "_get_info", linkageName: "_ZN5Linux14RCOutput_Bebop9_get_infoEP9bldc_info", scope: !156, file: !67, line: 97, type: !296, scopeLine: 97, flags: DIFlagPrototyped, spFlags: 0)
!296 = !DISubroutineType(types: !297)
!297 = !{!139, !245, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bldc_info", file: !67, line: 49, size: 104, flags: DIFlagTypePassByValue, elements: !300, identifier: "_ZTS9bldc_info")
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "version_maj", scope: !299, file: !67, line: 50, baseType: !115, size: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "version_min", scope: !299, file: !67, line: 51, baseType: !115, size: 8, offset: 8)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !67, line: 52, baseType: !115, size: 8, offset: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "n_motors", scope: !299, file: !67, line: 53, baseType: !115, size: 8, offset: 24)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "n_flights", scope: !299, file: !67, line: 54, baseType: !109, size: 16, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "last_flight_time", scope: !299, file: !67, line: 55, baseType: !109, size: 16, offset: 48)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "total_flight_time", scope: !299, file: !67, line: 56, baseType: !105, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !299, file: !67, line: 57, baseType: !115, size: 8, offset: 96)
!309 = !DISubprogram(name: "_stop_prop", linkageName: "_ZN5Linux14RCOutput_Bebop10_stop_propEv", scope: !156, file: !67, line: 98, type: !243, scopeLine: 98, flags: DIFlagPrototyped, spFlags: 0)
!310 = !DISubprogram(name: "_clear_error", linkageName: "_ZN5Linux14RCOutput_Bebop12_clear_errorEv", scope: !156, file: !67, line: 99, type: !243, scopeLine: 99, flags: DIFlagPrototyped, spFlags: 0)
!311 = !DISubprogram(name: "_play_sound", linkageName: "_ZN5Linux14RCOutput_Bebop11_play_soundEh", scope: !156, file: !67, line: 100, type: !258, scopeLine: 100, flags: DIFlagPrototyped, spFlags: 0)
!312 = !DISubprogram(name: "_period_us_to_rpm", linkageName: "_ZN5Linux14RCOutput_Bebop17_period_us_to_rpmEt", scope: !156, file: !67, line: 101, type: !313, scopeLine: 101, flags: DIFlagPrototyped, spFlags: 0)
!313 = !DISubroutineType(types: !314)
!314 = !{!109, !245, !109}
!315 = !DISubprogram(name: "_run_rcout", linkageName: "_ZN5Linux14RCOutput_Bebop10_run_rcoutEv", scope: !156, file: !67, line: 107, type: !243, scopeLine: 107, flags: DIFlagPrototyped, spFlags: 0)
!316 = !DISubprogram(name: "_control_thread", linkageName: "_ZN5Linux14RCOutput_Bebop15_control_threadEPv", scope: !156, file: !67, line: 108, type: !317, scopeLine: 108, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_class_type, name: "Util", scope: !157, file: !80, line: 18, size: 512, flags: DIFlagFwdDecl | DIFlagNonTrivial)
!322 = !{!55, !323, !325, !330, !335, !337, !339, !344, !349, !354}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !61, line: 161, type: !35, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !61, line: 246, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 34)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !61, line: 253, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 35)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !61, line: 264, type: !327, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !61, line: 270, type: !327, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !61, line: 278, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 38)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !61, line: 381, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 24)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !61, line: 411, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 28)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !61, line: 413, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 26)
!359 = !{!360, !366, !372, !376, !382, !386, !392, !397, !399, !405, !409, !413, !423, !425, !429, !433, !437, !442, !446, !450, !454, !458, !466, !470, !474, !476, !478, !482, !486, !492, !496, !500, !502, !510, !514, !521, !523, !527, !531, !535, !539, !543, !548, !553, !554, !555, !556, !558, !559, !560, !561, !562, !563, !564, !566, !567, !568, !569, !570, !571, !572, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !362, file: !365, line: 58)
!361 = !DINamespace(name: "std", scope: null)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !363, line: 24, baseType: !364)
!363 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/__stddef_max_align_t.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "48e8e2456f77e6cda35d245130fa7259")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 19, size: 256, flags: DIFlagFwdDecl, identifier: "_ZTS11max_align_t")
!365 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/cstddef", directory: "")
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !367, file: !371, line: 52)
!367 = !DISubprogram(name: "abs", scope: !368, file: !368, line: 848, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!369 = !DISubroutineType(types: !370)
!370 = !{!97, !97}
!371 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/std_abs.h", directory: "")
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !373, file: !375, line: 127)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !368, line: 63, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 59, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!375 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/cstdlib", directory: "")
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !377, file: !375, line: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !368, line: 71, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 67, size: 128, flags: DIFlagTypePassByValue, elements: !379, identifier: "_ZTS6ldiv_t")
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !378, file: !368, line: 69, baseType: !209, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !378, file: !368, line: 70, baseType: !209, size: 64, offset: 64)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !383, file: !375, line: 130)
!383 = !DISubprogram(name: "abort", scope: !368, file: !368, line: 598, type: !384, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{null}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !387, file: !375, line: 132)
!387 = !DISubprogram(name: "aligned_alloc", scope: !368, file: !368, line: 592, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DISubroutineType(types: !389)
!389 = !{!319, !390, !390}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !391, line: 46, baseType: !179)
!391 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !393, file: !375, line: 134)
!393 = !DISubprogram(name: "atexit", scope: !368, file: !368, line: 602, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{!97, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !398, file: !375, line: 137)
!398 = !DISubprogram(name: "at_quick_exit", scope: !368, file: !368, line: 607, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !400, file: !375, line: 140)
!400 = !DISubprogram(name: "atof", scope: !368, file: !368, line: 102, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DISubroutineType(types: !402)
!402 = !{!403, !404}
!403 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !406, file: !375, line: 141)
!406 = !DISubprogram(name: "atoi", scope: !368, file: !368, line: 105, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DISubroutineType(types: !408)
!408 = !{!97, !404}
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !410, file: !375, line: 142)
!410 = !DISubprogram(name: "atol", scope: !368, file: !368, line: 108, type: !411, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DISubroutineType(types: !412)
!412 = !{!209, !404}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !414, file: !375, line: 143)
!414 = !DISubprogram(name: "bsearch", scope: !368, file: !368, line: 828, type: !415, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DISubroutineType(types: !416)
!416 = !{!319, !417, !417, !390, !390, !419}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !368, line: 816, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!97, !417, !417}
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !424, file: !375, line: 144)
!424 = !DISubprogram(name: "calloc", scope: !368, file: !368, line: 543, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !426, file: !375, line: 145)
!426 = !DISubprogram(name: "div", scope: !368, file: !368, line: 860, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DISubroutineType(types: !428)
!428 = !{!373, !97, !97}
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !430, file: !375, line: 146)
!430 = !DISubprogram(name: "exit", scope: !368, file: !368, line: 624, type: !431, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !97}
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !434, file: !375, line: 147)
!434 = !DISubprogram(name: "free", scope: !368, file: !368, line: 555, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !319}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !438, file: !375, line: 148)
!438 = !DISubprogram(name: "getenv", scope: !368, file: !368, line: 641, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !404}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !443, file: !375, line: 149)
!443 = !DISubprogram(name: "labs", scope: !368, file: !368, line: 849, type: !444, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DISubroutineType(types: !445)
!445 = !{!209, !209}
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !447, file: !375, line: 150)
!447 = !DISubprogram(name: "ldiv", scope: !368, file: !368, line: 862, type: !448, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DISubroutineType(types: !449)
!449 = !{!377, !209, !209}
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !451, file: !375, line: 151)
!451 = !DISubprogram(name: "malloc", scope: !368, file: !368, line: 540, type: !452, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DISubroutineType(types: !453)
!453 = !{!319, !390}
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !455, file: !375, line: 153)
!455 = !DISubprogram(name: "mblen", scope: !368, file: !368, line: 930, type: !456, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{!97, !404, !390}
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !459, file: !375, line: 154)
!459 = !DISubprogram(name: "mbstowcs", scope: !368, file: !368, line: 941, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{!390, !462, !465, !390}
!462 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !404)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !467, file: !375, line: 155)
!467 = !DISubprogram(name: "mbtowc", scope: !368, file: !368, line: 933, type: !468, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DISubroutineType(types: !469)
!469 = !{!97, !462, !465, !390}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !471, file: !375, line: 157)
!471 = !DISubprogram(name: "qsort", scope: !368, file: !368, line: 838, type: !472, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !319, !390, !390, !419}
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !475, file: !375, line: 160)
!475 = !DISubprogram(name: "quick_exit", scope: !368, file: !368, line: 630, type: !431, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !477, file: !375, line: 163)
!477 = !DISubprogram(name: "rand", scope: !368, file: !368, line: 454, type: !95, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !479, file: !375, line: 164)
!479 = !DISubprogram(name: "realloc", scope: !368, file: !368, line: 551, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DISubroutineType(types: !481)
!481 = !{!319, !319, !390}
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !483, file: !375, line: 165)
!483 = !DISubprogram(name: "srand", scope: !368, file: !368, line: 456, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !62}
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !487, file: !375, line: 166)
!487 = !DISubprogram(name: "strtod", scope: !368, file: !368, line: 118, type: !488, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{!403, !465, !490}
!490 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !493, file: !375, line: 167)
!493 = !DISubprogram(name: "strtol", scope: !368, file: !368, line: 177, type: !494, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DISubroutineType(types: !495)
!495 = !{!209, !465, !490, !97}
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !497, file: !375, line: 168)
!497 = !DISubprogram(name: "strtoul", scope: !368, file: !368, line: 181, type: !498, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DISubroutineType(types: !499)
!499 = !{!179, !465, !490, !97}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !501, file: !375, line: 169)
!501 = !DISubprogram(name: "system", scope: !368, file: !368, line: 791, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !503, file: !375, line: 171)
!503 = !DISubprogram(name: "wcstombs", scope: !368, file: !368, line: 945, type: !504, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DISubroutineType(types: !505)
!505 = !{!390, !506, !507, !390}
!506 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !441)
!507 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !511, file: !375, line: 172)
!511 = !DISubprogram(name: "wctomb", scope: !368, file: !368, line: 937, type: !512, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DISubroutineType(types: !513)
!513 = !{!97, !441, !464}
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !516, file: !375, line: 200)
!515 = !DINamespace(name: "__gnu_cxx", scope: null)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !368, line: 81, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 77, size: 128, flags: DIFlagTypePassByValue, elements: !518, identifier: "_ZTS7lldiv_t")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !517, file: !368, line: 79, baseType: !241, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !517, file: !368, line: 80, baseType: !241, size: 64, offset: 64)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !522, file: !375, line: 206)
!522 = !DISubprogram(name: "_Exit", scope: !368, file: !368, line: 636, type: !431, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !524, file: !375, line: 210)
!524 = !DISubprogram(name: "llabs", scope: !368, file: !368, line: 852, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{!241, !241}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !528, file: !375, line: 216)
!528 = !DISubprogram(name: "lldiv", scope: !368, file: !368, line: 866, type: !529, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DISubroutineType(types: !530)
!530 = !{!516, !241, !241}
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !532, file: !375, line: 227)
!532 = !DISubprogram(name: "atoll", scope: !368, file: !368, line: 113, type: !533, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{!241, !404}
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !536, file: !375, line: 228)
!536 = !DISubprogram(name: "strtoll", scope: !368, file: !368, line: 201, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!241, !465, !490, !97}
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !540, file: !375, line: 229)
!540 = !DISubprogram(name: "strtoull", scope: !368, file: !368, line: 206, type: !541, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{!223, !465, !490, !97}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !544, file: !375, line: 231)
!544 = !DISubprogram(name: "strtof", scope: !368, file: !368, line: 124, type: !545, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DISubroutineType(types: !546)
!546 = !{!547, !465, !490}
!547 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !549, file: !375, line: 232)
!549 = !DISubprogram(name: "strtold", scope: !368, file: !368, line: 127, type: !550, flags: DIFlagPrototyped, spFlags: 0)
!550 = !DISubroutineType(types: !551)
!551 = !{!552, !465, !490}
!552 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !516, file: !375, line: 240)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !522, file: !375, line: 242)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !524, file: !375, line: 244)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !557, file: !375, line: 245)
!557 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !515, file: !375, line: 213, type: !529, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !528, file: !375, line: 246)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !532, file: !375, line: 248)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !544, file: !375, line: 249)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !536, file: !375, line: 250)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !540, file: !375, line: 251)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !361, entity: !549, file: !375, line: 252)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !383, file: !565, line: 38)
!565 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "0f5b773a303c24013fb112082e6d18a5")
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !393, file: !565, line: 39)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !430, file: !565, line: 40)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !398, file: !565, line: 43)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !475, file: !565, line: 46)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !373, file: !565, line: 51)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !377, file: !565, line: 52)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !573, file: !565, line: 54)
!573 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !361, file: !371, line: 103, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !576}
!576 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !400, file: !565, line: 55)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !406, file: !565, line: 56)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !410, file: !565, line: 57)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !414, file: !565, line: 58)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !424, file: !565, line: 59)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !557, file: !565, line: 60)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !434, file: !565, line: 61)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !438, file: !565, line: 62)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !443, file: !565, line: 63)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !447, file: !565, line: 64)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !451, file: !565, line: 65)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !455, file: !565, line: 67)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !459, file: !565, line: 68)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !467, file: !565, line: 69)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !471, file: !565, line: 71)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !477, file: !565, line: 72)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !479, file: !565, line: 73)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !483, file: !565, line: 74)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !487, file: !565, line: 75)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !493, file: !565, line: 76)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !497, file: !565, line: 77)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !501, file: !565, line: 78)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !503, file: !565, line: 80)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !57, entity: !511, file: !565, line: 81)
!601 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !57, entity: !157, file: !61, line: 71)
!602 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "HAL", scope: !90, file: !605, line: 15, size: 1344, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6AP_HAL3HALE")
!605 = !DIFile(filename: "ardupilot/libraries/AP_HAL/HAL.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "3f0a0f0e062a4283fcf90f261aa65082")
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !608, line: 73, type: !40, isLocal: true, isDefinition: true)
!608 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/Thread.cpp", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "9e005ab91942cff649f1dfc4afc480f7")
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !608, line: 80, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 33)
!614 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !615, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !667, globals: !1540, imports: !1541, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "/home/raj/ardupilot/libraries/AP_HAL_Linux/OpticalFlow_Onboard.cpp", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "39989a6ca62b51870b8b66b5593f6083")
!616 = !{!617, !74, !624}
!617 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "v4l2_memory", file: !618, line: 185, baseType: !62, size: 32, elements: !619, identifier: "_ZTS11v4l2_memory")
!618 = !DIFile(filename: "/usr/include/linux/videodev2.h", directory: "", checksumkind: CSK_MD5, checksum: "3cc097f94f263de2816b0907cfe35b21")
!619 = !{!620, !621, !622, !623}
!620 = !DIEnumerator(name: "V4L2_MEMORY_MMAP", value: 1, isUnsigned: true)
!621 = !DIEnumerator(name: "V4L2_MEMORY_USERPTR", value: 2, isUnsigned: true)
!622 = !DIEnumerator(name: "V4L2_MEMORY_OVERLAY", value: 3, isUnsigned: true)
!623 = !DIEnumerator(name: "V4L2_MEMORY_DMABUF", value: 4, isUnsigned: true)
!624 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "Rotation", file: !625, line: 28, baseType: !62, size: 32, elements: !626, identifier: "_ZTS8Rotation")
!625 = !DIFile(filename: "ardupilot/libraries/AP_Math/rotations.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "04a17862c10c9a57597560af0328029e")
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!627 = !DIEnumerator(name: "ROTATION_NONE", value: 0, isUnsigned: true)
!628 = !DIEnumerator(name: "ROTATION_YAW_45", value: 1, isUnsigned: true)
!629 = !DIEnumerator(name: "ROTATION_YAW_90", value: 2, isUnsigned: true)
!630 = !DIEnumerator(name: "ROTATION_YAW_135", value: 3, isUnsigned: true)
!631 = !DIEnumerator(name: "ROTATION_YAW_180", value: 4, isUnsigned: true)
!632 = !DIEnumerator(name: "ROTATION_YAW_225", value: 5, isUnsigned: true)
!633 = !DIEnumerator(name: "ROTATION_YAW_270", value: 6, isUnsigned: true)
!634 = !DIEnumerator(name: "ROTATION_YAW_315", value: 7, isUnsigned: true)
!635 = !DIEnumerator(name: "ROTATION_ROLL_180", value: 8, isUnsigned: true)
!636 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_45", value: 9, isUnsigned: true)
!637 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_90", value: 10, isUnsigned: true)
!638 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_135", value: 11, isUnsigned: true)
!639 = !DIEnumerator(name: "ROTATION_PITCH_180", value: 12, isUnsigned: true)
!640 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_225", value: 13, isUnsigned: true)
!641 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_270", value: 14, isUnsigned: true)
!642 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_315", value: 15, isUnsigned: true)
!643 = !DIEnumerator(name: "ROTATION_ROLL_90", value: 16, isUnsigned: true)
!644 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_45", value: 17, isUnsigned: true)
!645 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_90", value: 18, isUnsigned: true)
!646 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_135", value: 19, isUnsigned: true)
!647 = !DIEnumerator(name: "ROTATION_ROLL_270", value: 20, isUnsigned: true)
!648 = !DIEnumerator(name: "ROTATION_ROLL_270_YAW_45", value: 21, isUnsigned: true)
!649 = !DIEnumerator(name: "ROTATION_ROLL_270_YAW_90", value: 22, isUnsigned: true)
!650 = !DIEnumerator(name: "ROTATION_ROLL_270_YAW_135", value: 23, isUnsigned: true)
!651 = !DIEnumerator(name: "ROTATION_PITCH_90", value: 24, isUnsigned: true)
!652 = !DIEnumerator(name: "ROTATION_PITCH_270", value: 25, isUnsigned: true)
!653 = !DIEnumerator(name: "ROTATION_PITCH_180_YAW_90", value: 26, isUnsigned: true)
!654 = !DIEnumerator(name: "ROTATION_PITCH_180_YAW_270", value: 27, isUnsigned: true)
!655 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_90", value: 28, isUnsigned: true)
!656 = !DIEnumerator(name: "ROTATION_ROLL_180_PITCH_90", value: 29, isUnsigned: true)
!657 = !DIEnumerator(name: "ROTATION_ROLL_270_PITCH_90", value: 30, isUnsigned: true)
!658 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_180", value: 31, isUnsigned: true)
!659 = !DIEnumerator(name: "ROTATION_ROLL_270_PITCH_180", value: 32, isUnsigned: true)
!660 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_270", value: 33, isUnsigned: true)
!661 = !DIEnumerator(name: "ROTATION_ROLL_180_PITCH_270", value: 34, isUnsigned: true)
!662 = !DIEnumerator(name: "ROTATION_ROLL_270_PITCH_270", value: 35, isUnsigned: true)
!663 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_180_YAW_90", value: 36, isUnsigned: true)
!664 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_270", value: 37, isUnsigned: true)
!665 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_68_YAW_293", value: 38, isUnsigned: true)
!666 = !DIEnumerator(name: "ROTATION_MAX", value: 39, isUnsigned: true)
!667 = !{!668, !670, !154, !105, !1059, !1329, !1060, !679, !724, !728, !731, !751, !757, !851, !1369, !1475}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !669, line: 27, baseType: !62)
!669 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OpticalFlow_Onboard", scope: !157, file: !672, line: 27, size: 1600, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !673, vtableHolder: !675)
!672 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/OpticalFlow_Onboard.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "7b4c9e700f27d160076bb32dcc190a2a")
!673 = !{!674, !677, !1295, !1296, !1300, !1304, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1366, !1455, !1459, !1471, !1474}
!674 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !671, baseType: !675, flags: DIFlagPublic, extraData: i32 0)
!675 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OpticalFlow", scope: !90, file: !676, line: 17, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6AP_HAL11OpticalFlowE")
!676 = !DIFile(filename: "ardupilot/libraries/AP_HAL/OpticalFlow.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "9f9f121a90eb4c8138cfdc938010b02e")
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_videoin", scope: !671, file: !672, line: 35, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "VideoIn", scope: !157, file: !680, line: 26, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !681, identifier: "_ZTSN5Linux7VideoInE")
!680 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/VideoIn.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "af2f23b8636078178400514c9d07cdfc")
!681 = !{!682, !683, !686, !687, !688, !689, !690, !691, !692, !693, !694, !705, !708, !711, !714, !717, !720, !1260, !1264, !1267, !1268, !1271, !1274, !1277, !1280, !1283, !1284}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !679, file: !680, line: 72, baseType: !97, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_buffers", scope: !679, file: !680, line: 73, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !680, line: 21, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS6buffer")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_nbufs", scope: !679, file: !680, line: 74, baseType: !62, size: 32, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_streaming", scope: !679, file: !680, line: 75, baseType: !139, size: 8, offset: 160)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_width", scope: !679, file: !680, line: 76, baseType: !105, size: 32, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_height", scope: !679, file: !680, line: 77, baseType: !105, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_format", scope: !679, file: !680, line: 78, baseType: !105, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_bytesperline", scope: !679, file: !680, line: 79, baseType: !105, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_sizeimage", scope: !679, file: !680, line: 80, baseType: !105, size: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_memtype", scope: !679, file: !680, line: 81, baseType: !105, size: 32, offset: 352)
!694 = !DISubprogram(name: "get_frame", linkageName: "_ZN5Linux7VideoIn9get_frameERNS0_5FrameE", scope: !679, file: !680, line: 41, type: !695, scopeLine: 41, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!695 = !DISubroutineType(types: !696)
!696 = !{!139, !697, !698}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!698 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Frame", scope: !679, file: !680, line: 31, size: 192, flags: DIFlagPublic | DIFlagTypePassByValue, elements: !700, identifier: "_ZTSN5Linux7VideoIn5FrameE")
!700 = !{!701, !702, !703, !704}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !699, file: !680, line: 34, baseType: !105, size: 32, flags: DIFlagPublic)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !699, file: !680, line: 35, baseType: !105, size: 32, offset: 32, flags: DIFlagPublic)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !699, file: !680, line: 36, baseType: !319, size: 64, offset: 64, flags: DIFlagPublic)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "buf_index", scope: !699, file: !680, line: 38, baseType: !105, size: 32, offset: 128)
!705 = !DISubprogram(name: "put_frame", linkageName: "_ZN5Linux7VideoIn9put_frameERNS0_5FrameE", scope: !679, file: !680, line: 42, type: !706, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !697, !698}
!708 = !DISubprogram(name: "set_device_path", linkageName: "_ZN5Linux7VideoIn15set_device_pathEPKc", scope: !679, file: !680, line: 43, type: !709, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !697, !404}
!711 = !DISubprogram(name: "init", linkageName: "_ZN5Linux7VideoIn4initEv", scope: !679, file: !680, line: 44, type: !712, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !697}
!714 = !DISubprogram(name: "open_device", linkageName: "_ZN5Linux7VideoIn11open_deviceEPKcj", scope: !679, file: !680, line: 45, type: !715, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!139, !697, !404, !105}
!717 = !DISubprogram(name: "allocate_buffers", linkageName: "_ZN5Linux7VideoIn16allocate_buffersEj", scope: !679, file: !680, line: 46, type: !718, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{!139, !697, !105}
!720 = !DISubprogram(name: "get_pixel_formats", linkageName: "_ZN5Linux7VideoIn17get_pixel_formatsEPSt6vectorIjSaIjEE", scope: !679, file: !680, line: 47, type: !721, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !697, !723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, std::allocator<unsigned int> >", scope: !361, file: !725, line: 389, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !726, templateParams: !1258, identifier: "_ZTSSt6vectorIjSaIjEE")
!725 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/stl_vector.h", directory: "", checksumkind: CSK_MD5, checksum: "abcaf00227294b9790605822a1c03477")
!726 = !{!727, !945, !964, !980, !981, !987, !990, !993, !997, !1003, !1007, !1013, !1018, !1022, !1025, !1028, !1031, !1034, !1039, !1040, !1044, !1047, !1050, !1053, !1056, !1117, !1123, !1124, !1125, !1130, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1144, !1145, !1148, !1149, !1150, !1151, !1154, !1155, !1163, !1170, !1173, !1174, !1175, !1178, !1181, !1182, !1183, !1186, !1189, !1192, !1196, !1197, !1200, !1203, !1206, !1209, !1212, !1215, !1218, !1219, !1220, !1221, !1222, !1225, !1226, !1229, !1230, !1231, !1235, !1238, !1243, !1246, !1249, !1252, !1255}
!727 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !724, baseType: !728, flags: DIFlagProtected, extraData: i32 0)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_base<unsigned int, std::allocator<unsigned int> >", scope: !361, file: !725, line: 84, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !729, templateParams: !944, identifier: "_ZTSSt12_Vector_baseIjSaIjEE")
!729 = !{!730, !895, !900, !905, !909, !912, !917, !920, !923, !927, !930, !933, !936, !937, !940, !943}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: !728, file: !725, line: 340, baseType: !731, size: 192)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_impl", scope: !728, file: !725, line: 128, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !732, identifier: "_ZTSNSt12_Vector_baseIjSaIjEE12_Vector_implE")
!732 = !{!733, !850, !875, !879, !884, !888, !892}
!733 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !731, baseType: !734, extraData: i32 0)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Tp_alloc_type", scope: !728, file: !725, line: 87, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "other", scope: !737, file: !736, line: 120, baseType: !849)
!736 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/ext/alloc_traits.h", directory: "")
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rebind<unsigned int>", scope: !738, file: !736, line: 119, size: 8, flags: DIFlagTypePassByValue, elements: !848, templateParams: !798, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIjEjE6rebindIjEE")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<unsigned int>, unsigned int>", scope: !515, file: !736, line: 48, size: 8, flags: DIFlagTypePassByValue, elements: !739, templateParams: !846, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIjEjEE")
!739 = !{!740, !833, !836, !839, !842, !843, !844, !845}
!740 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !738, baseType: !741, extraData: i32 0)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator_traits<std::allocator<unsigned int> >", scope: !361, file: !742, line: 411, size: 8, flags: DIFlagTypePassByValue, elements: !743, templateParams: !831, identifier: "_ZTSSt16allocator_traitsISaIjEE")
!742 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/alloc_traits.h", directory: "", checksumkind: CSK_MD5, checksum: "937e9d7f00d3ed7cff7ec8fafeb8a8bc")
!743 = !{!744, !815, !819, !822, !828}
!744 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIjEE8allocateERS0_m", scope: !741, file: !742, line: 463, type: !745, scopeLine: 463, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !749, !814}
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !741, file: !742, line: 420, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !741, file: !742, line: 414, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "allocator<unsigned int>", scope: !361, file: !752, line: 124, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !753, templateParams: !798, identifier: "_ZTSSaIjE")
!752 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/allocator.h", directory: "", checksumkind: CSK_MD5, checksum: "52abf05a7426983321ecef80fe4251be")
!753 = !{!754, !800, !804, !809, !813}
!754 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !751, baseType: !755, flags: DIFlagPublic, extraData: i32 0)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__allocator_base<unsigned int>", scope: !361, file: !756, line: 48, baseType: !757)
!756 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/x86_64-linux-gnu/c++/11/bits/c++allocator.h", directory: "", checksumkind: CSK_MD5, checksum: "fcdcf111c9228da351f93cd81039e6d6")
!757 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "new_allocator<unsigned int>", scope: !515, file: !758, line: 55, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !759, templateParams: !798, identifier: "_ZTSN9__gnu_cxx13new_allocatorIjEE")
!758 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/ext/new_allocator.h", directory: "", checksumkind: CSK_MD5, checksum: "4493add5a3fa57e0ec30b90cd4e81c11")
!759 = !{!760, !764, !769, !770, !777, !785, !791, !794, !797}
!760 = !DISubprogram(name: "new_allocator", scope: !757, file: !758, line: 79, type: !761, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!764 = !DISubprogram(name: "new_allocator", scope: !757, file: !758, line: 82, type: !765, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !763, !767}
!767 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!769 = !DISubprogram(name: "~new_allocator", scope: !757, file: !758, line: 89, type: !761, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!770 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE7addressERj", scope: !757, file: !758, line: 92, type: !771, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!771 = !DISubroutineType(types: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !757, file: !758, line: 62, baseType: !748, flags: DIFlagPublic)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !757, file: !758, line: 64, baseType: !776, flags: DIFlagPublic)
!776 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !62, size: 64)
!777 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE7addressERKj", scope: !757, file: !758, line: 96, type: !778, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !774, !783}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !757, file: !758, line: 63, baseType: !781, flags: DIFlagPublic)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !757, file: !758, line: 65, baseType: !784, flags: DIFlagPublic)
!784 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !782, size: 64)
!785 = !DISubprogram(name: "allocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIjE8allocateEmPKv", scope: !757, file: !758, line: 103, type: !786, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!786 = !DISubroutineType(types: !787)
!787 = !{!748, !763, !788, !417}
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !758, line: 59, baseType: !789, flags: DIFlagPublic)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !361, file: !790, line: 280, baseType: !179)
!790 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/x86_64-linux-gnu/c++/11/bits/c++config.h", directory: "", checksumkind: CSK_MD5, checksum: "b09addf8bea7ac9bf251a76b15f26064")
!791 = !DISubprogram(name: "deallocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIjE10deallocateEPjm", scope: !757, file: !758, line: 132, type: !792, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !763, !748, !788}
!794 = !DISubprogram(name: "max_size", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE8max_sizeEv", scope: !757, file: !758, line: 154, type: !795, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{!788, !774}
!797 = !DISubprogram(name: "_M_max_size", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE11_M_max_sizeEv", scope: !757, file: !758, line: 197, type: !795, scopeLine: 197, flags: DIFlagPrototyped, spFlags: 0)
!798 = !{!799}
!799 = !DITemplateTypeParameter(name: "_Tp", type: !62)
!800 = !DISubprogram(name: "allocator", scope: !751, file: !752, line: 156, type: !801, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!804 = !DISubprogram(name: "allocator", scope: !751, file: !752, line: 159, type: !805, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !803, !807}
!807 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!809 = !DISubprogram(name: "operator=", linkageName: "_ZNSaIjEaSERKS_", scope: !751, file: !752, line: 164, type: !810, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!812, !803, !807}
!812 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !751, size: 64)
!813 = !DISubprogram(name: "~allocator", scope: !751, file: !752, line: 174, type: !801, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !742, line: 435, baseType: !789)
!815 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIjEE8allocateERS0_mPKv", scope: !741, file: !742, line: 477, type: !816, scopeLine: 477, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!816 = !DISubroutineType(types: !817)
!817 = !{!747, !749, !814, !818}
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_void_pointer", file: !742, line: 429, baseType: !417)
!819 = !DISubprogram(name: "deallocate", linkageName: "_ZNSt16allocator_traitsISaIjEE10deallocateERS0_Pjm", scope: !741, file: !742, line: 495, type: !820, scopeLine: 495, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !749, !747, !814}
!822 = !DISubprogram(name: "max_size", linkageName: "_ZNSt16allocator_traitsISaIjEE8max_sizeERKS0_", scope: !741, file: !742, line: 547, type: !823, scopeLine: 547, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !741, file: !742, line: 435, baseType: !789)
!826 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !750)
!828 = !DISubprogram(name: "select_on_container_copy_construction", linkageName: "_ZNSt16allocator_traitsISaIjEE37select_on_container_copy_constructionERKS0_", scope: !741, file: !742, line: 562, type: !829, scopeLine: 562, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{!750, !826}
!831 = !{!832}
!832 = !DITemplateTypeParameter(name: "_Alloc", type: !751)
!833 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE17_S_select_on_copyERKS1_", scope: !738, file: !736, line: 97, type: !834, scopeLine: 97, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!834 = !DISubroutineType(types: !835)
!835 = !{!751, !807}
!836 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE10_S_on_swapERS1_S3_", scope: !738, file: !736, line: 100, type: !837, scopeLine: 100, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !812, !812}
!839 = !DISubprogram(name: "_S_propagate_on_copy_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE27_S_propagate_on_copy_assignEv", scope: !738, file: !736, line: 103, type: !840, scopeLine: 103, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!139}
!842 = !DISubprogram(name: "_S_propagate_on_move_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE27_S_propagate_on_move_assignEv", scope: !738, file: !736, line: 106, type: !840, scopeLine: 106, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!843 = !DISubprogram(name: "_S_propagate_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE20_S_propagate_on_swapEv", scope: !738, file: !736, line: 109, type: !840, scopeLine: 109, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!844 = !DISubprogram(name: "_S_always_equal", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE15_S_always_equalEv", scope: !738, file: !736, line: 112, type: !840, scopeLine: 112, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!845 = !DISubprogram(name: "_S_nothrow_move", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE15_S_nothrow_moveEv", scope: !738, file: !736, line: 115, type: !840, scopeLine: 115, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!846 = !{!832, !847}
!847 = !DITemplateTypeParameter(type: !62)
!848 = !{}
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "rebind_alloc<unsigned int>", scope: !741, file: !742, line: 450, baseType: !751)
!850 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !731, baseType: !851, extraData: i32 0)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_impl_data", scope: !728, file: !725, line: 91, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !852, identifier: "_ZTSNSt12_Vector_baseIjSaIjEE17_Vector_impl_dataE")
!852 = !{!853, !856, !857, !858, !862, !866, !871}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_M_start", scope: !851, file: !725, line: 93, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !728, file: !725, line: 89, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !738, file: !736, line: 57, baseType: !747)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_M_finish", scope: !851, file: !725, line: 94, baseType: !854, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_M_end_of_storage", scope: !851, file: !725, line: 95, baseType: !854, size: 64, offset: 128)
!858 = !DISubprogram(name: "_Vector_impl_data", scope: !851, file: !725, line: 97, type: !859, scopeLine: 97, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!862 = !DISubprogram(name: "_Vector_impl_data", scope: !851, file: !725, line: 102, type: !863, scopeLine: 102, flags: DIFlagPrototyped, spFlags: 0)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !861, !865}
!865 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !851, size: 64)
!866 = !DISubprogram(name: "_M_copy_data", linkageName: "_ZNSt12_Vector_baseIjSaIjEE17_Vector_impl_data12_M_copy_dataERKS2_", scope: !851, file: !725, line: 109, type: !867, scopeLine: 109, flags: DIFlagPrototyped, spFlags: 0)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !861, !869}
!869 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!871 = !DISubprogram(name: "_M_swap_data", linkageName: "_ZNSt12_Vector_baseIjSaIjEE17_Vector_impl_data12_M_swap_dataERS2_", scope: !851, file: !725, line: 117, type: !872, scopeLine: 117, flags: DIFlagPrototyped, spFlags: 0)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !861, !874}
!874 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !851, size: 64)
!875 = !DISubprogram(name: "_Vector_impl", scope: !731, file: !725, line: 131, type: !876, scopeLine: 131, flags: DIFlagPrototyped, spFlags: 0)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !878}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!879 = !DISubprogram(name: "_Vector_impl", scope: !731, file: !725, line: 136, type: !880, scopeLine: 136, flags: DIFlagPrototyped, spFlags: 0)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !878, !882}
!882 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!884 = !DISubprogram(name: "_Vector_impl", scope: !731, file: !725, line: 143, type: !885, scopeLine: 143, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !878, !887}
!887 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !731, size: 64)
!888 = !DISubprogram(name: "_Vector_impl", scope: !731, file: !725, line: 147, type: !889, scopeLine: 147, flags: DIFlagPrototyped, spFlags: 0)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !878, !891}
!891 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !734, size: 64)
!892 = !DISubprogram(name: "_Vector_impl", scope: !731, file: !725, line: 151, type: !893, scopeLine: 151, flags: DIFlagPrototyped, spFlags: 0)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !878, !891, !887}
!895 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNSt12_Vector_baseIjSaIjEE19_M_get_Tp_allocatorEv", scope: !728, file: !725, line: 276, type: !896, scopeLine: 276, flags: DIFlagPrototyped, spFlags: 0)
!896 = !DISubroutineType(types: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !734, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!900 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNKSt12_Vector_baseIjSaIjEE19_M_get_Tp_allocatorEv", scope: !728, file: !725, line: 280, type: !901, scopeLine: 280, flags: DIFlagPrototyped, spFlags: 0)
!901 = !DISubroutineType(types: !902)
!902 = !{!882, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!905 = !DISubprogram(name: "get_allocator", linkageName: "_ZNKSt12_Vector_baseIjSaIjEE13get_allocatorEv", scope: !728, file: !725, line: 284, type: !906, scopeLine: 284, flags: DIFlagPrototyped, spFlags: 0)
!906 = !DISubroutineType(types: !907)
!907 = !{!908, !903}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !728, file: !725, line: 273, baseType: !751)
!909 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 288, type: !910, scopeLine: 288, flags: DIFlagPrototyped, spFlags: 0)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !899}
!912 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 293, type: !913, scopeLine: 293, flags: DIFlagPrototyped, spFlags: 0)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !899, !915}
!915 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!917 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 298, type: !918, scopeLine: 298, flags: DIFlagPrototyped, spFlags: 0)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !899, !789}
!920 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 303, type: !921, scopeLine: 303, flags: DIFlagPrototyped, spFlags: 0)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !899, !789, !915}
!923 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 308, type: !924, scopeLine: 308, flags: DIFlagPrototyped, spFlags: 0)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !899, !926}
!926 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !728, size: 64)
!927 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 312, type: !928, scopeLine: 312, flags: DIFlagPrototyped, spFlags: 0)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !899, !891}
!930 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 315, type: !931, scopeLine: 315, flags: DIFlagPrototyped, spFlags: 0)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !899, !926, !915}
!933 = !DISubprogram(name: "_Vector_base", scope: !728, file: !725, line: 328, type: !934, scopeLine: 328, flags: DIFlagPrototyped, spFlags: 0)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !899, !915, !926}
!936 = !DISubprogram(name: "~_Vector_base", scope: !728, file: !725, line: 333, type: !910, scopeLine: 333, flags: DIFlagPrototyped, spFlags: 0)
!937 = !DISubprogram(name: "_M_allocate", linkageName: "_ZNSt12_Vector_baseIjSaIjEE11_M_allocateEm", scope: !728, file: !725, line: 343, type: !938, scopeLine: 343, flags: DIFlagPrototyped, spFlags: 0)
!938 = !DISubroutineType(types: !939)
!939 = !{!854, !899, !789}
!940 = !DISubprogram(name: "_M_deallocate", linkageName: "_ZNSt12_Vector_baseIjSaIjEE13_M_deallocateEPjm", scope: !728, file: !725, line: 350, type: !941, scopeLine: 350, flags: DIFlagPrototyped, spFlags: 0)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !899, !854, !789}
!943 = !DISubprogram(name: "_M_create_storage", linkageName: "_ZNSt12_Vector_baseIjSaIjEE17_M_create_storageEm", scope: !728, file: !725, line: 359, type: !918, scopeLine: 359, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!944 = !{!799, !832}
!945 = !DISubprogram(name: "_S_nothrow_relocate", linkageName: "_ZNSt6vectorIjSaIjEE19_S_nothrow_relocateESt17integral_constantIbLb1EE", scope: !724, file: !725, line: 431, type: !946, scopeLine: 431, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!946 = !DISubroutineType(types: !947)
!947 = !{!139, !948}
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "true_type", scope: !361, file: !949, line: 83, baseType: !950)
!949 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/type_traits", directory: "")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "integral_constant<bool, true>", scope: !361, file: !949, line: 65, size: 8, flags: DIFlagTypePassByValue, elements: !951, templateParams: !961, identifier: "_ZTSSt17integral_constantIbLb1EE")
!951 = !{!952, !954, !960}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !950, file: !949, line: 67, baseType: !953, flags: DIFlagStaticMember, extraData: i1 true)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!954 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt17integral_constantIbLb1EEcvbEv", scope: !950, file: !949, line: 70, type: !955, scopeLine: 70, flags: DIFlagPrototyped, spFlags: 0)
!955 = !DISubroutineType(types: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !950, file: !949, line: 68, baseType: !139)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!960 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt17integral_constantIbLb1EEclEv", scope: !950, file: !949, line: 75, type: !955, scopeLine: 75, flags: DIFlagPrototyped, spFlags: 0)
!961 = !{!962, !963}
!962 = !DITemplateTypeParameter(name: "_Tp", type: !139)
!963 = !DITemplateValueParameter(name: "__v", type: !139, value: i1 true)
!964 = !DISubprogram(name: "_S_nothrow_relocate", linkageName: "_ZNSt6vectorIjSaIjEE19_S_nothrow_relocateESt17integral_constantIbLb0EE", scope: !724, file: !725, line: 440, type: !965, scopeLine: 440, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!965 = !DISubroutineType(types: !966)
!966 = !{!139, !967}
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "false_type", scope: !361, file: !949, line: 86, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "integral_constant<bool, false>", scope: !361, file: !949, line: 65, size: 8, flags: DIFlagTypePassByValue, elements: !969, templateParams: !978, identifier: "_ZTSSt17integral_constantIbLb0EE")
!969 = !{!970, !971, !977}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !968, file: !949, line: 67, baseType: !953, flags: DIFlagStaticMember, extraData: i1 false)
!971 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt17integral_constantIbLb0EEcvbEv", scope: !968, file: !949, line: 70, type: !972, scopeLine: 70, flags: DIFlagPrototyped, spFlags: 0)
!972 = !DISubroutineType(types: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !968, file: !949, line: 68, baseType: !139)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!977 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt17integral_constantIbLb0EEclEv", scope: !968, file: !949, line: 75, type: !972, scopeLine: 75, flags: DIFlagPrototyped, spFlags: 0)
!978 = !{!962, !979}
!979 = !DITemplateValueParameter(name: "__v", type: !139, value: i1 false)
!980 = !DISubprogram(name: "_S_use_relocate", linkageName: "_ZNSt6vectorIjSaIjEE15_S_use_relocateEv", scope: !724, file: !725, line: 444, type: !840, scopeLine: 444, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!981 = !DISubprogram(name: "_S_do_relocate", linkageName: "_ZNSt6vectorIjSaIjEE14_S_do_relocateEPjS2_S2_RS0_St17integral_constantIbLb1EE", scope: !724, file: !725, line: 453, type: !982, scopeLine: 453, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!982 = !DISubroutineType(types: !983)
!983 = !{!984, !984, !984, !984, !985, !948}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !724, file: !725, line: 415, baseType: !854, flags: DIFlagPublic)
!985 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Tp_alloc_type", scope: !724, file: !725, line: 410, baseType: !734)
!987 = !DISubprogram(name: "_S_do_relocate", linkageName: "_ZNSt6vectorIjSaIjEE14_S_do_relocateEPjS2_S2_RS0_St17integral_constantIbLb0EE", scope: !724, file: !725, line: 460, type: !988, scopeLine: 460, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!988 = !DISubroutineType(types: !989)
!989 = !{!984, !984, !984, !984, !985, !967}
!990 = !DISubprogram(name: "_S_relocate", linkageName: "_ZNSt6vectorIjSaIjEE11_S_relocateEPjS2_S2_RS0_", scope: !724, file: !725, line: 465, type: !991, scopeLine: 465, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!991 = !DISubroutineType(types: !992)
!992 = !{!984, !984, !984, !984, !985}
!993 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 487, type: !994, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!997 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 497, type: !998, scopeLine: 497, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !996, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !724, file: !725, line: 426, baseType: !751, flags: DIFlagPublic)
!1003 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 510, type: !1004, scopeLine: 510, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null, !996, !1006, !1000}
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !725, line: 424, baseType: !789, flags: DIFlagPublic)
!1007 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 522, type: !1008, scopeLine: 522, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !996, !1006, !1010, !1000}
!1010 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !724, file: !725, line: 414, baseType: !62, flags: DIFlagPublic)
!1013 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 553, type: !1014, scopeLine: 553, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !996, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!1018 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 572, type: !1019, scopeLine: 572, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !996, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !724, size: 64)
!1022 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 575, type: !1023, scopeLine: 575, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{null, !996, !1016, !1000}
!1025 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 585, type: !1026, scopeLine: 585, flags: DIFlagPrototyped, spFlags: 0)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !996, !1021, !1000, !948}
!1028 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 589, type: !1029, scopeLine: 589, flags: DIFlagPrototyped, spFlags: 0)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !996, !1021, !1000, !967}
!1031 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 607, type: !1032, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{null, !996, !1021, !1000}
!1034 = !DISubprogram(name: "vector", scope: !724, file: !725, line: 625, type: !1035, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !996, !1037, !1000}
!1037 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "initializer_list<unsigned int>", scope: !361, file: !1038, line: 47, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt16initializer_listIjE")
!1038 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/initializer_list", directory: "")
!1039 = !DISubprogram(name: "~vector", scope: !724, file: !725, line: 678, type: !994, scopeLine: 678, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1040 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIjSaIjEEaSERKS1_", scope: !724, file: !725, line: 695, type: !1041, scopeLine: 695, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1043, !996, !1016}
!1043 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !724, size: 64)
!1044 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIjSaIjEEaSEOS1_", scope: !724, file: !725, line: 709, type: !1045, scopeLine: 709, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1043, !996, !1021}
!1047 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIjSaIjEEaSESt16initializer_listIjE", scope: !724, file: !725, line: 730, type: !1048, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1043, !996, !1037}
!1050 = !DISubprogram(name: "assign", linkageName: "_ZNSt6vectorIjSaIjEE6assignEmRKj", scope: !724, file: !725, line: 749, type: !1051, scopeLine: 749, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !996, !1006, !1010}
!1053 = !DISubprogram(name: "assign", linkageName: "_ZNSt6vectorIjSaIjEE6assignESt16initializer_listIjE", scope: !724, file: !725, line: 794, type: !1054, scopeLine: 794, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !996, !1037}
!1056 = !DISubprogram(name: "begin", linkageName: "_ZNSt6vectorIjSaIjEE5beginEv", scope: !724, file: !725, line: 811, type: !1057, scopeLine: 811, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!1059, !996}
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !724, file: !725, line: 419, baseType: !1060, flags: DIFlagPublic)
!1060 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__normal_iterator<unsigned int *, std::vector<unsigned int, std::allocator<unsigned int> > >", scope: !515, file: !1061, line: 1004, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !1062, templateParams: !1115, identifier: "_ZTSN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEE")
!1061 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/stl_iterator.h", directory: "", checksumkind: CSK_MD5, checksum: "adfbaa72dad2c93f2f61417c54c47efb")
!1062 = !{!1063, !1064, !1068, !1073, !1084, !1089, !1093, !1096, !1097, !1098, !1104, !1107, !1110, !1111, !1112}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_M_current", scope: !1060, file: !1061, line: 1007, baseType: !748, size: 64, flags: DIFlagProtected)
!1064 = !DISubprogram(name: "__normal_iterator", scope: !1060, file: !1061, line: 1023, type: !1065, scopeLine: 1023, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{null, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1068 = !DISubprogram(name: "__normal_iterator", scope: !1060, file: !1061, line: 1027, type: !1069, scopeLine: 1027, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !1067, !1071}
!1071 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!1073 = !DISubprogram(name: "operator*", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEdeEv", scope: !1060, file: !1061, line: 1042, type: !1074, scopeLine: 1042, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!1076, !1082}
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !1060, file: !1061, line: 1016, baseType: !1077, flags: DIFlagPublic)
