; ModuleID = '/home/raj/ardupilot/libraries/AP_HAL_Linux/OpticalFlow_Onboard.cpp'
source_filename = "/home/raj/ardupilot/libraries/AP_HAL_Linux/OpticalFlow_Onboard.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sched_param = type { i32 }
%class.Functor = type { ptr, ptr }
%union.pthread_attr_t = type { i64, [48 x i8] }
%"class.std::vector" = type { %"struct.std::_Vector_base" }
%"struct.std::_Vector_base" = type { %"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl" }
%"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl" = type { %"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl_data" }
%"struct.std::_Vector_base<unsigned int, std::allocator<unsigned int>>::_Vector_impl_data" = type { ptr, ptr, ptr }
%"class.__gnu_cxx::__normal_iterator" = type { ptr }
%"class.Linux::OpticalFlow_Onboard" = type <{ %"class.AP_HAL::OpticalFlow", ptr, %"class.Linux::VideoIn::Frame", ptr, ptr, ptr, i64, %union.pthread_mutex_t, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, float, float, float, float, i32, i8, [3 x i8], %class.Functor, %class.Vector3, [4 x i8] }>
%"class.AP_HAL::OpticalFlow" = type { ptr }
%"class.Linux::VideoIn::Frame" = type <{ i32, i32, ptr, i32, [4 x i8] }>
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }

!63 = !DIEnumerator(name: "V4L2_MEMORY_USERPTR", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "V4L2_MEMORY_OVERLAY", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "V4L2_MEMORY_DMABUF", value: 4, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 124, baseType: !60, size: 32, elements: !68)
!67 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "5205981c6f80cc3dc1e81231df63d8ef")
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "PTHREAD_INHERIT_SCHED", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PTHREAD_EXPLICIT_SCHED", value: 1, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Rotation", file: !72, line: 28, baseType: !60, size: 32, elements: !73, identifier: "_ZTS8Rotation")
!72 = !DIFile(filename: "ardupilot/libraries/AP_Math/rotations.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "04a17862c10c9a57597560af0328029e")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!74 = !DIEnumerator(name: "ROTATION_NONE", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "ROTATION_YAW_45", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "ROTATION_YAW_90", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "ROTATION_YAW_135", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "ROTATION_YAW_180", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "ROTATION_YAW_225", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "ROTATION_YAW_270", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "ROTATION_YAW_315", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "ROTATION_ROLL_180", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_45", value: 9, isUnsigned: true)
!84 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_90", value: 10, isUnsigned: true)
!85 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_135", value: 11, isUnsigned: true)
!86 = !DIEnumerator(name: "ROTATION_PITCH_180", value: 12, isUnsigned: true)
!87 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_225", value: 13, isUnsigned: true)
!88 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_270", value: 14, isUnsigned: true)
!89 = !DIEnumerator(name: "ROTATION_ROLL_180_YAW_315", value: 15, isUnsigned: true)
!90 = !DIEnumerator(name: "ROTATION_ROLL_90", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_45", value: 17, isUnsigned: true)
!92 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_90", value: 18, isUnsigned: true)
!93 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_135", value: 19, isUnsigned: true)
!94 = !DIEnumerator(name: "ROTATION_ROLL_270", value: 20, isUnsigned: true)
!95 = !DIEnumerator(name: "ROTATION_ROLL_270_YAW_45", value: 21, isUnsigned: true)
!96 = !DIEnumerator(name: "ROTATION_ROLL_270_YAW_90", value: 22, isUnsigned: true)
!97 = !DIEnumerator(name: "ROTATION_ROLL_270_YAW_135", value: 23, isUnsigned: true)
!98 = !DIEnumerator(name: "ROTATION_PITCH_90", value: 24, isUnsigned: true)
!99 = !DIEnumerator(name: "ROTATION_PITCH_270", value: 25, isUnsigned: true)
!100 = !DIEnumerator(name: "ROTATION_PITCH_180_YAW_90", value: 26, isUnsigned: true)
!101 = !DIEnumerator(name: "ROTATION_PITCH_180_YAW_270", value: 27, isUnsigned: true)
!102 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_90", value: 28, isUnsigned: true)
!103 = !DIEnumerator(name: "ROTATION_ROLL_180_PITCH_90", value: 29, isUnsigned: true)
!104 = !DIEnumerator(name: "ROTATION_ROLL_270_PITCH_90", value: 30, isUnsigned: true)
!105 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_180", value: 31, isUnsigned: true)
!106 = !DIEnumerator(name: "ROTATION_ROLL_270_PITCH_180", value: 32, isUnsigned: true)
!107 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_270", value: 33, isUnsigned: true)
!108 = !DIEnumerator(name: "ROTATION_ROLL_180_PITCH_270", value: 34, isUnsigned: true)
!109 = !DIEnumerator(name: "ROTATION_ROLL_270_PITCH_270", value: 35, isUnsigned: true)
!110 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_180_YAW_90", value: 36, isUnsigned: true)
!111 = !DIEnumerator(name: "ROTATION_ROLL_90_YAW_270", value: 37, isUnsigned: true)
!112 = !DIEnumerator(name: "ROTATION_ROLL_90_PITCH_68_YAW_293", value: 38, isUnsigned: true)
!113 = !DIEnumerator(name: "ROTATION_MAX", value: 39, isUnsigned: true)
!114 = !{!115, !117, !734, !140, !521, !827, !522, !128, !181, !186, !189, !210, !216, !313, !867, !975}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !116, line: 27, baseType: !60)
!116 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "OpticalFlow_Onboard", scope: !120, file: !119, line: 27, size: 1600, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !121, vtableHolder: !123)
!119 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/OpticalFlow_Onboard.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "7b4c9e700f27d160076bb32dcc190a2a")
!120 = !DINamespace(name: "Linux", scope: null)
!121 = !{!122, !126, !762, !763, !767, !771, !775, !778, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !820, !821, !822, !823, !824, !825, !864, !953, !957, !969, !972}
!122 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !118, baseType: !123, flags: DIFlagPublic, extraData: i32 0)
!123 = !DICompositeType(tag: DW_TAG_class_type, name: "OpticalFlow", scope: !125, file: !124, line: 17, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6AP_HAL11OpticalFlowE")
!124 = !DIFile(filename: "ardupilot/libraries/AP_HAL/OpticalFlow.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "9f9f121a90eb4c8138cfdc938010b02e")
!125 = !DINamespace(name: "AP_HAL", scope: null)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_videoin", scope: !118, file: !119, line: 35, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "VideoIn", scope: !120, file: !129, line: 26, size: 384, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !130, identifier: "_ZTSN5Linux7VideoInE")
!129 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/VideoIn.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "af2f23b8636078178400514c9d07cdfc")
!130 = !{!131, !133, !136, !137, !139, !144, !145, !146, !147, !148, !149, !161, !164, !168, !171, !174, !177, !723, !727, !730, !731, !738, !741, !744, !747, !750, !751}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !128, file: !129, line: 72, baseType: !132, size: 32)
!132 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_buffers", scope: !128, file: !129, line: 73, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !129, line: 21, size: 128, flags: DIFlagFwdDecl, identifier: "_ZTS6buffer")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_nbufs", scope: !128, file: !129, line: 74, baseType: !60, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_streaming", scope: !128, file: !129, line: 75, baseType: !138, size: 8, offset: 160)
!138 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_width", scope: !128, file: !129, line: 76, baseType: !140, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !141, line: 26, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !143, line: 42, baseType: !60)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_height", scope: !128, file: !129, line: 77, baseType: !140, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_format", scope: !128, file: !129, line: 78, baseType: !140, size: 32, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_bytesperline", scope: !128, file: !129, line: 79, baseType: !140, size: 32, offset: 288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_sizeimage", scope: !128, file: !129, line: 80, baseType: !140, size: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_memtype", scope: !128, file: !129, line: 81, baseType: !140, size: 32, offset: 352)
!149 = !DISubprogram(name: "get_frame", linkageName: "_ZN5Linux7VideoIn9get_frameERNS0_5FrameE", scope: !128, file: !129, line: 41, type: !150, scopeLine: 41, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!150 = !DISubroutineType(types: !151)
!151 = !{!138, !152, !153}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!153 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Frame", scope: !128, file: !129, line: 31, size: 192, flags: DIFlagPublic | DIFlagTypePassByValue, elements: !155, identifier: "_ZTSN5Linux7VideoIn5FrameE")
!155 = !{!156, !157, !158, !160}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !154, file: !129, line: 34, baseType: !140, size: 32, flags: DIFlagPublic)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !154, file: !129, line: 35, baseType: !140, size: 32, offset: 32, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !129, line: 36, baseType: !159, size: 64, offset: 64, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "buf_index", scope: !154, file: !129, line: 38, baseType: !140, size: 32, offset: 128)
!161 = !DISubprogram(name: "put_frame", linkageName: "_ZN5Linux7VideoIn9put_frameERNS0_5FrameE", scope: !128, file: !129, line: 42, type: !162, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !152, !153}
!164 = !DISubprogram(name: "set_device_path", linkageName: "_ZN5Linux7VideoIn15set_device_pathEPKc", scope: !128, file: !129, line: 43, type: !165, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !152, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!168 = !DISubprogram(name: "init", linkageName: "_ZN5Linux7VideoIn4initEv", scope: !128, file: !129, line: 44, type: !169, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !152}
!171 = !DISubprogram(name: "open_device", linkageName: "_ZN5Linux7VideoIn11open_deviceEPKcj", scope: !128, file: !129, line: 45, type: !172, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!172 = !DISubroutineType(types: !173)
!173 = !{!138, !152, !167, !140}
!174 = !DISubprogram(name: "allocate_buffers", linkageName: "_ZN5Linux7VideoIn16allocate_buffersEj", scope: !128, file: !129, line: 46, type: !175, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!175 = !DISubroutineType(types: !176)
!176 = !{!138, !152, !140}
!177 = !DISubprogram(name: "get_pixel_formats", linkageName: "_ZN5Linux7VideoIn17get_pixel_formatsEPSt6vectorIjSaIjEE", scope: !128, file: !129, line: 47, type: !178, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !152, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, std::allocator<unsigned int> >", scope: !183, file: !182, line: 389, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !184, templateParams: !721, identifier: "_ZTSSt6vectorIjSaIjEE")
!182 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/stl_vector.h", directory: "", checksumkind: CSK_MD5, checksum: "abcaf00227294b9790605822a1c03477")
!183 = !DINamespace(name: "std", scope: null)
!184 = !{!185, !407, !426, !442, !443, !449, !452, !455, !459, !465, !469, !475, !480, !484, !487, !490, !493, !496, !501, !502, !506, !509, !512, !515, !518, !580, !586, !587, !588, !593, !598, !599, !600, !601, !602, !603, !604, !607, !608, !611, !612, !613, !614, !617, !618, !626, !633, !636, !637, !638, !641, !644, !645, !646, !649, !652, !655, !659, !660, !663, !666, !669, !672, !675, !678, !681, !682, !683, !684, !685, !688, !689, !692, !693, !694, !698, !701, !706, !709, !712, !715, !718}
!185 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !181, baseType: !186, flags: DIFlagProtected, extraData: i32 0)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_base<unsigned int, std::allocator<unsigned int> >", scope: !183, file: !182, line: 84, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !187, templateParams: !406, identifier: "_ZTSSt12_Vector_baseIjSaIjEE")
!187 = !{!188, !357, !362, !367, !371, !374, !379, !382, !385, !389, !392, !395, !398, !399, !402, !405}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: !186, file: !182, line: 340, baseType: !189, size: 192)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_impl", scope: !186, file: !182, line: 128, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !190, identifier: "_ZTSNSt12_Vector_baseIjSaIjEE12_Vector_implE")
!190 = !{!191, !312, !337, !341, !346, !350, !354}
!191 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !189, baseType: !192, extraData: i32 0)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Tp_alloc_type", scope: !186, file: !182, line: 87, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "other", scope: !195, file: !194, line: 120, baseType: !311)
!194 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/ext/alloc_traits.h", directory: "")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rebind<unsigned int>", scope: !196, file: !194, line: 119, size: 8, flags: DIFlagTypePassByValue, elements: !310, templateParams: !260, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIjEjE6rebindIjEE")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<unsigned int>, unsigned int>", scope: !197, file: !194, line: 48, size: 8, flags: DIFlagTypePassByValue, elements: !198, templateParams: !308, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIjEjEE")
!197 = !DINamespace(name: "__gnu_cxx", scope: null)
!198 = !{!199, !295, !298, !301, !304, !305, !306, !307}
!199 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !196, baseType: !200, extraData: i32 0)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator_traits<std::allocator<unsigned int> >", scope: !183, file: !201, line: 411, size: 8, flags: DIFlagTypePassByValue, elements: !202, templateParams: !293, identifier: "_ZTSSt16allocator_traitsISaIjEE")
!201 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/alloc_traits.h", directory: "", checksumkind: CSK_MD5, checksum: "937e9d7f00d3ed7cff7ec8fafeb8a8bc")
!202 = !{!203, !277, !281, !284, !290}
!203 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIjEE8allocateERS0_m", scope: !200, file: !201, line: 463, type: !204, scopeLine: 463, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !208, !276}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !200, file: !201, line: 420, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !200, file: !201, line: 414, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "allocator<unsigned int>", scope: !183, file: !211, line: 124, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !212, templateParams: !260, identifier: "_ZTSSaIjE")
!211 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/allocator.h", directory: "", checksumkind: CSK_MD5, checksum: "52abf05a7426983321ecef80fe4251be")
!212 = !{!213, !262, !266, !271, !275}
!213 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !210, baseType: !214, flags: DIFlagPublic, extraData: i32 0)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__allocator_base<unsigned int>", scope: !183, file: !215, line: 48, baseType: !216)
!215 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/x86_64-linux-gnu/c++/11/bits/c++allocator.h", directory: "", checksumkind: CSK_MD5, checksum: "fcdcf111c9228da351f93cd81039e6d6")
!216 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "new_allocator<unsigned int>", scope: !197, file: !217, line: 55, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !218, templateParams: !260, identifier: "_ZTSN9__gnu_cxx13new_allocatorIjEE")
!217 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/ext/new_allocator.h", directory: "", checksumkind: CSK_MD5, checksum: "4493add5a3fa57e0ec30b90cd4e81c11")
!218 = !{!219, !223, !228, !229, !236, !244, !253, !256, !259}
!219 = !DISubprogram(name: "new_allocator", scope: !216, file: !217, line: 79, type: !220, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!223 = !DISubprogram(name: "new_allocator", scope: !216, file: !217, line: 82, type: !224, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !222, !226}
!226 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!228 = !DISubprogram(name: "~new_allocator", scope: !216, file: !217, line: 89, type: !220, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!229 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE7addressERj", scope: !216, file: !217, line: 92, type: !230, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !216, file: !217, line: 62, baseType: !207, flags: DIFlagPublic)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !216, file: !217, line: 64, baseType: !235, flags: DIFlagPublic)
!235 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !60, size: 64)
!236 = !DISubprogram(name: "address", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE7addressERKj", scope: !216, file: !217, line: 96, type: !237, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !233, !242}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_pointer", scope: !216, file: !217, line: 63, baseType: !240, flags: DIFlagPublic)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !216, file: !217, line: 65, baseType: !243, flags: DIFlagPublic)
!243 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !241, size: 64)
!244 = !DISubprogram(name: "allocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIjE8allocateEmPKv", scope: !216, file: !217, line: 103, type: !245, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!207, !222, !247, !251}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !217, line: 59, baseType: !248, flags: DIFlagPublic)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !183, file: !249, line: 280, baseType: !250)
!249 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/x86_64-linux-gnu/c++/11/bits/c++config.h", directory: "", checksumkind: CSK_MD5, checksum: "b09addf8bea7ac9bf251a76b15f26064")
!250 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!253 = !DISubprogram(name: "deallocate", linkageName: "_ZN9__gnu_cxx13new_allocatorIjE10deallocateEPjm", scope: !216, file: !217, line: 132, type: !254, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !222, !207, !247}
!256 = !DISubprogram(name: "max_size", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE8max_sizeEv", scope: !216, file: !217, line: 154, type: !257, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!257 = !DISubroutineType(types: !258)
!258 = !{!247, !233}
!259 = !DISubprogram(name: "_M_max_size", linkageName: "_ZNK9__gnu_cxx13new_allocatorIjE11_M_max_sizeEv", scope: !216, file: !217, line: 197, type: !257, scopeLine: 197, flags: DIFlagPrototyped, spFlags: 0)
!260 = !{!261}
!261 = !DITemplateTypeParameter(name: "_Tp", type: !60)
!262 = !DISubprogram(name: "allocator", scope: !210, file: !211, line: 156, type: !263, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!266 = !DISubprogram(name: "allocator", scope: !210, file: !211, line: 159, type: !267, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !265, !269}
!269 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!271 = !DISubprogram(name: "operator=", linkageName: "_ZNSaIjEaSERKS_", scope: !210, file: !211, line: 164, type: !272, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !265, !269}
!274 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !210, size: 64)
!275 = !DISubprogram(name: "~allocator", scope: !210, file: !211, line: 174, type: !263, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !201, line: 435, baseType: !248)
!277 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIjEE8allocateERS0_mPKv", scope: !200, file: !201, line: 477, type: !278, scopeLine: 477, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!278 = !DISubroutineType(types: !279)
!279 = !{!206, !208, !276, !280}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_void_pointer", file: !201, line: 429, baseType: !251)
!281 = !DISubprogram(name: "deallocate", linkageName: "_ZNSt16allocator_traitsISaIjEE10deallocateERS0_Pjm", scope: !200, file: !201, line: 495, type: !282, scopeLine: 495, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !208, !206, !276}
!284 = !DISubprogram(name: "max_size", linkageName: "_ZNSt16allocator_traitsISaIjEE8max_sizeERKS0_", scope: !200, file: !201, line: 547, type: !285, scopeLine: 547, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !200, file: !201, line: 435, baseType: !248)
!288 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!290 = !DISubprogram(name: "select_on_container_copy_construction", linkageName: "_ZNSt16allocator_traitsISaIjEE37select_on_container_copy_constructionERKS0_", scope: !200, file: !201, line: 562, type: !291, scopeLine: 562, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!291 = !DISubroutineType(types: !292)
!292 = !{!209, !288}
!293 = !{!294}
!294 = !DITemplateTypeParameter(name: "_Alloc", type: !210)
!295 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE17_S_select_on_copyERKS1_", scope: !196, file: !194, line: 97, type: !296, scopeLine: 97, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!296 = !DISubroutineType(types: !297)
!297 = !{!210, !269}
!298 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE10_S_on_swapERS1_S3_", scope: !196, file: !194, line: 100, type: !299, scopeLine: 100, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !274, !274}
!301 = !DISubprogram(name: "_S_propagate_on_copy_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE27_S_propagate_on_copy_assignEv", scope: !196, file: !194, line: 103, type: !302, scopeLine: 103, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!302 = !DISubroutineType(types: !303)
!303 = !{!138}
!304 = !DISubprogram(name: "_S_propagate_on_move_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE27_S_propagate_on_move_assignEv", scope: !196, file: !194, line: 106, type: !302, scopeLine: 106, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!305 = !DISubprogram(name: "_S_propagate_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE20_S_propagate_on_swapEv", scope: !196, file: !194, line: 109, type: !302, scopeLine: 109, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!306 = !DISubprogram(name: "_S_always_equal", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE15_S_always_equalEv", scope: !196, file: !194, line: 112, type: !302, scopeLine: 112, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!307 = !DISubprogram(name: "_S_nothrow_move", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIjEjE15_S_nothrow_moveEv", scope: !196, file: !194, line: 115, type: !302, scopeLine: 115, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!308 = !{!294, !309}
!309 = !DITemplateTypeParameter(type: !60)
!310 = !{}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "rebind_alloc<unsigned int>", scope: !200, file: !201, line: 450, baseType: !210)
!312 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !189, baseType: !313, extraData: i32 0)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Vector_impl_data", scope: !186, file: !182, line: 91, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !314, identifier: "_ZTSNSt12_Vector_baseIjSaIjEE17_Vector_impl_dataE")
!314 = !{!315, !318, !319, !320, !324, !328, !333}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_M_start", scope: !313, file: !182, line: 93, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !186, file: !182, line: 89, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !196, file: !194, line: 57, baseType: !206)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_M_finish", scope: !313, file: !182, line: 94, baseType: !316, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_M_end_of_storage", scope: !313, file: !182, line: 95, baseType: !316, size: 64, offset: 128)
!320 = !DISubprogram(name: "_Vector_impl_data", scope: !313, file: !182, line: 97, type: !321, scopeLine: 97, flags: DIFlagPrototyped, spFlags: 0)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!324 = !DISubprogram(name: "_Vector_impl_data", scope: !313, file: !182, line: 102, type: !325, scopeLine: 102, flags: DIFlagPrototyped, spFlags: 0)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !323, !327}
!327 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !313, size: 64)
!328 = !DISubprogram(name: "_M_copy_data", linkageName: "_ZNSt12_Vector_baseIjSaIjEE17_Vector_impl_data12_M_copy_dataERKS2_", scope: !313, file: !182, line: 109, type: !329, scopeLine: 109, flags: DIFlagPrototyped, spFlags: 0)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !323, !331}
!331 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!333 = !DISubprogram(name: "_M_swap_data", linkageName: "_ZNSt12_Vector_baseIjSaIjEE17_Vector_impl_data12_M_swap_dataERS2_", scope: !313, file: !182, line: 117, type: !334, scopeLine: 117, flags: DIFlagPrototyped, spFlags: 0)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !323, !336}
!336 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !313, size: 64)
!337 = !DISubprogram(name: "_Vector_impl", scope: !189, file: !182, line: 131, type: !338, scopeLine: 131, flags: DIFlagPrototyped, spFlags: 0)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!341 = !DISubprogram(name: "_Vector_impl", scope: !189, file: !182, line: 136, type: !342, scopeLine: 136, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !340, !344}
!344 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!346 = !DISubprogram(name: "_Vector_impl", scope: !189, file: !182, line: 143, type: !347, scopeLine: 143, flags: DIFlagPrototyped, spFlags: 0)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !340, !349}
!349 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !189, size: 64)
!350 = !DISubprogram(name: "_Vector_impl", scope: !189, file: !182, line: 147, type: !351, scopeLine: 147, flags: DIFlagPrototyped, spFlags: 0)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !340, !353}
!353 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !192, size: 64)
!354 = !DISubprogram(name: "_Vector_impl", scope: !189, file: !182, line: 151, type: !355, scopeLine: 151, flags: DIFlagPrototyped, spFlags: 0)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !340, !353, !349}
!357 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNSt12_Vector_baseIjSaIjEE19_M_get_Tp_allocatorEv", scope: !186, file: !182, line: 276, type: !358, scopeLine: 276, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DISubroutineType(types: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !192, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!362 = !DISubprogram(name: "_M_get_Tp_allocator", linkageName: "_ZNKSt12_Vector_baseIjSaIjEE19_M_get_Tp_allocatorEv", scope: !186, file: !182, line: 280, type: !363, scopeLine: 280, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{!344, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!367 = !DISubprogram(name: "get_allocator", linkageName: "_ZNKSt12_Vector_baseIjSaIjEE13get_allocatorEv", scope: !186, file: !182, line: 284, type: !368, scopeLine: 284, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DISubroutineType(types: !369)
!369 = !{!370, !365}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !186, file: !182, line: 273, baseType: !210)
!371 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 288, type: !372, scopeLine: 288, flags: DIFlagPrototyped, spFlags: 0)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !361}
!374 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 293, type: !375, scopeLine: 293, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !361, !377}
!377 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!379 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 298, type: !380, scopeLine: 298, flags: DIFlagPrototyped, spFlags: 0)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !361, !248}
!382 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 303, type: !383, scopeLine: 303, flags: DIFlagPrototyped, spFlags: 0)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !361, !248, !377}
!385 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 308, type: !386, scopeLine: 308, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !361, !388}
!388 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !186, size: 64)
!389 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 312, type: !390, scopeLine: 312, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !361, !353}
!392 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 315, type: !393, scopeLine: 315, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !361, !388, !377}
!395 = !DISubprogram(name: "_Vector_base", scope: !186, file: !182, line: 328, type: !396, scopeLine: 328, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !361, !377, !388}
!398 = !DISubprogram(name: "~_Vector_base", scope: !186, file: !182, line: 333, type: !372, scopeLine: 333, flags: DIFlagPrototyped, spFlags: 0)
!399 = !DISubprogram(name: "_M_allocate", linkageName: "_ZNSt12_Vector_baseIjSaIjEE11_M_allocateEm", scope: !186, file: !182, line: 343, type: !400, scopeLine: 343, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DISubroutineType(types: !401)
!401 = !{!316, !361, !248}
!402 = !DISubprogram(name: "_M_deallocate", linkageName: "_ZNSt12_Vector_baseIjSaIjEE13_M_deallocateEPjm", scope: !186, file: !182, line: 350, type: !403, scopeLine: 350, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !361, !316, !248}
!405 = !DISubprogram(name: "_M_create_storage", linkageName: "_ZNSt12_Vector_baseIjSaIjEE17_M_create_storageEm", scope: !186, file: !182, line: 359, type: !380, scopeLine: 359, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!406 = !{!261, !294}
!407 = !DISubprogram(name: "_S_nothrow_relocate", linkageName: "_ZNSt6vectorIjSaIjEE19_S_nothrow_relocateESt17integral_constantIbLb1EE", scope: !181, file: !182, line: 431, type: !408, scopeLine: 431, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{!138, !410}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "true_type", scope: !183, file: !411, line: 83, baseType: !412)
!411 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/type_traits", directory: "")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "integral_constant<bool, true>", scope: !183, file: !411, line: 65, size: 8, flags: DIFlagTypePassByValue, elements: !413, templateParams: !423, identifier: "_ZTSSt17integral_constantIbLb1EE")
!413 = !{!414, !416, !422}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !412, file: !411, line: 67, baseType: !415, flags: DIFlagStaticMember, extraData: i1 true)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!416 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt17integral_constantIbLb1EEcvbEv", scope: !412, file: !411, line: 70, type: !417, scopeLine: 70, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !412, file: !411, line: 68, baseType: !138)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!422 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt17integral_constantIbLb1EEclEv", scope: !412, file: !411, line: 75, type: !417, scopeLine: 75, flags: DIFlagPrototyped, spFlags: 0)
!423 = !{!424, !425}
!424 = !DITemplateTypeParameter(name: "_Tp", type: !138)
!425 = !DITemplateValueParameter(name: "__v", type: !138, value: i1 true)
!426 = !DISubprogram(name: "_S_nothrow_relocate", linkageName: "_ZNSt6vectorIjSaIjEE19_S_nothrow_relocateESt17integral_constantIbLb0EE", scope: !181, file: !182, line: 440, type: !427, scopeLine: 440, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!427 = !DISubroutineType(types: !428)
!428 = !{!138, !429}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "false_type", scope: !183, file: !411, line: 86, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "integral_constant<bool, false>", scope: !183, file: !411, line: 65, size: 8, flags: DIFlagTypePassByValue, elements: !431, templateParams: !440, identifier: "_ZTSSt17integral_constantIbLb0EE")
!431 = !{!432, !433, !439}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !430, file: !411, line: 67, baseType: !415, flags: DIFlagStaticMember, extraData: i1 false)
!433 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt17integral_constantIbLb0EEcvbEv", scope: !430, file: !411, line: 70, type: !434, scopeLine: 70, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !430, file: !411, line: 68, baseType: !138)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!439 = !DISubprogram(name: "operator()", linkageName: "_ZNKSt17integral_constantIbLb0EEclEv", scope: !430, file: !411, line: 75, type: !434, scopeLine: 75, flags: DIFlagPrototyped, spFlags: 0)
!440 = !{!424, !441}
!441 = !DITemplateValueParameter(name: "__v", type: !138, value: i1 false)
!442 = !DISubprogram(name: "_S_use_relocate", linkageName: "_ZNSt6vectorIjSaIjEE15_S_use_relocateEv", scope: !181, file: !182, line: 444, type: !302, scopeLine: 444, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!443 = !DISubprogram(name: "_S_do_relocate", linkageName: "_ZNSt6vectorIjSaIjEE14_S_do_relocateEPjS2_S2_RS0_St17integral_constantIbLb1EE", scope: !181, file: !182, line: 453, type: !444, scopeLine: 453, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !446, !446, !446, !447, !410}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !181, file: !182, line: 415, baseType: !316, flags: DIFlagPublic)
!447 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Tp_alloc_type", scope: !181, file: !182, line: 410, baseType: !192)
!449 = !DISubprogram(name: "_S_do_relocate", linkageName: "_ZNSt6vectorIjSaIjEE14_S_do_relocateEPjS2_S2_RS0_St17integral_constantIbLb0EE", scope: !181, file: !182, line: 460, type: !450, scopeLine: 460, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!450 = !DISubroutineType(types: !451)
!451 = !{!446, !446, !446, !446, !447, !429}
!452 = !DISubprogram(name: "_S_relocate", linkageName: "_ZNSt6vectorIjSaIjEE11_S_relocateEPjS2_S2_RS0_", scope: !181, file: !182, line: 465, type: !453, scopeLine: 465, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!453 = !DISubroutineType(types: !454)
!454 = !{!446, !446, !446, !446, !447}
!455 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 487, type: !456, scopeLine: 487, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!459 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 497, type: !460, scopeLine: 497, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !458, !462}
!462 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !181, file: !182, line: 426, baseType: !210, flags: DIFlagPublic)
!465 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 510, type: !466, scopeLine: 510, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !458, !468, !462}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !182, line: 424, baseType: !248, flags: DIFlagPublic)
!469 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 522, type: !470, scopeLine: 522, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !458, !468, !472, !462}
!472 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !181, file: !182, line: 414, baseType: !60, flags: DIFlagPublic)
!475 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 553, type: !476, scopeLine: 553, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !458, !478}
!478 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!480 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 572, type: !481, scopeLine: 572, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !458, !483}
!483 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !181, size: 64)
!484 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 575, type: !485, scopeLine: 575, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !458, !478, !462}
!487 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 585, type: !488, scopeLine: 585, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !458, !483, !462, !410}
!490 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 589, type: !491, scopeLine: 589, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !458, !483, !462, !429}
!493 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 607, type: !494, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !458, !483, !462}
!496 = !DISubprogram(name: "vector", scope: !181, file: !182, line: 625, type: !497, scopeLine: 625, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !458, !499, !462}
!499 = !DICompositeType(tag: DW_TAG_class_type, name: "initializer_list<unsigned int>", scope: !183, file: !500, line: 47, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt16initializer_listIjE")
!500 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/initializer_list", directory: "")
!501 = !DISubprogram(name: "~vector", scope: !181, file: !182, line: 678, type: !456, scopeLine: 678, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!502 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIjSaIjEEaSERKS1_", scope: !181, file: !182, line: 695, type: !503, scopeLine: 695, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !458, !478}
!505 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !181, size: 64)
!506 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIjSaIjEEaSEOS1_", scope: !181, file: !182, line: 709, type: !507, scopeLine: 709, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!507 = !DISubroutineType(types: !508)
!508 = !{!505, !458, !483}
!509 = !DISubprogram(name: "operator=", linkageName: "_ZNSt6vectorIjSaIjEEaSESt16initializer_listIjE", scope: !181, file: !182, line: 730, type: !510, scopeLine: 730, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!505, !458, !499}
!512 = !DISubprogram(name: "assign", linkageName: "_ZNSt6vectorIjSaIjEE6assignEmRKj", scope: !181, file: !182, line: 749, type: !513, scopeLine: 749, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !458, !468, !472}
!515 = !DISubprogram(name: "assign", linkageName: "_ZNSt6vectorIjSaIjEE6assignESt16initializer_listIjE", scope: !181, file: !182, line: 794, type: !516, scopeLine: 794, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !458, !499}
!518 = !DISubprogram(name: "begin", linkageName: "_ZNSt6vectorIjSaIjEE5beginEv", scope: !181, file: !182, line: 811, type: !519, scopeLine: 811, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!519 = !DISubroutineType(types: !520)
!520 = !{!521, !458}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "iterator", scope: !181, file: !182, line: 419, baseType: !522, flags: DIFlagPublic)
!522 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__normal_iterator<unsigned int *, std::vector<unsigned int, std::allocator<unsigned int> > >", scope: !197, file: !523, line: 1004, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !524, templateParams: !578, identifier: "_ZTSN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEE")
!523 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/stl_iterator.h", directory: "", checksumkind: CSK_MD5, checksum: "adfbaa72dad2c93f2f61417c54c47efb")
!524 = !{!525, !526, !530, !535, !546, !551, !555, !558, !559, !560, !567, !570, !573, !574, !575}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_M_current", scope: !522, file: !523, line: 1007, baseType: !207, size: 64, flags: DIFlagProtected)
!526 = !DISubprogram(name: "__normal_iterator", scope: !522, file: !523, line: 1023, type: !527, scopeLine: 1023, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!530 = !DISubprogram(name: "__normal_iterator", scope: !522, file: !523, line: 1027, type: !531, scopeLine: 1027, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !529, !533}
!533 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!535 = !DISubprogram(name: "operator*", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEdeEv", scope: !522, file: !523, line: 1042, type: !536, scopeLine: 1042, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !544}
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !522, file: !523, line: 1016, baseType: !539, flags: DIFlagPublic)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !541, file: !540, line: 216, baseType: !235)
!540 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/stl_iterator_base_types.h", directory: "")
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iterator_traits<unsigned int *>", scope: !183, file: !540, line: 210, size: 8, flags: DIFlagTypePassByValue, elements: !310, templateParams: !542, identifier: "_ZTSSt15iterator_traitsIPjE")
!542 = !{!543}
!543 = !DITemplateTypeParameter(name: "_Iterator", type: !207)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!546 = !DISubprogram(name: "operator->", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEptEv", scope: !522, file: !523, line: 1047, type: !547, scopeLine: 1047, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !544}
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !522, file: !523, line: 1017, baseType: !550, flags: DIFlagPublic)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !541, file: !540, line: 215, baseType: !207)
!551 = !DISubprogram(name: "operator++", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEppEv", scope: !522, file: !523, line: 1052, type: !552, scopeLine: 1052, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !529}
!554 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !522, size: 64)
!555 = !DISubprogram(name: "operator++", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEppEi", scope: !522, file: !523, line: 1060, type: !556, scopeLine: 1060, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!556 = !DISubroutineType(types: !557)
!557 = !{!522, !529, !132}
!558 = !DISubprogram(name: "operator--", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEmmEv", scope: !522, file: !523, line: 1066, type: !552, scopeLine: 1066, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!559 = !DISubprogram(name: "operator--", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEmmEi", scope: !522, file: !523, line: 1074, type: !556, scopeLine: 1074, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!560 = !DISubprogram(name: "operator[]", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEixEl", scope: !522, file: !523, line: 1080, type: !561, scopeLine: 1080, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!538, !544, !563}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "difference_type", scope: !522, file: !523, line: 1015, baseType: !564, flags: DIFlagPublic)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "difference_type", scope: !541, file: !540, line: 214, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !183, file: !249, line: 281, baseType: !566)
!566 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!567 = !DISubprogram(name: "operator+=", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEpLEl", scope: !522, file: !523, line: 1085, type: !568, scopeLine: 1085, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!568 = !DISubroutineType(types: !569)
!569 = !{!554, !529, !563}
!570 = !DISubprogram(name: "operator+", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEplEl", scope: !522, file: !523, line: 1090, type: !571, scopeLine: 1090, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!571 = !DISubroutineType(types: !572)
!572 = !{!522, !544, !563}
!573 = !DISubprogram(name: "operator-=", linkageName: "_ZN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEmIEl", scope: !522, file: !523, line: 1095, type: !568, scopeLine: 1095, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!574 = !DISubprogram(name: "operator-", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEmiEl", scope: !522, file: !523, line: 1100, type: !571, scopeLine: 1100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!575 = !DISubprogram(name: "base", linkageName: "_ZNK9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEE4baseEv", scope: !522, file: !523, line: 1105, type: !576, scopeLine: 1105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!576 = !DISubroutineType(types: !577)
!577 = !{!533, !544}
!578 = !{!543, !579}
!579 = !DITemplateTypeParameter(name: "_Container", type: !181)
!580 = !DISubprogram(name: "begin", linkageName: "_ZNKSt6vectorIjSaIjEE5beginEv", scope: !181, file: !182, line: 820, type: !581, scopeLine: 820, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!581 = !DISubroutineType(types: !582)
!582 = !{!583, !585}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_iterator", scope: !181, file: !182, line: 421, baseType: !584, flags: DIFlagPublic)
!584 = !DICompositeType(tag: DW_TAG_class_type, name: "__normal_iterator<const unsigned int *, std::vector<unsigned int, std::allocator<unsigned int> > >", scope: !197, file: !523, line: 1004, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN9__gnu_cxx17__normal_iteratorIPKjSt6vectorIjSaIjEEEE")
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!586 = !DISubprogram(name: "end", linkageName: "_ZNSt6vectorIjSaIjEE3endEv", scope: !181, file: !182, line: 829, type: !519, scopeLine: 829, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!587 = !DISubprogram(name: "end", linkageName: "_ZNKSt6vectorIjSaIjEE3endEv", scope: !181, file: !182, line: 838, type: !581, scopeLine: 838, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!588 = !DISubprogram(name: "rbegin", linkageName: "_ZNSt6vectorIjSaIjEE6rbeginEv", scope: !181, file: !182, line: 847, type: !589, scopeLine: 847, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!589 = !DISubroutineType(types: !590)
!590 = !{!591, !458}
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "reverse_iterator", scope: !181, file: !182, line: 423, baseType: !592, flags: DIFlagPublic)
!592 = !DICompositeType(tag: DW_TAG_class_type, name: "reverse_iterator<__gnu_cxx::__normal_iterator<unsigned int *, std::vector<unsigned int, std::allocator<unsigned int> > > >", scope: !183, file: !523, line: 128, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt16reverse_iteratorIN9__gnu_cxx17__normal_iteratorIPjSt6vectorIjSaIjEEEEE")
!593 = !DISubprogram(name: "rbegin", linkageName: "_ZNKSt6vectorIjSaIjEE6rbeginEv", scope: !181, file: !182, line: 856, type: !594, scopeLine: 856, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !585}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reverse_iterator", scope: !181, file: !182, line: 422, baseType: !597, flags: DIFlagPublic)
!597 = !DICompositeType(tag: DW_TAG_class_type, name: "reverse_iterator<__gnu_cxx::__normal_iterator<const unsigned int *, std::vector<unsigned int, std::allocator<unsigned int> > > >", scope: !183, file: !523, line: 128, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt16reverse_iteratorIN9__gnu_cxx17__normal_iteratorIPKjSt6vectorIjSaIjEEEEE")
!598 = !DISubprogram(name: "rend", linkageName: "_ZNSt6vectorIjSaIjEE4rendEv", scope: !181, file: !182, line: 865, type: !589, scopeLine: 865, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!599 = !DISubprogram(name: "rend", linkageName: "_ZNKSt6vectorIjSaIjEE4rendEv", scope: !181, file: !182, line: 874, type: !594, scopeLine: 874, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!600 = !DISubprogram(name: "cbegin", linkageName: "_ZNKSt6vectorIjSaIjEE6cbeginEv", scope: !181, file: !182, line: 884, type: !581, scopeLine: 884, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!601 = !DISubprogram(name: "cend", linkageName: "_ZNKSt6vectorIjSaIjEE4cendEv", scope: !181, file: !182, line: 893, type: !581, scopeLine: 893, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!602 = !DISubprogram(name: "crbegin", linkageName: "_ZNKSt6vectorIjSaIjEE7crbeginEv", scope: !181, file: !182, line: 902, type: !594, scopeLine: 902, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!603 = !DISubprogram(name: "crend", linkageName: "_ZNKSt6vectorIjSaIjEE5crendEv", scope: !181, file: !182, line: 911, type: !594, scopeLine: 911, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!604 = !DISubprogram(name: "size", linkageName: "_ZNKSt6vectorIjSaIjEE4sizeEv", scope: !181, file: !182, line: 918, type: !605, scopeLine: 918, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{!468, !585}
!607 = !DISubprogram(name: "max_size", linkageName: "_ZNKSt6vectorIjSaIjEE8max_sizeEv", scope: !181, file: !182, line: 923, type: !605, scopeLine: 923, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!608 = !DISubprogram(name: "resize", linkageName: "_ZNSt6vectorIjSaIjEE6resizeEm", scope: !181, file: !182, line: 937, type: !609, scopeLine: 937, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !458, !468}
!611 = !DISubprogram(name: "resize", linkageName: "_ZNSt6vectorIjSaIjEE6resizeEmRKj", scope: !181, file: !182, line: 957, type: !513, scopeLine: 957, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!612 = !DISubprogram(name: "shrink_to_fit", linkageName: "_ZNSt6vectorIjSaIjEE13shrink_to_fitEv", scope: !181, file: !182, line: 989, type: !456, scopeLine: 989, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!613 = !DISubprogram(name: "capacity", linkageName: "_ZNKSt6vectorIjSaIjEE8capacityEv", scope: !181, file: !182, line: 998, type: !605, scopeLine: 998, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!614 = !DISubprogram(name: "empty", linkageName: "_ZNKSt6vectorIjSaIjEE5emptyEv", scope: !181, file: !182, line: 1007, type: !615, scopeLine: 1007, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!138, !585}
!617 = !DISubprogram(name: "reserve", linkageName: "_ZNSt6vectorIjSaIjEE7reserveEm", scope: !181, file: !182, line: 1028, type: !609, scopeLine: 1028, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!618 = !DISubprogram(name: "operator[]", linkageName: "_ZNSt6vectorIjSaIjEEixEm", scope: !181, file: !182, line: 1043, type: !619, scopeLine: 1043, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !458, !468}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !181, file: !182, line: 417, baseType: !622, flags: DIFlagPublic)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "reference", scope: !196, file: !194, line: 62, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !196, file: !194, line: 56, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_type", scope: !200, file: !201, line: 417, baseType: !60)
!626 = !DISubprogram(name: "operator[]", linkageName: "_ZNKSt6vectorIjSaIjEEixEm", scope: !181, file: !182, line: 1061, type: !627, scopeLine: 1061, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!627 = !DISubroutineType(types: !628)
!628 = !{!629, !585, !468}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !181, file: !182, line: 418, baseType: !630, flags: DIFlagPublic)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_reference", scope: !196, file: !194, line: 63, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!633 = !DISubprogram(name: "_M_range_check", linkageName: "_ZNKSt6vectorIjSaIjEE14_M_range_checkEm", scope: !181, file: !182, line: 1070, type: !634, scopeLine: 1070, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !585, !468}
!636 = !DISubprogram(name: "at", linkageName: "_ZNSt6vectorIjSaIjEE2atEm", scope: !181, file: !182, line: 1092, type: !619, scopeLine: 1092, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!637 = !DISubprogram(name: "at", linkageName: "_ZNKSt6vectorIjSaIjEE2atEm", scope: !181, file: !182, line: 1110, type: !627, scopeLine: 1110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!638 = !DISubprogram(name: "front", linkageName: "_ZNSt6vectorIjSaIjEE5frontEv", scope: !181, file: !182, line: 1121, type: !639, scopeLine: 1121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!639 = !DISubroutineType(types: !640)
!640 = !{!621, !458}
!641 = !DISubprogram(name: "front", linkageName: "_ZNKSt6vectorIjSaIjEE5frontEv", scope: !181, file: !182, line: 1132, type: !642, scopeLine: 1132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!642 = !DISubroutineType(types: !643)
!643 = !{!629, !585}
!644 = !DISubprogram(name: "back", linkageName: "_ZNSt6vectorIjSaIjEE4backEv", scope: !181, file: !182, line: 1143, type: !639, scopeLine: 1143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!645 = !DISubprogram(name: "back", linkageName: "_ZNKSt6vectorIjSaIjEE4backEv", scope: !181, file: !182, line: 1154, type: !642, scopeLine: 1154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!646 = !DISubprogram(name: "data", linkageName: "_ZNSt6vectorIjSaIjEE4dataEv", scope: !181, file: !182, line: 1168, type: !647, scopeLine: 1168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!207, !458}
!649 = !DISubprogram(name: "data", linkageName: "_ZNKSt6vectorIjSaIjEE4dataEv", scope: !181, file: !182, line: 1172, type: !650, scopeLine: 1172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!650 = !DISubroutineType(types: !651)
!651 = !{!240, !585}
!652 = !DISubprogram(name: "push_back", linkageName: "_ZNSt6vectorIjSaIjEE9push_backERKj", scope: !181, file: !182, line: 1187, type: !653, scopeLine: 1187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !458, !472}
!655 = !DISubprogram(name: "push_back", linkageName: "_ZNSt6vectorIjSaIjEE9push_backEOj", scope: !181, file: !182, line: 1203, type: !656, scopeLine: 1203, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !458, !658}
!658 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !474, size: 64)
!659 = !DISubprogram(name: "pop_back", linkageName: "_ZNSt6vectorIjSaIjEE8pop_backEv", scope: !181, file: !182, line: 1225, type: !456, scopeLine: 1225, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!660 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIjSaIjEE6insertEN9__gnu_cxx17__normal_iteratorIPKjS1_EERS4_", scope: !181, file: !182, line: 1263, type: !661, scopeLine: 1263, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!661 = !DISubroutineType(types: !662)
!662 = !{!521, !458, !583, !472}
!663 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIjSaIjEE6insertEN9__gnu_cxx17__normal_iteratorIPKjS1_EEOj", scope: !181, file: !182, line: 1293, type: !664, scopeLine: 1293, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{!521, !458, !583, !658}
!666 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIjSaIjEE6insertEN9__gnu_cxx17__normal_iteratorIPKjS1_EESt16initializer_listIjE", scope: !181, file: !182, line: 1310, type: !667, scopeLine: 1310, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!667 = !DISubroutineType(types: !668)
!668 = !{!521, !458, !583, !499}
!669 = !DISubprogram(name: "insert", linkageName: "_ZNSt6vectorIjSaIjEE6insertEN9__gnu_cxx17__normal_iteratorIPKjS1_EEmRS4_", scope: !181, file: !182, line: 1335, type: !670, scopeLine: 1335, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{!521, !458, !583, !468, !472}
!672 = !DISubprogram(name: "erase", linkageName: "_ZNSt6vectorIjSaIjEE5eraseEN9__gnu_cxx17__normal_iteratorIPKjS1_EE", scope: !181, file: !182, line: 1430, type: !673, scopeLine: 1430, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!521, !458, !583}
!675 = !DISubprogram(name: "erase", linkageName: "_ZNSt6vectorIjSaIjEE5eraseEN9__gnu_cxx17__normal_iteratorIPKjS1_EES6_", scope: !181, file: !182, line: 1457, type: !676, scopeLine: 1457, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!676 = !DISubroutineType(types: !677)
!677 = !{!521, !458, !583, !583}
!678 = !DISubprogram(name: "swap", linkageName: "_ZNSt6vectorIjSaIjEE4swapERS1_", scope: !181, file: !182, line: 1480, type: !679, scopeLine: 1480, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !458, !505}
!681 = !DISubprogram(name: "clear", linkageName: "_ZNSt6vectorIjSaIjEE5clearEv", scope: !181, file: !182, line: 1498, type: !456, scopeLine: 1498, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!682 = !DISubprogram(name: "_M_fill_initialize", linkageName: "_ZNSt6vectorIjSaIjEE18_M_fill_initializeEmRKj", scope: !181, file: !182, line: 1593, type: !513, scopeLine: 1593, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!683 = !DISubprogram(name: "_M_default_initialize", linkageName: "_ZNSt6vectorIjSaIjEE21_M_default_initializeEm", scope: !181, file: !182, line: 1603, type: !609, scopeLine: 1603, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!684 = !DISubprogram(name: "_M_fill_assign", linkageName: "_ZNSt6vectorIjSaIjEE14_M_fill_assignEmRKj", scope: !181, file: !182, line: 1645, type: !513, scopeLine: 1645, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!685 = !DISubprogram(name: "_M_fill_insert", linkageName: "_ZNSt6vectorIjSaIjEE14_M_fill_insertEN9__gnu_cxx17__normal_iteratorIPjS1_EEmRKj", scope: !181, file: !182, line: 1684, type: !686, scopeLine: 1684, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !458, !521, !468, !472}
!688 = !DISubprogram(name: "_M_default_append", linkageName: "_ZNSt6vectorIjSaIjEE17_M_default_appendEm", scope: !181, file: !182, line: 1689, type: !609, scopeLine: 1689, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!689 = !DISubprogram(name: "_M_shrink_to_fit", linkageName: "_ZNSt6vectorIjSaIjEE16_M_shrink_to_fitEv", scope: !181, file: !182, line: 1692, type: !690, scopeLine: 1692, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{!138, !458}
!692 = !DISubprogram(name: "_M_insert_rval", linkageName: "_ZNSt6vectorIjSaIjEE14_M_insert_rvalEN9__gnu_cxx17__normal_iteratorIPKjS1_EEOj", scope: !181, file: !182, line: 1741, type: !664, scopeLine: 1741, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!693 = !DISubprogram(name: "_M_emplace_aux", linkageName: "_ZNSt6vectorIjSaIjEE14_M_emplace_auxEN9__gnu_cxx17__normal_iteratorIPKjS1_EEOj", scope: !181, file: !182, line: 1750, type: !664, scopeLine: 1750, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!694 = !DISubprogram(name: "_M_check_len", linkageName: "_ZNKSt6vectorIjSaIjEE12_M_check_lenEmPKc", scope: !181, file: !182, line: 1756, type: !695, scopeLine: 1756, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !585, !468, !167}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !181, file: !182, line: 424, baseType: !248, flags: DIFlagPublic)
!698 = !DISubprogram(name: "_S_check_init_len", linkageName: "_ZNSt6vectorIjSaIjEE17_S_check_init_lenEmRKS0_", scope: !181, file: !182, line: 1767, type: !699, scopeLine: 1767, flags: DIFlagProtected | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!699 = !DISubroutineType(types: !700)
!700 = !{!697, !468, !462}
!701 = !DISubprogram(name: "_S_max_size", linkageName: "_ZNSt6vectorIjSaIjEE11_S_max_sizeERKS0_", scope: !181, file: !182, line: 1776, type: !702, scopeLine: 1776, flags: DIFlagProtected | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!697, !704}
!704 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!706 = !DISubprogram(name: "_M_erase_at_end", linkageName: "_ZNSt6vectorIjSaIjEE15_M_erase_at_endEPj", scope: !181, file: !182, line: 1792, type: !707, scopeLine: 1792, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !458, !446}
!709 = !DISubprogram(name: "_M_erase", linkageName: "_ZNSt6vectorIjSaIjEE8_M_eraseEN9__gnu_cxx17__normal_iteratorIPjS1_EE", scope: !181, file: !182, line: 1804, type: !710, scopeLine: 1804, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{!521, !458, !521}
!712 = !DISubprogram(name: "_M_erase", linkageName: "_ZNSt6vectorIjSaIjEE8_M_eraseEN9__gnu_cxx17__normal_iteratorIPjS1_EES5_", scope: !181, file: !182, line: 1807, type: !713, scopeLine: 1807, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{!521, !458, !521, !521}
!715 = !DISubprogram(name: "_M_move_assign", linkageName: "_ZNSt6vectorIjSaIjEE14_M_move_assignEOS1_St17integral_constantIbLb1EE", scope: !181, file: !182, line: 1815, type: !716, scopeLine: 1815, flags: DIFlagPrototyped, spFlags: 0)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !458, !483, !410}
!718 = !DISubprogram(name: "_M_move_assign", linkageName: "_ZNSt6vectorIjSaIjEE14_M_move_assignEOS1_St17integral_constantIbLb0EE", scope: !181, file: !182, line: 1826, type: !719, scopeLine: 1826, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !458, !483, !429}
!721 = !{!261, !722}
!722 = !DITemplateTypeParameter(name: "_Alloc", type: !210, defaulted: true)
!723 = !DISubprogram(name: "set_format", linkageName: "_ZN5Linux7VideoIn10set_formatEPjS1_S1_S1_S1_", scope: !128, file: !129, line: 48, type: !724, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{!138, !152, !726, !726, !726, !726, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!727 = !DISubprogram(name: "set_crop", linkageName: "_ZN5Linux7VideoIn8set_cropEjjjj", scope: !128, file: !129, line: 50, type: !728, scopeLine: 50, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{!138, !152, !140, !140, !140, !140}
!730 = !DISubprogram(name: "prepare_capture", linkageName: "_ZN5Linux7VideoIn15prepare_captureEv", scope: !128, file: !129, line: 52, type: !169, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!731 = !DISubprogram(name: "shrink_8bpp", linkageName: "_ZN5Linux7VideoIn11shrink_8bppEPhS1_jjjjjjjj", scope: !128, file: !129, line: 54, type: !732, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !734, !734, !140, !140, !140, !140, !140, !140, !140, !140}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !141, line: 24, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !143, line: 38, baseType: !737)
!737 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!738 = !DISubprogram(name: "crop_8bpp", linkageName: "_ZN5Linux7VideoIn9crop_8bppEPhS1_jjjjj", scope: !128, file: !129, line: 59, type: !739, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !734, !734, !140, !140, !140, !140, !140}
!741 = !DISubprogram(name: "yuyv_to_grey", linkageName: "_ZN5Linux7VideoIn12yuyv_to_greyEPhjS1_", scope: !128, file: !129, line: 64, type: !742, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !734, !140, !734}
!744 = !DISubprogram(name: "_queue_buffer", linkageName: "_ZN5Linux7VideoIn13_queue_bufferEi", scope: !128, file: !129, line: 68, type: !745, scopeLine: 68, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !152, !132}
!747 = !DISubprogram(name: "_set_streaming", linkageName: "_ZN5Linux7VideoIn14_set_streamingEb", scope: !128, file: !129, line: 69, type: !748, scopeLine: 69, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!138, !152, !138}
!750 = !DISubprogram(name: "_dequeue_frame", linkageName: "_ZN5Linux7VideoIn14_dequeue_frameERNS0_5FrameE", scope: !128, file: !129, line: 70, type: !150, scopeLine: 70, flags: DIFlagPrototyped, spFlags: 0)
!751 = !DISubprogram(name: "_timeval_to_us", linkageName: "_ZN5Linux7VideoIn14_timeval_to_usER7timeval", scope: !128, file: !129, line: 71, type: !752, scopeLine: 71, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DISubroutineType(types: !753)
!753 = !{!140, !152, !754}
!754 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !756, line: 8, size: 128, flags: DIFlagTypePassByValue, elements: !757, identifier: "_ZTS7timeval")
!756 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!757 = !{!758, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !755, file: !756, line: 14, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !143, line: 160, baseType: !566)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !755, file: !756, line: 15, baseType: !761, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !143, line: 162, baseType: !566)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_last_video_frame", scope: !118, file: !119, line: 36, baseType: !154, size: 192, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_pwm", scope: !118, file: !119, line: 37, baseType: !764, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_class_type, name: "PWM_Sysfs_Base", scope: !120, file: !766, line: 8, size: 448, flags: DIFlagFwdDecl | DIFlagNonTrivial)
!766 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/PWM_Sysfs.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "5af82f9c516108dd2231a00cd6683187")
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_camerasensor", scope: !118, file: !119, line: 38, baseType: !768, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_class_type, name: "CameraSensor", scope: !120, file: !770, line: 19, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN5Linux12CameraSensorE")
!770 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/CameraSensor.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "ab06175cc466a95f4dd846f5b2b8ee79")
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flow", scope: !118, file: !119, line: 39, baseType: !772, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_class_type, name: "Flow_PX4", scope: !120, file: !774, line: 19, size: 224, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN5Linux8Flow_PX4E")
!774 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/Flow_PX4.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "7ee789e8cf27f3c8c3149c08ea7cb467")
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_thread", scope: !118, file: !119, line: 40, baseType: !776, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !777, line: 27, baseType: !250)
!777 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_mutex", scope: !118, file: !119, line: 41, baseType: !779, size: 320, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !777, line: 72, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !777, line: 67, size: 320, flags: DIFlagTypePassByValue, elements: !781, identifier: "_ZTS15pthread_mutex_t")
!781 = !{!782, !802, !806}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !780, file: !777, line: 69, baseType: !783, size: 320)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !784, line: 22, size: 320, flags: DIFlagTypePassByValue, elements: !785, identifier: "_ZTS17__pthread_mutex_s")
!784 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!785 = !{!786, !787, !788, !789, !790, !791, !793, !794}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !783, file: !784, line: 24, baseType: !132, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !783, file: !784, line: 25, baseType: !60, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !783, file: !784, line: 26, baseType: !132, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !783, file: !784, line: 28, baseType: !60, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !783, file: !784, line: 32, baseType: !132, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !783, file: !784, line: 34, baseType: !792, size: 16, offset: 160)
!792 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !783, file: !784, line: 35, baseType: !792, size: 16, offset: 176)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !783, file: !784, line: 36, baseType: !795, size: 128, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !796, line: 55, baseType: !797)
!796 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !796, line: 51, size: 128, flags: DIFlagTypePassByValue, elements: !798, identifier: "_ZTS23__pthread_internal_list")
!798 = !{!799, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !797, file: !796, line: 53, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !797, file: !796, line: 54, baseType: !800, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !780, file: !777, line: 70, baseType: !803, size: 320)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 40)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !780, file: !777, line: 71, baseType: !566, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_initialized", scope: !118, file: !119, line: 42, baseType: !138, size: 8, offset: 896)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_data_available", scope: !118, file: !119, line: 43, baseType: !138, size: 8, offset: 904)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_crop_by_software", scope: !118, file: !119, line: 44, baseType: !138, size: 8, offset: 912)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_shrink_by_software", scope: !118, file: !119, line: 45, baseType: !138, size: 8, offset: 920)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_camera_output_width", scope: !118, file: !119, line: 46, baseType: !140, size: 32, offset: 928)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_camera_output_height", scope: !118, file: !119, line: 47, baseType: !140, size: 32, offset: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_width", scope: !118, file: !119, line: 48, baseType: !140, size: 32, offset: 992)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_height", scope: !118, file: !119, line: 49, baseType: !140, size: 32, offset: 1024)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_format", scope: !118, file: !119, line: 50, baseType: !140, size: 32, offset: 1056)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_bytesperline", scope: !118, file: !119, line: 51, baseType: !140, size: 32, offset: 1088)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_sizeimage", scope: !118, file: !119, line: 52, baseType: !140, size: 32, offset: 1120)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_pixel_flow_x_integral", scope: !118, file: !119, line: 53, baseType: !819, size: 32, offset: 1152)
!819 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_pixel_flow_y_integral", scope: !118, file: !119, line: 54, baseType: !819, size: 32, offset: 1184)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_gyro_x_integral", scope: !118, file: !119, line: 55, baseType: !819, size: 32, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_gyro_y_integral", scope: !118, file: !119, line: 56, baseType: !819, size: 32, offset: 1248)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_integration_timespan", scope: !118, file: !119, line: 57, baseType: !140, size: 32, offset: 1280)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_surface_quality", scope: !118, file: !119, line: 58, baseType: !735, size: 8, offset: 1312)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_get_gyro", scope: !118, file: !119, line: 59, baseType: !826, size: 128, offset: 1344)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gyro_Cb", scope: !123, file: !124, line: 29, baseType: !827, flags: DIFlagPublic)
!827 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Functor<void, float &, float &, float &>", file: !828, line: 36, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !829, templateParams: !859, identifier: "_ZTS7FunctorIvJRfS0_S0_EE")
!828 = !DIFile(filename: "ardupilot/libraries/AP_HAL/utility/functor.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "ce8d7f01a6b110e9ab9c61001786a69b")
!829 = !{!830, !831, !836, !840, !844, !847, !852, !856}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_obj", scope: !827, file: !828, line: 78, baseType: !159, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_method", scope: !827, file: !828, line: 79, baseType: !832, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !159, !835, !835, !835}
!835 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !819, size: 64)
!836 = !DISubprogram(name: "Functor", scope: !827, file: !828, line: 39, type: !837, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !839, !159, !832}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!840 = !DISubprogram(name: "Functor", scope: !827, file: !828, line: 46, type: !841, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !839, !843}
!843 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!844 = !DISubprogram(name: "Functor", scope: !827, file: !828, line: 49, type: !845, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !839}
!847 = !DISubprogram(name: "operator()", linkageName: "_ZNK7FunctorIvJRfS0_S0_EEclES0_S0_S0_", scope: !827, file: !828, line: 53, type: !848, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !850, !835, !835, !835}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!852 = !DISubprogram(name: "operator==", linkageName: "_ZN7FunctorIvJRfS0_S0_EEeqERKS1_", scope: !827, file: !828, line: 60, type: !853, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!138, !839, !855}
!855 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !851, size: 64)
!856 = !DISubprogram(name: "operator bool", linkageName: "_ZNK7FunctorIvJRfS0_S0_EEcvbEv", scope: !827, file: !828, line: 66, type: !857, scopeLine: 66, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{!138, !850}
!859 = !{!860, !861}
!860 = !DITemplateTypeParameter(name: "RetType", type: null)
!861 = !DITemplateValueParameter(tag: DW_TAG_GNU_template_parameter_pack, name: "Args", value: !862)
!862 = !{!863, !863, !863}
!863 = !DITemplateTypeParameter(type: !835)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_last_gyro_rate", scope: !118, file: !119, line: 60, baseType: !865, size: 96, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "Vector3f", file: !866, line: 218, baseType: !867)
!866 = !DIFile(filename: "ardupilot/libraries/AP_Math/vector3.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "29233b5c46fd321fe8809e56c85d2bd8")
!867 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Vector3<float>", file: !866, line: 64, size: 96, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !868, templateParams: !951, identifier: "_ZTS7Vector3IfE")
!868 = !{!869, !870, !871, !872, !876, !880, !881, !887, !888, !891, !894, !895, !898, !899, !903, !904, !907, !908, !911, !915, !918, !925, !928, !929, !930, !933, !934, !935, !938, !939, !942, !943, !944, !945, !946, !949, !950}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !867, file: !866, line: 68, baseType: !819, size: 32, flags: DIFlagPublic)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !867, file: !866, line: 68, baseType: !819, size: 32, offset: 32, flags: DIFlagPublic)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !867, file: !866, line: 68, baseType: !819, size: 32, offset: 64, flags: DIFlagPublic)
!872 = !DISubprogram(name: "Vector3", scope: !867, file: !866, line: 71, type: !873, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !875}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!876 = !DISubprogram(name: "Vector3", scope: !867, file: !866, line: 76, type: !877, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !875, !879, !879, !879}
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!880 = !DISubprogram(name: "operator()", linkageName: "_ZN7Vector3IfEclEfff", scope: !867, file: !866, line: 80, type: !877, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!881 = !DISubprogram(name: "operator==", linkageName: "_ZNK7Vector3IfEeqERKS0_", scope: !867, file: !866, line: 86, type: !882, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!882 = !DISubroutineType(types: !883)
!883 = !{!138, !884, !886}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!886 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !885, size: 64)
!887 = !DISubprogram(name: "operator!=", linkageName: "_ZNK7Vector3IfEneERKS0_", scope: !867, file: !866, line: 89, type: !882, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!888 = !DISubprogram(name: "operator-", linkageName: "_ZNK7Vector3IfEngEv", scope: !867, file: !866, line: 92, type: !889, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!889 = !DISubroutineType(types: !890)
!890 = !{!867, !884}
!891 = !DISubprogram(name: "operator+", linkageName: "_ZNK7Vector3IfEplERKS0_", scope: !867, file: !866, line: 95, type: !892, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!892 = !DISubroutineType(types: !893)
!893 = !{!867, !884, !886}
!894 = !DISubprogram(name: "operator-", linkageName: "_ZNK7Vector3IfEmiERKS0_", scope: !867, file: !866, line: 98, type: !892, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!895 = !DISubprogram(name: "operator*", linkageName: "_ZNK7Vector3IfEmlEf", scope: !867, file: !866, line: 101, type: !896, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!896 = !DISubroutineType(types: !897)
!897 = !{!867, !884, !879}
!898 = !DISubprogram(name: "operator/", linkageName: "_ZNK7Vector3IfEdvEf", scope: !867, file: !866, line: 104, type: !896, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!899 = !DISubprogram(name: "operator+=", linkageName: "_ZN7Vector3IfEpLERKS0_", scope: !867, file: !866, line: 107, type: !900, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!900 = !DISubroutineType(types: !901)
!901 = !{!902, !875, !886}
!902 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !867, size: 64)
!903 = !DISubprogram(name: "operator-=", linkageName: "_ZN7Vector3IfEmIERKS0_", scope: !867, file: !866, line: 110, type: !900, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!904 = !DISubprogram(name: "operator*=", linkageName: "_ZN7Vector3IfEmLEf", scope: !867, file: !866, line: 113, type: !905, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!905 = !DISubroutineType(types: !906)
!906 = !{!902, !875, !879}
!907 = !DISubprogram(name: "operator/=", linkageName: "_ZN7Vector3IfEdVEf", scope: !867, file: !866, line: 116, type: !905, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!908 = !DISubprogram(name: "operator[]", linkageName: "_ZN7Vector3IfEixEh", scope: !867, file: !866, line: 119, type: !909, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!909 = !DISubroutineType(types: !910)
!910 = !{!835, !875, !735}
!911 = !DISubprogram(name: "operator[]", linkageName: "_ZNK7Vector3IfEixEh", scope: !867, file: !866, line: 127, type: !912, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!912 = !DISubroutineType(types: !913)
!913 = !{!914, !884, !735}
!914 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !879, size: 64)
!915 = !DISubprogram(name: "operator*", linkageName: "_ZNK7Vector3IfEmlERKS0_", scope: !867, file: !866, line: 136, type: !916, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!916 = !DISubroutineType(types: !917)
!917 = !{!819, !884, !886}
!918 = !DISubprogram(name: "operator*", linkageName: "_ZNK7Vector3IfEmlERK7Matrix3IfE", scope: !867, file: !866, line: 139, type: !919, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!919 = !DISubroutineType(types: !920)
!920 = !{!867, !884, !921}
!921 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = !DICompositeType(tag: DW_TAG_class_type, name: "Matrix3<float>", file: !924, line: 45, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS7Matrix3IfE")
!924 = !DIFile(filename: "ardupilot/libraries/AP_Math/matrix3.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "8c023c39d650bc76ff484f39d0e25f8b")
!925 = !DISubprogram(name: "mul_rowcol", linkageName: "_ZNK7Vector3IfE10mul_rowcolERKS0_", scope: !867, file: !866, line: 142, type: !926, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!926 = !DISubroutineType(types: !927)
!927 = !{!923, !884, !886}
!928 = !DISubprogram(name: "operator%", linkageName: "_ZNK7Vector3IfErmERKS0_", scope: !867, file: !866, line: 145, type: !892, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!929 = !DISubprogram(name: "angle", linkageName: "_ZNK7Vector3IfE5angleERKS0_", scope: !867, file: !866, line: 148, type: !916, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!930 = !DISubprogram(name: "is_nan", linkageName: "_ZNK7Vector3IfE6is_nanEv", scope: !867, file: !866, line: 151, type: !931, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!931 = !DISubroutineType(types: !932)
!932 = !{!138, !884}
!933 = !DISubprogram(name: "is_inf", linkageName: "_ZNK7Vector3IfE6is_infEv", scope: !867, file: !866, line: 154, type: !931, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!934 = !DISubprogram(name: "is_zero", linkageName: "_ZNK7Vector3IfE7is_zeroEv", scope: !867, file: !866, line: 157, type: !931, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!935 = !DISubprogram(name: "rotate", linkageName: "_ZN7Vector3IfE6rotateE8Rotation", scope: !867, file: !866, line: 161, type: !936, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !875, !71}
!938 = !DISubprogram(name: "rotate_inverse", linkageName: "_ZN7Vector3IfE14rotate_inverseE8Rotation", scope: !867, file: !866, line: 162, type: !936, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!939 = !DISubprogram(name: "length_squared", linkageName: "_ZNK7Vector3IfE14length_squaredEv", scope: !867, file: !866, line: 165, type: !940, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!940 = !DISubroutineType(types: !941)
!941 = !{!819, !884}
!942 = !DISubprogram(name: "length", linkageName: "_ZNK7Vector3IfE6lengthEv", scope: !867, file: !866, line: 171, type: !940, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!943 = !DISubprogram(name: "normalize", linkageName: "_ZN7Vector3IfE9normalizeEv", scope: !867, file: !866, line: 174, type: !873, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!944 = !DISubprogram(name: "zero", linkageName: "_ZN7Vector3IfE4zeroEv", scope: !867, file: !866, line: 180, type: !873, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!945 = !DISubprogram(name: "normalized", linkageName: "_ZNK7Vector3IfE10normalizedEv", scope: !867, file: !866, line: 186, type: !889, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!946 = !DISubprogram(name: "reflect", linkageName: "_ZN7Vector3IfE7reflectERKS0_", scope: !867, file: !866, line: 192, type: !947, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !875, !886}
!949 = !DISubprogram(name: "project", linkageName: "_ZN7Vector3IfE7projectERKS0_", scope: !867, file: !866, line: 200, type: !947, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!950 = !DISubprogram(name: "projected", linkageName: "_ZNK7Vector3IfE9projectedERKS0_", scope: !867, file: !866, line: 206, type: !892, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!951 = !{!952}
!952 = !DITemplateTypeParameter(name: "T", type: !819)
!953 = !DISubprogram(name: "init", linkageName: "_ZN5Linux19OpticalFlow_Onboard4initE7FunctorIvJRfS2_S2_EE", scope: !118, file: !119, line: 29, type: !954, scopeLine: 29, containingType: !118, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !956, !826}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!957 = !DISubprogram(name: "read", linkageName: "_ZN5Linux19OpticalFlow_Onboard4readERN6AP_HAL11OpticalFlow10Data_FrameE", scope: !118, file: !119, line: 30, type: !958, scopeLine: 30, containingType: !118, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!958 = !DISubroutineType(types: !959)
!959 = !{!138, !956, !960}
!960 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Data_Frame", scope: !123, file: !124, line: 19, size: 192, flags: DIFlagPublic | DIFlagTypePassByValue, elements: !962, identifier: "_ZTSN6AP_HAL11OpticalFlow10Data_FrameE")
!962 = !{!963, !964, !965, !966, !967, !968}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_flow_x_integral", scope: !961, file: !124, line: 21, baseType: !819, size: 32, flags: DIFlagPublic)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_flow_y_integral", scope: !961, file: !124, line: 22, baseType: !819, size: 32, offset: 32, flags: DIFlagPublic)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gyro_x_integral", scope: !961, file: !124, line: 23, baseType: !819, size: 32, offset: 64, flags: DIFlagPublic)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "gyro_y_integral", scope: !961, file: !124, line: 24, baseType: !819, size: 32, offset: 96, flags: DIFlagPublic)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "delta_time", scope: !961, file: !124, line: 25, baseType: !140, size: 32, offset: 128, flags: DIFlagPublic)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !961, file: !124, line: 26, baseType: !735, size: 8, offset: 160, flags: DIFlagPublic)
!969 = !DISubprogram(name: "_run_optflow", linkageName: "_ZN5Linux19OpticalFlow_Onboard12_run_optflowEv", scope: !118, file: !119, line: 33, type: !970, scopeLine: 33, flags: DIFlagPrototyped, spFlags: 0)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !956}
