; ModuleID = '/home/raj/ardupilot/libraries/AP_HAL_Linux/RCOutput_Bebop.cpp'
source_filename = "/home/raj/ardupilot/libraries/AP_HAL_Linux/RCOutput_Bebop.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sched_param = type { i32 }
%"class.Linux::RCOutput_Bebop" = type { %"class.AP_HAL::RCOutput", ptr, [4 x i16], [4 x i16], [4 x i16], i16, i16, i16, i8, i8, i16, i64, %union.pthread_mutex_t, %union.pthread_cond_t }
%"class.AP_HAL::RCOutput" = type { ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.__atomic_wide_counter = type { i64 }
%"class.AP_HAL::HAL" = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.bldc_ref_speed_data = type <{ i8, [4 x i16], i8, i8 }>
%struct.bldc_obs_data = type <{ [4 x i16], i16, i8, i8, i8, i8, i8 }>
%class.BebopBLDC_ObsData = type { [4 x i16], [4 x i8], i16, i8, i8, i8, i8 }
%union.pthread_attr_t = type { i64, [48 x i8] }
%union.pthread_condattr_t = type { i32 }
%struct.timespec = type { i64, i64 }

!58 = !DISubroutineType(types: !59)
!59 = !{!54, !46, !60}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !51, line: 24, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !53, line: 38, baseType: !62)
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DISubprogram(name: "enable_ch", linkageName: "_ZN6AP_HAL8RCOutput9enable_chEh", scope: !34, file: !33, line: 41, type: !64, scopeLine: 41, containingType: !34, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !46, !60}
!66 = !DISubprogram(name: "disable_ch", linkageName: "_ZN6AP_HAL8RCOutput10disable_chEh", scope: !34, file: !33, line: 42, type: !64, scopeLine: 42, containingType: !34, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!67 = !DISubprogram(name: "write", linkageName: "_ZN6AP_HAL8RCOutput5writeEht", scope: !34, file: !33, line: 48, type: !68, scopeLine: 48, containingType: !34, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !46, !60, !54}
!70 = !DISubprogram(name: "cork", linkageName: "_ZN6AP_HAL8RCOutput4corkEv", scope: !34, file: !33, line: 58, type: !44, scopeLine: 58, containingType: !34, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!71 = !DISubprogram(name: "push", linkageName: "_ZN6AP_HAL8RCOutput4pushEv", scope: !34, file: !33, line: 67, type: !44, scopeLine: 67, containingType: !34, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!72 = !DISubprogram(name: "read", linkageName: "_ZN6AP_HAL8RCOutput4readEh", scope: !34, file: !33, line: 73, type: !58, scopeLine: 73, containingType: !34, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!73 = !DISubprogram(name: "read", linkageName: "_ZN6AP_HAL8RCOutput4readEPth", scope: !34, file: !33, line: 74, type: !74, scopeLine: 74, containingType: !34, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !46, !76, !60}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!77 = !DISubprogram(name: "read_last_sent", linkageName: "_ZN6AP_HAL8RCOutput14read_last_sentEh", scope: !34, file: !33, line: 77, type: !58, scopeLine: 77, containingType: !34, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!78 = !DISubprogram(name: "read_last_sent", linkageName: "_ZN6AP_HAL8RCOutput14read_last_sentEPth", scope: !34, file: !33, line: 78, type: !74, scopeLine: 78, containingType: !34, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!79 = !DISubprogram(name: "set_safety_pwm", linkageName: "_ZN6AP_HAL8RCOutput14set_safety_pwmEjt", scope: !34, file: !33, line: 84, type: !48, scopeLine: 84, containingType: !34, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!80 = !DISubprogram(name: "set_failsafe_pwm", linkageName: "_ZN6AP_HAL8RCOutput16set_failsafe_pwmEjt", scope: !34, file: !33, line: 89, type: !48, scopeLine: 89, containingType: !34, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!81 = !DISubprogram(name: "force_safety_on", linkageName: "_ZN6AP_HAL8RCOutput15force_safety_onEv", scope: !34, file: !33, line: 96, type: !82, scopeLine: 96, containingType: !34, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !46}
!84 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!85 = !DISubprogram(name: "force_safety_off", linkageName: "_ZN6AP_HAL8RCOutput16force_safety_offEv", scope: !34, file: !33, line: 101, type: !44, scopeLine: 101, containingType: !34, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!86 = !DISubprogram(name: "set_esc_scaling", linkageName: "_ZN6AP_HAL8RCOutput15set_esc_scalingEtt", scope: !34, file: !33, line: 109, type: !87, scopeLine: 109, containingType: !34, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !46, !54, !54}
!89 = !DISubprogram(name: "enable_sbus_out", linkageName: "_ZN6AP_HAL8RCOutput15enable_sbus_outEt", scope: !34, file: !33, line: 114, type: !90, scopeLine: 114, containingType: !34, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!90 = !DISubroutineType(types: !91)
!91 = !{!84, !46, !54}
!92 = !DISubprogram(name: "set_output_mode", linkageName: "_ZN6AP_HAL8RCOutput15set_output_modeENS0_11output_modeE", scope: !34, file: !33, line: 123, type: !93, scopeLine: 123, containingType: !34, virtualIndex: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !46, !32}
!95 = !{!96, !97}
!96 = !DIEnumerator(name: "MODE_PWM_NORMAL", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "MODE_PWM_ONESHOT", value: 1, isUnsigned: true)
!98 = !{!99, !54, !100, !55, !268}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RCOutput_Bebop", scope: !102, file: !12, line: 60, size: 1216, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !103, vtableHolder: !34)
!102 = !DINamespace(name: "Linux", scope: null)
!103 = !{!104, !105, !109, !113, !114, !115, !116, !117, !118, !119, !120, !121, !125, !156, !190, !194, !198, !199, !202, !205, !208, !209, !212, !213, !214, !215, !218, !221, !235, !238, !239, !240, !243, !257, !258, !259, !260, !263, !264}
!104 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !101, baseType: !34, flags: DIFlagPublic, extraData: i32 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_i2c_sem", scope: !101, file: !12, line: 82, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_class_type, name: "Semaphore", scope: !35, file: !108, line: 7, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6AP_HAL9SemaphoreE")
!108 = !DIFile(filename: "ardupilot/libraries/AP_HAL/Semaphores.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "adfc5c77867951e90e4bb54608b881db")
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_request_period_us", scope: !101, file: !12, line: 83, baseType: !110, size: 64, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 4)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_period_us", scope: !101, file: !12, line: 84, baseType: !110, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_rpm", scope: !101, file: !12, line: 85, baseType: !110, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_frequency", scope: !101, file: !12, line: 86, baseType: !54, size: 16, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_min_pwm", scope: !101, file: !12, line: 87, baseType: !54, size: 16, offset: 336)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_max_pwm", scope: !101, file: !12, line: 88, baseType: !54, size: 16, offset: 352)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_state", scope: !101, file: !12, line: 89, baseType: !60, size: 8, offset: 368)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_corking", scope: !101, file: !12, line: 90, baseType: !84, size: 8, offset: 376)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_max_rpm", scope: !101, file: !12, line: 91, baseType: !54, size: 16, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_thread", scope: !101, file: !12, line: 104, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !123, line: 27, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!124 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mutex", scope: !101, file: !12, line: 105, baseType: !126, size: 320, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !123, line: 72, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 67, size: 320, flags: DIFlagTypePassByValue, elements: !128, identifier: "_ZTS15pthread_mutex_t")
!128 = !{!129, !149, !154}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !127, file: !123, line: 69, baseType: !130, size: 320)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !131, line: 22, size: 320, flags: DIFlagTypePassByValue, elements: !132, identifier: "_ZTS17__pthread_mutex_s")
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!132 = !{!133, !134, !135, !136, !137, !138, !140, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !130, file: !131, line: 24, baseType: !42, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !130, file: !131, line: 25, baseType: !7, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !130, file: !131, line: 26, baseType: !42, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !130, file: !131, line: 28, baseType: !7, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !130, file: !131, line: 32, baseType: !42, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !130, file: !131, line: 34, baseType: !139, size: 16, offset: 160)
!139 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !130, file: !131, line: 35, baseType: !139, size: 16, offset: 176)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !130, file: !131, line: 36, baseType: !142, size: 128, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !143, line: 55, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !143, line: 51, size: 128, flags: DIFlagTypePassByValue, elements: !145, identifier: "_ZTS23__pthread_internal_list")
!145 = !{!146, !148}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !144, file: !143, line: 53, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !144, file: !143, line: 54, baseType: !147, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !127, file: !123, line: 70, baseType: !150, size: 320)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 320, elements: !152)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !{!153}
!153 = !DISubrange(count: 40)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !127, file: !123, line: 71, baseType: !155, size: 64)
!155 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_cond", scope: !101, file: !12, line: 106, baseType: !157, size: 384, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !123, line: 80, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 75, size: 384, flags: DIFlagTypePassByValue, elements: !159, identifier: "_ZTS14pthread_cond_t")
!159 = !{!160, !184, !188}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !158, file: !123, line: 77, baseType: !161, size: 384)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !143, line: 94, size: 384, flags: DIFlagTypePassByValue, elements: !162, identifier: "_ZTS16__pthread_cond_s")
!162 = !{!163, !175, !176, !180, !181, !182, !183}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !161, file: !143, line: 96, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !165, line: 33, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !165, line: 25, size: 64, flags: DIFlagTypePassByValue, elements: !167, identifier: "_ZTS21__atomic_wide_counter")
!167 = !{!168, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !166, file: !165, line: 27, baseType: !169, size: 64)
!169 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !166, file: !165, line: 32, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !165, line: 28, size: 64, flags: DIFlagTypePassByValue, elements: !172, identifier: "_ZTSN21__atomic_wide_counterUt_E")
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !171, file: !165, line: 30, baseType: !7, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !171, file: !165, line: 31, baseType: !7, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !161, file: !143, line: 97, baseType: !164, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !161, file: !143, line: 98, baseType: !177, size: 64, offset: 128)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 2)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !161, file: !143, line: 99, baseType: !177, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !161, file: !143, line: 100, baseType: !7, size: 32, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !161, file: !143, line: 101, baseType: !7, size: 32, offset: 288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !161, file: !143, line: 102, baseType: !177, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !158, file: !123, line: 78, baseType: !185, size: 384)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 384, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !158, file: !123, line: 79, baseType: !189, size: 64)
!189 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!190 = !DISubprogram(name: "RCOutput_Bebop", scope: !101, file: !12, line: 62, type: !191, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!194 = !DISubprogram(name: "from", linkageName: "_ZN5Linux14RCOutput_Bebop4fromEPN6AP_HAL8RCOutputE", scope: !101, file: !12, line: 64, type: !195, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!195 = !DISubroutineType(types: !196)
!196 = !{!100, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!198 = !DISubprogram(name: "init", linkageName: "_ZN5Linux14RCOutput_Bebop4initEv", scope: !101, file: !12, line: 68, type: !191, scopeLine: 68, containingType: !101, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!199 = !DISubprogram(name: "set_freq", linkageName: "_ZN5Linux14RCOutput_Bebop8set_freqEjt", scope: !101, file: !12, line: 69, type: !200, scopeLine: 69, containingType: !101, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !193, !50, !54}
!202 = !DISubprogram(name: "get_freq", linkageName: "_ZN5Linux14RCOutput_Bebop8get_freqEh", scope: !101, file: !12, line: 70, type: !203, scopeLine: 70, containingType: !101, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!203 = !DISubroutineType(types: !204)
!204 = !{!54, !193, !60}
!205 = !DISubprogram(name: "enable_ch", linkageName: "_ZN5Linux14RCOutput_Bebop9enable_chEh", scope: !101, file: !12, line: 71, type: !206, scopeLine: 71, containingType: !101, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !193, !60}
!208 = !DISubprogram(name: "disable_ch", linkageName: "_ZN5Linux14RCOutput_Bebop10disable_chEh", scope: !101, file: !12, line: 72, type: !206, scopeLine: 72, containingType: !101, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!209 = !DISubprogram(name: "write", linkageName: "_ZN5Linux14RCOutput_Bebop5writeEht", scope: !101, file: !12, line: 73, type: !210, scopeLine: 73, containingType: !101, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !193, !60, !54}
!212 = !DISubprogram(name: "cork", linkageName: "_ZN5Linux14RCOutput_Bebop4corkEv", scope: !101, file: !12, line: 74, type: !191, scopeLine: 74, containingType: !101, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!213 = !DISubprogram(name: "push", linkageName: "_ZN5Linux14RCOutput_Bebop4pushEv", scope: !101, file: !12, line: 75, type: !191, scopeLine: 75, containingType: !101, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!214 = !DISubprogram(name: "read", linkageName: "_ZN5Linux14RCOutput_Bebop4readEh", scope: !101, file: !12, line: 76, type: !203, scopeLine: 76, containingType: !101, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!215 = !DISubprogram(name: "read", linkageName: "_ZN5Linux14RCOutput_Bebop4readEPth", scope: !101, file: !12, line: 77, type: !216, scopeLine: 77, containingType: !101, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !193, !76, !60}
!218 = !DISubprogram(name: "set_esc_scaling", linkageName: "_ZN5Linux14RCOutput_Bebop15set_esc_scalingEtt", scope: !101, file: !12, line: 78, type: !219, scopeLine: 78, containingType: !101, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !193, !54, !54}
!221 = !DISubprogram(name: "read_obs_data", linkageName: "_ZN5Linux14RCOutput_Bebop13read_obs_dataER17BebopBLDC_ObsData", scope: !101, file: !12, line: 79, type: !222, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!222 = !DISubroutineType(types: !223)
!223 = !{!42, !193, !224}
!224 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BebopBLDC_ObsData", file: !12, line: 38, size: 144, flags: DIFlagTypePassByValue, elements: !226, identifier: "_ZTS17BebopBLDC_ObsData")
!226 = !{!227, !228, !230, !231, !232, !233, !234}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "rpm", scope: !225, file: !12, line: 40, baseType: !110, size: 64, flags: DIFlagPublic)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rpm_saturated", scope: !225, file: !12, line: 41, baseType: !229, size: 32, offset: 64, flags: DIFlagPublic)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !111)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "batt_mv", scope: !225, file: !12, line: 42, baseType: !54, size: 16, offset: 96, flags: DIFlagPublic)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !225, file: !12, line: 43, baseType: !60, size: 8, offset: 112, flags: DIFlagPublic)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !225, file: !12, line: 44, baseType: !60, size: 8, offset: 120, flags: DIFlagPublic)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "motors_err", scope: !225, file: !12, line: 45, baseType: !60, size: 8, offset: 128, flags: DIFlagPublic)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "temperature", scope: !225, file: !12, line: 46, baseType: !60, size: 8, offset: 136, flags: DIFlagPublic)
!235 = !DISubprogram(name: "_checksum", linkageName: "_ZN5Linux14RCOutput_Bebop9_checksumEPhj", scope: !101, file: !12, line: 93, type: !236, scopeLine: 93, flags: DIFlagPrototyped, spFlags: 0)
!236 = !DISubroutineType(types: !237)
!237 = !{!60, !193, !99, !7}
!238 = !DISubprogram(name: "_start_prop", linkageName: "_ZN5Linux14RCOutput_Bebop11_start_propEv", scope: !101, file: !12, line: 94, type: !191, scopeLine: 94, flags: DIFlagPrototyped, spFlags: 0)
!239 = !DISubprogram(name: "_toggle_gpio", linkageName: "_ZN5Linux14RCOutput_Bebop12_toggle_gpioEh", scope: !101, file: !12, line: 95, type: !206, scopeLine: 95, flags: DIFlagPrototyped, spFlags: 0)
!240 = !DISubprogram(name: "_set_ref_speed", linkageName: "_ZN5Linux14RCOutput_Bebop14_set_ref_speedEPt", scope: !101, file: !12, line: 96, type: !241, scopeLine: 96, flags: DIFlagPrototyped, spFlags: 0)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !193, !76}
!243 = !DISubprogram(name: "_get_info", linkageName: "_ZN5Linux14RCOutput_Bebop9_get_infoEP9bldc_info", scope: !101, file: !12, line: 97, type: !244, scopeLine: 97, flags: DIFlagPrototyped, spFlags: 0)
!244 = !DISubroutineType(types: !245)
!245 = !{!84, !193, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bldc_info", file: !12, line: 49, size: 104, flags: DIFlagTypePassByValue, elements: !248, identifier: "_ZTS9bldc_info")
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "version_maj", scope: !247, file: !12, line: 50, baseType: !60, size: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "version_min", scope: !247, file: !12, line: 51, baseType: !60, size: 8, offset: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !247, file: !12, line: 52, baseType: !60, size: 8, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "n_motors", scope: !247, file: !12, line: 53, baseType: !60, size: 8, offset: 24)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "n_flights", scope: !247, file: !12, line: 54, baseType: !54, size: 16, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "last_flight_time", scope: !247, file: !12, line: 55, baseType: !54, size: 16, offset: 48)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "total_flight_time", scope: !247, file: !12, line: 56, baseType: !50, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !247, file: !12, line: 57, baseType: !60, size: 8, offset: 96)
!257 = !DISubprogram(name: "_stop_prop", linkageName: "_ZN5Linux14RCOutput_Bebop10_stop_propEv", scope: !101, file: !12, line: 98, type: !191, scopeLine: 98, flags: DIFlagPrototyped, spFlags: 0)
!258 = !DISubprogram(name: "_clear_error", linkageName: "_ZN5Linux14RCOutput_Bebop12_clear_errorEv", scope: !101, file: !12, line: 99, type: !191, scopeLine: 99, flags: DIFlagPrototyped, spFlags: 0)
!259 = !DISubprogram(name: "_play_sound", linkageName: "_ZN5Linux14RCOutput_Bebop11_play_soundEh", scope: !101, file: !12, line: 100, type: !206, scopeLine: 100, flags: DIFlagPrototyped, spFlags: 0)
!260 = !DISubprogram(name: "_period_us_to_rpm", linkageName: "_ZN5Linux14RCOutput_Bebop17_period_us_to_rpmEt", scope: !101, file: !12, line: 101, type: !261, scopeLine: 101, flags: DIFlagPrototyped, spFlags: 0)
!261 = !DISubroutineType(types: !262)
!262 = !{!54, !193, !54}
!263 = !DISubprogram(name: "_run_rcout", linkageName: "_ZN5Linux14RCOutput_Bebop10_run_rcoutEv", scope: !101, file: !12, line: 107, type: !191, scopeLine: 107, flags: DIFlagPrototyped, spFlags: 0)
!264 = !DISubprogram(name: "_control_thread", linkageName: "_ZN5Linux14RCOutput_Bebop15_control_threadEPv", scope: !101, file: !12, line: 108, type: !265, scopeLine: 108, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_class_type, name: "Util", scope: !102, file: !25, line: 18, size: 512, flags: DIFlagFwdDecl | DIFlagNonTrivial)
!270 = !{!0, !271, !277, !282, !287, !289, !291, !296, !301, !306}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !6, line: 161, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 328, elements: !275)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!275 = !{!276}
!276 = !DISubrange(count: 41)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !6, line: 246, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 272, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 34)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !6, line: 253, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 280, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 35)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !6, line: 264, type: !279, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !6, line: 270, type: !279, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !6, line: 278, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 304, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 38)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !6, line: 381, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 192, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 24)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !6, line: 411, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 224, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 28)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !6, line: 413, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 208, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 26)
!311 = !{!312, !318, !324, !328, !334, !338, !344, !349, !351, !357, !361, !365, !375, !377, !381, !385, !389, !394, !398, !402, !406, !410, !418, !422, !426, !428, !430, !434, !438, !444, !448, !452, !454, !462, !466, !473, !475, !479, !483, !487, !491, !495, !500, !505, !506, !507, !508, !510, !511, !512, !513, !514, !515, !516, !518, !519, !520, !521, !522, !523, !524, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !314, file: !317, line: 58)
!313 = !DINamespace(name: "std", scope: null)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !315, line: 24, baseType: !316)
!315 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/__stddef_max_align_t.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "48e8e2456f77e6cda35d245130fa7259")
!316 = !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 19, size: 256, flags: DIFlagFwdDecl, identifier: "_ZTS11max_align_t")
!317 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/cstddef", directory: "")
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !319, file: !323, line: 52)
!319 = !DISubprogram(name: "abs", scope: !320, file: !320, line: 848, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!320 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!321 = !DISubroutineType(types: !322)
!322 = !{!42, !42}
!323 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/std_abs.h", directory: "")
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !325, file: !327, line: 127)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !320, line: 63, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 59, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!327 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/cstdlib", directory: "")
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !329, file: !327, line: 128)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !320, line: 71, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 67, size: 128, flags: DIFlagTypePassByValue, elements: !331, identifier: "_ZTS6ldiv_t")
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !330, file: !320, line: 69, baseType: !155, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !330, file: !320, line: 70, baseType: !155, size: 64, offset: 64)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !335, file: !327, line: 130)
!335 = !DISubprogram(name: "abort", scope: !320, file: !320, line: 598, type: !336, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !339, file: !327, line: 132)
!339 = !DISubprogram(name: "aligned_alloc", scope: !320, file: !320, line: 592, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DISubroutineType(types: !341)
!341 = !{!267, !342, !342}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !343, line: 46, baseType: !124)
!343 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !345, file: !327, line: 134)
!345 = !DISubprogram(name: "atexit", scope: !320, file: !320, line: 602, type: !346, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DISubroutineType(types: !347)
!347 = !{!42, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !350, file: !327, line: 137)
!350 = !DISubprogram(name: "at_quick_exit", scope: !320, file: !320, line: 607, type: !346, flags: DIFlagPrototyped, spFlags: 0)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !352, file: !327, line: 140)
!352 = !DISubprogram(name: "atof", scope: !320, file: !320, line: 102, type: !353, flags: DIFlagPrototyped, spFlags: 0)
!353 = !DISubroutineType(types: !354)
!354 = !{!355, !356}
!355 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !358, file: !327, line: 141)
!358 = !DISubprogram(name: "atoi", scope: !320, file: !320, line: 105, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!359 = !DISubroutineType(types: !360)
!360 = !{!42, !356}
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !362, file: !327, line: 142)
!362 = !DISubprogram(name: "atol", scope: !320, file: !320, line: 108, type: !363, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{!155, !356}
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !366, file: !327, line: 143)
!366 = !DISubprogram(name: "bsearch", scope: !320, file: !320, line: 828, type: !367, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!267, !369, !369, !342, !342, !371}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !320, line: 816, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!42, !369, !369}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !376, file: !327, line: 144)
!376 = !DISubprogram(name: "calloc", scope: !320, file: !320, line: 543, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !378, file: !327, line: 145)
!378 = !DISubprogram(name: "div", scope: !320, file: !320, line: 860, type: !379, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DISubroutineType(types: !380)
!380 = !{!325, !42, !42}
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !382, file: !327, line: 146)
!382 = !DISubprogram(name: "exit", scope: !320, file: !320, line: 624, type: !383, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !42}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !386, file: !327, line: 147)
!386 = !DISubprogram(name: "free", scope: !320, file: !320, line: 555, type: !387, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !267}
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !390, file: !327, line: 148)
!390 = !DISubprogram(name: "getenv", scope: !320, file: !320, line: 641, type: !391, flags: DIFlagPrototyped, spFlags: 0)
!391 = !DISubroutineType(types: !392)
!392 = !{!393, !356}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !395, file: !327, line: 149)
!395 = !DISubprogram(name: "labs", scope: !320, file: !320, line: 849, type: !396, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DISubroutineType(types: !397)
!397 = !{!155, !155}
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !399, file: !327, line: 150)
!399 = !DISubprogram(name: "ldiv", scope: !320, file: !320, line: 862, type: !400, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DISubroutineType(types: !401)
!401 = !{!329, !155, !155}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !403, file: !327, line: 151)
!403 = !DISubprogram(name: "malloc", scope: !320, file: !320, line: 540, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DISubroutineType(types: !405)
!405 = !{!267, !342}
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !407, file: !327, line: 153)
!407 = !DISubprogram(name: "mblen", scope: !320, file: !320, line: 930, type: !408, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{!42, !356, !342}
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !411, file: !327, line: 154)
!411 = !DISubprogram(name: "mbstowcs", scope: !320, file: !320, line: 941, type: !412, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DISubroutineType(types: !413)
!413 = !{!342, !414, !417, !342}
!414 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!417 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !356)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !419, file: !327, line: 155)
!419 = !DISubprogram(name: "mbtowc", scope: !320, file: !320, line: 933, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DISubroutineType(types: !421)
!421 = !{!42, !414, !417, !342}
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !423, file: !327, line: 157)
!423 = !DISubprogram(name: "qsort", scope: !320, file: !320, line: 838, type: !424, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !267, !342, !342, !371}
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !427, file: !327, line: 160)
!427 = !DISubprogram(name: "quick_exit", scope: !320, file: !320, line: 630, type: !383, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !429, file: !327, line: 163)
!429 = !DISubprogram(name: "rand", scope: !320, file: !320, line: 454, type: !40, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !431, file: !327, line: 164)
!431 = !DISubprogram(name: "realloc", scope: !320, file: !320, line: 551, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DISubroutineType(types: !433)
!433 = !{!267, !267, !342}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !435, file: !327, line: 165)
!435 = !DISubprogram(name: "srand", scope: !320, file: !320, line: 456, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !7}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !439, file: !327, line: 166)
!439 = !DISubprogram(name: "strtod", scope: !320, file: !320, line: 118, type: !440, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DISubroutineType(types: !441)
!441 = !{!355, !417, !442}
!442 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !445, file: !327, line: 167)
!445 = !DISubprogram(name: "strtol", scope: !320, file: !320, line: 177, type: !446, flags: DIFlagPrototyped, spFlags: 0)
!446 = !DISubroutineType(types: !447)
!447 = !{!155, !417, !442, !42}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !449, file: !327, line: 168)
!449 = !DISubprogram(name: "strtoul", scope: !320, file: !320, line: 181, type: !450, flags: DIFlagPrototyped, spFlags: 0)
!450 = !DISubroutineType(types: !451)
!451 = !{!124, !417, !442, !42}
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !453, file: !327, line: 169)
!453 = !DISubprogram(name: "system", scope: !320, file: !320, line: 791, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !455, file: !327, line: 171)
!455 = !DISubprogram(name: "wcstombs", scope: !320, file: !320, line: 945, type: !456, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{!342, !458, !459, !342}
!458 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !393)
!459 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !463, file: !327, line: 172)
!463 = !DISubprogram(name: "wctomb", scope: !320, file: !320, line: 937, type: !464, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DISubroutineType(types: !465)
!465 = !{!42, !393, !416}
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !468, file: !327, line: 200)
!467 = !DINamespace(name: "__gnu_cxx", scope: null)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !320, line: 81, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 77, size: 128, flags: DIFlagTypePassByValue, elements: !470, identifier: "_ZTS7lldiv_t")
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !469, file: !320, line: 79, baseType: !189, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !469, file: !320, line: 80, baseType: !189, size: 64, offset: 64)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !474, file: !327, line: 206)
!474 = !DISubprogram(name: "_Exit", scope: !320, file: !320, line: 636, type: !383, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !476, file: !327, line: 210)
!476 = !DISubprogram(name: "llabs", scope: !320, file: !320, line: 852, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{!189, !189}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !480, file: !327, line: 216)
!480 = !DISubprogram(name: "lldiv", scope: !320, file: !320, line: 866, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{!468, !189, !189}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !484, file: !327, line: 227)
!484 = !DISubprogram(name: "atoll", scope: !320, file: !320, line: 113, type: !485, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{!189, !356}
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !488, file: !327, line: 228)
!488 = !DISubprogram(name: "strtoll", scope: !320, file: !320, line: 201, type: !489, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DISubroutineType(types: !490)
!490 = !{!189, !417, !442, !42}
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !492, file: !327, line: 229)
!492 = !DISubprogram(name: "strtoull", scope: !320, file: !320, line: 206, type: !493, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DISubroutineType(types: !494)
!494 = !{!169, !417, !442, !42}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !496, file: !327, line: 231)
!496 = !DISubprogram(name: "strtof", scope: !320, file: !320, line: 124, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{!499, !417, !442}
!499 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !467, entity: !501, file: !327, line: 232)
!501 = !DISubprogram(name: "strtold", scope: !320, file: !320, line: 127, type: !502, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DISubroutineType(types: !503)
!503 = !{!504, !417, !442}
!504 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !468, file: !327, line: 240)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !474, file: !327, line: 242)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !476, file: !327, line: 244)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !509, file: !327, line: 245)
!509 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !467, file: !327, line: 213, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !480, file: !327, line: 246)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !484, file: !327, line: 248)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !496, file: !327, line: 249)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !488, file: !327, line: 250)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !492, file: !327, line: 251)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !313, entity: !501, file: !327, line: 252)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !335, file: !517, line: 38)
!517 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "0f5b773a303c24013fb112082e6d18a5")
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !345, file: !517, line: 39)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !382, file: !517, line: 40)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !350, file: !517, line: 43)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !427, file: !517, line: 46)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !517, line: 51)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !329, file: !517, line: 52)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !525, file: !517, line: 54)
!525 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !313, file: !323, line: 103, type: !526, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !528}
!528 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !352, file: !517, line: 55)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !358, file: !517, line: 56)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !362, file: !517, line: 57)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !366, file: !517, line: 58)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !376, file: !517, line: 59)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !509, file: !517, line: 60)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !386, file: !517, line: 61)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !390, file: !517, line: 62)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !395, file: !517, line: 63)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !399, file: !517, line: 64)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !403, file: !517, line: 65)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !407, file: !517, line: 67)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !411, file: !517, line: 68)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !419, file: !517, line: 69)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !423, file: !517, line: 71)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !429, file: !517, line: 72)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !431, file: !517, line: 73)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !435, file: !517, line: 74)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !439, file: !517, line: 75)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !445, file: !517, line: 76)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !449, file: !517, line: 77)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !453, file: !517, line: 78)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !455, file: !517, line: 80)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !463, file: !517, line: 81)
!553 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !102, file: !6, line: 71)
!554 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_class_type, name: "HAL", scope: !35, file: !557, line: 15, size: 1344, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN6AP_HAL3HALE")
!557 = !DIFile(filename: "ardupilot/libraries/AP_HAL/HAL.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "3f0a0f0e062a4283fcf90f261aa65082")
!558 = !{i32 7, !"Dwarf Version", i32 5}
!559 = !{i32 2, !"Debug Info Version", i32 3}
!560 = !{i32 1, !"wchar_size", i32 4}
!561 = !{i32 8, !"PIC Level", i32 2}
!562 = !{i32 7, !"PIE Level", i32 2}
!563 = !{i32 7, !"uwtable", i32 2}
!564 = !{i32 7, !"frame-pointer", i32 2}
!565 = !{!"clang version 16.0.0"}
!566 = distinct !DISubprogram(name: "__cxx_global_var_init", scope: !567, file: !567, type: !336, flags: DIFlagArtificial, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !568)
!567 = !DIFile(filename: "ardupilot/libraries/AP_HAL_Linux/RCOutput_Bebop.cpp", directory: "/home/raj")
!568 = !{}
!569 = !DILocation(line: 73, column: 33, scope: !570)
!570 = !DILexicalBlockFile(scope: !566, file: !6, discriminator: 0)
!571 = !DILocation(line: 0, scope: !566)
!572 = distinct !DISubprogram(name: "RCOutput_Bebop", linkageName: "_ZN5Linux14RCOutput_BebopC2Ev", scope: !101, file: !6, line: 75, type: !191, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !190, retainedNodes: !568)
!573 = !DILocalVariable(name: "this", arg: 1, scope: !572, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!574 = !DILocation(line: 0, scope: !572)
!575 = !DILocation(line: 75, column: 17, scope: !572)
!576 = !DILocation(line: 80, column: 1, scope: !572)
!577 = !DILocation(line: 76, column: 5, scope: !572)
!578 = !DILocation(line: 77, column: 5, scope: !572)
!579 = !DILocation(line: 78, column: 5, scope: !572)
!580 = !DILocation(line: 79, column: 5, scope: !572)
!581 = !DILocation(line: 90, column: 14, scope: !582)
!582 = !DILexicalBlockFile(scope: !572, file: !12, discriminator: 0)
!583 = !DILocation(line: 75, column: 17, scope: !584)
!584 = !DILexicalBlockFile(scope: !572, file: !6, discriminator: 0)
!585 = !DILocation(line: 81, column: 12, scope: !586)
!586 = distinct !DILexicalBlock(scope: !584, file: !6, line: 80, column: 1)
!587 = !DILocation(line: 81, column: 5, scope: !586)
!588 = !DILocation(line: 82, column: 12, scope: !586)
!589 = !DILocation(line: 82, column: 5, scope: !586)
!590 = !DILocation(line: 83, column: 12, scope: !586)
!591 = !DILocation(line: 83, column: 5, scope: !586)
!592 = !DILocation(line: 84, column: 1, scope: !584)
!593 = distinct !DISubprogram(name: "RCOutput", linkageName: "_ZN6AP_HAL8RCOutputC2Ev", scope: !34, file: !33, line: 31, type: !44, scopeLine: 31, flags: DIFlagArtificial | DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !594, retainedNodes: !568)
!594 = !DISubprogram(name: "RCOutput", scope: !34, type: !44, flags: DIFlagPublic | DIFlagArtificial | DIFlagPrototyped, spFlags: 0)
!595 = !DILocalVariable(name: "this", arg: 1, scope: !593, type: !197, flags: DIFlagArtificial | DIFlagObjectPointer)
!596 = !DILocation(line: 0, scope: !593)
!597 = !DILocation(line: 31, column: 15, scope: !593)
!598 = distinct !DISubprogram(name: "_checksum", linkageName: "_ZN5Linux14RCOutput_Bebop9_checksumEPhj", scope: !101, file: !6, line: 86, type: !236, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !235, retainedNodes: !568)
!599 = !DILocalVariable(name: "this", arg: 1, scope: !598, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!600 = !DILocation(line: 0, scope: !598)
!601 = !DILocalVariable(name: "data", arg: 2, scope: !598, file: !6, line: 86, type: !99)
!602 = !DILocation(line: 86, column: 44, scope: !598)
!603 = !DILocalVariable(name: "len", arg: 3, scope: !598, file: !6, line: 86, type: !7)
!604 = !DILocation(line: 86, column: 63, scope: !598)
!605 = !DILocalVariable(name: "checksum", scope: !598, file: !6, line: 88, type: !60)
!606 = !DILocation(line: 88, column: 13, scope: !598)
!607 = !DILocation(line: 88, column: 24, scope: !598)
!608 = !DILocalVariable(name: "i", scope: !598, file: !6, line: 89, type: !7)
!609 = !DILocation(line: 89, column: 18, scope: !598)
!610 = !DILocation(line: 91, column: 12, scope: !611)
!611 = distinct !DILexicalBlock(scope: !598, file: !6, line: 91, column: 5)
!612 = !DILocation(line: 91, column: 10, scope: !611)
!613 = !DILocation(line: 91, column: 17, scope: !614)
!614 = distinct !DILexicalBlock(scope: !611, file: !6, line: 91, column: 5)
!615 = !DILocation(line: 91, column: 21, scope: !614)
!616 = !DILocation(line: 91, column: 19, scope: !614)
!617 = !DILocation(line: 91, column: 5, scope: !611)
!618 = !DILocation(line: 92, column: 20, scope: !614)
!619 = !DILocation(line: 92, column: 31, scope: !614)
!620 = !DILocation(line: 92, column: 36, scope: !614)
!621 = !DILocation(line: 92, column: 29, scope: !614)
!622 = !DILocation(line: 92, column: 18, scope: !614)
!623 = !DILocation(line: 92, column: 9, scope: !614)
!624 = !DILocation(line: 91, column: 27, scope: !614)
!625 = !DILocation(line: 91, column: 5, scope: !614)
!626 = distinct !{!626, !617, !627, !628}
!627 = !DILocation(line: 92, column: 37, scope: !611)
!628 = !{!"llvm.loop.mustprogress"}
!629 = !DILocation(line: 94, column: 12, scope: !598)
!630 = !DILocation(line: 94, column: 5, scope: !598)
!631 = distinct !DISubprogram(name: "_start_prop", linkageName: "_ZN5Linux14RCOutput_Bebop11_start_propEv", scope: !101, file: !6, line: 97, type: !191, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !238, retainedNodes: !568)
!632 = !DILocalVariable(name: "this", arg: 1, scope: !631, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!633 = !DILocation(line: 0, scope: !631)
!634 = !DILocalVariable(name: "data", scope: !631, file: !6, line: 99, type: !60)
!635 = !DILocation(line: 99, column: 13, scope: !631)
!636 = !DILocation(line: 101, column: 10, scope: !637)
!637 = distinct !DILexicalBlock(scope: !631, file: !6, line: 101, column: 9)
!638 = !DILocation(line: 101, column: 20, scope: !637)
!639 = !DILocation(line: 101, column: 9, scope: !631)
!640 = !DILocation(line: 102, column: 9, scope: !637)
!641 = !DILocation(line: 104, column: 5, scope: !631)
!642 = !DILocation(line: 104, column: 9, scope: !631)
!643 = !DILocation(line: 104, column: 15, scope: !631)
!644 = !DILocation(line: 106, column: 5, scope: !631)
!645 = !DILocation(line: 106, column: 15, scope: !631)
!646 = !DILocation(line: 107, column: 5, scope: !631)
!647 = !DILocation(line: 107, column: 12, scope: !631)
!648 = !DILocation(line: 108, column: 1, scope: !631)
!649 = distinct !DISubprogram(name: "_set_ref_speed", linkageName: "_ZN5Linux14RCOutput_Bebop14_set_ref_speedEPt", scope: !101, file: !6, line: 110, type: !241, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !240, retainedNodes: !568)
!650 = !DILocalVariable(name: "this", arg: 1, scope: !649, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!651 = !DILocation(line: 0, scope: !649)
!652 = !DILocalVariable(name: "rpm", arg: 2, scope: !649, file: !6, line: 110, type: !76)
!653 = !DILocation(line: 110, column: 46, scope: !649)
!654 = !DILocalVariable(name: "data", scope: !649, file: !6, line: 112, type: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bldc_ref_speed_data", file: !6, line: 21, size: 88, flags: DIFlagTypePassByValue, elements: !656, identifier: "_ZTS19bldc_ref_speed_data")
!656 = !{!657, !658, !659, !660}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !655, file: !6, line: 22, baseType: !60, size: 8)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rpm", scope: !655, file: !6, line: 23, baseType: !110, size: 64, offset: 8)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "enable_security", scope: !655, file: !6, line: 24, baseType: !60, size: 8, offset: 72)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !655, file: !6, line: 25, baseType: !60, size: 8, offset: 80)
!661 = !DILocation(line: 112, column: 32, scope: !649)
!662 = !DILocalVariable(name: "i", scope: !649, file: !6, line: 113, type: !42)
!663 = !DILocation(line: 113, column: 9, scope: !649)
!664 = !DILocation(line: 115, column: 10, scope: !649)
!665 = !DILocation(line: 115, column: 14, scope: !649)
!666 = !DILocation(line: 117, column: 11, scope: !667)
!667 = distinct !DILexicalBlock(scope: !649, file: !6, line: 117, column: 5)
!668 = !DILocation(line: 117, column: 10, scope: !667)
!669 = !DILocation(line: 117, column: 15, scope: !670)
!670 = distinct !DILexicalBlock(scope: !667, file: !6, line: 117, column: 5)
!671 = !DILocation(line: 117, column: 16, scope: !670)
!672 = !DILocation(line: 117, column: 5, scope: !667)
!673 = !DILocation(line: 118, column: 23, scope: !670)
!674 = !DILocation(line: 118, column: 14, scope: !670)
!675 = !DILocation(line: 118, column: 18, scope: !670)
!676 = !DILocation(line: 118, column: 9, scope: !670)
!677 = !DILocation(line: 118, column: 21, scope: !670)
!678 = !DILocation(line: 117, column: 41, scope: !670)
!679 = !DILocation(line: 117, column: 5, scope: !670)
!680 = distinct !{!680, !672, !681, !628}
!681 = !DILocation(line: 118, column: 23, scope: !667)
!682 = !DILocation(line: 120, column: 10, scope: !649)
!683 = !DILocation(line: 120, column: 26, scope: !649)
!684 = !DILocation(line: 121, column: 21, scope: !649)
!685 = !DILocation(line: 121, column: 10, scope: !649)
!686 = !DILocation(line: 121, column: 19, scope: !649)
!687 = !DILocation(line: 123, column: 10, scope: !688)
!688 = distinct !DILexicalBlock(scope: !649, file: !6, line: 123, column: 9)
!689 = !DILocation(line: 123, column: 20, scope: !688)
!690 = !DILocation(line: 123, column: 9, scope: !649)
!691 = !DILocation(line: 124, column: 9, scope: !688)
!692 = !DILocation(line: 126, column: 5, scope: !649)
!693 = !DILocation(line: 126, column: 9, scope: !649)
!694 = !DILocation(line: 126, column: 15, scope: !649)
!695 = !DILocation(line: 128, column: 5, scope: !649)
!696 = !DILocation(line: 128, column: 15, scope: !649)
!697 = !DILocation(line: 129, column: 1, scope: !649)
!698 = distinct !DISubprogram(name: "__bswap_16", linkageName: "_ZL10__bswap_16t", scope: !699, file: !699, line: 34, type: !700, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !568)
!699 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/byteswap.h", directory: "", checksumkind: CSK_MD5, checksum: "98f83253ffd9c64e7486789204e9fa05")
!700 = !DISubroutineType(types: !701)
!701 = !{!55, !55}
!702 = !DILocalVariable(name: "__bsx", arg: 1, scope: !698, file: !699, line: 34, type: !55)
!703 = !DILocation(line: 34, column: 24, scope: !698)
!704 = !DILocation(line: 39, column: 10, scope: !698)
!705 = !DILocation(line: 39, column: 3, scope: !698)
!706 = distinct !DISubprogram(name: "_get_info", linkageName: "_ZN5Linux14RCOutput_Bebop9_get_infoEP9bldc_info", scope: !101, file: !6, line: 131, type: !244, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !243, retainedNodes: !568)
!707 = !DILocalVariable(name: "this", arg: 1, scope: !706, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!708 = !DILocation(line: 0, scope: !706)
!709 = !DILocalVariable(name: "info", arg: 2, scope: !706, file: !6, line: 131, type: !246)
!710 = !DILocation(line: 131, column: 50, scope: !706)
!711 = !DILocation(line: 133, column: 9, scope: !712)
!712 = distinct !DILexicalBlock(scope: !706, file: !6, line: 133, column: 9)
!713 = !DILocation(line: 133, column: 14, scope: !712)
!714 = !DILocation(line: 133, column: 9, scope: !706)
!715 = !DILocation(line: 134, column: 9, scope: !716)
!716 = distinct !DILexicalBlock(scope: !712, file: !6, line: 133, column: 23)
!717 = !DILocation(line: 136, column: 12, scope: !706)
!718 = !DILocation(line: 136, column: 5, scope: !706)
!719 = !DILocation(line: 137, column: 10, scope: !720)
!720 = distinct !DILexicalBlock(scope: !706, file: !6, line: 137, column: 9)
!721 = !DILocation(line: 137, column: 20, scope: !720)
!722 = !DILocation(line: 137, column: 9, scope: !706)
!723 = !DILocation(line: 138, column: 9, scope: !724)
!724 = distinct !DILexicalBlock(scope: !720, file: !6, line: 137, column: 29)
!725 = !DILocation(line: 140, column: 5, scope: !706)
!726 = !DILocation(line: 140, column: 9, scope: !706)
!727 = !DILocation(line: 141, column: 66, scope: !706)
!728 = !DILocation(line: 140, column: 15, scope: !706)
!729 = !DILocation(line: 142, column: 5, scope: !706)
!730 = !DILocation(line: 142, column: 15, scope: !706)
!731 = !DILocation(line: 143, column: 5, scope: !706)
!732 = !DILocation(line: 144, column: 1, scope: !706)
!733 = distinct !DISubprogram(name: "read_obs_data", linkageName: "_ZN5Linux14RCOutput_Bebop13read_obs_dataER17BebopBLDC_ObsData", scope: !101, file: !6, line: 146, type: !222, scopeLine: 147, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !221, retainedNodes: !568)
!734 = !DILocalVariable(name: "this", arg: 1, scope: !733, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!735 = !DILocation(line: 0, scope: !733)
!736 = !DILocalVariable(name: "obs", arg: 2, scope: !733, file: !6, line: 146, type: !224)
!737 = !DILocation(line: 146, column: 54, scope: !733)
!738 = !DILocalVariable(name: "data", scope: !733, file: !6, line: 148, type: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bldc_obs_data", file: !6, line: 29, size: 120, flags: DIFlagTypePassByValue, elements: !740, identifier: "_ZTS13bldc_obs_data")
!740 = !{!741, !742, !743, !744, !745, !746, !747}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rpm", scope: !739, file: !6, line: 30, baseType: !110, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "batt_mv", scope: !739, file: !6, line: 31, baseType: !54, size: 16, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !739, file: !6, line: 32, baseType: !60, size: 8, offset: 80)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !739, file: !6, line: 33, baseType: !60, size: 8, offset: 88)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "motors_err", scope: !739, file: !6, line: 34, baseType: !60, size: 8, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !739, file: !6, line: 35, baseType: !60, size: 8, offset: 104)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !739, file: !6, line: 36, baseType: !60, size: 8, offset: 112)
!748 = !DILocation(line: 148, column: 26, scope: !733)
!749 = !DILocalVariable(name: "i", scope: !733, file: !6, line: 149, type: !42)
!750 = !DILocation(line: 149, column: 9, scope: !733)
!751 = !DILocation(line: 151, column: 5, scope: !733)
!752 = !DILocation(line: 152, column: 10, scope: !753)
!753 = distinct !DILexicalBlock(scope: !733, file: !6, line: 152, column: 9)
!754 = !DILocation(line: 152, column: 20, scope: !753)
!755 = !DILocation(line: 152, column: 9, scope: !733)
!756 = !DILocation(line: 153, column: 9, scope: !753)
!757 = !DILocation(line: 155, column: 5, scope: !733)
!758 = !DILocation(line: 155, column: 9, scope: !733)
!759 = !DILocation(line: 155, column: 15, scope: !733)
!760 = !DILocation(line: 158, column: 5, scope: !733)
!761 = !DILocation(line: 158, column: 15, scope: !733)
!762 = !DILocation(line: 160, column: 14, scope: !763)
!763 = distinct !DILexicalBlock(scope: !733, file: !6, line: 160, column: 9)
!764 = !DILocation(line: 160, column: 9, scope: !763)
!765 = !DILocation(line: 160, column: 26, scope: !763)
!766 = !DILocation(line: 160, column: 23, scope: !763)
!767 = !DILocation(line: 160, column: 9, scope: !733)
!768 = !DILocation(line: 161, column: 9, scope: !763)
!769 = !DILocation(line: 161, column: 13, scope: !763)
!770 = !DILocation(line: 161, column: 22, scope: !763)
!771 = !DILocation(line: 164, column: 12, scope: !772)
!772 = distinct !DILexicalBlock(scope: !733, file: !6, line: 164, column: 5)
!773 = !DILocation(line: 164, column: 10, scope: !772)
!774 = !DILocation(line: 164, column: 17, scope: !775)
!775 = distinct !DILexicalBlock(scope: !772, file: !6, line: 164, column: 5)
!776 = !DILocation(line: 164, column: 19, scope: !775)
!777 = !DILocation(line: 164, column: 5, scope: !772)
!778 = !DILocation(line: 166, column: 38, scope: !779)
!779 = distinct !DILexicalBlock(scope: !775, file: !6, line: 164, column: 49)
!780 = !DILocation(line: 166, column: 42, scope: !779)
!781 = !DILocation(line: 166, column: 33, scope: !779)
!782 = !DILocation(line: 166, column: 45, scope: !779)
!783 = !DILocation(line: 166, column: 32, scope: !779)
!784 = !DILocation(line: 166, column: 9, scope: !779)
!785 = !DILocation(line: 166, column: 13, scope: !779)
!786 = !DILocation(line: 166, column: 27, scope: !779)
!787 = !DILocation(line: 166, column: 30, scope: !779)
!788 = !DILocation(line: 168, column: 14, scope: !779)
!789 = !DILocation(line: 168, column: 18, scope: !779)
!790 = !DILocation(line: 168, column: 9, scope: !779)
!791 = !DILocation(line: 168, column: 21, scope: !779)
!792 = !DILocation(line: 169, column: 22, scope: !779)
!793 = !DILocation(line: 169, column: 9, scope: !779)
!794 = !DILocation(line: 169, column: 13, scope: !779)
!795 = !DILocation(line: 169, column: 17, scope: !779)
!796 = !DILocation(line: 169, column: 20, scope: !779)
!797 = !DILocation(line: 170, column: 13, scope: !798)
!798 = distinct !DILexicalBlock(scope: !779, file: !6, line: 170, column: 13)
!799 = !DILocation(line: 170, column: 17, scope: !798)
!800 = !DILocation(line: 170, column: 21, scope: !798)
!801 = !DILocation(line: 170, column: 24, scope: !798)
!802 = !DILocation(line: 170, column: 13, scope: !779)
!803 = !DILocation(line: 171, column: 13, scope: !798)
!804 = !DILocation(line: 171, column: 17, scope: !798)
!805 = !DILocation(line: 171, column: 31, scope: !798)
!806 = !DILocation(line: 171, column: 34, scope: !798)
!807 = !DILocation(line: 172, column: 5, scope: !779)
!808 = !DILocation(line: 164, column: 45, scope: !775)
!809 = !DILocation(line: 164, column: 5, scope: !775)
!810 = distinct !{!810, !777, !811, !628}
!811 = !DILocation(line: 172, column: 5, scope: !772)
!812 = !DILocation(line: 174, column: 19, scope: !733)
!813 = !DILocation(line: 174, column: 5, scope: !733)
!814 = !DILocation(line: 174, column: 9, scope: !733)
!815 = !DILocation(line: 174, column: 17, scope: !733)
!816 = !DILocation(line: 175, column: 23, scope: !733)
!817 = !DILocation(line: 175, column: 5, scope: !733)
!818 = !DILocation(line: 175, column: 9, scope: !733)
!819 = !DILocation(line: 175, column: 16, scope: !733)
!820 = !DILocation(line: 176, column: 22, scope: !733)
!821 = !DILocation(line: 176, column: 5, scope: !733)
!822 = !DILocation(line: 176, column: 9, scope: !733)
!823 = !DILocation(line: 176, column: 15, scope: !733)
!824 = !DILocation(line: 177, column: 27, scope: !733)
!825 = !DILocation(line: 177, column: 5, scope: !733)
!826 = !DILocation(line: 177, column: 9, scope: !733)
!827 = !DILocation(line: 177, column: 20, scope: !733)
!828 = !DILocation(line: 178, column: 28, scope: !733)
!829 = !DILocation(line: 178, column: 5, scope: !733)
!830 = !DILocation(line: 178, column: 9, scope: !733)
!831 = !DILocation(line: 178, column: 21, scope: !733)
!832 = !DILocation(line: 179, column: 5, scope: !733)
!833 = !DILocation(line: 180, column: 1, scope: !733)
!834 = distinct !DISubprogram(name: "_toggle_gpio", linkageName: "_ZN5Linux14RCOutput_Bebop12_toggle_gpioEh", scope: !101, file: !6, line: 182, type: !206, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !239, retainedNodes: !568)
!835 = !DILocalVariable(name: "this", arg: 1, scope: !834, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!836 = !DILocation(line: 0, scope: !834)
!837 = !DILocalVariable(name: "mask", arg: 2, scope: !834, file: !6, line: 182, type: !60)
!838 = !DILocation(line: 182, column: 43, scope: !834)
!839 = !DILocation(line: 184, column: 10, scope: !840)
!840 = distinct !DILexicalBlock(scope: !834, file: !6, line: 184, column: 9)
!841 = !DILocation(line: 184, column: 20, scope: !840)
!842 = !DILocation(line: 184, column: 9, scope: !834)
!843 = !DILocation(line: 185, column: 9, scope: !840)
!844 = !DILocation(line: 187, column: 5, scope: !834)
!845 = !DILocation(line: 187, column: 9, scope: !834)
!846 = !DILocation(line: 187, column: 74, scope: !834)
!847 = !DILocation(line: 187, column: 15, scope: !834)
!848 = !DILocation(line: 189, column: 5, scope: !834)
!849 = !DILocation(line: 189, column: 15, scope: !834)
!850 = !DILocation(line: 190, column: 1, scope: !834)
!851 = distinct !DISubprogram(name: "_stop_prop", linkageName: "_ZN5Linux14RCOutput_Bebop10_stop_propEv", scope: !101, file: !6, line: 192, type: !191, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !257, retainedNodes: !568)
!852 = !DILocalVariable(name: "this", arg: 1, scope: !851, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!853 = !DILocation(line: 0, scope: !851)
!854 = !DILocalVariable(name: "data", scope: !851, file: !6, line: 194, type: !60)
!855 = !DILocation(line: 194, column: 13, scope: !851)
!856 = !DILocation(line: 195, column: 5, scope: !851)
!857 = !DILocation(line: 195, column: 12, scope: !851)
!858 = !DILocation(line: 197, column: 10, scope: !859)
!859 = distinct !DILexicalBlock(scope: !851, file: !6, line: 197, column: 9)
!860 = !DILocation(line: 197, column: 20, scope: !859)
!861 = !DILocation(line: 197, column: 9, scope: !851)
!862 = !DILocation(line: 198, column: 9, scope: !859)
!863 = !DILocation(line: 200, column: 5, scope: !851)
!864 = !DILocation(line: 200, column: 9, scope: !851)
!865 = !DILocation(line: 200, column: 15, scope: !851)
!866 = !DILocation(line: 202, column: 5, scope: !851)
!867 = !DILocation(line: 202, column: 15, scope: !851)
!868 = !DILocation(line: 203, column: 1, scope: !851)
!869 = distinct !DISubprogram(name: "_clear_error", linkageName: "_ZN5Linux14RCOutput_Bebop12_clear_errorEv", scope: !101, file: !6, line: 205, type: !191, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !258, retainedNodes: !568)
!870 = !DILocalVariable(name: "this", arg: 1, scope: !869, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!871 = !DILocation(line: 0, scope: !869)
!872 = !DILocalVariable(name: "data", scope: !869, file: !6, line: 207, type: !60)
!873 = !DILocation(line: 207, column: 13, scope: !869)
!874 = !DILocation(line: 209, column: 10, scope: !875)
!875 = distinct !DILexicalBlock(scope: !869, file: !6, line: 209, column: 9)
!876 = !DILocation(line: 209, column: 20, scope: !875)
!877 = !DILocation(line: 209, column: 9, scope: !869)
!878 = !DILocation(line: 210, column: 9, scope: !875)
!879 = !DILocation(line: 212, column: 5, scope: !869)
!880 = !DILocation(line: 212, column: 9, scope: !869)
!881 = !DILocation(line: 212, column: 15, scope: !869)
!882 = !DILocation(line: 214, column: 5, scope: !869)
!883 = !DILocation(line: 214, column: 15, scope: !869)
!884 = !DILocation(line: 215, column: 1, scope: !869)
!885 = distinct !DISubprogram(name: "_play_sound", linkageName: "_ZN5Linux14RCOutput_Bebop11_play_soundEh", scope: !101, file: !6, line: 217, type: !206, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !259, retainedNodes: !568)
!886 = !DILocalVariable(name: "this", arg: 1, scope: !885, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!887 = !DILocation(line: 0, scope: !885)
!888 = !DILocalVariable(name: "sound", arg: 2, scope: !885, file: !6, line: 217, type: !60)
!889 = !DILocation(line: 217, column: 42, scope: !885)
!890 = !DILocation(line: 219, column: 10, scope: !891)
!891 = distinct !DILexicalBlock(scope: !885, file: !6, line: 219, column: 9)
!892 = !DILocation(line: 219, column: 20, scope: !891)
!893 = !DILocation(line: 219, column: 9, scope: !885)
!894 = !DILocation(line: 220, column: 9, scope: !891)
!895 = !DILocation(line: 222, column: 5, scope: !885)
!896 = !DILocation(line: 222, column: 9, scope: !885)
!897 = !DILocation(line: 222, column: 73, scope: !885)
!898 = !DILocation(line: 222, column: 15, scope: !885)
!899 = !DILocation(line: 224, column: 5, scope: !885)
!900 = !DILocation(line: 224, column: 15, scope: !885)
!901 = !DILocation(line: 225, column: 1, scope: !885)
!902 = distinct !DISubprogram(name: "_period_us_to_rpm", linkageName: "_ZN5Linux14RCOutput_Bebop17_period_us_to_rpmEt", scope: !101, file: !6, line: 227, type: !261, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !260, retainedNodes: !568)
!903 = !DILocalVariable(name: "this", arg: 1, scope: !902, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!904 = !DILocation(line: 0, scope: !902)
!905 = !DILocalVariable(name: "period_us", arg: 2, scope: !902, file: !6, line: 227, type: !54)
!906 = !DILocation(line: 227, column: 53, scope: !902)
!907 = !DILocalVariable(name: "period_us_fl", scope: !902, file: !6, line: 229, type: !499)
!908 = !DILocation(line: 229, column: 11, scope: !902)
!909 = !DILocation(line: 229, column: 26, scope: !902)
!910 = !DILocalVariable(name: "rpm_fl", scope: !902, file: !6, line: 231, type: !499)
!911 = !DILocation(line: 231, column: 11, scope: !902)
!912 = !DILocation(line: 231, column: 21, scope: !902)
!913 = !DILocation(line: 231, column: 36, scope: !902)
!914 = !DILocation(line: 231, column: 34, scope: !902)
!915 = !DILocation(line: 231, column: 47, scope: !902)
!916 = !DILocation(line: 231, column: 58, scope: !902)
!917 = !DILocation(line: 231, column: 56, scope: !902)
!918 = !DILocation(line: 231, column: 46, scope: !902)
!919 = !DILocation(line: 231, column: 45, scope: !902)
!920 = !DILocation(line: 232, column: 22, scope: !902)
!921 = !DILocation(line: 232, column: 31, scope: !902)
!922 = !DILocation(line: 232, column: 21, scope: !902)
!923 = !DILocation(line: 232, column: 53, scope: !902)
!924 = !DILocation(line: 234, column: 22, scope: !902)
!925 = !DILocation(line: 234, column: 5, scope: !902)
!926 = distinct !DISubprogram(name: "init", linkageName: "_ZN5Linux14RCOutput_Bebop4initEv", scope: !101, file: !6, line: 237, type: !191, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !198, retainedNodes: !568)
!927 = !DILocalVariable(name: "this", arg: 1, scope: !926, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!928 = !DILocation(line: 0, scope: !926)
!929 = !DILocalVariable(name: "ret", scope: !926, file: !6, line: 239, type: !42)
!930 = !DILocation(line: 239, column: 9, scope: !926)
!931 = !DILocalVariable(name: "param", scope: !926, file: !6, line: 240, type: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_param", file: !933, line: 23, size: 32, flags: DIFlagTypePassByValue, elements: !934, identifier: "_ZTS11sched_param")
!933 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_sched_param.h", directory: "", checksumkind: CSK_MD5, checksum: "13c2f29d5f5dc39597ef32d201b78292")
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !932, file: !933, line: 25, baseType: !42, size: 32)
!936 = !DILocation(line: 240, column: 24, scope: !926)
!937 = !DILocalVariable(name: "attr", scope: !926, file: !6, line: 241, type: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !123, line: 62, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !123, line: 56, size: 448, flags: DIFlagTypePassByValue, elements: !940, identifier: "_ZTS14pthread_attr_t")
!940 = !{!941, !945}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !939, file: !123, line: 58, baseType: !942, size: 448)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 448, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 56)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !939, file: !123, line: 59, baseType: !155, size: 64)
!946 = !DILocation(line: 241, column: 20, scope: !926)
!947 = !DILocalVariable(name: "cond_attr", scope: !926, file: !6, line: 242, type: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_condattr_t", file: !123, line: 45, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 41, size: 32, flags: DIFlagTypePassByValue, elements: !950, identifier: "_ZTS18pthread_condattr_t")
!950 = !{!951, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !949, file: !123, line: 43, baseType: !952, size: 32)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32, elements: !111)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !949, file: !123, line: 44, baseType: !42, size: 32)
!954 = !DILocation(line: 242, column: 24, scope: !926)
!955 = !DILocation(line: 244, column: 16, scope: !926)
!956 = !DILocation(line: 244, column: 20, scope: !926)
!957 = !DILocation(line: 244, column: 26, scope: !926)
!958 = !DILocation(line: 244, column: 5, scope: !926)
!959 = !DILocation(line: 244, column: 14, scope: !926)
!960 = !DILocation(line: 245, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !926, file: !6, line: 245, column: 9)
!962 = !DILocation(line: 245, column: 18, scope: !961)
!963 = !DILocation(line: 245, column: 9, scope: !926)
!964 = !DILocation(line: 246, column: 9, scope: !965)
!965 = distinct !DILexicalBlock(scope: !961, file: !6, line: 245, column: 27)
!966 = !DILocation(line: 251, column: 31, scope: !926)
!967 = !DILocation(line: 251, column: 11, scope: !926)
!968 = !DILocation(line: 251, column: 9, scope: !926)
!969 = !DILocation(line: 252, column: 9, scope: !970)
!970 = distinct !DILexicalBlock(scope: !926, file: !6, line: 252, column: 9)
!971 = !DILocation(line: 252, column: 13, scope: !970)
!972 = !DILocation(line: 252, column: 9, scope: !926)
!973 = !DILocation(line: 253, column: 9, scope: !974)
!974 = distinct !DILexicalBlock(scope: !970, file: !6, line: 252, column: 19)
!975 = !DILocation(line: 254, column: 9, scope: !974)
!976 = !DILocation(line: 257, column: 25, scope: !926)
!977 = !DILocation(line: 257, column: 5, scope: !926)
!978 = !DILocation(line: 259, column: 5, scope: !926)
!979 = !DILocation(line: 260, column: 5, scope: !926)
!980 = !DILocation(line: 261, column: 30, scope: !926)
!981 = !DILocation(line: 261, column: 11, scope: !926)
!982 = !DILocation(line: 261, column: 9, scope: !926)
!983 = !DILocation(line: 262, column: 5, scope: !926)
!984 = !DILocation(line: 263, column: 9, scope: !985)
!985 = distinct !DILexicalBlock(scope: !926, file: !6, line: 263, column: 9)
!986 = !DILocation(line: 263, column: 13, scope: !985)
!987 = !DILocation(line: 263, column: 9, scope: !926)
!988 = !DILocation(line: 264, column: 9, scope: !989)
!989 = distinct !DILexicalBlock(scope: !985, file: !6, line: 263, column: 19)
!990 = !DILocation(line: 265, column: 9, scope: !989)
!991 = !DILocation(line: 268, column: 11, scope: !926)
!992 = !DILocation(line: 268, column: 9, scope: !926)
!993 = !DILocation(line: 269, column: 9, scope: !994)
!994 = distinct !DILexicalBlock(scope: !926, file: !6, line: 269, column: 9)
!995 = !DILocation(line: 269, column: 13, scope: !994)
!996 = !DILocation(line: 269, column: 9, scope: !926)
!997 = !DILocation(line: 270, column: 9, scope: !998)
!998 = distinct !DILexicalBlock(scope: !994, file: !6, line: 269, column: 19)
!999 = !DILocation(line: 271, column: 9, scope: !998)
!1000 = !DILocation(line: 273, column: 5, scope: !926)
!1001 = !DILocation(line: 274, column: 5, scope: !926)
!1002 = !DILocation(line: 275, column: 5, scope: !926)
!1003 = !DILocation(line: 276, column: 27, scope: !926)
!1004 = !DILocation(line: 276, column: 11, scope: !926)
!1005 = !DILocation(line: 276, column: 9, scope: !926)
!1006 = !DILocation(line: 277, column: 9, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !926, file: !6, line: 277, column: 9)
!1008 = !DILocation(line: 277, column: 13, scope: !1007)
!1009 = !DILocation(line: 277, column: 9, scope: !926)
!1010 = !DILocation(line: 278, column: 9, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !6, line: 277, column: 19)
!1012 = !DILocation(line: 279, column: 9, scope: !1011)
!1013 = !DILocation(line: 282, column: 5, scope: !926)
!1014 = !DILocation(line: 285, column: 5, scope: !926)
!1015 = !DILocation(line: 285, column: 16, scope: !926)
!1016 = !DILabel(scope: !926, name: "exit", file: !6, line: 287)
!1017 = !DILocation(line: 287, column: 1, scope: !926)
!1018 = !DILocation(line: 288, column: 27, scope: !926)
!1019 = !DILocation(line: 288, column: 5, scope: !926)
!1020 = !DILocation(line: 289, column: 5, scope: !926)
!1021 = !DILocation(line: 290, column: 1, scope: !926)
!1022 = distinct !DISubprogram(name: "_control_thread", linkageName: "_ZN5Linux14RCOutput_Bebop15_control_threadEPv", scope: !101, file: !6, line: 359, type: !265, scopeLine: 359, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !264, retainedNodes: !568)
!1023 = !DILocalVariable(name: "arg", arg: 1, scope: !1022, file: !6, line: 359, type: !267)
!1024 = !DILocation(line: 359, column: 45, scope: !1022)
!1025 = !DILocalVariable(name: "rcout", scope: !1022, file: !6, line: 360, type: !100)
!1026 = !DILocation(line: 360, column: 21, scope: !1022)
!1027 = !DILocation(line: 360, column: 48, scope: !1022)
!1028 = !DILocation(line: 362, column: 5, scope: !1022)
!1029 = !DILocation(line: 362, column: 12, scope: !1022)
!1030 = !DILocation(line: 363, column: 5, scope: !1022)
!1031 = distinct !DISubprogram(name: "set_freq", linkageName: "_ZN5Linux14RCOutput_Bebop8set_freqEjt", scope: !101, file: !6, line: 292, type: !200, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !199, retainedNodes: !568)
!1032 = !DILocalVariable(name: "this", arg: 1, scope: !1031, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1033 = !DILocation(line: 0, scope: !1031)
!1034 = !DILocalVariable(name: "chmask", arg: 2, scope: !1031, file: !6, line: 292, type: !50)
!1035 = !DILocation(line: 292, column: 40, scope: !1031)
!1036 = !DILocalVariable(name: "freq_hz", arg: 3, scope: !1031, file: !6, line: 292, type: !54)
!1037 = !DILocation(line: 292, column: 57, scope: !1031)
!1038 = !DILocation(line: 294, column: 18, scope: !1031)
!1039 = !DILocation(line: 294, column: 5, scope: !1031)
!1040 = !DILocation(line: 294, column: 16, scope: !1031)
!1041 = !DILocation(line: 295, column: 1, scope: !1031)
!1042 = distinct !DISubprogram(name: "get_freq", linkageName: "_ZN5Linux14RCOutput_Bebop8get_freqEh", scope: !101, file: !6, line: 297, type: !203, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !202, retainedNodes: !568)
!1043 = !DILocalVariable(name: "this", arg: 1, scope: !1042, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1044 = !DILocation(line: 0, scope: !1042)
!1045 = !DILocalVariable(name: "ch", arg: 2, scope: !1042, file: !6, line: 297, type: !60)
!1046 = !DILocation(line: 297, column: 43, scope: !1042)
!1047 = !DILocation(line: 299, column: 12, scope: !1042)
!1048 = !DILocation(line: 299, column: 5, scope: !1042)
!1049 = distinct !DISubprogram(name: "enable_ch", linkageName: "_ZN5Linux14RCOutput_Bebop9enable_chEh", scope: !101, file: !6, line: 302, type: !206, scopeLine: 303, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !205, retainedNodes: !568)
!1050 = !DILocalVariable(name: "this", arg: 1, scope: !1049, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1051 = !DILocation(line: 0, scope: !1049)
!1052 = !DILocalVariable(name: "ch", arg: 2, scope: !1049, file: !6, line: 302, type: !60)
!1053 = !DILocation(line: 302, column: 40, scope: !1049)
!1054 = !DILocation(line: 304, column: 1, scope: !1049)
!1055 = distinct !DISubprogram(name: "disable_ch", linkageName: "_ZN5Linux14RCOutput_Bebop10disable_chEh", scope: !101, file: !6, line: 306, type: !206, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !208, retainedNodes: !568)
!1056 = !DILocalVariable(name: "this", arg: 1, scope: !1055, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1057 = !DILocation(line: 0, scope: !1055)
!1058 = !DILocalVariable(name: "ch", arg: 2, scope: !1055, file: !6, line: 306, type: !60)
!1059 = !DILocation(line: 306, column: 41, scope: !1055)
!1060 = !DILocation(line: 308, column: 5, scope: !1055)
!1061 = !DILocation(line: 309, column: 1, scope: !1055)
!1062 = distinct !DISubprogram(name: "write", linkageName: "_ZN5Linux14RCOutput_Bebop5writeEht", scope: !101, file: !6, line: 311, type: !210, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !209, retainedNodes: !568)
!1063 = !DILocalVariable(name: "this", arg: 1, scope: !1062, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1064 = !DILocation(line: 0, scope: !1062)
!1065 = !DILocalVariable(name: "ch", arg: 2, scope: !1062, file: !6, line: 311, type: !60)
!1066 = !DILocation(line: 311, column: 36, scope: !1062)
!1067 = !DILocalVariable(name: "period_us", arg: 3, scope: !1062, file: !6, line: 311, type: !54)
!1068 = !DILocation(line: 311, column: 49, scope: !1062)
!1069 = !DILocation(line: 313, column: 9, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1062, file: !6, line: 313, column: 9)
!1071 = !DILocation(line: 313, column: 12, scope: !1070)
!1072 = !DILocation(line: 313, column: 9, scope: !1062)
!1073 = !DILocation(line: 314, column: 9, scope: !1070)
!1074 = !DILocation(line: 316, column: 30, scope: !1062)
!1075 = !DILocation(line: 316, column: 5, scope: !1062)
!1076 = !DILocation(line: 316, column: 24, scope: !1062)
!1077 = !DILocation(line: 316, column: 28, scope: !1062)
!1078 = !DILocation(line: 318, column: 10, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1062, file: !6, line: 318, column: 9)
!1080 = !DILocation(line: 318, column: 9, scope: !1062)
!1081 = !DILocation(line: 319, column: 9, scope: !1079)
!1082 = !DILocation(line: 320, column: 1, scope: !1062)
!1083 = distinct !DISubprogram(name: "cork", linkageName: "_ZN5Linux14RCOutput_Bebop4corkEv", scope: !101, file: !6, line: 322, type: !191, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !212, retainedNodes: !568)
!1084 = !DILocalVariable(name: "this", arg: 1, scope: !1083, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1085 = !DILocation(line: 0, scope: !1083)
!1086 = !DILocation(line: 324, column: 5, scope: !1083)
!1087 = !DILocation(line: 324, column: 14, scope: !1083)
!1088 = !DILocation(line: 325, column: 1, scope: !1083)
!1089 = distinct !DISubprogram(name: "push", linkageName: "_ZN5Linux14RCOutput_Bebop4pushEv", scope: !101, file: !6, line: 327, type: !191, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !213, retainedNodes: !568)
!1090 = !DILocalVariable(name: "this", arg: 1, scope: !1089, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1091 = !DILocation(line: 0, scope: !1089)
!1092 = !DILocation(line: 329, column: 5, scope: !1089)
!1093 = !DILocation(line: 329, column: 14, scope: !1089)
!1094 = !DILocation(line: 330, column: 25, scope: !1089)
!1095 = !DILocation(line: 330, column: 5, scope: !1089)
!1096 = !DILocation(line: 331, column: 12, scope: !1089)
!1097 = !DILocation(line: 331, column: 5, scope: !1089)
!1098 = !DILocation(line: 331, column: 24, scope: !1089)
!1099 = !DILocation(line: 332, column: 26, scope: !1089)
!1100 = !DILocation(line: 332, column: 5, scope: !1089)
!1101 = !DILocation(line: 333, column: 27, scope: !1089)
!1102 = !DILocation(line: 333, column: 5, scope: !1089)
!1103 = !DILocation(line: 334, column: 12, scope: !1089)
!1104 = !DILocation(line: 334, column: 5, scope: !1089)
!1105 = !DILocation(line: 335, column: 1, scope: !1089)
!1106 = distinct !DISubprogram(name: "read", linkageName: "_ZN5Linux14RCOutput_Bebop4readEh", scope: !101, file: !6, line: 337, type: !203, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !214, retainedNodes: !568)
!1107 = !DILocalVariable(name: "this", arg: 1, scope: !1106, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1108 = !DILocation(line: 0, scope: !1106)
!1109 = !DILocalVariable(name: "ch", arg: 2, scope: !1106, file: !6, line: 337, type: !60)
!1110 = !DILocation(line: 337, column: 39, scope: !1106)
!1111 = !DILocation(line: 339, column: 9, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1106, file: !6, line: 339, column: 9)
!1113 = !DILocation(line: 339, column: 12, scope: !1112)
!1114 = !DILocation(line: 339, column: 9, scope: !1106)
!1115 = !DILocation(line: 340, column: 16, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1112, file: !6, line: 339, column: 37)
!1117 = !DILocation(line: 340, column: 27, scope: !1116)
!1118 = !DILocation(line: 340, column: 9, scope: !1116)
!1119 = !DILocation(line: 342, column: 9, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1112, file: !6, line: 341, column: 12)
!1121 = !DILocation(line: 344, column: 1, scope: !1106)
!1122 = distinct !DISubprogram(name: "read", linkageName: "_ZN5Linux14RCOutput_Bebop4readEPth", scope: !101, file: !6, line: 346, type: !216, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !215, retainedNodes: !568)
!1123 = !DILocalVariable(name: "this", arg: 1, scope: !1122, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1124 = !DILocation(line: 0, scope: !1122)
!1125 = !DILocalVariable(name: "period_us", arg: 2, scope: !1122, file: !6, line: 346, type: !76)
!1126 = !DILocation(line: 346, column: 37, scope: !1122)
!1127 = !DILocalVariable(name: "len", arg: 3, scope: !1122, file: !6, line: 346, type: !60)
!1128 = !DILocation(line: 346, column: 56, scope: !1122)
!1129 = !DILocalVariable(name: "i", scope: !1130, file: !6, line: 348, type: !42)
!1130 = distinct !DILexicalBlock(scope: !1122, file: !6, line: 348, column: 5)
!1131 = !DILocation(line: 348, column: 14, scope: !1130)
!1132 = !DILocation(line: 348, column: 10, scope: !1130)
!1133 = !DILocation(line: 348, column: 21, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1130, file: !6, line: 348, column: 5)
!1135 = !DILocation(line: 348, column: 25, scope: !1134)
!1136 = !DILocation(line: 348, column: 23, scope: !1134)
!1137 = !DILocation(line: 348, column: 5, scope: !1130)
!1138 = !DILocation(line: 349, column: 33, scope: !1134)
!1139 = !DILocation(line: 349, column: 31, scope: !1134)
!1140 = !DILocation(line: 349, column: 29, scope: !1134)
!1141 = !DILocation(line: 349, column: 24, scope: !1134)
!1142 = !DILocation(line: 349, column: 9, scope: !1134)
!1143 = !DILocation(line: 349, column: 19, scope: !1134)
!1144 = !DILocation(line: 349, column: 22, scope: !1134)
!1145 = !DILocation(line: 348, column: 31, scope: !1134)
!1146 = !DILocation(line: 348, column: 5, scope: !1134)
!1147 = distinct !{!1147, !1137, !1148, !628}
!1148 = !DILocation(line: 349, column: 34, scope: !1130)
!1149 = !DILocation(line: 350, column: 1, scope: !1122)
!1150 = distinct !DISubprogram(name: "set_esc_scaling", linkageName: "_ZN5Linux14RCOutput_Bebop15set_esc_scalingEtt", scope: !101, file: !6, line: 352, type: !219, scopeLine: 353, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !218, retainedNodes: !568)
!1151 = !DILocalVariable(name: "this", arg: 1, scope: !1150, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1152 = !DILocation(line: 0, scope: !1150)
!1153 = !DILocalVariable(name: "min_pwm", arg: 2, scope: !1150, file: !6, line: 352, type: !54)
!1154 = !DILocation(line: 352, column: 47, scope: !1150)
!1155 = !DILocalVariable(name: "max_pwm", arg: 3, scope: !1150, file: !6, line: 352, type: !54)
!1156 = !DILocation(line: 352, column: 65, scope: !1150)
!1157 = !DILocation(line: 354, column: 16, scope: !1150)
!1158 = !DILocation(line: 354, column: 5, scope: !1150)
!1159 = !DILocation(line: 354, column: 14, scope: !1150)
!1160 = !DILocation(line: 355, column: 16, scope: !1150)
!1161 = !DILocation(line: 355, column: 5, scope: !1150)
!1162 = !DILocation(line: 355, column: 14, scope: !1150)
!1163 = !DILocation(line: 356, column: 1, scope: !1150)
!1164 = distinct !DISubprogram(name: "_run_rcout", linkageName: "_ZN5Linux14RCOutput_Bebop10_run_rcoutEv", scope: !101, file: !6, line: 366, type: !191, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !263, retainedNodes: !568)
!1165 = !DILocalVariable(name: "this", arg: 1, scope: !1164, type: !100, flags: DIFlagArtificial | DIFlagObjectPointer)
!1166 = !DILocation(line: 0, scope: !1164)
!1167 = !DILocalVariable(name: "current_period_us", scope: !1164, file: !6, line: 368, type: !110)
!1168 = !DILocation(line: 368, column: 14, scope: !1164)
!1169 = !DILocalVariable(name: "i", scope: !1164, file: !6, line: 369, type: !60)
!1170 = !DILocation(line: 369, column: 13, scope: !1164)
!1171 = !DILocalVariable(name: "ret", scope: !1164, file: !6, line: 370, type: !42)
!1172 = !DILocation(line: 370, column: 9, scope: !1164)
!1173 = !DILocalVariable(name: "ts", scope: !1164, file: !6, line: 371, type: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1175, line: 11, size: 128, flags: DIFlagTypePassByValue, elements: !1176, identifier: "_ZTS8timespec")
!1175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1176 = !{!1177, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1174, file: !1175, line: 16, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !53, line: 160, baseType: !155)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1174, file: !1175, line: 21, baseType: !1180, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !53, line: 197, baseType: !155)
!1181 = !DILocation(line: 371, column: 21, scope: !1164)
!1182 = !DILocalVariable(name: "info", scope: !1164, file: !6, line: 372, type: !247)
!1183 = !DILocation(line: 372, column: 22, scope: !1164)
!1184 = !DILocalVariable(name: "bebop_bldc_channels", scope: !1164, file: !6, line: 373, type: !229)
!1185 = !DILocation(line: 373, column: 13, scope: !1164)
!1186 = !DILocalVariable(name: "bebop_bldc_right_front", scope: !1164, file: !6, line: 374, type: !60)
!1187 = !DILocation(line: 374, column: 13, scope: !1164)
!1188 = !DILocalVariable(name: "bebop_bldc_left_front", scope: !1164, file: !6, line: 374, type: !60)
!1189 = !DILocation(line: 374, column: 37, scope: !1164)
!1190 = !DILocalVariable(name: "bebop_bldc_left_back", scope: !1164, file: !6, line: 375, type: !60)
!1191 = !DILocation(line: 375, column: 13, scope: !1164)
!1192 = !DILocalVariable(name: "bebop_bldc_right_back", scope: !1164, file: !6, line: 375, type: !60)
!1193 = !DILocation(line: 375, column: 35, scope: !1164)
!1194 = !DILocalVariable(name: "hw_version", scope: !1164, file: !6, line: 376, type: !42)
!1195 = !DILocation(line: 376, column: 9, scope: !1164)
!1196 = !DILocation(line: 378, column: 5, scope: !1164)
!1197 = !DILocation(line: 380, column: 10, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1164, file: !6, line: 380, column: 9)
!1199 = !DILocation(line: 380, column: 9, scope: !1164)
!1200 = !DILocation(line: 381, column: 9, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1198, file: !6, line: 380, column: 28)
!1202 = !DILocation(line: 388, column: 14, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1164, file: !6, line: 388, column: 9)
!1204 = !DILocation(line: 388, column: 9, scope: !1203)
!1205 = !DILocation(line: 388, column: 26, scope: !1203)
!1206 = !DILocation(line: 388, column: 9, scope: !1164)
!1207 = !DILocation(line: 389, column: 32, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1203, file: !6, line: 388, column: 32)
!1209 = !DILocation(line: 390, column: 32, scope: !1208)
!1210 = !DILocation(line: 391, column: 32, scope: !1208)
!1211 = !DILocation(line: 392, column: 32, scope: !1208)
!1212 = !DILocation(line: 393, column: 5, scope: !1208)
!1213 = !DILocation(line: 394, column: 32, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1203, file: !6, line: 393, column: 12)
!1215 = !DILocation(line: 395, column: 32, scope: !1214)
!1216 = !DILocation(line: 396, column: 32, scope: !1214)
!1217 = !DILocation(line: 397, column: 32, scope: !1214)
!1218 = !DILocation(line: 400, column: 30, scope: !1164)
!1219 = !DILocation(line: 400, column: 5, scope: !1164)
!1220 = !DILocation(line: 400, column: 28, scope: !1164)
