; ModuleID = '/home/raj/lwan/techempower/database.c'
source_filename = "/home/raj/lwan/techempower/database.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.db_mysql = type { %struct.db, ptr }
%struct.db = type { ptr, ptr }
%struct.db_stmt_mysql = type { %struct.db_stmt, ptr, ptr, ptr, i8 }
%struct.db_stmt = type { ptr, ptr, ptr }
%struct.db_sqlite = type { %struct.db, ptr }
%struct.db_stmt_sqlite = type { %struct.db_stmt, ptr }
%struct.db_row = type { %union.anon, i8, i64 }
%union.anon = type { ptr }
%struct.MYSQL_BIND = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i8, i8, i8, i8, ptr }

@.str = private unnamed_addr constant [5 x i8] c"utf8\00", align 1, !dbg !0

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @db_connect_mysql(ptr noundef %0, ptr noundef %1, ptr noundef %2, ptr noundef %3) #0 !dbg !431 {
  %5 = alloca ptr, align 8
  %6 = alloca ptr, align 8
  %7 = alloca ptr, align 8
  %8 = alloca ptr, align 8
  %9 = alloca ptr, align 8
  %10 = alloca ptr, align 8
  store ptr %0, ptr %6, align 8
  call void @llvm.dbg.declare(metadata ptr %6, metadata !435, metadata !DIExpression()), !dbg !436
  store ptr %1, ptr %7, align 8
  call void @llvm.dbg.declare(metadata ptr %7, metadata !437, metadata !DIExpression()), !dbg !438
  store ptr %2, ptr %8, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 203, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "techempower/database.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "b1863d3de4d8cddd800a4bd2ab6539b0")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 5)
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !66, globals: !422, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "/home/raj/lwan/techempower/database.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "b1863d3de4d8cddd800a4bd2ab6539b0")
!9 = !{!10, !48, !55, !60}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "enum_field_types", file: !11, line: 53, baseType: !12, size: 32, elements: !13)
!11 = !DIFile(filename: "/usr/include/mysql/field_types.h", directory: "", checksumkind: CSK_MD5, checksum: "1dac89ddf305112c87b3c4620861815a")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!14 = !DIEnumerator(name: "MYSQL_TYPE_DECIMAL", value: 0)
!15 = !DIEnumerator(name: "MYSQL_TYPE_TINY", value: 1)
!16 = !DIEnumerator(name: "MYSQL_TYPE_SHORT", value: 2)
!17 = !DIEnumerator(name: "MYSQL_TYPE_LONG", value: 3)
!18 = !DIEnumerator(name: "MYSQL_TYPE_FLOAT", value: 4)
!19 = !DIEnumerator(name: "MYSQL_TYPE_DOUBLE", value: 5)
!20 = !DIEnumerator(name: "MYSQL_TYPE_NULL", value: 6)
!21 = !DIEnumerator(name: "MYSQL_TYPE_TIMESTAMP", value: 7)
!22 = !DIEnumerator(name: "MYSQL_TYPE_LONGLONG", value: 8)
!23 = !DIEnumerator(name: "MYSQL_TYPE_INT24", value: 9)
!24 = !DIEnumerator(name: "MYSQL_TYPE_DATE", value: 10)
!25 = !DIEnumerator(name: "MYSQL_TYPE_TIME", value: 11)
!26 = !DIEnumerator(name: "MYSQL_TYPE_DATETIME", value: 12)
!27 = !DIEnumerator(name: "MYSQL_TYPE_YEAR", value: 13)
!28 = !DIEnumerator(name: "MYSQL_TYPE_NEWDATE", value: 14)
!29 = !DIEnumerator(name: "MYSQL_TYPE_VARCHAR", value: 15)
!30 = !DIEnumerator(name: "MYSQL_TYPE_BIT", value: 16)
!31 = !DIEnumerator(name: "MYSQL_TYPE_TIMESTAMP2", value: 17)
!32 = !DIEnumerator(name: "MYSQL_TYPE_DATETIME2", value: 18)
!33 = !DIEnumerator(name: "MYSQL_TYPE_TIME2", value: 19)
!34 = !DIEnumerator(name: "MYSQL_TYPE_TYPED_ARRAY", value: 20)
!35 = !DIEnumerator(name: "MYSQL_TYPE_INVALID", value: 243)
!36 = !DIEnumerator(name: "MYSQL_TYPE_BOOL", value: 244)
!37 = !DIEnumerator(name: "MYSQL_TYPE_JSON", value: 245)
!38 = !DIEnumerator(name: "MYSQL_TYPE_NEWDECIMAL", value: 246)
!39 = !DIEnumerator(name: "MYSQL_TYPE_ENUM", value: 247)
!40 = !DIEnumerator(name: "MYSQL_TYPE_SET", value: 248)
!41 = !DIEnumerator(name: "MYSQL_TYPE_TINY_BLOB", value: 249)
!42 = !DIEnumerator(name: "MYSQL_TYPE_MEDIUM_BLOB", value: 250)
!43 = !DIEnumerator(name: "MYSQL_TYPE_LONG_BLOB", value: 251)
!44 = !DIEnumerator(name: "MYSQL_TYPE_BLOB", value: 252)
!45 = !DIEnumerator(name: "MYSQL_TYPE_VAR_STRING", value: 253)
!46 = !DIEnumerator(name: "MYSQL_TYPE_STRING", value: 254)
!47 = !DIEnumerator(name: "MYSQL_TYPE_GEOMETRY", value: 255)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mysql_status", file: !49, line: 256, baseType: !12, size: 32, elements: !50)
!49 = !DIFile(filename: "/usr/include/mysql/mysql.h", directory: "", checksumkind: CSK_MD5, checksum: "1247b3d6239b685fabf3391bf8ffe6e9")
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "MYSQL_STATUS_READY", value: 0)
!52 = !DIEnumerator(name: "MYSQL_STATUS_GET_RESULT", value: 1)
!53 = !DIEnumerator(name: "MYSQL_STATUS_USE_RESULT", value: 2)
!54 = !DIEnumerator(name: "MYSQL_STATUS_STATEMENT_GET_RESULT", value: 3)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "enum_resultset_metadata", file: !56, line: 1024, baseType: !12, size: 32, elements: !57)
!56 = !DIFile(filename: "/usr/include/mysql/mysql_com.h", directory: "", checksumkind: CSK_MD5, checksum: "948b54ebe3c9fc7d454d9a6494ddab54")
!57 = !{!58, !59}
!58 = !DIEnumerator(name: "RESULTSET_METADATA_NONE", value: 0)
!59 = !DIEnumerator(name: "RESULTSET_METADATA_FULL", value: 1)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "enum_mysql_stmt_state", file: !49, line: 586, baseType: !12, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "MYSQL_STMT_INIT_DONE", value: 1)
!63 = !DIEnumerator(name: "MYSQL_STMT_PREPARE_DONE", value: 2)
!64 = !DIEnumerator(name: "MYSQL_STMT_EXECUTE_DONE", value: 3)
!65 = !DIEnumerator(name: "MYSQL_STMT_FETCH_DONE", value: 4)
!66 = !{!67, !117, !118, !304, !78, !306, !401, !410, !98, !412, !96, !421}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db", file: !2, line: 33, size: 128, elements: !69)
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !68, file: !2, line: 34, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !67}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !68, file: !2, line: 35, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !112, !114, !116}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_stmt", file: !2, line: 27, size: 192, elements: !80)
!80 = !{!81, !104, !108}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "bind", scope: !79, file: !2, line: 28, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !86, !88, !101}
!85 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_row", file: !90, line: 27, size: 192, elements: !91)
!90 = !DIFile(filename: "techempower/database.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "b5199ce24ba11b1ee7482ccc6d0952b7")
!91 = !{!92, !99, !100}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !89, file: !90, line: 31, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !90, line: 28, size: 64, elements: !94)
!94 = !{!95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !93, file: !90, line: 29, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !93, file: !90, line: 30, baseType: !98, size: 32)
!98 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !89, file: !90, line: 32, baseType: !4, size: 8, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !89, file: !90, line: 33, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!103 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !79, file: !2, line: 29, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!85, !86, !88}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !79, file: !2, line: 30, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !78}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_mysql", file: !2, line: 40, size: 192, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !119, file: !2, line: 41, baseType: !68, size: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "con", scope: !119, file: !2, line: 42, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL", file: !49, line: 337, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL", file: !49, line: 299, size: 9280, elements: !126)
!126 = !{!127, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !182, !208, !211, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !278, !279, !280, !281, !282, !286, !296, !300, !301, !303}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "net", scope: !125, file: !49, line: 300, baseType: !128, size: 5312)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET", file: !56, line: 947, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET", file: !56, line: 914, size: 5312, elements: !130)
!130 = !{!131, !134, !137, !138, !139, !140, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !156, !157, !158, !159, !160, !161, !165, !169}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "vio", scope: !129, file: !56, line: 915, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vio", file: !56, line: 894, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !129, file: !56, line: 916, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "buff_end", scope: !129, file: !56, line: 916, baseType: !135, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !129, file: !56, line: 916, baseType: !135, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !129, file: !56, line: 916, baseType: !135, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !129, file: !56, line: 917, baseType: !141, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_socket", file: !49, line: 65, baseType: !98)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "remain_in_buf", scope: !129, file: !56, line: 923, baseType: !103, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !129, file: !56, line: 923, baseType: !103, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "buf_length", scope: !129, file: !56, line: 923, baseType: !103, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "where_b", scope: !129, file: !56, line: 923, baseType: !103, size: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet", scope: !129, file: !56, line: 924, baseType: !103, size: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !129, file: !56, line: 924, baseType: !103, size: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_nr", scope: !129, file: !56, line: 925, baseType: !12, size: 32, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "compress_pkt_nr", scope: !129, file: !56, line: 925, baseType: !12, size: 32, offset: 800)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "write_timeout", scope: !129, file: !56, line: 926, baseType: !12, size: 32, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !129, file: !56, line: 926, baseType: !12, size: 32, offset: 864)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !129, file: !56, line: 926, baseType: !12, size: 32, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fcntl", scope: !129, file: !56, line: 927, baseType: !98, size: 32, offset: 928)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "return_status", scope: !129, file: !56, line: 928, baseType: !155, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reading_or_writing", scope: !129, file: !56, line: 929, baseType: !136, size: 8, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "save_char", scope: !129, file: !56, line: 930, baseType: !136, size: 8, offset: 1032)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !129, file: !56, line: 931, baseType: !85, size: 8, offset: 1040)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "last_errno", scope: !129, file: !56, line: 932, baseType: !12, size: 32, offset: 1056)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !129, file: !56, line: 933, baseType: !136, size: 8, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !129, file: !56, line: 935, baseType: !162, size: 4096, offset: 1096)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4096, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sqlstate", scope: !129, file: !56, line: 937, baseType: !166, size: 48, offset: 5192)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 6)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !129, file: !56, line: 946, baseType: !117, size: 64, offset: 5248)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "connector_fd", scope: !125, file: !49, line: 301, baseType: !135, size: 64, offset: 5312)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !125, file: !49, line: 302, baseType: !96, size: 64, offset: 5376)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !125, file: !49, line: 302, baseType: !96, size: 64, offset: 5440)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !125, file: !49, line: 302, baseType: !96, size: 64, offset: 5504)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !125, file: !49, line: 302, baseType: !96, size: 64, offset: 5568)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "server_version", scope: !125, file: !49, line: 302, baseType: !96, size: 64, offset: 5632)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "host_info", scope: !125, file: !49, line: 302, baseType: !96, size: 64, offset: 5696)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !125, file: !49, line: 303, baseType: !96, size: 64, offset: 5760)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !125, file: !49, line: 303, baseType: !96, size: 64, offset: 5824)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !125, file: !49, line: 304, baseType: !180, size: 64, offset: 5888)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "CHARSET_INFO", file: !49, line: 304, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !125, file: !49, line: 305, baseType: !183, size: 64, offset: 5952)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_FIELD", file: !49, line: 143, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_FIELD", file: !49, line: 121, size: 1024, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !49, line: 122, baseType: !96, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "org_name", scope: !185, file: !49, line: 123, baseType: !96, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !185, file: !49, line: 124, baseType: !96, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "org_table", scope: !185, file: !49, line: 125, baseType: !96, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !185, file: !49, line: 126, baseType: !96, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !185, file: !49, line: 127, baseType: !96, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !185, file: !49, line: 128, baseType: !96, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !185, file: !49, line: 129, baseType: !103, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !185, file: !49, line: 130, baseType: !103, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name_length", scope: !185, file: !49, line: 131, baseType: !12, size: 32, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "org_name_length", scope: !185, file: !49, line: 132, baseType: !12, size: 32, offset: 608)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "table_length", scope: !185, file: !49, line: 133, baseType: !12, size: 32, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "org_table_length", scope: !185, file: !49, line: 134, baseType: !12, size: 32, offset: 672)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "db_length", scope: !185, file: !49, line: 135, baseType: !12, size: 32, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "catalog_length", scope: !185, file: !49, line: 136, baseType: !12, size: 32, offset: 736)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "def_length", scope: !185, file: !49, line: 137, baseType: !12, size: 32, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !49, line: 138, baseType: !12, size: 32, offset: 800)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "decimals", scope: !185, file: !49, line: 139, baseType: !12, size: 32, offset: 832)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "charsetnr", scope: !185, file: !49, line: 140, baseType: !12, size: 32, offset: 864)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !49, line: 141, baseType: !10, size: 32, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !185, file: !49, line: 142, baseType: !117, size: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "field_alloc", scope: !125, file: !49, line: 306, baseType: !209, size: 64, offset: 6016)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_ROOT", file: !49, line: 161, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "affected_rows", scope: !125, file: !49, line: 307, baseType: !212, size: 64, offset: 6080)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !213, line: 27, baseType: !214)
!213 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !215, line: 45, baseType: !103)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "insert_id", scope: !125, file: !49, line: 308, baseType: !212, size: 64, offset: 6144)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "extra_info", scope: !125, file: !49, line: 309, baseType: !212, size: 64, offset: 6208)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !125, file: !49, line: 310, baseType: !103, size: 64, offset: 6272)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !125, file: !49, line: 311, baseType: !103, size: 64, offset: 6336)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !125, file: !49, line: 312, baseType: !12, size: 32, offset: 6400)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "client_flag", scope: !125, file: !49, line: 313, baseType: !103, size: 64, offset: 6464)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "server_capabilities", scope: !125, file: !49, line: 313, baseType: !103, size: 64, offset: 6528)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !125, file: !49, line: 314, baseType: !12, size: 32, offset: 6592)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !125, file: !49, line: 315, baseType: !12, size: 32, offset: 6624)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "server_status", scope: !125, file: !49, line: 316, baseType: !12, size: 32, offset: 6656)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "server_language", scope: !125, file: !49, line: 317, baseType: !12, size: 32, offset: 6688)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "warning_count", scope: !125, file: !49, line: 318, baseType: !12, size: 32, offset: 6720)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !125, file: !49, line: 319, baseType: !229, size: 1920, offset: 6784)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "st_mysql_options", file: !49, line: 225, size: 1920, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !265, !269, !273, !274, !275}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "connect_timeout", scope: !229, file: !49, line: 226, baseType: !12, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !229, file: !49, line: 226, baseType: !12, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "write_timeout", scope: !229, file: !49, line: 226, baseType: !12, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !229, file: !49, line: 227, baseType: !12, size: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !229, file: !49, line: 227, baseType: !12, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "client_flag", scope: !229, file: !49, line: 228, baseType: !103, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !229, file: !49, line: 229, baseType: !96, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !229, file: !49, line: 229, baseType: !96, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !229, file: !49, line: 229, baseType: !96, size: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !229, file: !49, line: 229, baseType: !96, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !229, file: !49, line: 229, baseType: !96, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init_commands", scope: !229, file: !49, line: 230, baseType: !243, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Init_commands_array", file: !49, line: 230, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "my_cnf_file", scope: !229, file: !49, line: 231, baseType: !96, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "my_cnf_group", scope: !229, file: !49, line: 231, baseType: !96, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "charset_dir", scope: !229, file: !49, line: 231, baseType: !96, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "charset_name", scope: !229, file: !49, line: 231, baseType: !96, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_key", scope: !229, file: !49, line: 232, baseType: !96, size: 64, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_cert", scope: !229, file: !49, line: 233, baseType: !96, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ca", scope: !229, file: !49, line: 234, baseType: !96, size: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_capath", scope: !229, file: !49, line: 235, baseType: !96, size: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_cipher", scope: !229, file: !49, line: 236, baseType: !96, size: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory_base_name", scope: !229, file: !49, line: 237, baseType: !96, size: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "max_allowed_packet", scope: !229, file: !49, line: 238, baseType: !103, size: 64, offset: 1280)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !229, file: !49, line: 239, baseType: !85, size: 8, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "named_pipe", scope: !229, file: !49, line: 239, baseType: !85, size: 8, offset: 1352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bind_address", scope: !229, file: !49, line: 243, baseType: !96, size: 64, offset: 1408)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "report_data_truncation", scope: !229, file: !49, line: 245, baseType: !85, size: 8, offset: 1472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_init", scope: !229, file: !49, line: 248, baseType: !261, size: 64, offset: 1536)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!98, !264, !114, !117}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_read", scope: !229, file: !49, line: 249, baseType: !266, size: 64, offset: 1600)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!98, !117, !96, !12}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_end", scope: !229, file: !49, line: 250, baseType: !270, size: 64, offset: 1664)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !117}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_error", scope: !229, file: !49, line: 251, baseType: !266, size: 64, offset: 1728)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_userdata", scope: !229, file: !49, line: 252, baseType: !117, size: 64, offset: 1792)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !229, file: !49, line: 253, baseType: !276, size: 64, offset: 1856)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "st_mysql_options_extention", file: !49, line: 223, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !125, file: !49, line: 320, baseType: !48, size: 32, offset: 8704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "resultset_metadata", scope: !125, file: !49, line: 321, baseType: !55, size: 32, offset: 8736)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !125, file: !49, line: 322, baseType: !85, size: 8, offset: 8768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect", scope: !125, file: !49, line: 323, baseType: !85, size: 8, offset: 8776)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scramble", scope: !125, file: !49, line: 326, baseType: !283, size: 168, offset: 8784)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 21)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "stmts", scope: !125, file: !49, line: 328, baseType: !287, size: 64, offset: 8960)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST", file: !289, line: 39, baseType: !290)
!289 = !DIFile(filename: "/usr/include/mysql/my_list.h", directory: "", checksumkind: CSK_MD5, checksum: "2c916b19e4f514cea577a95404bf2fb6")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LIST", file: !289, line: 36, size: 192, elements: !291)
!291 = !{!292, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !289, line: 37, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !289, line: 37, baseType: !293, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !290, file: !289, line: 38, baseType: !117, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !125, file: !49, line: 329, baseType: !297, size: 64, offset: 9024)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_METHODS", file: !49, line: 296, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "thd", scope: !125, file: !49, line: 330, baseType: !117, size: 64, offset: 9088)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "unbuffered_fetch_owner", scope: !125, file: !49, line: 335, baseType: !302, size: 64, offset: 9152)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !125, file: !49, line: 336, baseType: !117, size: 64, offset: 9216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_stmt_mysql", file: !2, line: 45, size: 448, elements: !308)
!308 = !{!309, !310, !398, !399, !400}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !307, file: !2, line: 46, baseType: !79, size: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !307, file: !2, line: 47, baseType: !311, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_STMT", file: !49, line: 726, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_STMT", file: !49, line: 683, size: 5632, elements: !314)
!314 = !{!315, !316, !317, !318, !352, !353, !354, !372, !373, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mem_root", scope: !313, file: !49, line: 684, baseType: !209, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !313, file: !49, line: 685, baseType: !288, size: 192, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mysql", scope: !313, file: !49, line: 686, baseType: !123, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !313, file: !49, line: 687, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_BIND", file: !49, line: 678, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_BIND", file: !49, line: 656, size: 896, elements: !322)
!322 = !{!323, !325, !326, !327, !328, !329, !335, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !321, file: !49, line: 657, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "is_null", scope: !321, file: !49, line: 658, baseType: !302, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !321, file: !49, line: 659, baseType: !117, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !321, file: !49, line: 661, baseType: !302, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "row_ptr", scope: !321, file: !49, line: 662, baseType: !135, size: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "store_param_func", scope: !321, file: !49, line: 663, baseType: !330, size: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !334}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_result", scope: !321, file: !49, line: 664, baseType: !336, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !334, !183, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "skip_result", scope: !321, file: !49, line: 665, baseType: !336, size: 64, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !321, file: !49, line: 667, baseType: !103, size: 64, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !321, file: !49, line: 668, baseType: !103, size: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "length_value", scope: !321, file: !49, line: 669, baseType: !103, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "param_number", scope: !321, file: !49, line: 670, baseType: !12, size: 32, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pack_length", scope: !321, file: !49, line: 671, baseType: !12, size: 32, offset: 736)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_type", scope: !321, file: !49, line: 672, baseType: !10, size: 32, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "error_value", scope: !321, file: !49, line: 673, baseType: !85, size: 8, offset: 800)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "is_unsigned", scope: !321, file: !49, line: 674, baseType: !85, size: 8, offset: 808)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "long_data_used", scope: !321, file: !49, line: 675, baseType: !85, size: 8, offset: 816)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "is_null_value", scope: !321, file: !49, line: 676, baseType: !85, size: 8, offset: 824)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !321, file: !49, line: 677, baseType: !117, size: 64, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bind", scope: !313, file: !49, line: 688, baseType: !319, size: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !313, file: !49, line: 689, baseType: !183, size: 64, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !313, file: !49, line: 690, baseType: !355, size: 256, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_DATA", file: !49, line: 168, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_DATA", file: !49, line: 163, size: 256, elements: !357)
!357 = !{!358, !369, !370, !371}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !356, file: !49, line: 164, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_ROWS", file: !49, line: 157, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_ROWS", file: !49, line: 153, size: 192, elements: !362)
!362 = !{!363, !365, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !361, file: !49, line: 154, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !361, file: !49, line: 155, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_ROW", file: !49, line: 145, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !361, file: !49, line: 156, baseType: !103, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !356, file: !49, line: 165, baseType: !209, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !356, file: !49, line: 166, baseType: !212, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !356, file: !49, line: 167, baseType: !12, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data_cursor", scope: !313, file: !49, line: 691, baseType: !359, size: 64, offset: 768)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_func", scope: !313, file: !49, line: 696, baseType: !374, size: 64, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!98, !377, !339}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "affected_rows", scope: !313, file: !49, line: 698, baseType: !212, size: 64, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "insert_id", scope: !313, file: !49, line: 699, baseType: !212, size: 64, offset: 960)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_id", scope: !313, file: !49, line: 700, baseType: !103, size: 64, offset: 1024)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !49, line: 701, baseType: !103, size: 64, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prefetch_rows", scope: !313, file: !49, line: 702, baseType: !103, size: 64, offset: 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "server_status", scope: !313, file: !49, line: 707, baseType: !12, size: 32, offset: 1216)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "last_errno", scope: !313, file: !49, line: 708, baseType: !12, size: 32, offset: 1248)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !313, file: !49, line: 709, baseType: !12, size: 32, offset: 1280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !313, file: !49, line: 710, baseType: !12, size: 32, offset: 1312)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !49, line: 711, baseType: !60, size: 32, offset: 1344)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !313, file: !49, line: 712, baseType: !162, size: 4096, offset: 1376)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sqlstate", scope: !313, file: !49, line: 713, baseType: !166, size: 48, offset: 5472)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "send_types_to_server", scope: !313, file: !49, line: 715, baseType: !85, size: 8, offset: 5520)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bind_param_done", scope: !313, file: !49, line: 716, baseType: !85, size: 8, offset: 5528)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bind_result_done", scope: !313, file: !49, line: 717, baseType: !136, size: 8, offset: 5536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "unbuffered_fetch_cancelled", scope: !313, file: !49, line: 719, baseType: !85, size: 8, offset: 5544)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "update_max_length", scope: !313, file: !49, line: 724, baseType: !85, size: 8, offset: 5552)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !313, file: !49, line: 725, baseType: !396, size: 64, offset: 5568)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_STMT_EXT", file: !49, line: 680, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "param_bind", scope: !307, file: !2, line: 48, baseType: !319, size: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "result_bind", scope: !307, file: !2, line: 49, baseType: !319, size: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "must_execute_again", scope: !307, file: !2, line: 50, baseType: !85, size: 8, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_sqlite", file: !2, line: 219, size: 192, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !402, file: !2, line: 220, baseType: !68, size: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sqlite", scope: !402, file: !2, line: 221, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3", file: !408, line: 272, baseType: !409)
!408 = !DIFile(filename: "/usr/include/sqlite3.h", directory: "", checksumkind: CSK_MD5, checksum: "a588c4681dc2c3e9f3424818d7f39d50")
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", file: !408, line: 272, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_stmt_sqlite", file: !2, line: 224, size: 256, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !414, file: !2, line: 225, baseType: !79, size: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sqlite", scope: !414, file: !2, line: 226, baseType: !418, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !408, line: 3892, baseType: !420)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !408, line: 3892, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!422 = !{!0}
!423 = !{i32 7, !"Dwarf Version", i32 5}
!424 = !{i32 2, !"Debug Info Version", i32 3}
!425 = !{i32 1, !"wchar_size", i32 4}
!426 = !{i32 8, !"PIC Level", i32 2}
!427 = !{i32 7, !"PIE Level", i32 2}
!428 = !{i32 7, !"uwtable", i32 2}
!429 = !{i32 7, !"frame-pointer", i32 2}
!430 = !{!"clang version 16.0.0"}
!431 = distinct !DISubprogram(name: "db_connect_mysql", scope: !2, file: !2, line: 186, type: !432, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !434)
!432 = !DISubroutineType(types: !433)
!433 = !{!67, !114, !114, !114, !114}
!434 = !{}
!435 = !DILocalVariable(name: "host", arg: 1, scope: !431, file: !2, line: 186, type: !114)
!436 = !DILocation(line: 186, column: 41, scope: !431)
!437 = !DILocalVariable(name: "user", arg: 2, scope: !431, file: !2, line: 186, type: !114)
!438 = !DILocation(line: 186, column: 59, scope: !431)
!439 = !DILocalVariable(name: "pass", arg: 3, scope: !431, file: !2, line: 186, type: !114)
!440 = !DILocation(line: 186, column: 77, scope: !431)
!441 = !DILocalVariable(name: "database", arg: 4, scope: !431, file: !2, line: 187, type: !114)
!442 = !DILocation(line: 187, column: 21, scope: !431)
!443 = !DILocalVariable(name: "db_mysql", scope: !431, file: !2, line: 189, type: !118)
!444 = !DILocation(line: 189, column: 22, scope: !431)
!445 = !DILocation(line: 189, column: 33, scope: !431)
!446 = !DILocation(line: 191, column: 10, scope: !447)
!447 = distinct !DILexicalBlock(scope: !431, file: !2, line: 191, column: 9)
!448 = !DILocation(line: 191, column: 9, scope: !431)
!449 = !DILocation(line: 192, column: 9, scope: !447)
!450 = !DILocation(line: 194, column: 21, scope: !431)
!451 = !DILocation(line: 194, column: 5, scope: !431)
!452 = !DILocation(line: 194, column: 15, scope: !431)
!453 = !DILocation(line: 194, column: 19, scope: !431)
!454 = !DILocation(line: 195, column: 10, scope: !455)
!455 = distinct !DILexicalBlock(scope: !431, file: !2, line: 195, column: 9)
!456 = !DILocation(line: 195, column: 20, scope: !455)
!457 = !DILocation(line: 195, column: 9, scope: !431)
!458 = !DILocation(line: 196, column: 14, scope: !459)
!459 = distinct !DILexicalBlock(scope: !455, file: !2, line: 195, column: 25)
!460 = !DILocation(line: 196, column: 9, scope: !459)
!461 = !DILocation(line: 197, column: 9, scope: !459)
!462 = !DILocation(line: 200, column: 29, scope: !463)
!463 = distinct !DILexicalBlock(scope: !431, file: !2, line: 200, column: 9)
!464 = !DILocation(line: 200, column: 39, scope: !463)
!465 = !DILocation(line: 200, column: 44, scope: !463)
!466 = !DILocation(line: 200, column: 50, scope: !463)
!467 = !DILocation(line: 200, column: 56, scope: !463)
!468 = !DILocation(line: 200, column: 62, scope: !463)
!469 = !DILocation(line: 200, column: 10, scope: !463)
!470 = !DILocation(line: 200, column: 9, scope: !431)
!471 = !DILocation(line: 201, column: 9, scope: !463)
!472 = !DILocation(line: 203, column: 33, scope: !473)
!473 = distinct !DILexicalBlock(scope: !431, file: !2, line: 203, column: 9)
!474 = !DILocation(line: 203, column: 43, scope: !473)
!475 = !DILocation(line: 203, column: 9, scope: !473)
!476 = !DILocation(line: 203, column: 9, scope: !431)
!477 = !DILocation(line: 204, column: 9, scope: !473)
!478 = !DILocation(line: 206, column: 5, scope: !431)
!479 = !DILocation(line: 206, column: 15, scope: !431)
!480 = !DILocation(line: 206, column: 20, scope: !431)
!481 = !DILocation(line: 206, column: 31, scope: !431)
