; ModuleID = 'encoder/analyse.c'
source_filename = "encoder/analyse.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.vlc_t = type { i8, i8 }
%struct.anon.16 = type { i32, i32 }
%struct.bs_s = type { ptr, ptr, ptr, i64, i32, i32 }
%struct.x264_cabac_t = type { i32, i32, i32, i32, ptr, ptr, ptr, [8 x i8], i32, [460 x i8] }
%struct.x264_t = type { %struct.x264_param_t, [128 x ptr], i64, i32, i32, %struct.anon.2, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], ptr, [8 x i8], [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], %struct.x264_slice_header_t, [8 x i8], %struct.x264_cabac_t, %struct.anon.6, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], %struct.anon.8, %struct.anon.9, ptr, %struct.anon.12, [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t }

!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2174, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 144, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 18)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2174, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 312, elements: !211)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!211 = !{!212}
!212 = !DISubrange(count: 39)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !3, line: 2311, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 248, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 31)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !220, line: 607, type: !221, isLocal: true, isDefinition: true)
!220 = !DIFile(filename: "encoder/slicetype.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2238c27eae5c326d345e4c6d9e629f8c")
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 544, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 68)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !220, line: 627, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 464, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 58)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "cabac_transition_unary", scope: !2, file: !231, line: 32, type: !232, isLocal: true, isDefinition: true)
!231 = !DIFile(filename: "encoder/rdo.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "ecd65cf8d00dca338163b4d922b36aab")
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 15360, elements: !236)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !132, line: 24, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !134, line: 38, baseType: !235)
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !{!237, !238}
!237 = !DISubrange(count: 15)
!238 = !DISubrange(count: 128)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "cabac_transition_5ones", scope: !2, file: !231, line: 36, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 1024, elements: !242)
!242 = !{!238}
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "cabac_size_5ones", scope: !2, file: !231, line: 37, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 2048, elements: !242)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "x264_cost_mv_fpel", scope: !2, file: !3, line: 170, type: !248, isLocal: false, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 13312, elements: !249)
!249 = !{!193, !250}
!250 = !DISubrange(count: 4)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "i_mb_len", scope: !253, file: !254, line: 169, type: !1336, isLocal: true, isDefinition: true)
!253 = distinct !DISubprogram(name: "x264_cabac_mb_type", scope: !254, file: !254, line: 66, type: !255, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1319)
!254 = !DIFile(filename: "encoder/cabac.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "c9c24ec8592c82ee854c1579a041070e")
!255 = !DISubroutineType(types: !256)
!256 = !{null, !257, !1318}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !259, line: 42, baseType: !260)
!259 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !29, line: 250, size: 206080, elements: !261)
!261 = !{!262, !403, !405, !408, !409, !410, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !523, !525, !553, !555, !556, !562, !567, !571, !575, !579, !583, !584, !585, !586, !589, !591, !593, !633, !650, !805, !806, !807, !808, !812, !813, !814, !815, !829, !980, !984, !1038, !1046, !1047, !1055, !1057, !1125, !1185, !1237, !1258, !1298}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !260, file: !29, line: 253, baseType: !263, size: 4928)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !259, line: 295, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !259, line: 151, size: 4928, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !306, !308, !309, !310, !311, !313, !314, !327, !328, !329, !330, !331, !361, !400, !401, !402}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !264, file: !259, line: 154, baseType: !7, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !264, file: !259, line: 155, baseType: !152, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !264, file: !259, line: 156, baseType: !152, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !264, file: !259, line: 159, baseType: !152, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !264, file: !259, line: 160, baseType: !152, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !264, file: !259, line: 161, baseType: !152, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !264, file: !259, line: 162, baseType: !152, size: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !264, file: !259, line: 163, baseType: !152, size: 32, offset: 224)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !264, file: !259, line: 180, baseType: !275, size: 288, offset: 256)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !264, file: !259, line: 165, size: 288, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !275, file: !259, line: 168, baseType: !152, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !275, file: !259, line: 169, baseType: !152, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !275, file: !259, line: 171, baseType: !152, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !275, file: !259, line: 174, baseType: !152, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !275, file: !259, line: 175, baseType: !152, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !275, file: !259, line: 176, baseType: !152, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !275, file: !259, line: 177, baseType: !152, size: 32, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !275, file: !259, line: 178, baseType: !152, size: 32, offset: 224)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !275, file: !259, line: 179, baseType: !152, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !264, file: !259, line: 182, baseType: !152, size: 32, offset: 544)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !264, file: !259, line: 183, baseType: !152, size: 32, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !264, file: !259, line: 186, baseType: !152, size: 32, offset: 608)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !264, file: !259, line: 187, baseType: !152, size: 32, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !264, file: !259, line: 188, baseType: !152, size: 32, offset: 672)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !264, file: !259, line: 189, baseType: !152, size: 32, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !264, file: !259, line: 190, baseType: !152, size: 32, offset: 736)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !264, file: !259, line: 191, baseType: !152, size: 32, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !264, file: !259, line: 192, baseType: !152, size: 32, offset: 800)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !264, file: !259, line: 193, baseType: !152, size: 32, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !264, file: !259, line: 194, baseType: !152, size: 32, offset: 864)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !264, file: !259, line: 196, baseType: !152, size: 32, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !264, file: !259, line: 197, baseType: !152, size: 32, offset: 928)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !264, file: !259, line: 198, baseType: !152, size: 32, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !264, file: !259, line: 200, baseType: !152, size: 32, offset: 992)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !264, file: !259, line: 201, baseType: !152, size: 32, offset: 1024)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !264, file: !259, line: 203, baseType: !152, size: 32, offset: 1056)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !264, file: !259, line: 205, baseType: !152, size: 32, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !264, file: !259, line: 206, baseType: !305, size: 64, offset: 1152)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !264, file: !259, line: 207, baseType: !307, size: 128, offset: 1216)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 128, elements: !159)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !264, file: !259, line: 208, baseType: !307, size: 128, offset: 1344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !264, file: !259, line: 209, baseType: !307, size: 128, offset: 1472)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !264, file: !259, line: 210, baseType: !307, size: 128, offset: 1600)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !264, file: !259, line: 211, baseType: !312, size: 512, offset: 1728)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 512, elements: !175)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !264, file: !259, line: 212, baseType: !312, size: 512, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !264, file: !259, line: 215, baseType: !315, size: 64, offset: 2752)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !141, !152, !318, !319}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !321)
!321 = !{!322, !324, !325, !326}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !320, file: !323, baseType: !7, size: 32)
!323 = !DIFile(filename: "encoder/analyse.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !320, file: !323, baseType: !7, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !320, file: !323, baseType: !141, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !320, file: !323, baseType: !141, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !264, file: !259, line: 216, baseType: !141, size: 64, offset: 2816)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !264, file: !259, line: 217, baseType: !152, size: 32, offset: 2880)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !264, file: !259, line: 218, baseType: !152, size: 32, offset: 2912)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !264, file: !259, line: 219, baseType: !305, size: 64, offset: 2944)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !264, file: !259, line: 252, baseType: !332, size: 768, offset: 3008)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !264, file: !259, line: 222, size: 768, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !354, !355, !359, !360}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !332, file: !259, line: 224, baseType: !7, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !332, file: !259, line: 225, baseType: !7, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !332, file: !259, line: 227, baseType: !152, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !332, file: !259, line: 228, baseType: !152, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !332, file: !259, line: 229, baseType: !152, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !332, file: !259, line: 230, baseType: !152, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !332, file: !259, line: 231, baseType: !152, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !332, file: !259, line: 233, baseType: !152, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !332, file: !259, line: 234, baseType: !152, size: 32, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !332, file: !259, line: 235, baseType: !152, size: 32, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !332, file: !259, line: 236, baseType: !152, size: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !332, file: !259, line: 237, baseType: !152, size: 32, offset: 352)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !332, file: !259, line: 238, baseType: !152, size: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !332, file: !259, line: 239, baseType: !152, size: 32, offset: 416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !332, file: !259, line: 240, baseType: !152, size: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !332, file: !259, line: 241, baseType: !152, size: 32, offset: 480)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !332, file: !259, line: 242, baseType: !152, size: 32, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !332, file: !259, line: 243, baseType: !152, size: 32, offset: 544)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !332, file: !259, line: 244, baseType: !353, size: 32, offset: 576)
!353 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !332, file: !259, line: 245, baseType: !353, size: 32, offset: 608)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !332, file: !259, line: 248, baseType: !356, size: 64, offset: 640)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 2)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !332, file: !259, line: 250, baseType: !152, size: 32, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !332, file: !259, line: 251, baseType: !152, size: 32, offset: 736)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !264, file: !259, line: 289, baseType: !362, size: 1024, offset: 3776)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !264, file: !259, line: 255, size: 1024, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !398, !399}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !362, file: !259, line: 257, baseType: !152, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !362, file: !259, line: 259, baseType: !152, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !362, file: !259, line: 260, baseType: !152, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !362, file: !259, line: 261, baseType: !152, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !362, file: !259, line: 262, baseType: !152, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !362, file: !259, line: 264, baseType: !152, size: 32, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !362, file: !259, line: 265, baseType: !353, size: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !362, file: !259, line: 266, baseType: !353, size: 32, offset: 224)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !362, file: !259, line: 267, baseType: !152, size: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !362, file: !259, line: 268, baseType: !152, size: 32, offset: 288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !362, file: !259, line: 269, baseType: !353, size: 32, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !362, file: !259, line: 270, baseType: !353, size: 32, offset: 352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !362, file: !259, line: 271, baseType: !353, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !362, file: !259, line: 273, baseType: !152, size: 32, offset: 416)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !362, file: !259, line: 274, baseType: !353, size: 32, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !362, file: !259, line: 277, baseType: !152, size: 32, offset: 480)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !362, file: !259, line: 278, baseType: !305, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !362, file: !259, line: 279, baseType: !152, size: 32, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !362, file: !259, line: 280, baseType: !305, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !362, file: !259, line: 283, baseType: !353, size: 32, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !362, file: !259, line: 284, baseType: !353, size: 32, offset: 736)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !362, file: !259, line: 285, baseType: !353, size: 32, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !362, file: !259, line: 286, baseType: !387, size: 64, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !259, line: 149, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 142, size: 256, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !389, file: !259, line: 144, baseType: !152, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !389, file: !259, line: 144, baseType: !152, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !389, file: !259, line: 145, baseType: !152, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !389, file: !259, line: 146, baseType: !152, size: 32, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !389, file: !259, line: 147, baseType: !353, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !389, file: !259, line: 148, baseType: !397, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !362, file: !259, line: 287, baseType: !152, size: 32, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !362, file: !259, line: 288, baseType: !305, size: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !264, file: !259, line: 292, baseType: !152, size: 32, offset: 4800)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !264, file: !259, line: 293, baseType: !152, size: 32, offset: 4832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !264, file: !259, line: 294, baseType: !152, size: 32, offset: 4864)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !260, file: !29, line: 255, baseType: !404, size: 8192, offset: 4928)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 8192, elements: !242)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !260, file: !29, line: 256, baseType: !406, size: 64, offset: 13120)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !407, line: 27, baseType: !135)
!407 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !260, file: !29, line: 257, baseType: !152, size: 32, offset: 13184)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !260, file: !29, line: 258, baseType: !152, size: 32, offset: 13216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !260, file: !29, line: 269, baseType: !411, size: 2112, offset: 13248)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !29, line: 261, size: 2112, elements: !412)
!412 = !{!413, !414, !426, !427, !428, !442}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !411, file: !29, line: 263, baseType: !152, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !411, file: !29, line: 264, baseType: !415, size: 1536, offset: 64)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 1536, elements: !424)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !259, line: 399, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 391, size: 192, elements: !418)
!418 = !{!419, !420, !421, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !417, file: !259, line: 393, baseType: !152, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !417, file: !259, line: 394, baseType: !152, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !417, file: !259, line: 397, baseType: !152, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !417, file: !259, line: 398, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!424 = !{!425}
!425 = !DISubrange(count: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !411, file: !29, line: 265, baseType: !152, size: 32, offset: 1600)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !411, file: !29, line: 266, baseType: !423, size: 64, offset: 1664)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !411, file: !29, line: 267, baseType: !429, size: 320, offset: 1728)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !430, line: 49, baseType: !431)
!430 = !DIFile(filename: "./common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !430, line: 40, size: 320, elements: !432)
!432 = !{!433, !434, !435, !436, !440, !441}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !431, file: !430, line: 42, baseType: !423, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !431, file: !430, line: 43, baseType: !423, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !431, file: !430, line: 44, baseType: !423, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !431, file: !430, line: 46, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !438, line: 267, baseType: !439)
!438 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !134, line: 207, baseType: !185)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !431, file: !430, line: 47, baseType: !152, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !431, file: !430, line: 48, baseType: !152, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !411, file: !29, line: 268, baseType: !152, size: 32, offset: 2048)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !260, file: !29, line: 274, baseType: !152, size: 32, offset: 15360)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !260, file: !29, line: 276, baseType: !152, size: 32, offset: 15392)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !260, file: !29, line: 277, baseType: !152, size: 32, offset: 15424)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !260, file: !29, line: 278, baseType: !152, size: 32, offset: 15456)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !260, file: !29, line: 279, baseType: !152, size: 32, offset: 15488)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !260, file: !29, line: 280, baseType: !152, size: 32, offset: 15520)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !260, file: !29, line: 282, baseType: !152, size: 32, offset: 15552)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !260, file: !29, line: 283, baseType: !152, size: 32, offset: 15584)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !260, file: !29, line: 284, baseType: !152, size: 32, offset: 15616)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !260, file: !29, line: 287, baseType: !453, size: 9920, offset: 15648)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 9920, elements: !521)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !102, line: 133, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 52, size: 9920, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !474, !475, !476, !477, !478, !479, !480, !481, !482, !489, !490, !520}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !455, file: !102, line: 54, baseType: !152, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !455, file: !102, line: 56, baseType: !152, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !455, file: !102, line: 57, baseType: !152, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !455, file: !102, line: 59, baseType: !152, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !455, file: !102, line: 60, baseType: !152, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !455, file: !102, line: 61, baseType: !152, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !455, file: !102, line: 63, baseType: !152, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !455, file: !102, line: 65, baseType: !152, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !455, file: !102, line: 67, baseType: !152, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !455, file: !102, line: 69, baseType: !152, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !455, file: !102, line: 70, baseType: !152, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !455, file: !102, line: 71, baseType: !152, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !455, file: !102, line: 72, baseType: !152, size: 32, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !455, file: !102, line: 73, baseType: !471, size: 8192, offset: 416)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8192, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !455, file: !102, line: 75, baseType: !152, size: 32, offset: 8608)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !455, file: !102, line: 76, baseType: !152, size: 32, offset: 8640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !455, file: !102, line: 77, baseType: !152, size: 32, offset: 8672)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !455, file: !102, line: 78, baseType: !152, size: 32, offset: 8704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !455, file: !102, line: 79, baseType: !152, size: 32, offset: 8736)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !455, file: !102, line: 80, baseType: !152, size: 32, offset: 8768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !455, file: !102, line: 81, baseType: !152, size: 32, offset: 8800)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !455, file: !102, line: 83, baseType: !152, size: 32, offset: 8832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !455, file: !102, line: 90, baseType: !483, size: 128, offset: 8864)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !455, file: !102, line: 84, size: 128, elements: !484)
!484 = !{!485, !486, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !483, file: !102, line: 86, baseType: !152, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !483, file: !102, line: 87, baseType: !152, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !483, file: !102, line: 88, baseType: !152, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !483, file: !102, line: 89, baseType: !152, size: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !455, file: !102, line: 92, baseType: !152, size: 32, offset: 8992)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !455, file: !102, line: 129, baseType: !491, size: 864, offset: 9024)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !455, file: !102, line: 93, size: 864, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !491, file: !102, line: 95, baseType: !152, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !491, file: !102, line: 96, baseType: !152, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !491, file: !102, line: 97, baseType: !152, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !491, file: !102, line: 99, baseType: !152, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !491, file: !102, line: 100, baseType: !152, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !491, file: !102, line: 102, baseType: !152, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !491, file: !102, line: 103, baseType: !152, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !491, file: !102, line: 104, baseType: !152, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !491, file: !102, line: 105, baseType: !152, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !491, file: !102, line: 106, baseType: !152, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !491, file: !102, line: 107, baseType: !152, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !491, file: !102, line: 108, baseType: !152, size: 32, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !491, file: !102, line: 110, baseType: !152, size: 32, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !491, file: !102, line: 111, baseType: !152, size: 32, offset: 416)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !491, file: !102, line: 112, baseType: !152, size: 32, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !491, file: !102, line: 114, baseType: !152, size: 32, offset: 480)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !491, file: !102, line: 115, baseType: !152, size: 32, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !491, file: !102, line: 116, baseType: !152, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !491, file: !102, line: 117, baseType: !152, size: 32, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !491, file: !102, line: 119, baseType: !152, size: 32, offset: 608)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !491, file: !102, line: 120, baseType: !152, size: 32, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !491, file: !102, line: 121, baseType: !152, size: 32, offset: 672)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !491, file: !102, line: 122, baseType: !152, size: 32, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !491, file: !102, line: 123, baseType: !152, size: 32, offset: 736)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !491, file: !102, line: 124, baseType: !152, size: 32, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !491, file: !102, line: 125, baseType: !152, size: 32, offset: 800)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !491, file: !102, line: 126, baseType: !152, size: 32, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !455, file: !102, line: 131, baseType: !152, size: 32, offset: 9888)
!521 = !{!522}
!522 = !DISubrange(count: 1)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !260, file: !29, line: 288, baseType: !524, size: 64, offset: 25600)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !260, file: !29, line: 289, baseType: !526, size: 960, offset: 25664)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 960, elements: !521)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !102, line: 165, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !102, line: 135, size: 960, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !528, file: !102, line: 137, baseType: !152, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !528, file: !102, line: 138, baseType: !152, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !528, file: !102, line: 140, baseType: !152, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !528, file: !102, line: 142, baseType: !152, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !528, file: !102, line: 143, baseType: !152, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !528, file: !102, line: 145, baseType: !152, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !528, file: !102, line: 146, baseType: !152, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !528, file: !102, line: 148, baseType: !152, size: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !528, file: !102, line: 149, baseType: !152, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !528, file: !102, line: 151, baseType: !152, size: 32, offset: 288)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !528, file: !102, line: 152, baseType: !152, size: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !528, file: !102, line: 154, baseType: !152, size: 32, offset: 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !528, file: !102, line: 156, baseType: !152, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !528, file: !102, line: 157, baseType: !152, size: 32, offset: 416)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !528, file: !102, line: 158, baseType: !152, size: 32, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !528, file: !102, line: 160, baseType: !152, size: 32, offset: 480)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !528, file: !102, line: 162, baseType: !152, size: 32, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !528, file: !102, line: 163, baseType: !548, size: 384, offset: 576)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 384, elements: !551)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!551 = !{!552}
!552 = !DISubrange(count: 6)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !260, file: !29, line: 290, baseType: !554, size: 64, offset: 26624)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !260, file: !29, line: 291, baseType: !152, size: 32, offset: 26688)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !260, file: !29, line: 294, baseType: !557, size: 256, offset: 26752)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 256, elements: !561)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !560)
!560 = !{!250, !250}
!561 = !{!250}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !260, file: !29, line: 295, baseType: !563, size: 128, offset: 27008)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 128, elements: !357)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, elements: !566)
!566 = !{!425, !425}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !260, file: !29, line: 297, baseType: !568, size: 256, offset: 27136)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 256, elements: !561)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !159)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !260, file: !29, line: 298, baseType: !572, size: 128, offset: 27392)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 128, elements: !357)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, elements: !175)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !260, file: !29, line: 300, baseType: !576, size: 256, offset: 27520)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 256, elements: !561)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !159)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !260, file: !29, line: 301, baseType: !580, size: 128, offset: 27776)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 128, elements: !357)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !175)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !260, file: !29, line: 302, baseType: !576, size: 256, offset: 27904)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !260, file: !29, line: 303, baseType: !580, size: 128, offset: 28160)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !260, file: !29, line: 305, baseType: !549, size: 64, offset: 28288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !260, file: !29, line: 307, baseType: !587, size: 4096, align: 128, offset: 28416)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 4096, elements: !588)
!588 = !{!358, !176}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !260, file: !29, line: 308, baseType: !590, size: 2048, align: 128, offset: 32512)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 2048, elements: !588)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !260, file: !29, line: 309, baseType: !592, size: 64, offset: 34560)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !357)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !260, file: !29, line: 312, baseType: !594, size: 3072, offset: 34624)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !29, line: 209, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 159, size: 3072, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !625, !626, !627, !628, !629, !630, !631, !632}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !595, file: !29, line: 161, baseType: !524, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !595, file: !29, line: 162, baseType: !554, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !595, file: !29, line: 164, baseType: !152, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !595, file: !29, line: 165, baseType: !152, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !595, file: !29, line: 166, baseType: !152, size: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !595, file: !29, line: 168, baseType: !152, size: 32, offset: 224)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !595, file: !29, line: 170, baseType: !152, size: 32, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !595, file: !29, line: 172, baseType: !152, size: 32, offset: 288)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !595, file: !29, line: 173, baseType: !152, size: 32, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !595, file: !29, line: 174, baseType: !152, size: 32, offset: 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !595, file: !29, line: 176, baseType: !152, size: 32, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !595, file: !29, line: 178, baseType: !152, size: 32, offset: 416)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !595, file: !29, line: 179, baseType: !152, size: 32, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !595, file: !29, line: 181, baseType: !356, size: 64, offset: 480)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !595, file: !29, line: 182, baseType: !152, size: 32, offset: 544)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !595, file: !29, line: 184, baseType: !152, size: 32, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !595, file: !29, line: 186, baseType: !152, size: 32, offset: 608)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !595, file: !29, line: 187, baseType: !152, size: 32, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !595, file: !29, line: 188, baseType: !152, size: 32, offset: 672)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !595, file: !29, line: 190, baseType: !152, size: 32, offset: 704)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !595, file: !29, line: 191, baseType: !152, size: 32, offset: 736)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !595, file: !29, line: 195, baseType: !619, size: 2048, offset: 768)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 2048, elements: !624)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !29, line: 192, size: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !620, file: !29, line: 193, baseType: !152, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !620, file: !29, line: 194, baseType: !152, size: 32, offset: 32)
!624 = !{!358, !160}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !595, file: !29, line: 197, baseType: !152, size: 32, offset: 2816)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !595, file: !29, line: 199, baseType: !152, size: 32, offset: 2848)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !595, file: !29, line: 200, baseType: !152, size: 32, offset: 2880)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !595, file: !29, line: 201, baseType: !152, size: 32, offset: 2912)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !595, file: !29, line: 202, baseType: !152, size: 32, offset: 2944)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !595, file: !29, line: 205, baseType: !152, size: 32, offset: 2976)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !595, file: !29, line: 206, baseType: !152, size: 32, offset: 3008)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !595, file: !29, line: 207, baseType: !152, size: 32, offset: 3040)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !260, file: !29, line: 315, baseType: !634, size: 4096, offset: 37760)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !635, line: 46, baseType: !636)
!635 = !DIFile(filename: "./common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !635, line: 27, size: 4096, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !636, file: !635, line: 30, baseType: !152, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !636, file: !635, line: 31, baseType: !152, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !636, file: !635, line: 34, baseType: !152, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !636, file: !635, line: 35, baseType: !152, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !636, file: !635, line: 37, baseType: !423, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !636, file: !635, line: 38, baseType: !423, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !636, file: !635, line: 39, baseType: !423, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !636, file: !635, line: 42, baseType: !152, size: 32, align: 128, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !636, file: !635, line: 45, baseType: !647, size: 3680, offset: 416)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 3680, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 460)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !260, file: !29, line: 340, baseType: !651, size: 31808, offset: 41856)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !29, line: 317, size: 31808, elements: !652)
!652 = !{!653, !790, !791, !795, !796, !798, !799, !800, !801, !802, !803, !804}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !651, file: !29, line: 320, baseType: !654, size: 4288)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 4288, elements: !788)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !657, line: 94, baseType: !658)
!657 = !DIFile(filename: "./common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 31, size: 51648, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !674, !675, !676, !677, !678, !679, !681, !683, !684, !685, !686, !687, !692, !696, !700, !703, !705, !706, !708, !709, !712, !713, !714, !716, !718, !719, !720, !721, !723, !724, !725, !726, !727, !728, !756}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !658, file: !657, line: 34, baseType: !152, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !658, file: !657, line: 35, baseType: !152, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !658, file: !657, line: 36, baseType: !152, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !658, file: !657, line: 37, baseType: !183, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !658, file: !657, line: 38, baseType: !152, size: 32, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !658, file: !657, line: 39, baseType: !152, size: 32, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !658, file: !657, line: 40, baseType: !152, size: 32, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !658, file: !657, line: 41, baseType: !353, size: 32, offset: 288)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !658, file: !657, line: 42, baseType: !353, size: 32, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !658, file: !657, line: 45, baseType: !152, size: 32, offset: 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !658, file: !657, line: 46, baseType: !671, size: 96, offset: 384)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 96, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 3)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !658, file: !657, line: 47, baseType: !671, size: 96, offset: 480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !658, file: !657, line: 48, baseType: !671, size: 96, offset: 576)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !658, file: !657, line: 49, baseType: !152, size: 32, offset: 672)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !658, file: !657, line: 50, baseType: !152, size: 32, offset: 704)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !658, file: !657, line: 51, baseType: !152, size: 32, offset: 736)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !658, file: !657, line: 52, baseType: !680, size: 192, offset: 768)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 192, elements: !672)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !658, file: !657, line: 53, baseType: !682, size: 256, offset: 960)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 256, elements: !561)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !658, file: !657, line: 54, baseType: !682, size: 256, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !658, file: !657, line: 55, baseType: !179, size: 64, offset: 1472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !658, file: !657, line: 59, baseType: !682, size: 256, offset: 1536)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !658, file: !657, line: 60, baseType: !682, size: 256, offset: 1792)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !658, file: !657, line: 63, baseType: !688, size: 64, offset: 2048)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !138, line: 24, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !134, line: 37, baseType: !691)
!691 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !658, file: !657, line: 64, baseType: !693, size: 128, offset: 2112)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 128, elements: !357)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !357)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !658, file: !657, line: 65, baseType: !697, size: 2176, offset: 2240)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 2176, elements: !698)
!698 = !{!358, !699}
!699 = !DISubrange(count: 17)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !658, file: !657, line: 66, baseType: !701, size: 2176, offset: 4416)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 2176, elements: !698)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !658, file: !657, line: 67, baseType: !704, size: 128, offset: 6592)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 128, elements: !357)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !658, file: !657, line: 68, baseType: !356, size: 64, offset: 6720)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !658, file: !657, line: 69, baseType: !707, size: 1024, offset: 6784)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 1024, elements: !624)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !658, file: !657, line: 70, baseType: !570, size: 512, offset: 7808)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !658, file: !657, line: 75, baseType: !710, size: 10368, offset: 8320)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 10368, elements: !711)
!711 = !{!206, !206}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !658, file: !657, line: 76, baseType: !710, size: 10368, offset: 18688)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !658, file: !657, line: 77, baseType: !152, size: 32, offset: 29056)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !658, file: !657, line: 78, baseType: !715, size: 576, offset: 29088)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 576, elements: !205)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !658, file: !657, line: 79, baseType: !717, size: 20736, offset: 29696)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 20736, elements: !711)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !658, file: !657, line: 80, baseType: !702, size: 64, offset: 50432)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !658, file: !657, line: 81, baseType: !702, size: 64, offset: 50496)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !658, file: !657, line: 82, baseType: !702, size: 64, offset: 50560)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !658, file: !657, line: 83, baseType: !722, size: 64, offset: 50624)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !658, file: !657, line: 84, baseType: !152, size: 32, offset: 50688)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !658, file: !657, line: 85, baseType: !179, size: 64, offset: 50752)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !658, file: !657, line: 86, baseType: !179, size: 64, offset: 50816)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !658, file: !657, line: 89, baseType: !152, size: 32, offset: 50880)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !658, file: !657, line: 90, baseType: !152, size: 32, offset: 50912)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !658, file: !657, line: 91, baseType: !729, size: 320, offset: 50944)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !407, line: 72, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !407, line: 67, size: 320, elements: !731)
!731 = !{!732, !751, !755}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !730, file: !407, line: 69, baseType: !733, size: 320)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !734, line: 22, size: 320, elements: !735)
!734 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !733, file: !734, line: 24, baseType: !152, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !733, file: !734, line: 25, baseType: !7, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !733, file: !734, line: 26, baseType: !152, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !733, file: !734, line: 28, baseType: !7, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !733, file: !734, line: 32, baseType: !152, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !733, file: !734, line: 34, baseType: !140, size: 16, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !733, file: !734, line: 35, baseType: !140, size: 16, offset: 176)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !733, file: !734, line: 36, baseType: !744, size: 128, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !745, line: 55, baseType: !746)
!745 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !745, line: 51, size: 128, elements: !747)
!747 = !{!748, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !746, file: !745, line: 53, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !746, file: !745, line: 54, baseType: !749, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !730, file: !407, line: 70, baseType: !752, size: 320)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 320, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 40)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !730, file: !407, line: 71, baseType: !185, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !658, file: !657, line: 92, baseType: !757, size: 384, offset: 51264)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !407, line: 80, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !407, line: 75, size: 384, elements: !759)
!759 = !{!760, !782, !786}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !758, file: !407, line: 77, baseType: !761, size: 384)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !745, line: 94, size: 384, elements: !762)
!762 = !{!763, !775, !776, !778, !779, !780, !781}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !761, file: !745, line: 96, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !765, line: 33, baseType: !766)
!765 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!766 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !765, line: 25, size: 64, elements: !767)
!767 = !{!768, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !766, file: !765, line: 27, baseType: !769, size: 64)
!769 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !766, file: !765, line: 32, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !766, file: !765, line: 28, size: 64, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !771, file: !765, line: 30, baseType: !7, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !771, file: !765, line: 31, baseType: !7, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !761, file: !745, line: 97, baseType: !764, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !761, file: !745, line: 98, baseType: !777, size: 64, offset: 128)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !357)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !761, file: !745, line: 99, baseType: !777, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !761, file: !745, line: 100, baseType: !7, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !761, file: !745, line: 101, baseType: !7, size: 32, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !761, file: !745, line: 102, baseType: !777, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !758, file: !407, line: 78, baseType: !783, size: 384)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 384, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 48)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !758, file: !407, line: 79, baseType: !787, size: 64)
!787 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!788 = !{!789}
!789 = !DISubrange(count: 67)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !651, file: !29, line: 322, baseType: !654, size: 4288, offset: 4288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !651, file: !29, line: 324, baseType: !792, size: 21760, offset: 8576)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 21760, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 340)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !651, file: !29, line: 326, baseType: !655, size: 64, offset: 30336)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !651, file: !29, line: 329, baseType: !797, size: 1152, offset: 30400)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 1152, elements: !205)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !651, file: !29, line: 331, baseType: !152, size: 32, offset: 31552)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !651, file: !29, line: 333, baseType: !152, size: 32, offset: 31584)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !651, file: !29, line: 335, baseType: !152, size: 32, offset: 31616)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !651, file: !29, line: 336, baseType: !152, size: 32, offset: 31648)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !651, file: !29, line: 337, baseType: !152, size: 32, offset: 31680)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !651, file: !29, line: 338, baseType: !152, size: 32, offset: 31712)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !651, file: !29, line: 339, baseType: !152, size: 32, offset: 31744)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !260, file: !29, line: 343, baseType: !655, size: 64, offset: 73664)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !260, file: !29, line: 346, baseType: !655, size: 64, offset: 73728)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !260, file: !29, line: 349, baseType: !152, size: 32, offset: 73792)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !260, file: !29, line: 350, baseType: !809, size: 1216, offset: 73856)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 1216, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 19)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !260, file: !29, line: 351, baseType: !152, size: 32, offset: 75072)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !260, file: !29, line: 352, baseType: !809, size: 1216, offset: 75136)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !260, file: !29, line: 353, baseType: !356, size: 64, offset: 76352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !260, file: !29, line: 365, baseType: !816, size: 10624, offset: 76416)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !29, line: 358, size: 10624, elements: !817)
!817 = !{!818, !819, !822, !825}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !816, file: !29, line: 360, baseType: !158, size: 256, align: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !816, file: !29, line: 361, baseType: !820, size: 128, align: 128, offset: 256)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !821)
!821 = !{!358, !250}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !816, file: !29, line: 363, baseType: !823, size: 4096, align: 128, offset: 384)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 4096, elements: !824)
!824 = !{!250, !176}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !816, file: !29, line: 364, baseType: !826, size: 6144, align: 128, offset: 4480)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 6144, elements: !827)
!827 = !{!828, !160}
!828 = !DISubrange(count: 24)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !260, file: !29, line: 544, baseType: !830, size: 80128, offset: 87040)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !29, line: 368, size: 80128, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !858, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !872, !876, !877, !878, !879, !880, !884, !885, !886, !889, !891, !892, !893, !895, !896, !897, !898, !899, !900, !901, !902, !942, !962, !963, !964, !965, !966, !967, !968, !969, !970, !973, !976, !978}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !830, file: !29, line: 370, baseType: !152, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !830, file: !29, line: 373, baseType: !152, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !830, file: !29, line: 374, baseType: !152, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !830, file: !29, line: 375, baseType: !152, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !830, file: !29, line: 378, baseType: !152, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !830, file: !29, line: 379, baseType: !152, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !830, file: !29, line: 380, baseType: !152, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !830, file: !29, line: 381, baseType: !152, size: 32, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !830, file: !29, line: 382, baseType: !152, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !830, file: !29, line: 385, baseType: !152, size: 32, offset: 288)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !830, file: !29, line: 386, baseType: !152, size: 32, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !830, file: !29, line: 387, baseType: !152, size: 32, offset: 352)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !830, file: !29, line: 388, baseType: !152, size: 32, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !830, file: !29, line: 389, baseType: !152, size: 32, offset: 416)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !830, file: !29, line: 390, baseType: !152, size: 32, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !830, file: !29, line: 391, baseType: !152, size: 32, offset: 480)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !830, file: !29, line: 393, baseType: !152, size: 32, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !830, file: !29, line: 396, baseType: !356, size: 64, offset: 544)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !830, file: !29, line: 397, baseType: !356, size: 64, offset: 608)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !830, file: !29, line: 400, baseType: !356, size: 64, offset: 672)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !830, file: !29, line: 401, baseType: !356, size: 64, offset: 736)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !830, file: !29, line: 403, baseType: !356, size: 64, offset: 800)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !830, file: !29, line: 404, baseType: !356, size: 64, offset: 864)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !830, file: !29, line: 407, baseType: !7, size: 32, offset: 928)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !830, file: !29, line: 408, baseType: !857, size: 128, offset: 960)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !561)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !830, file: !29, line: 409, baseType: !859, size: 512, offset: 1088)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !159)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !830, file: !29, line: 410, baseType: !152, size: 32, offset: 1600)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !830, file: !29, line: 411, baseType: !152, size: 32, offset: 1632)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !830, file: !29, line: 412, baseType: !152, size: 32, offset: 1664)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !830, file: !29, line: 413, baseType: !152, size: 32, offset: 1696)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !830, file: !29, line: 414, baseType: !152, size: 32, offset: 1728)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !830, file: !29, line: 415, baseType: !152, size: 32, offset: 1760)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !830, file: !29, line: 422, baseType: !688, size: 64, offset: 1792)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !830, file: !29, line: 423, baseType: !688, size: 64, offset: 1856)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !830, file: !29, line: 424, baseType: !136, size: 64, offset: 1920)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !830, file: !29, line: 425, baseType: !870, size: 64, offset: 1984)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 64, elements: !424)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !830, file: !29, line: 427, baseType: !873, size: 64, offset: 2048)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 192, elements: !875)
!875 = !{!828}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !830, file: !29, line: 428, baseType: !688, size: 64, offset: 2112)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !830, file: !29, line: 429, baseType: !693, size: 128, offset: 2176)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !830, file: !29, line: 430, baseType: !693, size: 128, offset: 2304)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !830, file: !29, line: 431, baseType: !704, size: 128, offset: 2432)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !830, file: !29, line: 432, baseType: !881, size: 4096, offset: 2560)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 4096, elements: !882)
!882 = !{!358, !883}
!883 = !DISubrange(count: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !830, file: !29, line: 433, baseType: !688, size: 64, offset: 6656)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !830, file: !29, line: 434, baseType: !688, size: 64, offset: 6720)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !830, file: !29, line: 435, baseType: !887, size: 384, offset: 6784)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 384, elements: !888)
!888 = !{!358, !673}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !830, file: !29, line: 436, baseType: !890, size: 64, offset: 7168)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !830, file: !29, line: 439, baseType: !152, size: 32, offset: 7232)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !830, file: !29, line: 440, baseType: !152, size: 32, offset: 7264)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !830, file: !29, line: 441, baseType: !894, size: 128, offset: 7296)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !561)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !830, file: !29, line: 442, baseType: !152, size: 32, offset: 7424)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !830, file: !29, line: 444, baseType: !152, size: 32, offset: 7456)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !830, file: !29, line: 445, baseType: !152, size: 32, offset: 7488)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !830, file: !29, line: 447, baseType: !152, size: 32, offset: 7520)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !830, file: !29, line: 448, baseType: !152, size: 32, offset: 7552)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !830, file: !29, line: 454, baseType: !152, size: 32, offset: 7584)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !830, file: !29, line: 457, baseType: !152, size: 32, offset: 7616)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !830, file: !29, line: 498, baseType: !903, size: 57344, offset: 7680)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !830, file: !29, line: 459, size: 57344, elements: !904)
!904 = !{!905, !909, !913, !915, !916, !919, !922, !923, !926, !927, !928, !931, !932, !933, !934, !935, !936, !939, !941}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !903, file: !29, line: 464, baseType: !906, size: 3072, align: 128)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 3072, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !903, file: !29, line: 465, baseType: !910, size: 6912, align: 128, offset: 3072)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 6912, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 864)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !903, file: !29, line: 468, baseType: !914, size: 2048, align: 128, offset: 9984)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 2048, elements: !472)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !903, file: !29, line: 469, baseType: !914, size: 2048, align: 128, offset: 12032)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !903, file: !29, line: 470, baseType: !917, size: 3072, align: 128, offset: 14080)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 3072, elements: !918)
!918 = !{!673, !176}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !903, file: !29, line: 471, baseType: !920, size: 3840, align: 128, offset: 17152)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 3840, elements: !921)
!921 = !{!237, !160}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !903, file: !29, line: 474, baseType: !823, size: 4096, align: 128, offset: 20992)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !903, file: !29, line: 475, baseType: !924, size: 4096, align: 128, offset: 25088)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 4096, elements: !925)
!925 = !{!160, !160}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !903, file: !29, line: 478, baseType: !559, size: 512, offset: 29184)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !903, file: !29, line: 479, baseType: !152, size: 32, offset: 29696)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !903, file: !29, line: 480, baseType: !929, size: 128, offset: 29728)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !930)
!930 = !{!358, !358}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !903, file: !29, line: 481, baseType: !152, size: 32, offset: 29856)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !903, file: !29, line: 484, baseType: !680, size: 192, offset: 29888)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !903, file: !29, line: 486, baseType: !680, size: 192, offset: 30080)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !903, file: !29, line: 489, baseType: !680, size: 192, offset: 30272)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !903, file: !29, line: 492, baseType: !356, size: 64, offset: 30464)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !903, file: !29, line: 493, baseType: !937, size: 24576, offset: 30528)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 24576, elements: !938)
!938 = !{!358, !883, !552}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !903, file: !29, line: 494, baseType: !940, size: 2048, offset: 55104)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2048, elements: !624)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !903, file: !29, line: 497, baseType: !671, size: 96, offset: 57152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !830, file: !29, line: 526, baseType: !943, size: 12032, offset: 65024)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !830, file: !29, line: 501, size: 12032, elements: !944)
!944 = !{!945, !947, !949, !952, !955, !956, !957, !958, !959, !960, !961}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !943, file: !29, line: 504, baseType: !946, size: 384)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 384, elements: !784)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !943, file: !29, line: 507, baseType: !948, size: 384, offset: 384)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 384, elements: !784)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !943, file: !29, line: 510, baseType: !950, size: 768, align: 32, offset: 768)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 768, elements: !951)
!951 = !{!358, !785}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !943, file: !29, line: 513, baseType: !953, size: 3072, align: 128, offset: 1536)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 3072, elements: !954)
!954 = !{!358, !785, !358}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !943, file: !29, line: 514, baseType: !953, size: 3072, align: 64, offset: 4608)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !943, file: !29, line: 517, baseType: !946, size: 384, align: 32, offset: 7680)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !943, file: !29, line: 519, baseType: !953, size: 3072, align: 128, offset: 8064)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !943, file: !29, line: 520, baseType: !950, size: 768, align: 32, offset: 11136)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !943, file: !29, line: 521, baseType: !695, size: 32, align: 32, offset: 11904)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !943, file: !29, line: 524, baseType: !152, size: 32, offset: 11936)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !943, file: !29, line: 525, baseType: !152, size: 32, offset: 11968)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !830, file: !29, line: 529, baseType: !152, size: 32, offset: 77056)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !830, file: !29, line: 530, baseType: !152, size: 32, offset: 77088)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !830, file: !29, line: 531, baseType: !152, size: 32, offset: 77120)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !830, file: !29, line: 532, baseType: !152, size: 32, offset: 77152)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !830, file: !29, line: 533, baseType: !152, size: 32, offset: 77184)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !830, file: !29, line: 534, baseType: !152, size: 32, offset: 77216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !830, file: !29, line: 535, baseType: !152, size: 32, offset: 77248)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !830, file: !29, line: 536, baseType: !152, size: 32, offset: 77280)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !830, file: !29, line: 539, baseType: !971, size: 512, offset: 77312)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 512, elements: !972)
!972 = !{!160, !358}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !830, file: !29, line: 540, baseType: !974, size: 2048, offset: 77824)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2048, elements: !975)
!975 = !{!883, !250}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !830, file: !29, line: 542, baseType: !977, size: 16, offset: 79872)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 16, elements: !357)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !830, file: !29, line: 543, baseType: !979, size: 128, offset: 79888)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 128, elements: !159)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !260, file: !29, line: 547, baseType: !981, size: 64, offset: 167168)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !29, line: 248, baseType: !983)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !29, line: 248, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !260, file: !29, line: 604, baseType: !985, size: 23936, offset: 167232)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !29, line: 550, size: 23936, elements: !986)
!986 = !{!987, !1011, !1015, !1017, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1029, !1031, !1033, !1036, !1037}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !985, file: !29, line: 579, baseType: !988, size: 3904)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !985, file: !29, line: 553, size: 3904, elements: !989)
!989 = !{!990, !991, !992, !993, !995, !996, !997, !998, !999, !1001, !1004, !1005, !1006, !1007, !1008, !1010}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !988, file: !29, line: 556, baseType: !152, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !988, file: !29, line: 558, baseType: !152, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !988, file: !29, line: 560, baseType: !152, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !988, file: !29, line: 562, baseType: !994, size: 608, offset: 96)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 608, elements: !810)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !988, file: !29, line: 563, baseType: !152, size: 32, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !988, file: !29, line: 564, baseType: !152, size: 32, offset: 736)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !988, file: !29, line: 565, baseType: !152, size: 32, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !988, file: !29, line: 566, baseType: !356, size: 64, offset: 800)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !988, file: !29, line: 567, baseType: !1000, size: 2048, offset: 864)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, elements: !882)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !988, file: !29, line: 568, baseType: !1002, size: 544, offset: 2912)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 544, elements: !1003)
!1003 = !{!699}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !988, file: !29, line: 571, baseType: !152, size: 32, offset: 3456)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !988, file: !29, line: 572, baseType: !152, size: 32, offset: 3488)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !988, file: !29, line: 573, baseType: !152, size: 32, offset: 3520)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !988, file: !29, line: 575, baseType: !356, size: 64, offset: 3552)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !988, file: !29, line: 577, baseType: !1009, size: 192, offset: 3648)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 192, elements: !672)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !988, file: !29, line: 578, baseType: !186, size: 64, offset: 3840)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !985, file: !29, line: 584, baseType: !1012, size: 160, offset: 3904)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 160, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 5)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !985, file: !29, line: 585, baseType: !1016, size: 320, offset: 4096)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 320, elements: !1013)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !985, file: !29, line: 586, baseType: !1018, size: 320, offset: 4416)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 320, elements: !1013)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !985, file: !29, line: 587, baseType: !1002, size: 544, offset: 4736)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !985, file: !29, line: 589, baseType: !1016, size: 320, offset: 5312)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !985, file: !29, line: 590, baseType: !1018, size: 320, offset: 5632)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !985, file: !29, line: 591, baseType: !1018, size: 320, offset: 5952)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !985, file: !29, line: 592, baseType: !1018, size: 320, offset: 6272)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !985, file: !29, line: 593, baseType: !1018, size: 320, offset: 6592)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !985, file: !29, line: 594, baseType: !1018, size: 320, offset: 6912)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !985, file: !29, line: 596, baseType: !1027, size: 6080, offset: 7232)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 6080, elements: !1028)
!1028 = !{!1014, !811}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !985, file: !29, line: 597, baseType: !1030, size: 2176, offset: 13312)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2176, elements: !698)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !985, file: !29, line: 598, baseType: !1032, size: 128, offset: 15488)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !357)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !985, file: !29, line: 599, baseType: !1034, size: 8192, offset: 15616)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 8192, elements: !1035)
!1035 = !{!358, !358, !883}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !985, file: !29, line: 601, baseType: !356, size: 64, offset: 23808)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_frames", scope: !985, file: !29, line: 602, baseType: !356, size: 64, offset: 23872)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "predict_16x16", scope: !260, file: !29, line: 607, baseType: !1039, size: 448, offset: 191168)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 448, elements: !1044)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict_t", file: !79, line: 27, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{null, !423}
!1044 = !{!1045}
!1045 = !DISubrange(count: 7)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8c", scope: !260, file: !29, line: 608, baseType: !1039, size: 448, offset: 191616)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8", scope: !260, file: !29, line: 609, baseType: !1048, size: 768, offset: 192064)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 768, elements: !1053)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict8x8_t", file: !79, line: 28, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !423, !423}
!1053 = !{!1054}
!1054 = !DISubrange(count: 12)
