; ModuleID = 'encoder/cabac.c'
source_filename = "encoder/cabac.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [128 x ptr], i64, i32, i32, %struct.anon.2, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], ptr, [8 x i8], [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], %struct.x264_slice_header_t, [8 x i8], %struct.x264_cabac_t, %struct.anon.6, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], %struct.anon.8, %struct.anon.9, ptr, %struct.anon.12, [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!55 = !DIEnumerator(name: "D_L0_8x8", value: 3)
!56 = !DIEnumerator(name: "D_L1_4x4", value: 4)
!57 = !DIEnumerator(name: "D_L1_8x4", value: 5)
!58 = !DIEnumerator(name: "D_L1_4x8", value: 6)
!59 = !DIEnumerator(name: "D_L1_8x8", value: 7)
!60 = !DIEnumerator(name: "D_BI_4x4", value: 8)
!61 = !DIEnumerator(name: "D_BI_8x4", value: 9)
!62 = !DIEnumerator(name: "D_BI_4x8", value: 10)
!63 = !DIEnumerator(name: "D_BI_8x8", value: 11)
!64 = !DIEnumerator(name: "D_DIRECT_8x8", value: 12)
!65 = !DIEnumerator(name: "D_8x8", value: 13)
!66 = !DIEnumerator(name: "D_16x8", value: 14)
!67 = !DIEnumerator(name: "D_8x16", value: 15)
!68 = !DIEnumerator(name: "D_16x16", value: 16)
!69 = !DIEnumerator(name: "X264_PARTTYPE_MAX", value: 17)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cabac_ctx_block_cat_e", file: !6, line: 266, baseType: !7, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "DCT_LUMA_DC", value: 0)
!73 = !DIEnumerator(name: "DCT_LUMA_AC", value: 1)
!74 = !DIEnumerator(name: "DCT_LUMA_4x4", value: 2)
!75 = !DIEnumerator(name: "DCT_CHROMA_DC", value: 3)
!76 = !DIEnumerator(name: "DCT_CHROMA_AC", value: 4)
!77 = !DIEnumerator(name: "DCT_LUMA_8x8", value: 5)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "intra4x4_pred_e", file: !79, line: 64, baseType: !7, size: 32, elements: !80)
!79 = !DIFile(filename: "./common/predict.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "c7827bfe44f4a550b7080533457a8327")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!81 = !DIEnumerator(name: "I_PRED_4x4_V", value: 0)
!82 = !DIEnumerator(name: "I_PRED_4x4_H", value: 1)
!83 = !DIEnumerator(name: "I_PRED_4x4_DC", value: 2)
!84 = !DIEnumerator(name: "I_PRED_4x4_DDL", value: 3)
!85 = !DIEnumerator(name: "I_PRED_4x4_DDR", value: 4)
!86 = !DIEnumerator(name: "I_PRED_4x4_VR", value: 5)
!87 = !DIEnumerator(name: "I_PRED_4x4_HD", value: 6)
!88 = !DIEnumerator(name: "I_PRED_4x4_VL", value: 7)
!89 = !DIEnumerator(name: "I_PRED_4x4_HU", value: 8)
!90 = !DIEnumerator(name: "I_PRED_4x4_DC_LEFT", value: 9)
!91 = !DIEnumerator(name: "I_PRED_4x4_DC_TOP", value: 10)
!92 = !DIEnumerator(name: "I_PRED_4x4_DC_128", value: 11)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "macroblock_position_e", file: !6, line: 28, baseType: !7, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIEnumerator(name: "MB_LEFT", value: 1)
!96 = !DIEnumerator(name: "MB_TOP", value: 2)
!97 = !DIEnumerator(name: "MB_TOPRIGHT", value: 4)
!98 = !DIEnumerator(name: "MB_TOPLEFT", value: 8)
!99 = !DIEnumerator(name: "MB_PRIVATE", value: 16)
!100 = !DIEnumerator(name: "ALL_NEIGHBORS", value: 15)
!101 = !{!102, !107, !110}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !104, line: 26, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !106, line: 42, baseType: !7)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !104, line: 27, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !106, line: 45, baseType: !109)
!109 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!111 = !{!112, !1233, !1237, !1242, !0, !1245, !1247, !1249, !1269, !1272, !1274, !1285, !1288, !1292, !1294, !1304, !1309, !1311, !1314, !1318, !1321, !1324, !1326}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "i_mb_len", scope: !114, file: !3, line: 169, type: !1230, isLocal: true, isDefinition: true)
!114 = distinct !DISubprogram(name: "x264_cabac_mb_type", scope: !3, file: !3, line: 66, type: !115, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1212)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117, !1211}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !119, line: 42, baseType: !120)
!119 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !30, line: 250, size: 206080, elements: !121)
!121 = !{!122, !274, !278, !281, !282, !283, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !397, !399, !427, !429, !430, !437, !442, !446, !450, !457, !461, !462, !463, !464, !467, !469, !471, !511, !528, !692, !693, !694, !695, !699, !700, !701, !702, !717, !870, !874, !929, !937, !938, !946, !948, !1016, !1076, !1128, !1149, !1191}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !120, file: !30, line: 253, baseType: !123, size: 4928)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !119, line: 295, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !119, line: 151, size: 4928, elements: !125)
!125 = !{!126, !127, !129, !130, !131, !132, !133, !134, !135, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !168, !175, !176, !177, !178, !182, !183, !198, !199, !200, !201, !202, !232, !271, !272, !273}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !124, file: !119, line: 154, baseType: !7, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !124, file: !119, line: 155, baseType: !128, size: 32, offset: 32)
!128 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !124, file: !119, line: 156, baseType: !128, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !124, file: !119, line: 159, baseType: !128, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !124, file: !119, line: 160, baseType: !128, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !124, file: !119, line: 161, baseType: !128, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !124, file: !119, line: 162, baseType: !128, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !124, file: !119, line: 163, baseType: !128, size: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !124, file: !119, line: 180, baseType: !136, size: 288, offset: 256)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !119, line: 165, size: 288, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !136, file: !119, line: 168, baseType: !128, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !136, file: !119, line: 169, baseType: !128, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !136, file: !119, line: 171, baseType: !128, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !136, file: !119, line: 174, baseType: !128, size: 32, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !136, file: !119, line: 175, baseType: !128, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !136, file: !119, line: 176, baseType: !128, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !136, file: !119, line: 177, baseType: !128, size: 32, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !136, file: !119, line: 178, baseType: !128, size: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !136, file: !119, line: 179, baseType: !128, size: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !124, file: !119, line: 182, baseType: !128, size: 32, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !124, file: !119, line: 183, baseType: !128, size: 32, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !124, file: !119, line: 186, baseType: !128, size: 32, offset: 608)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !124, file: !119, line: 187, baseType: !128, size: 32, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !124, file: !119, line: 188, baseType: !128, size: 32, offset: 672)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !124, file: !119, line: 189, baseType: !128, size: 32, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !124, file: !119, line: 190, baseType: !128, size: 32, offset: 736)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !124, file: !119, line: 191, baseType: !128, size: 32, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !124, file: !119, line: 192, baseType: !128, size: 32, offset: 800)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !124, file: !119, line: 193, baseType: !128, size: 32, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !124, file: !119, line: 194, baseType: !128, size: 32, offset: 864)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !124, file: !119, line: 196, baseType: !128, size: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !124, file: !119, line: 197, baseType: !128, size: 32, offset: 928)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !124, file: !119, line: 198, baseType: !128, size: 32, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !124, file: !119, line: 200, baseType: !128, size: 32, offset: 992)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !124, file: !119, line: 201, baseType: !128, size: 32, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !124, file: !119, line: 203, baseType: !128, size: 32, offset: 1056)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !124, file: !119, line: 205, baseType: !128, size: 32, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !124, file: !119, line: 206, baseType: !166, size: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !124, file: !119, line: 207, baseType: !169, size: 128, offset: 1216)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 128, elements: !173)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !104, line: 24, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !106, line: 38, baseType: !172)
!172 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !{!174}
!174 = !DISubrange(count: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !124, file: !119, line: 208, baseType: !169, size: 128, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !124, file: !119, line: 209, baseType: !169, size: 128, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !124, file: !119, line: 210, baseType: !169, size: 128, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !124, file: !119, line: 211, baseType: !179, size: 512, offset: 1728)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 512, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !124, file: !119, line: 212, baseType: !179, size: 512, offset: 2240)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !124, file: !119, line: 215, baseType: !184, size: 64, offset: 2752)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !187, !128, !188, !190}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !192)
!192 = !{!193, !195, !196, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !191, file: !194, baseType: !7, size: 32)
!194 = !DIFile(filename: "encoder/cabac.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !191, file: !194, baseType: !7, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !191, file: !194, baseType: !187, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !191, file: !194, baseType: !187, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !124, file: !119, line: 216, baseType: !187, size: 64, offset: 2816)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !124, file: !119, line: 217, baseType: !128, size: 32, offset: 2880)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !124, file: !119, line: 218, baseType: !128, size: 32, offset: 2912)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !124, file: !119, line: 219, baseType: !166, size: 64, offset: 2944)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !124, file: !119, line: 252, baseType: !203, size: 768, offset: 3008)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !119, line: 222, size: 768, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !225, !226, !230, !231}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !203, file: !119, line: 224, baseType: !7, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !203, file: !119, line: 225, baseType: !7, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !203, file: !119, line: 227, baseType: !128, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !203, file: !119, line: 228, baseType: !128, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !203, file: !119, line: 229, baseType: !128, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !203, file: !119, line: 230, baseType: !128, size: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !203, file: !119, line: 231, baseType: !128, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !203, file: !119, line: 233, baseType: !128, size: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !203, file: !119, line: 234, baseType: !128, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !203, file: !119, line: 235, baseType: !128, size: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !203, file: !119, line: 236, baseType: !128, size: 32, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !203, file: !119, line: 237, baseType: !128, size: 32, offset: 352)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !203, file: !119, line: 238, baseType: !128, size: 32, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !203, file: !119, line: 239, baseType: !128, size: 32, offset: 416)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !203, file: !119, line: 240, baseType: !128, size: 32, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !203, file: !119, line: 241, baseType: !128, size: 32, offset: 480)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !203, file: !119, line: 242, baseType: !128, size: 32, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !203, file: !119, line: 243, baseType: !128, size: 32, offset: 544)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !203, file: !119, line: 244, baseType: !224, size: 32, offset: 576)
!224 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !203, file: !119, line: 245, baseType: !224, size: 32, offset: 608)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !203, file: !119, line: 248, baseType: !227, size: 64, offset: 640)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 64, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !203, file: !119, line: 250, baseType: !128, size: 32, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !203, file: !119, line: 251, baseType: !128, size: 32, offset: 736)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !124, file: !119, line: 289, baseType: !233, size: 1024, offset: 3776)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !119, line: 255, size: 1024, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !269, !270}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !233, file: !119, line: 257, baseType: !128, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !233, file: !119, line: 259, baseType: !128, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !233, file: !119, line: 260, baseType: !128, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !233, file: !119, line: 261, baseType: !128, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !233, file: !119, line: 262, baseType: !128, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !233, file: !119, line: 264, baseType: !128, size: 32, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !233, file: !119, line: 265, baseType: !224, size: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !233, file: !119, line: 266, baseType: !224, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !233, file: !119, line: 267, baseType: !128, size: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !233, file: !119, line: 268, baseType: !128, size: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !233, file: !119, line: 269, baseType: !224, size: 32, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !233, file: !119, line: 270, baseType: !224, size: 32, offset: 352)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !233, file: !119, line: 271, baseType: !224, size: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !233, file: !119, line: 273, baseType: !128, size: 32, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !233, file: !119, line: 274, baseType: !224, size: 32, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !233, file: !119, line: 277, baseType: !128, size: 32, offset: 480)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !233, file: !119, line: 278, baseType: !166, size: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !233, file: !119, line: 279, baseType: !128, size: 32, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !233, file: !119, line: 280, baseType: !166, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !233, file: !119, line: 283, baseType: !224, size: 32, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !233, file: !119, line: 284, baseType: !224, size: 32, offset: 736)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !233, file: !119, line: 285, baseType: !224, size: 32, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !233, file: !119, line: 286, baseType: !258, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !119, line: 149, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 142, size: 256, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !260, file: !119, line: 144, baseType: !128, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !260, file: !119, line: 144, baseType: !128, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !260, file: !119, line: 145, baseType: !128, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !260, file: !119, line: 146, baseType: !128, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !260, file: !119, line: 147, baseType: !224, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !260, file: !119, line: 148, baseType: !268, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !233, file: !119, line: 287, baseType: !128, size: 32, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !233, file: !119, line: 288, baseType: !166, size: 64, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !124, file: !119, line: 292, baseType: !128, size: 32, offset: 4800)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !124, file: !119, line: 293, baseType: !128, size: 32, offset: 4832)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !124, file: !119, line: 294, baseType: !128, size: 32, offset: 4864)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !120, file: !30, line: 255, baseType: !275, size: 8192, offset: 4928)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 8192, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !120, file: !30, line: 256, baseType: !279, size: 64, offset: 13120)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !280, line: 27, baseType: !109)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !120, file: !30, line: 257, baseType: !128, size: 32, offset: 13184)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !120, file: !30, line: 258, baseType: !128, size: 32, offset: 13216)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !120, file: !30, line: 269, baseType: !284, size: 2112, offset: 13248)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !30, line: 261, size: 2112, elements: !285)
!285 = !{!286, !287, !299, !300, !301, !315}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !284, file: !30, line: 263, baseType: !128, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !284, file: !30, line: 264, baseType: !288, size: 1536, offset: 64)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 1536, elements: !297)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !119, line: 399, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 391, size: 192, elements: !291)
!291 = !{!292, !293, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !290, file: !119, line: 393, baseType: !128, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !290, file: !119, line: 394, baseType: !128, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !290, file: !119, line: 397, baseType: !128, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !290, file: !119, line: 398, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!297 = !{!298}
!298 = !DISubrange(count: 8)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !284, file: !30, line: 265, baseType: !128, size: 32, offset: 1600)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !284, file: !30, line: 266, baseType: !296, size: 64, offset: 1664)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !284, file: !30, line: 267, baseType: !302, size: 320, offset: 1728)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !303, line: 49, baseType: !304)
!303 = !DIFile(filename: "./common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !303, line: 40, size: 320, elements: !305)
!305 = !{!306, !307, !308, !309, !313, !314}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !304, file: !303, line: 42, baseType: !296, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !304, file: !303, line: 43, baseType: !296, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !304, file: !303, line: 44, baseType: !296, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !304, file: !303, line: 46, baseType: !310, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !311, line: 87, baseType: !312)
!311 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!312 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !304, file: !303, line: 47, baseType: !128, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !304, file: !303, line: 48, baseType: !128, size: 32, offset: 288)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !284, file: !30, line: 268, baseType: !128, size: 32, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !120, file: !30, line: 274, baseType: !128, size: 32, offset: 15360)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !120, file: !30, line: 276, baseType: !128, size: 32, offset: 15392)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !120, file: !30, line: 277, baseType: !128, size: 32, offset: 15424)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !120, file: !30, line: 278, baseType: !128, size: 32, offset: 15456)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !120, file: !30, line: 279, baseType: !128, size: 32, offset: 15488)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !120, file: !30, line: 280, baseType: !128, size: 32, offset: 15520)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !120, file: !30, line: 282, baseType: !128, size: 32, offset: 15552)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !120, file: !30, line: 283, baseType: !128, size: 32, offset: 15584)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !120, file: !30, line: 284, baseType: !128, size: 32, offset: 15616)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !120, file: !30, line: 287, baseType: !326, size: 9920, offset: 15648)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 9920, elements: !395)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !328, line: 133, baseType: !329)
!328 = !DIFile(filename: "./common/set.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "06164d1fd824dd844d17e97dd39e9ac3")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 52, size: 9920, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !352, !353, !354, !355, !356, !363, !364, !394}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !329, file: !328, line: 54, baseType: !128, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !329, file: !328, line: 56, baseType: !128, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !329, file: !328, line: 57, baseType: !128, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !329, file: !328, line: 59, baseType: !128, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !329, file: !328, line: 60, baseType: !128, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !329, file: !328, line: 61, baseType: !128, size: 32, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !329, file: !328, line: 63, baseType: !128, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !329, file: !328, line: 65, baseType: !128, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !329, file: !328, line: 67, baseType: !128, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !329, file: !328, line: 69, baseType: !128, size: 32, offset: 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !329, file: !328, line: 70, baseType: !128, size: 32, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !329, file: !328, line: 71, baseType: !128, size: 32, offset: 352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !329, file: !328, line: 72, baseType: !128, size: 32, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !329, file: !328, line: 73, baseType: !345, size: 8192, offset: 416)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 8192, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !329, file: !328, line: 75, baseType: !128, size: 32, offset: 8608)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !329, file: !328, line: 76, baseType: !128, size: 32, offset: 8640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !329, file: !328, line: 77, baseType: !128, size: 32, offset: 8672)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !329, file: !328, line: 78, baseType: !128, size: 32, offset: 8704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !329, file: !328, line: 79, baseType: !128, size: 32, offset: 8736)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !329, file: !328, line: 80, baseType: !128, size: 32, offset: 8768)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !329, file: !328, line: 81, baseType: !128, size: 32, offset: 8800)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !329, file: !328, line: 83, baseType: !128, size: 32, offset: 8832)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !329, file: !328, line: 90, baseType: !357, size: 128, offset: 8864)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !328, line: 84, size: 128, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !357, file: !328, line: 86, baseType: !128, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !357, file: !328, line: 87, baseType: !128, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !357, file: !328, line: 88, baseType: !128, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !357, file: !328, line: 89, baseType: !128, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !329, file: !328, line: 92, baseType: !128, size: 32, offset: 8992)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !329, file: !328, line: 129, baseType: !365, size: 864, offset: 9024)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !328, line: 93, size: 864, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !365, file: !328, line: 95, baseType: !128, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !365, file: !328, line: 96, baseType: !128, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !365, file: !328, line: 97, baseType: !128, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !365, file: !328, line: 99, baseType: !128, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !365, file: !328, line: 100, baseType: !128, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !365, file: !328, line: 102, baseType: !128, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !365, file: !328, line: 103, baseType: !128, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !365, file: !328, line: 104, baseType: !128, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !365, file: !328, line: 105, baseType: !128, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !365, file: !328, line: 106, baseType: !128, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !365, file: !328, line: 107, baseType: !128, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !365, file: !328, line: 108, baseType: !128, size: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !365, file: !328, line: 110, baseType: !128, size: 32, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !365, file: !328, line: 111, baseType: !128, size: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !365, file: !328, line: 112, baseType: !128, size: 32, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !365, file: !328, line: 114, baseType: !128, size: 32, offset: 480)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !365, file: !328, line: 115, baseType: !128, size: 32, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !365, file: !328, line: 116, baseType: !128, size: 32, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !365, file: !328, line: 117, baseType: !128, size: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !365, file: !328, line: 119, baseType: !128, size: 32, offset: 608)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !365, file: !328, line: 120, baseType: !128, size: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !365, file: !328, line: 121, baseType: !128, size: 32, offset: 672)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !365, file: !328, line: 122, baseType: !128, size: 32, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !365, file: !328, line: 123, baseType: !128, size: 32, offset: 736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !365, file: !328, line: 124, baseType: !128, size: 32, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !365, file: !328, line: 125, baseType: !128, size: 32, offset: 800)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !365, file: !328, line: 126, baseType: !128, size: 32, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !329, file: !328, line: 131, baseType: !128, size: 32, offset: 9888)
!395 = !{!396}
!396 = !DISubrange(count: 1)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !120, file: !30, line: 288, baseType: !398, size: 64, offset: 25600)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !120, file: !30, line: 289, baseType: !400, size: 960, offset: 25664)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 960, elements: !395)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !328, line: 165, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 135, size: 960, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !402, file: !328, line: 137, baseType: !128, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !402, file: !328, line: 138, baseType: !128, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !402, file: !328, line: 140, baseType: !128, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !402, file: !328, line: 142, baseType: !128, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !402, file: !328, line: 143, baseType: !128, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !402, file: !328, line: 145, baseType: !128, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !402, file: !328, line: 146, baseType: !128, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !402, file: !328, line: 148, baseType: !128, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !402, file: !328, line: 149, baseType: !128, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !402, file: !328, line: 151, baseType: !128, size: 32, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !402, file: !328, line: 152, baseType: !128, size: 32, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !402, file: !328, line: 154, baseType: !128, size: 32, offset: 352)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !402, file: !328, line: 156, baseType: !128, size: 32, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !402, file: !328, line: 157, baseType: !128, size: 32, offset: 416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !402, file: !328, line: 158, baseType: !128, size: 32, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !402, file: !328, line: 160, baseType: !128, size: 32, offset: 480)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !402, file: !328, line: 162, baseType: !128, size: 32, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !402, file: !328, line: 163, baseType: !422, size: 384, offset: 576)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 384, elements: !425)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!425 = !{!426}
!426 = !DISubrange(count: 6)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !120, file: !30, line: 290, baseType: !428, size: 64, offset: 26624)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !120, file: !30, line: 291, baseType: !128, size: 32, offset: 26688)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !120, file: !30, line: 294, baseType: !431, size: 256, offset: 26752)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 256, elements: !436)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !434)
!434 = !{!435, !435}
!435 = !DISubrange(count: 4)
!436 = !{!435}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !120, file: !30, line: 295, baseType: !438, size: 128, offset: 27008)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 128, elements: !228)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !441)
!441 = !{!298, !298}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !120, file: !30, line: 297, baseType: !443, size: 256, offset: 27136)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 256, elements: !436)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !173)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !120, file: !30, line: 298, baseType: !447, size: 128, offset: 27392)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !228)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !180)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !120, file: !30, line: 300, baseType: !451, size: 256, offset: 27520)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 256, elements: !436)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 256, elements: !173)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !104, line: 25, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !106, line: 40, baseType: !456)
!456 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !120, file: !30, line: 301, baseType: !458, size: 128, offset: 27776)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !228)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1024, elements: !180)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !120, file: !30, line: 302, baseType: !451, size: 256, offset: 27904)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !120, file: !30, line: 303, baseType: !458, size: 128, offset: 28160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !120, file: !30, line: 305, baseType: !423, size: 64, offset: 28288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !120, file: !30, line: 307, baseType: !465, size: 4096, align: 128, offset: 28416)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 4096, elements: !466)
!466 = !{!229, !181}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !120, file: !30, line: 308, baseType: !468, size: 2048, align: 128, offset: 32512)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 2048, elements: !466)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !120, file: !30, line: 309, baseType: !470, size: 64, offset: 34560)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 64, elements: !228)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !120, file: !30, line: 312, baseType: !472, size: 3072, offset: 34624)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !30, line: 209, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 159, size: 3072, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !503, !504, !505, !506, !507, !508, !509, !510}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !473, file: !30, line: 161, baseType: !398, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !473, file: !30, line: 162, baseType: !428, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !473, file: !30, line: 164, baseType: !128, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !473, file: !30, line: 165, baseType: !128, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !473, file: !30, line: 166, baseType: !128, size: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !473, file: !30, line: 168, baseType: !128, size: 32, offset: 224)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !473, file: !30, line: 170, baseType: !128, size: 32, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !473, file: !30, line: 172, baseType: !128, size: 32, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !473, file: !30, line: 173, baseType: !128, size: 32, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !473, file: !30, line: 174, baseType: !128, size: 32, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !473, file: !30, line: 176, baseType: !128, size: 32, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !473, file: !30, line: 178, baseType: !128, size: 32, offset: 416)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !473, file: !30, line: 179, baseType: !128, size: 32, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !473, file: !30, line: 181, baseType: !227, size: 64, offset: 480)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !473, file: !30, line: 182, baseType: !128, size: 32, offset: 544)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !473, file: !30, line: 184, baseType: !128, size: 32, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !473, file: !30, line: 186, baseType: !128, size: 32, offset: 608)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !473, file: !30, line: 187, baseType: !128, size: 32, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !473, file: !30, line: 188, baseType: !128, size: 32, offset: 672)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !473, file: !30, line: 190, baseType: !128, size: 32, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !473, file: !30, line: 191, baseType: !128, size: 32, offset: 736)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !473, file: !30, line: 195, baseType: !497, size: 2048, offset: 768)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 2048, elements: !502)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !30, line: 192, size: 64, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !498, file: !30, line: 193, baseType: !128, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !498, file: !30, line: 194, baseType: !128, size: 32, offset: 32)
!502 = !{!229, !174}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !473, file: !30, line: 197, baseType: !128, size: 32, offset: 2816)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !473, file: !30, line: 199, baseType: !128, size: 32, offset: 2848)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !473, file: !30, line: 200, baseType: !128, size: 32, offset: 2880)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !473, file: !30, line: 201, baseType: !128, size: 32, offset: 2912)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !473, file: !30, line: 202, baseType: !128, size: 32, offset: 2944)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !473, file: !30, line: 205, baseType: !128, size: 32, offset: 2976)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !473, file: !30, line: 206, baseType: !128, size: 32, offset: 3008)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !473, file: !30, line: 207, baseType: !128, size: 32, offset: 3040)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !120, file: !30, line: 315, baseType: !512, size: 4096, offset: 37760)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !513, line: 46, baseType: !514)
!513 = !DIFile(filename: "./common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 27, size: 4096, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !514, file: !513, line: 30, baseType: !128, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !514, file: !513, line: 31, baseType: !128, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !514, file: !513, line: 34, baseType: !128, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !514, file: !513, line: 35, baseType: !128, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !514, file: !513, line: 37, baseType: !296, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !514, file: !513, line: 38, baseType: !296, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !514, file: !513, line: 39, baseType: !296, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !514, file: !513, line: 42, baseType: !128, size: 32, align: 128, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !514, file: !513, line: 45, baseType: !525, size: 3680, offset: 416)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 3680, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 460)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !120, file: !30, line: 340, baseType: !529, size: 31808, offset: 41856)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !30, line: 317, size: 31808, elements: !530)
!530 = !{!531, !677, !678, !682, !683, !685, !686, !687, !688, !689, !690, !691}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !529, file: !30, line: 320, baseType: !532, size: 4288)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 4288, elements: !675)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !535, line: 94, baseType: !536)
!535 = !DIFile(filename: "./common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !535, line: 31, size: 51648, elements: !537)
!537 = !{!538, !539, !540, !541, !545, !546, !547, !548, !549, !550, !551, !555, !556, !557, !558, !559, !560, !562, !564, !565, !567, !568, !569, !574, !581, !585, !588, !590, !591, !593, !594, !598, !599, !600, !603, !605, !606, !607, !608, !610, !611, !612, !613, !614, !615, !643}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !536, file: !535, line: 34, baseType: !128, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !536, file: !535, line: 35, baseType: !128, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !536, file: !535, line: 36, baseType: !128, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !536, file: !535, line: 37, baseType: !542, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !543, line: 27, baseType: !544)
!543 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !106, line: 44, baseType: !312)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !536, file: !535, line: 38, baseType: !128, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !536, file: !535, line: 39, baseType: !128, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !536, file: !535, line: 40, baseType: !128, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !536, file: !535, line: 41, baseType: !224, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !536, file: !535, line: 42, baseType: !224, size: 32, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !536, file: !535, line: 45, baseType: !128, size: 32, offset: 352)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !536, file: !535, line: 46, baseType: !552, size: 96, offset: 384)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 96, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 3)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !536, file: !535, line: 47, baseType: !552, size: 96, offset: 480)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !536, file: !535, line: 48, baseType: !552, size: 96, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !536, file: !535, line: 49, baseType: !128, size: 32, offset: 672)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !536, file: !535, line: 50, baseType: !128, size: 32, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !536, file: !535, line: 51, baseType: !128, size: 32, offset: 736)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !536, file: !535, line: 52, baseType: !561, size: 192, offset: 768)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 192, elements: !553)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !536, file: !535, line: 53, baseType: !563, size: 256, offset: 960)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 256, elements: !436)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !536, file: !535, line: 54, baseType: !563, size: 256, offset: 1216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !536, file: !535, line: 55, baseType: !566, size: 64, offset: 1472)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !536, file: !535, line: 59, baseType: !563, size: 256, offset: 1536)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !536, file: !535, line: 60, baseType: !563, size: 256, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !536, file: !535, line: 63, baseType: !570, size: 64, offset: 2048)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !543, line: 24, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !106, line: 37, baseType: !573)
!573 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !536, file: !535, line: 64, baseType: !575, size: 128, offset: 2112)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 128, elements: !228)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 32, elements: !228)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !543, line: 25, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !106, line: 39, baseType: !580)
!580 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !536, file: !535, line: 65, baseType: !582, size: 2176, offset: 2240)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2176, elements: !583)
!583 = !{!229, !584}
!584 = !DISubrange(count: 17)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !536, file: !535, line: 66, baseType: !586, size: 2176, offset: 4416)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 2176, elements: !583)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !536, file: !535, line: 67, baseType: !589, size: 128, offset: 6592)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 128, elements: !228)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !536, file: !535, line: 68, baseType: !227, size: 64, offset: 6720)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !536, file: !535, line: 69, baseType: !592, size: 1024, offset: 6784)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 1024, elements: !502)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !536, file: !535, line: 70, baseType: !445, size: 512, offset: 7808)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !536, file: !535, line: 75, baseType: !595, size: 10368, offset: 8320)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 10368, elements: !596)
!596 = !{!597, !597}
!597 = !DISubrange(count: 18)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !536, file: !535, line: 76, baseType: !595, size: 10368, offset: 18688)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !536, file: !535, line: 77, baseType: !128, size: 32, offset: 29056)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !536, file: !535, line: 78, baseType: !601, size: 576, offset: 29088)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 576, elements: !602)
!602 = !{!597}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !536, file: !535, line: 79, baseType: !604, size: 20736, offset: 29696)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 20736, elements: !596)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !536, file: !535, line: 80, baseType: !587, size: 64, offset: 50432)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !536, file: !535, line: 81, baseType: !587, size: 64, offset: 50496)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !536, file: !535, line: 82, baseType: !587, size: 64, offset: 50560)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !536, file: !535, line: 83, baseType: !609, size: 64, offset: 50624)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !536, file: !535, line: 84, baseType: !128, size: 32, offset: 50688)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !536, file: !535, line: 85, baseType: !566, size: 64, offset: 50752)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !536, file: !535, line: 86, baseType: !566, size: 64, offset: 50816)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !536, file: !535, line: 89, baseType: !128, size: 32, offset: 50880)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !536, file: !535, line: 90, baseType: !128, size: 32, offset: 50912)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !536, file: !535, line: 91, baseType: !616, size: 320, offset: 50944)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !280, line: 72, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !280, line: 67, size: 320, elements: !618)
!618 = !{!619, !638, !642}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !617, file: !280, line: 69, baseType: !620, size: 320)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !621, line: 22, size: 320, elements: !622)
!621 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !620, file: !621, line: 24, baseType: !128, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !620, file: !621, line: 25, baseType: !7, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !620, file: !621, line: 26, baseType: !128, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !620, file: !621, line: 28, baseType: !7, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !620, file: !621, line: 32, baseType: !128, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !620, file: !621, line: 34, baseType: !580, size: 16, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !620, file: !621, line: 35, baseType: !580, size: 16, offset: 176)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !620, file: !621, line: 36, baseType: !631, size: 128, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !632, line: 55, baseType: !633)
!632 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !632, line: 51, size: 128, elements: !634)
!634 = !{!635, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !633, file: !632, line: 53, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !633, file: !632, line: 54, baseType: !636, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !617, file: !280, line: 70, baseType: !639, size: 320)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 320, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 40)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !617, file: !280, line: 71, baseType: !312, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !536, file: !535, line: 92, baseType: !644, size: 384, offset: 51264)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !280, line: 80, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !280, line: 75, size: 384, elements: !646)
!646 = !{!647, !669, !673}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !645, file: !280, line: 77, baseType: !648, size: 384)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !632, line: 94, size: 384, elements: !649)
!649 = !{!650, !662, !663, !665, !666, !667, !668}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !648, file: !632, line: 96, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !652, line: 33, baseType: !653)
!652 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !652, line: 25, size: 64, elements: !654)
!654 = !{!655, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !653, file: !652, line: 27, baseType: !656, size: 64)
!656 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !653, file: !652, line: 32, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !652, line: 28, size: 64, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !658, file: !652, line: 30, baseType: !7, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !658, file: !652, line: 31, baseType: !7, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !648, file: !632, line: 97, baseType: !651, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !648, file: !632, line: 98, baseType: !664, size: 64, offset: 128)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !228)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !648, file: !632, line: 99, baseType: !664, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !648, file: !632, line: 100, baseType: !7, size: 32, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !648, file: !632, line: 101, baseType: !7, size: 32, offset: 288)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !648, file: !632, line: 102, baseType: !664, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !645, file: !280, line: 78, baseType: !670, size: 384)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 384, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 48)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !645, file: !280, line: 79, baseType: !674, size: 64)
!674 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!675 = !{!676}
!676 = !DISubrange(count: 67)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !529, file: !30, line: 322, baseType: !532, size: 4288, offset: 4288)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !529, file: !30, line: 324, baseType: !679, size: 21760, offset: 8576)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 21760, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 340)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !529, file: !30, line: 326, baseType: !533, size: 64, offset: 30336)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !529, file: !30, line: 329, baseType: !684, size: 1152, offset: 30400)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 1152, elements: !602)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !529, file: !30, line: 331, baseType: !128, size: 32, offset: 31552)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !529, file: !30, line: 333, baseType: !128, size: 32, offset: 31584)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !529, file: !30, line: 335, baseType: !128, size: 32, offset: 31616)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !529, file: !30, line: 336, baseType: !128, size: 32, offset: 31648)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !529, file: !30, line: 337, baseType: !128, size: 32, offset: 31680)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !529, file: !30, line: 338, baseType: !128, size: 32, offset: 31712)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !529, file: !30, line: 339, baseType: !128, size: 32, offset: 31744)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !120, file: !30, line: 343, baseType: !533, size: 64, offset: 73664)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !120, file: !30, line: 346, baseType: !533, size: 64, offset: 73728)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !120, file: !30, line: 349, baseType: !128, size: 32, offset: 73792)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !120, file: !30, line: 350, baseType: !696, size: 1216, offset: 73856)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 1216, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 19)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !120, file: !30, line: 351, baseType: !128, size: 32, offset: 75072)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !120, file: !30, line: 352, baseType: !696, size: 1216, offset: 75136)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !120, file: !30, line: 353, baseType: !227, size: 64, offset: 76352)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !120, file: !30, line: 365, baseType: !703, size: 10624, offset: 76416)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !30, line: 358, size: 10624, elements: !704)
!704 = !{!705, !707, !710, !713}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !703, file: !30, line: 360, baseType: !706, size: 256, align: 128)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 256, elements: !173)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !703, file: !30, line: 361, baseType: !708, size: 128, align: 128, offset: 256)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 128, elements: !709)
!709 = !{!229, !435}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !703, file: !30, line: 363, baseType: !711, size: 4096, align: 128, offset: 384)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 4096, elements: !712)
!712 = !{!435, !181}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !703, file: !30, line: 364, baseType: !714, size: 6144, align: 128, offset: 4480)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 6144, elements: !715)
!715 = !{!716, !174}
!716 = !DISubrange(count: 24)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !120, file: !30, line: 544, baseType: !718, size: 80128, offset: 87040)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !30, line: 368, size: 80128, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !746, !748, !749, !750, !751, !752, !753, !754, !755, !756, !758, !761, !765, !766, !767, !768, !769, !773, !774, !775, !778, !780, !781, !782, !784, !785, !786, !787, !788, !789, !790, !791, !832, !852, !853, !854, !855, !856, !857, !858, !859, !860, !863, !866, !868}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !718, file: !30, line: 370, baseType: !128, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !718, file: !30, line: 373, baseType: !128, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !718, file: !30, line: 374, baseType: !128, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !718, file: !30, line: 375, baseType: !128, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !718, file: !30, line: 378, baseType: !128, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !718, file: !30, line: 379, baseType: !128, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !718, file: !30, line: 380, baseType: !128, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !718, file: !30, line: 381, baseType: !128, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !718, file: !30, line: 382, baseType: !128, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !718, file: !30, line: 385, baseType: !128, size: 32, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !718, file: !30, line: 386, baseType: !128, size: 32, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !718, file: !30, line: 387, baseType: !128, size: 32, offset: 352)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !718, file: !30, line: 388, baseType: !128, size: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !718, file: !30, line: 389, baseType: !128, size: 32, offset: 416)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !718, file: !30, line: 390, baseType: !128, size: 32, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !718, file: !30, line: 391, baseType: !128, size: 32, offset: 480)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !718, file: !30, line: 393, baseType: !128, size: 32, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !718, file: !30, line: 396, baseType: !227, size: 64, offset: 544)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !718, file: !30, line: 397, baseType: !227, size: 64, offset: 608)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !718, file: !30, line: 400, baseType: !227, size: 64, offset: 672)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !718, file: !30, line: 401, baseType: !227, size: 64, offset: 736)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !718, file: !30, line: 403, baseType: !227, size: 64, offset: 800)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !718, file: !30, line: 404, baseType: !227, size: 64, offset: 864)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !718, file: !30, line: 407, baseType: !7, size: 32, offset: 928)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !718, file: !30, line: 408, baseType: !745, size: 128, offset: 960)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !436)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !718, file: !30, line: 409, baseType: !747, size: 512, offset: 1088)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !173)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !718, file: !30, line: 410, baseType: !128, size: 32, offset: 1600)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !718, file: !30, line: 411, baseType: !128, size: 32, offset: 1632)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !718, file: !30, line: 412, baseType: !128, size: 32, offset: 1664)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !718, file: !30, line: 413, baseType: !128, size: 32, offset: 1696)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !718, file: !30, line: 414, baseType: !128, size: 32, offset: 1728)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !718, file: !30, line: 415, baseType: !128, size: 32, offset: 1760)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !718, file: !30, line: 422, baseType: !570, size: 64, offset: 1792)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !718, file: !30, line: 423, baseType: !570, size: 64, offset: 1856)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !718, file: !30, line: 424, baseType: !757, size: 64, offset: 1920)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !718, file: !30, line: 425, baseType: !759, size: 64, offset: 1984)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 64, elements: !297)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !718, file: !30, line: 427, baseType: !762, size: 64, offset: 2048)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 192, elements: !764)
!764 = !{!716}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !718, file: !30, line: 428, baseType: !570, size: 64, offset: 2112)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !718, file: !30, line: 429, baseType: !575, size: 128, offset: 2176)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !718, file: !30, line: 430, baseType: !575, size: 128, offset: 2304)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !718, file: !30, line: 431, baseType: !589, size: 128, offset: 2432)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !718, file: !30, line: 432, baseType: !770, size: 4096, offset: 2560)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4096, elements: !771)
!771 = !{!229, !772}
!772 = !DISubrange(count: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !718, file: !30, line: 433, baseType: !570, size: 64, offset: 6656)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !718, file: !30, line: 434, baseType: !570, size: 64, offset: 6720)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !718, file: !30, line: 435, baseType: !776, size: 384, offset: 6784)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 384, elements: !777)
!777 = !{!229, !554}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !718, file: !30, line: 436, baseType: !779, size: 64, offset: 7168)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !718, file: !30, line: 439, baseType: !128, size: 32, offset: 7232)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !718, file: !30, line: 440, baseType: !128, size: 32, offset: 7264)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !718, file: !30, line: 441, baseType: !783, size: 128, offset: 7296)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, elements: !436)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !718, file: !30, line: 442, baseType: !128, size: 32, offset: 7424)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !718, file: !30, line: 444, baseType: !128, size: 32, offset: 7456)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !718, file: !30, line: 445, baseType: !128, size: 32, offset: 7488)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !718, file: !30, line: 447, baseType: !128, size: 32, offset: 7520)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !718, file: !30, line: 448, baseType: !128, size: 32, offset: 7552)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !718, file: !30, line: 454, baseType: !128, size: 32, offset: 7584)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !718, file: !30, line: 457, baseType: !128, size: 32, offset: 7616)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !718, file: !30, line: 498, baseType: !792, size: 57344, offset: 7680)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !30, line: 459, size: 57344, elements: !793)
!793 = !{!794, !798, !802, !804, !805, !808, !812, !813, !816, !817, !818, !821, !822, !823, !824, !825, !826, !829, !831}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !792, file: !30, line: 464, baseType: !795, size: 3072, align: 128)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 3072, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !792, file: !30, line: 465, baseType: !799, size: 6912, align: 128, offset: 3072)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 6912, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 864)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !792, file: !30, line: 468, baseType: !803, size: 2048, align: 128, offset: 9984)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 2048, elements: !346)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !792, file: !30, line: 469, baseType: !803, size: 2048, align: 128, offset: 12032)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !792, file: !30, line: 470, baseType: !806, size: 3072, align: 128, offset: 14080)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 3072, elements: !807)
!807 = !{!554, !181}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !792, file: !30, line: 471, baseType: !809, size: 3840, align: 128, offset: 17152)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 3840, elements: !810)
!810 = !{!811, !174}
!811 = !DISubrange(count: 15)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !792, file: !30, line: 474, baseType: !711, size: 4096, align: 128, offset: 20992)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !792, file: !30, line: 475, baseType: !814, size: 4096, align: 128, offset: 25088)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 4096, elements: !815)
!815 = !{!174, !174}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !792, file: !30, line: 478, baseType: !433, size: 512, offset: 29184)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !792, file: !30, line: 479, baseType: !128, size: 32, offset: 29696)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !792, file: !30, line: 480, baseType: !819, size: 128, offset: 29728)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, elements: !820)
!820 = !{!229, !229}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !792, file: !30, line: 481, baseType: !128, size: 32, offset: 29856)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !792, file: !30, line: 484, baseType: !561, size: 192, offset: 29888)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !792, file: !30, line: 486, baseType: !561, size: 192, offset: 30080)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !792, file: !30, line: 489, baseType: !561, size: 192, offset: 30272)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !792, file: !30, line: 492, baseType: !227, size: 64, offset: 30464)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !792, file: !30, line: 493, baseType: !827, size: 24576, offset: 30528)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 24576, elements: !828)
!828 = !{!229, !772, !426}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !792, file: !30, line: 494, baseType: !830, size: 2048, offset: 55104)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 2048, elements: !502)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !792, file: !30, line: 497, baseType: !552, size: 96, offset: 57152)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !718, file: !30, line: 526, baseType: !833, size: 12032, offset: 65024)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !30, line: 501, size: 12032, elements: !834)
!834 = !{!835, !837, !839, !842, !845, !846, !847, !848, !849, !850, !851}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !833, file: !30, line: 504, baseType: !836, size: 384)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 384, elements: !671)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !833, file: !30, line: 507, baseType: !838, size: 384, offset: 384)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 384, elements: !671)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !833, file: !30, line: 510, baseType: !840, size: 768, align: 32, offset: 768)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 768, elements: !841)
!841 = !{!229, !672}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !833, file: !30, line: 513, baseType: !843, size: 3072, align: 128, offset: 1536)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 3072, elements: !844)
!844 = !{!229, !672, !229}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !833, file: !30, line: 514, baseType: !843, size: 3072, align: 64, offset: 4608)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !833, file: !30, line: 517, baseType: !836, size: 384, align: 32, offset: 7680)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !833, file: !30, line: 519, baseType: !843, size: 3072, align: 128, offset: 8064)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !833, file: !30, line: 520, baseType: !840, size: 768, align: 32, offset: 11136)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !833, file: !30, line: 521, baseType: !577, size: 32, align: 32, offset: 11904)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !833, file: !30, line: 524, baseType: !128, size: 32, offset: 11936)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !833, file: !30, line: 525, baseType: !128, size: 32, offset: 11968)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !718, file: !30, line: 529, baseType: !128, size: 32, offset: 77056)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !718, file: !30, line: 530, baseType: !128, size: 32, offset: 77088)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !718, file: !30, line: 531, baseType: !128, size: 32, offset: 77120)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !718, file: !30, line: 532, baseType: !128, size: 32, offset: 77152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !718, file: !30, line: 533, baseType: !128, size: 32, offset: 77184)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !718, file: !30, line: 534, baseType: !128, size: 32, offset: 77216)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !718, file: !30, line: 535, baseType: !128, size: 32, offset: 77248)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !718, file: !30, line: 536, baseType: !128, size: 32, offset: 77280)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !718, file: !30, line: 539, baseType: !861, size: 512, offset: 77312)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 512, elements: !862)
!862 = !{!174, !229}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !718, file: !30, line: 540, baseType: !864, size: 2048, offset: 77824)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 2048, elements: !865)
!865 = !{!772, !435}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !718, file: !30, line: 542, baseType: !867, size: 16, offset: 79872)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 16, elements: !228)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !718, file: !30, line: 543, baseType: !869, size: 128, offset: 79888)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 128, elements: !173)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !120, file: !30, line: 547, baseType: !871, size: 64, offset: 167168)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !30, line: 248, baseType: !873)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !30, line: 248, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !120, file: !30, line: 604, baseType: !875, size: 23936, offset: 167232)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !30, line: 550, size: 23936, elements: !876)
!876 = !{!877, !902, !906, !908, !910, !911, !912, !913, !914, !915, !916, !917, !920, !922, !924, !927, !928}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !875, file: !30, line: 579, baseType: !878, size: 3904)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !875, file: !30, line: 553, size: 3904, elements: !879)
!879 = !{!880, !881, !882, !883, !885, !886, !887, !888, !889, !891, !894, !895, !896, !897, !898, !900}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !878, file: !30, line: 556, baseType: !128, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !878, file: !30, line: 558, baseType: !128, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !878, file: !30, line: 560, baseType: !128, size: 32, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !878, file: !30, line: 562, baseType: !884, size: 608, offset: 96)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 608, elements: !697)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !878, file: !30, line: 563, baseType: !128, size: 32, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !878, file: !30, line: 564, baseType: !128, size: 32, offset: 736)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !878, file: !30, line: 565, baseType: !128, size: 32, offset: 768)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !878, file: !30, line: 566, baseType: !227, size: 64, offset: 800)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !878, file: !30, line: 567, baseType: !890, size: 2048, offset: 864)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !771)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !878, file: !30, line: 568, baseType: !892, size: 544, offset: 2912)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 544, elements: !893)
!893 = !{!584}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !878, file: !30, line: 571, baseType: !128, size: 32, offset: 3456)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !878, file: !30, line: 572, baseType: !128, size: 32, offset: 3488)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !878, file: !30, line: 573, baseType: !128, size: 32, offset: 3520)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !878, file: !30, line: 575, baseType: !227, size: 64, offset: 3552)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !878, file: !30, line: 577, baseType: !899, size: 192, offset: 3648)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 192, elements: !553)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !878, file: !30, line: 578, baseType: !901, size: 64, offset: 3840)
!901 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !875, file: !30, line: 584, baseType: !903, size: 160, offset: 3904)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 160, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 5)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !875, file: !30, line: 585, baseType: !907, size: 320, offset: 4096)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !904)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !875, file: !30, line: 586, baseType: !909, size: 320, offset: 4416)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 320, elements: !904)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !875, file: !30, line: 587, baseType: !892, size: 544, offset: 4736)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !875, file: !30, line: 589, baseType: !907, size: 320, offset: 5312)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !875, file: !30, line: 590, baseType: !909, size: 320, offset: 5632)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !875, file: !30, line: 591, baseType: !909, size: 320, offset: 5952)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !875, file: !30, line: 592, baseType: !909, size: 320, offset: 6272)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !875, file: !30, line: 593, baseType: !909, size: 320, offset: 6592)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !875, file: !30, line: 594, baseType: !909, size: 320, offset: 6912)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !875, file: !30, line: 596, baseType: !918, size: 6080, offset: 7232)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 6080, elements: !919)
!919 = !{!905, !698}
