; ModuleID = 'encoder/cavlc.c'
source_filename = "encoder/cavlc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.vlc_t = type { i8, i8 }
%struct.x264_t = type { %struct.x264_param_t, [128 x ptr], i64, i32, i32, %struct.anon.2, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], ptr, [8 x i8], [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], %struct.x264_slice_header_t, [8 x i8], %struct.x264_cabac_t, %struct.anon.6, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], %struct.anon.8, %struct.anon.9, ptr, %struct.anon.12, [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !113, line: 24, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !115, line: 38, baseType: !153)
!153 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !{!155}
!155 = !DISubrange(count: 256)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "x264_scan8", scope: !9, file: !12, line: 216, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 864, elements: !144)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "x264_mb_pred_mode8x8c_fix", scope: !9, file: !85, line: 41, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 56, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 7)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "x264_mb_pred_mode16x16_fix", scope: !9, file: !85, line: 58, type: !162, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "sub_mb_type_p_to_golomb", scope: !9, file: !2, line: 50, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 32, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 4)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "sub_mb_type_b_to_golomb", scope: !9, file: !2, line: 54, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 13)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "x264_mb_partition_listX_table", scope: !9, file: !21, line: 153, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 272, elements: !180)
!180 = !{!181, !182}
!181 = !DISubrange(count: 2)
!182 = !DISubrange(count: 17)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "x264_mb_type_list0_table", scope: !9, file: !21, line: 94, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 304, elements: !186)
!186 = !{!187, !181}
!187 = !DISubrange(count: 19)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "x264_mb_type_list1_table", scope: !9, file: !21, line: 107, type: !185, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "mb_type_b_to_golomb", scope: !9, file: !2, line: 44, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 216, elements: !193)
!193 = !{!194, !195}
!194 = !DISubrange(count: 3)
!195 = !DISubrange(count: 9)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "intra4x4_cbp_to_golomb", scope: !9, file: !2, line: 32, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 384, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 48)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "inter_cbp_to_golomb", scope: !9, file: !2, line: 38, type: !198, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "partition_tab", scope: !205, file: !21, line: 473, type: !1275, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "x264_mb_transform_8x8_allowed", scope: !21, file: !21, line: 468, type: !206, scopeLine: 469, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !1271)
!206 = !DISubroutineType(types: !207)
!207 = !{!126, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !210, line: 42, baseType: !211)
!210 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !12, line: 250, size: 206080, elements: !212)
!212 = !{!213, !357, !361, !365, !366, !367, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !474, !476, !503, !505, !506, !511, !516, !520, !524, !531, !535, !536, !537, !538, !541, !543, !545, !585, !602, !757, !758, !759, !760, !763, !764, !765, !766, !780, !932, !936, !991, !997, !998, !1006, !1008, !1078, !1138, !1190, !1211, !1251}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !211, file: !12, line: 253, baseType: !214, size: 4928)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !210, line: 295, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !210, line: 151, size: 4928, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !257, !259, !260, !261, !262, !266, !267, !282, !283, !284, !285, !286, !315, !354, !355, !356}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !215, file: !210, line: 154, baseType: !13, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !215, file: !210, line: 155, baseType: !126, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !215, file: !210, line: 156, baseType: !126, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !215, file: !210, line: 159, baseType: !126, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !215, file: !210, line: 160, baseType: !126, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !215, file: !210, line: 161, baseType: !126, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !215, file: !210, line: 162, baseType: !126, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !215, file: !210, line: 163, baseType: !126, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !215, file: !210, line: 180, baseType: !226, size: 288, offset: 256)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !210, line: 165, size: 288, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !226, file: !210, line: 168, baseType: !126, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !226, file: !210, line: 169, baseType: !126, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !226, file: !210, line: 171, baseType: !126, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !226, file: !210, line: 174, baseType: !126, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !226, file: !210, line: 175, baseType: !126, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !226, file: !210, line: 176, baseType: !126, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !226, file: !210, line: 177, baseType: !126, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !226, file: !210, line: 178, baseType: !126, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !226, file: !210, line: 179, baseType: !126, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !215, file: !210, line: 182, baseType: !126, size: 32, offset: 544)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !215, file: !210, line: 183, baseType: !126, size: 32, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !215, file: !210, line: 186, baseType: !126, size: 32, offset: 608)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !215, file: !210, line: 187, baseType: !126, size: 32, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !215, file: !210, line: 188, baseType: !126, size: 32, offset: 672)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !215, file: !210, line: 189, baseType: !126, size: 32, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !215, file: !210, line: 190, baseType: !126, size: 32, offset: 736)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !215, file: !210, line: 191, baseType: !126, size: 32, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !215, file: !210, line: 192, baseType: !126, size: 32, offset: 800)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !215, file: !210, line: 193, baseType: !126, size: 32, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !215, file: !210, line: 194, baseType: !126, size: 32, offset: 864)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !215, file: !210, line: 196, baseType: !126, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !215, file: !210, line: 197, baseType: !126, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !215, file: !210, line: 198, baseType: !126, size: 32, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !215, file: !210, line: 200, baseType: !126, size: 32, offset: 992)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !215, file: !210, line: 201, baseType: !126, size: 32, offset: 1024)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !215, file: !210, line: 203, baseType: !126, size: 32, offset: 1056)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !215, file: !210, line: 205, baseType: !126, size: 32, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !215, file: !210, line: 206, baseType: !256, size: 64, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !215, file: !210, line: 207, baseType: !258, size: 128, offset: 1216)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 128, elements: !138)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !215, file: !210, line: 208, baseType: !258, size: 128, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !215, file: !210, line: 209, baseType: !258, size: 128, offset: 1472)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !215, file: !210, line: 210, baseType: !258, size: 128, offset: 1600)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !215, file: !210, line: 211, baseType: !263, size: 512, offset: 1728)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 512, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !215, file: !210, line: 212, baseType: !263, size: 512, offset: 2240)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !215, file: !210, line: 215, baseType: !268, size: 64, offset: 2752)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !271, !126, !272, !274}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !276)
!276 = !{!277, !279, !280, !281}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !275, file: !278, baseType: !13, size: 32)
!278 = !DIFile(filename: "encoder/cavlc.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !275, file: !278, baseType: !13, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !275, file: !278, baseType: !271, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !275, file: !278, baseType: !271, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !215, file: !210, line: 216, baseType: !271, size: 64, offset: 2816)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !215, file: !210, line: 217, baseType: !126, size: 32, offset: 2880)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !215, file: !210, line: 218, baseType: !126, size: 32, offset: 2912)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !215, file: !210, line: 219, baseType: !256, size: 64, offset: 2944)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !215, file: !210, line: 252, baseType: !287, size: 768, offset: 3008)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !210, line: 222, size: 768, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !309, !310, !313, !314}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !287, file: !210, line: 224, baseType: !13, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !287, file: !210, line: 225, baseType: !13, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !287, file: !210, line: 227, baseType: !126, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !287, file: !210, line: 228, baseType: !126, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !287, file: !210, line: 229, baseType: !126, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !287, file: !210, line: 230, baseType: !126, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !287, file: !210, line: 231, baseType: !126, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !287, file: !210, line: 233, baseType: !126, size: 32, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !287, file: !210, line: 234, baseType: !126, size: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !287, file: !210, line: 235, baseType: !126, size: 32, offset: 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !287, file: !210, line: 236, baseType: !126, size: 32, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !287, file: !210, line: 237, baseType: !126, size: 32, offset: 352)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !287, file: !210, line: 238, baseType: !126, size: 32, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !287, file: !210, line: 239, baseType: !126, size: 32, offset: 416)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !287, file: !210, line: 240, baseType: !126, size: 32, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !287, file: !210, line: 241, baseType: !126, size: 32, offset: 480)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !287, file: !210, line: 242, baseType: !126, size: 32, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !287, file: !210, line: 243, baseType: !126, size: 32, offset: 544)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !287, file: !210, line: 244, baseType: !308, size: 32, offset: 576)
!308 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !287, file: !210, line: 245, baseType: !308, size: 32, offset: 608)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !287, file: !210, line: 248, baseType: !311, size: 64, offset: 640)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !312)
!312 = !{!181}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !287, file: !210, line: 250, baseType: !126, size: 32, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !287, file: !210, line: 251, baseType: !126, size: 32, offset: 736)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !215, file: !210, line: 289, baseType: !316, size: 1024, offset: 3776)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !210, line: 255, size: 1024, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !352, !353}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !316, file: !210, line: 257, baseType: !126, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !316, file: !210, line: 259, baseType: !126, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !316, file: !210, line: 260, baseType: !126, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !316, file: !210, line: 261, baseType: !126, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !316, file: !210, line: 262, baseType: !126, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !316, file: !210, line: 264, baseType: !126, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !316, file: !210, line: 265, baseType: !308, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !316, file: !210, line: 266, baseType: !308, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !316, file: !210, line: 267, baseType: !126, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !316, file: !210, line: 268, baseType: !126, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !316, file: !210, line: 269, baseType: !308, size: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !316, file: !210, line: 270, baseType: !308, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !316, file: !210, line: 271, baseType: !308, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !316, file: !210, line: 273, baseType: !126, size: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !316, file: !210, line: 274, baseType: !308, size: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !316, file: !210, line: 277, baseType: !126, size: 32, offset: 480)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !316, file: !210, line: 278, baseType: !256, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !316, file: !210, line: 279, baseType: !126, size: 32, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !316, file: !210, line: 280, baseType: !256, size: 64, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !316, file: !210, line: 283, baseType: !308, size: 32, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !316, file: !210, line: 284, baseType: !308, size: 32, offset: 736)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !316, file: !210, line: 285, baseType: !308, size: 32, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !316, file: !210, line: 286, baseType: !341, size: 64, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !210, line: 149, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 142, size: 256, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !343, file: !210, line: 144, baseType: !126, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !343, file: !210, line: 144, baseType: !126, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !343, file: !210, line: 145, baseType: !126, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !343, file: !210, line: 146, baseType: !126, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !343, file: !210, line: 147, baseType: !308, size: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !343, file: !210, line: 148, baseType: !351, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !316, file: !210, line: 287, baseType: !126, size: 32, offset: 896)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !316, file: !210, line: 288, baseType: !256, size: 64, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !215, file: !210, line: 292, baseType: !126, size: 32, offset: 4800)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !215, file: !210, line: 293, baseType: !126, size: 32, offset: 4832)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !215, file: !210, line: 294, baseType: !126, size: 32, offset: 4864)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !211, file: !12, line: 255, baseType: !358, size: 8192, offset: 4928)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 8192, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !211, file: !12, line: 256, baseType: !362, size: 64, offset: 13120)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !363, line: 27, baseType: !364)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!364 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !211, file: !12, line: 257, baseType: !126, size: 32, offset: 13184)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !211, file: !12, line: 258, baseType: !126, size: 32, offset: 13216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !211, file: !12, line: 269, baseType: !368, size: 2112, offset: 13248)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !12, line: 261, size: 2112, elements: !369)
!369 = !{!370, !371, !383, !384, !385, !395}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !368, file: !12, line: 263, baseType: !126, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !368, file: !12, line: 264, baseType: !372, size: 1536, offset: 64)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 1536, elements: !381)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !210, line: 399, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 391, size: 192, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !374, file: !210, line: 393, baseType: !126, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !374, file: !210, line: 394, baseType: !126, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !374, file: !210, line: 397, baseType: !126, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !374, file: !210, line: 398, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!381 = !{!382}
!382 = !DISubrange(count: 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !368, file: !12, line: 265, baseType: !126, size: 32, offset: 1600)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !368, file: !12, line: 266, baseType: !380, size: 64, offset: 1664)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !368, file: !12, line: 267, baseType: !386, size: 320, offset: 1728)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !148, line: 49, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !148, line: 40, size: 320, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !387, file: !148, line: 42, baseType: !380, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !387, file: !148, line: 43, baseType: !380, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !387, file: !148, line: 44, baseType: !380, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !387, file: !148, line: 46, baseType: !117, size: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !387, file: !148, line: 47, baseType: !126, size: 32, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !387, file: !148, line: 48, baseType: !126, size: 32, offset: 288)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !368, file: !12, line: 268, baseType: !126, size: 32, offset: 2048)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !211, file: !12, line: 274, baseType: !126, size: 32, offset: 15360)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !211, file: !12, line: 276, baseType: !126, size: 32, offset: 15392)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !211, file: !12, line: 277, baseType: !126, size: 32, offset: 15424)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !211, file: !12, line: 278, baseType: !126, size: 32, offset: 15456)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !211, file: !12, line: 279, baseType: !126, size: 32, offset: 15488)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !211, file: !12, line: 280, baseType: !126, size: 32, offset: 15520)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !211, file: !12, line: 282, baseType: !126, size: 32, offset: 15552)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !211, file: !12, line: 283, baseType: !126, size: 32, offset: 15584)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !211, file: !12, line: 284, baseType: !126, size: 32, offset: 15616)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !211, file: !12, line: 287, baseType: !406, size: 9920, offset: 15648)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 9920, elements: !472)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !100, line: 133, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 52, size: 9920, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !425, !426, !427, !428, !429, !430, !431, !432, !433, !440, !441, !471}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !408, file: !100, line: 54, baseType: !126, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !408, file: !100, line: 56, baseType: !126, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !408, file: !100, line: 57, baseType: !126, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !408, file: !100, line: 59, baseType: !126, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !408, file: !100, line: 60, baseType: !126, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !408, file: !100, line: 61, baseType: !126, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !408, file: !100, line: 63, baseType: !126, size: 32, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !408, file: !100, line: 65, baseType: !126, size: 32, offset: 224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !408, file: !100, line: 67, baseType: !126, size: 32, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !408, file: !100, line: 69, baseType: !126, size: 32, offset: 288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !408, file: !100, line: 70, baseType: !126, size: 32, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !408, file: !100, line: 71, baseType: !126, size: 32, offset: 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !408, file: !100, line: 72, baseType: !126, size: 32, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !408, file: !100, line: 73, baseType: !424, size: 8192, offset: 416)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8192, elements: !154)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !408, file: !100, line: 75, baseType: !126, size: 32, offset: 8608)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !408, file: !100, line: 76, baseType: !126, size: 32, offset: 8640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !408, file: !100, line: 77, baseType: !126, size: 32, offset: 8672)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !408, file: !100, line: 78, baseType: !126, size: 32, offset: 8704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !408, file: !100, line: 79, baseType: !126, size: 32, offset: 8736)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !408, file: !100, line: 80, baseType: !126, size: 32, offset: 8768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !408, file: !100, line: 81, baseType: !126, size: 32, offset: 8800)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !408, file: !100, line: 83, baseType: !126, size: 32, offset: 8832)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !408, file: !100, line: 90, baseType: !434, size: 128, offset: 8864)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !100, line: 84, size: 128, elements: !435)
!435 = !{!436, !437, !438, !439}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !434, file: !100, line: 86, baseType: !126, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !434, file: !100, line: 87, baseType: !126, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !434, file: !100, line: 88, baseType: !126, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !434, file: !100, line: 89, baseType: !126, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !408, file: !100, line: 92, baseType: !126, size: 32, offset: 8992)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !408, file: !100, line: 129, baseType: !442, size: 864, offset: 9024)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !100, line: 93, size: 864, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !442, file: !100, line: 95, baseType: !126, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !442, file: !100, line: 96, baseType: !126, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !442, file: !100, line: 97, baseType: !126, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !442, file: !100, line: 99, baseType: !126, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !442, file: !100, line: 100, baseType: !126, size: 32, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !442, file: !100, line: 102, baseType: !126, size: 32, offset: 160)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !442, file: !100, line: 103, baseType: !126, size: 32, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !442, file: !100, line: 104, baseType: !126, size: 32, offset: 224)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !442, file: !100, line: 105, baseType: !126, size: 32, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !442, file: !100, line: 106, baseType: !126, size: 32, offset: 288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !442, file: !100, line: 107, baseType: !126, size: 32, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !442, file: !100, line: 108, baseType: !126, size: 32, offset: 352)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !442, file: !100, line: 110, baseType: !126, size: 32, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !442, file: !100, line: 111, baseType: !126, size: 32, offset: 416)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !442, file: !100, line: 112, baseType: !126, size: 32, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !442, file: !100, line: 114, baseType: !126, size: 32, offset: 480)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !442, file: !100, line: 115, baseType: !126, size: 32, offset: 512)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !442, file: !100, line: 116, baseType: !126, size: 32, offset: 544)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !442, file: !100, line: 117, baseType: !126, size: 32, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !442, file: !100, line: 119, baseType: !126, size: 32, offset: 608)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !442, file: !100, line: 120, baseType: !126, size: 32, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !442, file: !100, line: 121, baseType: !126, size: 32, offset: 672)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !442, file: !100, line: 122, baseType: !126, size: 32, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !442, file: !100, line: 123, baseType: !126, size: 32, offset: 736)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !442, file: !100, line: 124, baseType: !126, size: 32, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !442, file: !100, line: 125, baseType: !126, size: 32, offset: 800)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !442, file: !100, line: 126, baseType: !126, size: 32, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !408, file: !100, line: 131, baseType: !126, size: 32, offset: 9888)
!472 = !{!473}
!473 = !DISubrange(count: 1)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !211, file: !12, line: 288, baseType: !475, size: 64, offset: 25600)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !211, file: !12, line: 289, baseType: !477, size: 960, offset: 25664)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 960, elements: !472)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !100, line: 165, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 135, size: 960, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !479, file: !100, line: 137, baseType: !126, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !479, file: !100, line: 138, baseType: !126, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !479, file: !100, line: 140, baseType: !126, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !479, file: !100, line: 142, baseType: !126, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !479, file: !100, line: 143, baseType: !126, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !479, file: !100, line: 145, baseType: !126, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !479, file: !100, line: 146, baseType: !126, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !479, file: !100, line: 148, baseType: !126, size: 32, offset: 224)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !479, file: !100, line: 149, baseType: !126, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !479, file: !100, line: 151, baseType: !126, size: 32, offset: 288)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !479, file: !100, line: 152, baseType: !126, size: 32, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !479, file: !100, line: 154, baseType: !126, size: 32, offset: 352)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !479, file: !100, line: 156, baseType: !126, size: 32, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !479, file: !100, line: 157, baseType: !126, size: 32, offset: 416)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !479, file: !100, line: 158, baseType: !126, size: 32, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !479, file: !100, line: 160, baseType: !126, size: 32, offset: 480)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !479, file: !100, line: 162, baseType: !126, size: 32, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !479, file: !100, line: 163, baseType: !499, size: 384, offset: 576)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 384, elements: !501)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!501 = !{!502}
!502 = !DISubrange(count: 6)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !211, file: !12, line: 290, baseType: !504, size: 64, offset: 26624)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !211, file: !12, line: 291, baseType: !126, size: 32, offset: 26688)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !211, file: !12, line: 294, baseType: !507, size: 256, offset: 26752)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 256, elements: !170)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !510)
!510 = !{!171, !171}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !211, file: !12, line: 295, baseType: !512, size: 128, offset: 27008)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 128, elements: !312)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !515)
!515 = !{!382, !382}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !211, file: !12, line: 297, baseType: !517, size: 256, offset: 27136)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 256, elements: !170)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !138)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !211, file: !12, line: 298, baseType: !521, size: 128, offset: 27392)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 128, elements: !312)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !264)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !211, file: !12, line: 300, baseType: !525, size: 256, offset: 27520)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 256, elements: !170)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 256, elements: !138)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !113, line: 25, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !115, line: 40, baseType: !530)
!530 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !211, file: !12, line: 301, baseType: !532, size: 128, offset: 27776)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 128, elements: !312)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 1024, elements: !264)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !211, file: !12, line: 302, baseType: !525, size: 256, offset: 27904)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !211, file: !12, line: 303, baseType: !532, size: 128, offset: 28160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !211, file: !12, line: 305, baseType: !500, size: 64, offset: 28288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !211, file: !12, line: 307, baseType: !539, size: 4096, align: 128, offset: 28416)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 4096, elements: !540)
!540 = !{!181, !265}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !211, file: !12, line: 308, baseType: !542, size: 2048, align: 128, offset: 32512)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 2048, elements: !540)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !211, file: !12, line: 309, baseType: !544, size: 64, offset: 34560)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !312)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !211, file: !12, line: 312, baseType: !546, size: 3072, offset: 34624)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !12, line: 209, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 159, size: 3072, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !577, !578, !579, !580, !581, !582, !583, !584}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !547, file: !12, line: 161, baseType: !475, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !547, file: !12, line: 162, baseType: !504, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !547, file: !12, line: 164, baseType: !126, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !547, file: !12, line: 165, baseType: !126, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !547, file: !12, line: 166, baseType: !126, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !547, file: !12, line: 168, baseType: !126, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !547, file: !12, line: 170, baseType: !126, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !547, file: !12, line: 172, baseType: !126, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !547, file: !12, line: 173, baseType: !126, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !547, file: !12, line: 174, baseType: !126, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !547, file: !12, line: 176, baseType: !126, size: 32, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !547, file: !12, line: 178, baseType: !126, size: 32, offset: 416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !547, file: !12, line: 179, baseType: !126, size: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !547, file: !12, line: 181, baseType: !311, size: 64, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !547, file: !12, line: 182, baseType: !126, size: 32, offset: 544)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !547, file: !12, line: 184, baseType: !126, size: 32, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !547, file: !12, line: 186, baseType: !126, size: 32, offset: 608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !547, file: !12, line: 187, baseType: !126, size: 32, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !547, file: !12, line: 188, baseType: !126, size: 32, offset: 672)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !547, file: !12, line: 190, baseType: !126, size: 32, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !547, file: !12, line: 191, baseType: !126, size: 32, offset: 736)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !547, file: !12, line: 195, baseType: !571, size: 2048, offset: 768)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 2048, elements: !576)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !12, line: 192, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !572, file: !12, line: 193, baseType: !126, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !572, file: !12, line: 194, baseType: !126, size: 32, offset: 32)
!576 = !{!181, !139}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !547, file: !12, line: 197, baseType: !126, size: 32, offset: 2816)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !547, file: !12, line: 199, baseType: !126, size: 32, offset: 2848)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !547, file: !12, line: 200, baseType: !126, size: 32, offset: 2880)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !547, file: !12, line: 201, baseType: !126, size: 32, offset: 2912)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !547, file: !12, line: 202, baseType: !126, size: 32, offset: 2944)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !547, file: !12, line: 205, baseType: !126, size: 32, offset: 2976)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !547, file: !12, line: 206, baseType: !126, size: 32, offset: 3008)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !547, file: !12, line: 207, baseType: !126, size: 32, offset: 3040)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !211, file: !12, line: 315, baseType: !586, size: 4096, offset: 37760)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !587, line: 46, baseType: !588)
!587 = !DIFile(filename: "./common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !587, line: 27, size: 4096, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !588, file: !587, line: 30, baseType: !126, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !588, file: !587, line: 31, baseType: !126, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !588, file: !587, line: 34, baseType: !126, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !588, file: !587, line: 35, baseType: !126, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !588, file: !587, line: 37, baseType: !380, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !588, file: !587, line: 38, baseType: !380, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !588, file: !587, line: 39, baseType: !380, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !588, file: !587, line: 42, baseType: !126, size: 32, align: 128, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !588, file: !587, line: 45, baseType: !599, size: 3680, offset: 416)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 3680, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 460)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !211, file: !12, line: 340, baseType: !603, size: 31808, offset: 41856)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !12, line: 317, size: 31808, elements: !604)
!604 = !{!605, !742, !743, !747, !748, !750, !751, !752, !753, !754, !755, !756}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !603, file: !12, line: 320, baseType: !606, size: 4288)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 4288, elements: !740)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !609, line: 94, baseType: !610)
!609 = !DIFile(filename: "./common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 31, size: 51648, elements: !611)
!611 = !{!612, !613, !614, !615, !618, !619, !620, !621, !622, !623, !624, !627, !628, !629, !630, !631, !632, !634, !636, !637, !639, !640, !641, !646, !650, !652, !655, !657, !658, !660, !661, !665, !666, !667, !670, !672, !673, !674, !675, !677, !678, !679, !680, !681, !682, !710}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !610, file: !609, line: 34, baseType: !126, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !610, file: !609, line: 35, baseType: !126, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !610, file: !609, line: 36, baseType: !126, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !610, file: !609, line: 37, baseType: !616, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !129, line: 27, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !115, line: 44, baseType: !119)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !610, file: !609, line: 38, baseType: !126, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !610, file: !609, line: 39, baseType: !126, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !610, file: !609, line: 40, baseType: !126, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !610, file: !609, line: 41, baseType: !308, size: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !610, file: !609, line: 42, baseType: !308, size: 32, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !610, file: !609, line: 45, baseType: !126, size: 32, offset: 352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !610, file: !609, line: 46, baseType: !625, size: 96, offset: 384)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !626)
!626 = !{!194}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !610, file: !609, line: 47, baseType: !625, size: 96, offset: 480)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !610, file: !609, line: 48, baseType: !625, size: 96, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !610, file: !609, line: 49, baseType: !126, size: 32, offset: 672)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !610, file: !609, line: 50, baseType: !126, size: 32, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !610, file: !609, line: 51, baseType: !126, size: 32, offset: 736)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !610, file: !609, line: 52, baseType: !633, size: 192, offset: 768)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 192, elements: !626)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !610, file: !609, line: 53, baseType: !635, size: 256, offset: 960)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 256, elements: !170)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !610, file: !609, line: 54, baseType: !635, size: 256, offset: 1216)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !610, file: !609, line: 55, baseType: !638, size: 64, offset: 1472)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !610, file: !609, line: 59, baseType: !635, size: 256, offset: 1536)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !610, file: !609, line: 60, baseType: !635, size: 256, offset: 1792)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !610, file: !609, line: 63, baseType: !642, size: 64, offset: 2048)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !129, line: 24, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !115, line: 37, baseType: !645)
!645 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !610, file: !609, line: 64, baseType: !647, size: 128, offset: 2112)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 128, elements: !312)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 32, elements: !312)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !610, file: !609, line: 65, baseType: !651, size: 2176, offset: 2240)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 2176, elements: !180)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !610, file: !609, line: 66, baseType: !653, size: 2176, offset: 4416)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 2176, elements: !180)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !610, file: !609, line: 67, baseType: !656, size: 128, offset: 6592)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 128, elements: !312)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !610, file: !609, line: 68, baseType: !311, size: 64, offset: 6720)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !610, file: !609, line: 69, baseType: !659, size: 1024, offset: 6784)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 1024, elements: !576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !610, file: !609, line: 70, baseType: !519, size: 512, offset: 7808)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !610, file: !609, line: 75, baseType: !662, size: 10368, offset: 8320)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 10368, elements: !663)
!663 = !{!664, !664}
!664 = !DISubrange(count: 18)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !610, file: !609, line: 76, baseType: !662, size: 10368, offset: 18688)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !610, file: !609, line: 77, baseType: !126, size: 32, offset: 29056)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !610, file: !609, line: 78, baseType: !668, size: 576, offset: 29088)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 576, elements: !669)
!669 = !{!664}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !610, file: !609, line: 79, baseType: !671, size: 20736, offset: 29696)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 20736, elements: !663)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !610, file: !609, line: 80, baseType: !654, size: 64, offset: 50432)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !610, file: !609, line: 81, baseType: !654, size: 64, offset: 50496)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !610, file: !609, line: 82, baseType: !654, size: 64, offset: 50560)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !610, file: !609, line: 83, baseType: !676, size: 64, offset: 50624)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !610, file: !609, line: 84, baseType: !126, size: 32, offset: 50688)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !610, file: !609, line: 85, baseType: !638, size: 64, offset: 50752)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !610, file: !609, line: 86, baseType: !638, size: 64, offset: 50816)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !610, file: !609, line: 89, baseType: !126, size: 32, offset: 50880)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !610, file: !609, line: 90, baseType: !126, size: 32, offset: 50912)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !610, file: !609, line: 91, baseType: !683, size: 320, offset: 50944)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !363, line: 72, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !363, line: 67, size: 320, elements: !685)
!685 = !{!686, !705, !709}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !684, file: !363, line: 69, baseType: !687, size: 320)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !688, line: 22, size: 320, elements: !689)
!688 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !687, file: !688, line: 24, baseType: !126, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !687, file: !688, line: 25, baseType: !13, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !687, file: !688, line: 26, baseType: !126, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !687, file: !688, line: 28, baseType: !13, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !687, file: !688, line: 32, baseType: !126, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !687, file: !688, line: 34, baseType: !131, size: 16, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !687, file: !688, line: 35, baseType: !131, size: 16, offset: 176)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !687, file: !688, line: 36, baseType: !698, size: 128, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !699, line: 55, baseType: !700)
!699 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !699, line: 51, size: 128, elements: !701)
!701 = !{!702, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !700, file: !699, line: 53, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !700, file: !699, line: 54, baseType: !703, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !684, file: !363, line: 70, baseType: !706, size: 320)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 40)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !684, file: !363, line: 71, baseType: !119, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !610, file: !609, line: 92, baseType: !711, size: 384, offset: 51264)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !363, line: 80, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !363, line: 75, size: 384, elements: !713)
!713 = !{!714, !736, !738}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !712, file: !363, line: 77, baseType: !715, size: 384)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !699, line: 94, size: 384, elements: !716)
!716 = !{!717, !729, !730, !732, !733, !734, !735}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !715, file: !699, line: 96, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !719, line: 33, baseType: !720)
!719 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !719, line: 25, size: 64, elements: !721)
!721 = !{!722, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !720, file: !719, line: 27, baseType: !723, size: 64)
!723 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !720, file: !719, line: 32, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !720, file: !719, line: 28, size: 64, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !725, file: !719, line: 30, baseType: !13, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !725, file: !719, line: 31, baseType: !13, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !715, file: !699, line: 97, baseType: !718, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !715, file: !699, line: 98, baseType: !731, size: 64, offset: 128)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !312)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !715, file: !699, line: 99, baseType: !731, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !715, file: !699, line: 100, baseType: !13, size: 32, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !715, file: !699, line: 101, baseType: !13, size: 32, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !715, file: !699, line: 102, baseType: !731, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !712, file: !363, line: 78, baseType: !737, size: 384)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !199)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !712, file: !363, line: 79, baseType: !739, size: 64)
!739 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!740 = !{!741}
!741 = !DISubrange(count: 67)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !603, file: !12, line: 322, baseType: !606, size: 4288, offset: 4288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !603, file: !12, line: 324, baseType: !744, size: 21760, offset: 8576)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 21760, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 340)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !603, file: !12, line: 326, baseType: !607, size: 64, offset: 30336)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !603, file: !12, line: 329, baseType: !749, size: 1152, offset: 30400)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 1152, elements: !669)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !603, file: !12, line: 331, baseType: !126, size: 32, offset: 31552)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !603, file: !12, line: 333, baseType: !126, size: 32, offset: 31584)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !603, file: !12, line: 335, baseType: !126, size: 32, offset: 31616)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !603, file: !12, line: 336, baseType: !126, size: 32, offset: 31648)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !603, file: !12, line: 337, baseType: !126, size: 32, offset: 31680)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !603, file: !12, line: 338, baseType: !126, size: 32, offset: 31712)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !603, file: !12, line: 339, baseType: !126, size: 32, offset: 31744)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !211, file: !12, line: 343, baseType: !607, size: 64, offset: 73664)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !211, file: !12, line: 346, baseType: !607, size: 64, offset: 73728)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !211, file: !12, line: 349, baseType: !126, size: 32, offset: 73792)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !211, file: !12, line: 350, baseType: !761, size: 1216, offset: 73856)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 1216, elements: !762)
!762 = !{!187}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !211, file: !12, line: 351, baseType: !126, size: 32, offset: 75072)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !211, file: !12, line: 352, baseType: !761, size: 1216, offset: 75136)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !211, file: !12, line: 353, baseType: !311, size: 64, offset: 76352)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !211, file: !12, line: 365, baseType: !767, size: 10624, offset: 76416)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !12, line: 358, size: 10624, elements: !768)
!768 = !{!769, !770, !773, !776}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !767, file: !12, line: 360, baseType: !137, size: 256, align: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !767, file: !12, line: 361, baseType: !771, size: 128, align: 128, offset: 256)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, elements: !772)
!772 = !{!181, !171}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !767, file: !12, line: 363, baseType: !774, size: 4096, align: 128, offset: 384)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 4096, elements: !775)
!775 = !{!171, !265}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !767, file: !12, line: 364, baseType: !777, size: 6144, align: 128, offset: 4480)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 6144, elements: !778)
!778 = !{!779, !139}
!779 = !DISubrange(count: 24)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !211, file: !12, line: 544, baseType: !781, size: 80128, offset: 87040)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !12, line: 368, size: 80128, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !809, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !823, !827, !828, !829, !830, !831, !835, !836, !837, !840, !842, !843, !844, !846, !847, !848, !849, !850, !851, !852, !853, !894, !914, !915, !916, !917, !918, !919, !920, !921, !922, !925, !928, !930}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !781, file: !12, line: 370, baseType: !126, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !781, file: !12, line: 373, baseType: !126, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !781, file: !12, line: 374, baseType: !126, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !781, file: !12, line: 375, baseType: !126, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !781, file: !12, line: 378, baseType: !126, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !781, file: !12, line: 379, baseType: !126, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !781, file: !12, line: 380, baseType: !126, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !781, file: !12, line: 381, baseType: !126, size: 32, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !781, file: !12, line: 382, baseType: !126, size: 32, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !781, file: !12, line: 385, baseType: !126, size: 32, offset: 288)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !781, file: !12, line: 386, baseType: !126, size: 32, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !781, file: !12, line: 387, baseType: !126, size: 32, offset: 352)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !781, file: !12, line: 388, baseType: !126, size: 32, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !781, file: !12, line: 389, baseType: !126, size: 32, offset: 416)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !781, file: !12, line: 390, baseType: !126, size: 32, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !781, file: !12, line: 391, baseType: !126, size: 32, offset: 480)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !781, file: !12, line: 393, baseType: !126, size: 32, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !781, file: !12, line: 396, baseType: !311, size: 64, offset: 544)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !781, file: !12, line: 397, baseType: !311, size: 64, offset: 608)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !781, file: !12, line: 400, baseType: !311, size: 64, offset: 672)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !781, file: !12, line: 401, baseType: !311, size: 64, offset: 736)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !781, file: !12, line: 403, baseType: !311, size: 64, offset: 800)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !781, file: !12, line: 404, baseType: !311, size: 64, offset: 864)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !781, file: !12, line: 407, baseType: !13, size: 32, offset: 928)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !781, file: !12, line: 408, baseType: !808, size: 128, offset: 960)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, elements: !170)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !781, file: !12, line: 409, baseType: !810, size: 512, offset: 1088)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, elements: !138)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !781, file: !12, line: 410, baseType: !126, size: 32, offset: 1600)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !781, file: !12, line: 411, baseType: !126, size: 32, offset: 1632)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !781, file: !12, line: 412, baseType: !126, size: 32, offset: 1664)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !781, file: !12, line: 413, baseType: !126, size: 32, offset: 1696)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !781, file: !12, line: 414, baseType: !126, size: 32, offset: 1728)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !781, file: !12, line: 415, baseType: !126, size: 32, offset: 1760)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !781, file: !12, line: 422, baseType: !642, size: 64, offset: 1792)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !781, file: !12, line: 423, baseType: !642, size: 64, offset: 1856)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !781, file: !12, line: 424, baseType: !127, size: 64, offset: 1920)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !781, file: !12, line: 425, baseType: !821, size: 64, offset: 1984)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 64, elements: !381)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !781, file: !12, line: 427, baseType: !824, size: 64, offset: 2048)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 192, elements: !826)
!826 = !{!779}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !781, file: !12, line: 428, baseType: !642, size: 64, offset: 2112)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !781, file: !12, line: 429, baseType: !647, size: 128, offset: 2176)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !781, file: !12, line: 430, baseType: !647, size: 128, offset: 2304)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !781, file: !12, line: 431, baseType: !656, size: 128, offset: 2432)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !781, file: !12, line: 432, baseType: !832, size: 4096, offset: 2560)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 4096, elements: !833)
!833 = !{!181, !834}
!834 = !DISubrange(count: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !781, file: !12, line: 433, baseType: !642, size: 64, offset: 6656)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !781, file: !12, line: 434, baseType: !642, size: 64, offset: 6720)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !781, file: !12, line: 435, baseType: !838, size: 384, offset: 6784)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 384, elements: !839)
!839 = !{!181, !194}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !781, file: !12, line: 436, baseType: !841, size: 64, offset: 7168)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !781, file: !12, line: 439, baseType: !126, size: 32, offset: 7232)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !781, file: !12, line: 440, baseType: !126, size: 32, offset: 7264)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !781, file: !12, line: 441, baseType: !845, size: 128, offset: 7296)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !170)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !781, file: !12, line: 442, baseType: !126, size: 32, offset: 7424)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !781, file: !12, line: 444, baseType: !126, size: 32, offset: 7456)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !781, file: !12, line: 445, baseType: !126, size: 32, offset: 7488)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !781, file: !12, line: 447, baseType: !126, size: 32, offset: 7520)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !781, file: !12, line: 448, baseType: !126, size: 32, offset: 7552)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !781, file: !12, line: 454, baseType: !126, size: 32, offset: 7584)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !781, file: !12, line: 457, baseType: !126, size: 32, offset: 7616)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !781, file: !12, line: 498, baseType: !854, size: 57344, offset: 7680)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !781, file: !12, line: 459, size: 57344, elements: !855)
!855 = !{!856, !860, !864, !866, !867, !870, !874, !875, !878, !879, !880, !883, !884, !885, !886, !887, !888, !891, !893}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !854, file: !12, line: 464, baseType: !857, size: 3072, align: 128)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 3072, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !854, file: !12, line: 465, baseType: !861, size: 6912, align: 128, offset: 3072)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 6912, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 864)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !854, file: !12, line: 468, baseType: !865, size: 2048, align: 128, offset: 9984)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 2048, elements: !154)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !854, file: !12, line: 469, baseType: !865, size: 2048, align: 128, offset: 12032)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !854, file: !12, line: 470, baseType: !868, size: 3072, align: 128, offset: 14080)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 3072, elements: !869)
!869 = !{!194, !265}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !854, file: !12, line: 471, baseType: !871, size: 3840, align: 128, offset: 17152)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 3840, elements: !872)
!872 = !{!873, !139}
!873 = !DISubrange(count: 15)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !854, file: !12, line: 474, baseType: !774, size: 4096, align: 128, offset: 20992)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !854, file: !12, line: 475, baseType: !876, size: 4096, align: 128, offset: 25088)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 4096, elements: !877)
!877 = !{!139, !139}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !854, file: !12, line: 478, baseType: !509, size: 512, offset: 29184)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !854, file: !12, line: 479, baseType: !126, size: 32, offset: 29696)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !854, file: !12, line: 480, baseType: !881, size: 128, offset: 29728)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !882)
!882 = !{!181, !181}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !854, file: !12, line: 481, baseType: !126, size: 32, offset: 29856)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !854, file: !12, line: 484, baseType: !633, size: 192, offset: 29888)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !854, file: !12, line: 486, baseType: !633, size: 192, offset: 30080)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !854, file: !12, line: 489, baseType: !633, size: 192, offset: 30272)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !854, file: !12, line: 492, baseType: !311, size: 64, offset: 30464)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !854, file: !12, line: 493, baseType: !889, size: 24576, offset: 30528)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 24576, elements: !890)
!890 = !{!181, !834, !502}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !854, file: !12, line: 494, baseType: !892, size: 2048, offset: 55104)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 2048, elements: !576)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !854, file: !12, line: 497, baseType: !625, size: 96, offset: 57152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !781, file: !12, line: 526, baseType: !895, size: 12032, offset: 65024)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !781, file: !12, line: 501, size: 12032, elements: !896)
!896 = !{!897, !899, !901, !904, !907, !908, !909, !910, !911, !912, !913}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !895, file: !12, line: 504, baseType: !898, size: 384)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 384, elements: !199)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !895, file: !12, line: 507, baseType: !900, size: 384, offset: 384)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 384, elements: !199)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !895, file: !12, line: 510, baseType: !902, size: 768, align: 32, offset: 768)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 768, elements: !903)
!903 = !{!181, !200}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !895, file: !12, line: 513, baseType: !905, size: 3072, align: 128, offset: 1536)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 3072, elements: !906)
!906 = !{!181, !200, !181}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !895, file: !12, line: 514, baseType: !905, size: 3072, align: 64, offset: 4608)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !895, file: !12, line: 517, baseType: !898, size: 384, align: 32, offset: 7680)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !895, file: !12, line: 519, baseType: !905, size: 3072, align: 128, offset: 8064)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !895, file: !12, line: 520, baseType: !902, size: 768, align: 32, offset: 11136)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !895, file: !12, line: 521, baseType: !649, size: 32, align: 32, offset: 11904)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !895, file: !12, line: 524, baseType: !126, size: 32, offset: 11936)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !895, file: !12, line: 525, baseType: !126, size: 32, offset: 11968)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !781, file: !12, line: 529, baseType: !126, size: 32, offset: 77056)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !781, file: !12, line: 530, baseType: !126, size: 32, offset: 77088)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !781, file: !12, line: 531, baseType: !126, size: 32, offset: 77120)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !781, file: !12, line: 532, baseType: !126, size: 32, offset: 77152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !781, file: !12, line: 533, baseType: !126, size: 32, offset: 77184)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !781, file: !12, line: 534, baseType: !126, size: 32, offset: 77216)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !781, file: !12, line: 535, baseType: !126, size: 32, offset: 77248)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !781, file: !12, line: 536, baseType: !126, size: 32, offset: 77280)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !781, file: !12, line: 539, baseType: !923, size: 512, offset: 77312)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !924)
!924 = !{!139, !181}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !781, file: !12, line: 540, baseType: !926, size: 2048, offset: 77824)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !927)
!927 = !{!834, !171}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !781, file: !12, line: 542, baseType: !929, size: 16, offset: 79872)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 16, elements: !312)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !781, file: !12, line: 543, baseType: !931, size: 128, offset: 79888)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 128, elements: !138)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !211, file: !12, line: 547, baseType: !933, size: 64, offset: 167168)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !12, line: 248, baseType: !935)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !12, line: 248, flags: DIFlagFwdDecl)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !211, file: !12, line: 604, baseType: !937, size: 23936, offset: 167232)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !211, file: !12, line: 550, size: 23936, elements: !938)
!938 = !{!939, !964, !968, !970, !972, !973, !974, !975, !976, !977, !978, !979, !982, !984, !986, !989, !990}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !937, file: !12, line: 579, baseType: !940, size: 3904)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !937, file: !12, line: 553, size: 3904, elements: !941)
!941 = !{!942, !943, !944, !945, !947, !948, !949, !950, !951, !953, !956, !957, !958, !959, !960, !962}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !940, file: !12, line: 556, baseType: !126, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !940, file: !12, line: 558, baseType: !126, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !940, file: !12, line: 560, baseType: !126, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !940, file: !12, line: 562, baseType: !946, size: 608, offset: 96)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 608, elements: !762)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !940, file: !12, line: 563, baseType: !126, size: 32, offset: 704)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !940, file: !12, line: 564, baseType: !126, size: 32, offset: 736)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !940, file: !12, line: 565, baseType: !126, size: 32, offset: 768)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !940, file: !12, line: 566, baseType: !311, size: 64, offset: 800)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !940, file: !12, line: 567, baseType: !952, size: 2048, offset: 864)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !833)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !940, file: !12, line: 568, baseType: !954, size: 544, offset: 2912)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 544, elements: !955)
!955 = !{!182}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !940, file: !12, line: 571, baseType: !126, size: 32, offset: 3456)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !940, file: !12, line: 572, baseType: !126, size: 32, offset: 3488)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !940, file: !12, line: 573, baseType: !126, size: 32, offset: 3520)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !940, file: !12, line: 575, baseType: !311, size: 64, offset: 3552)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !940, file: !12, line: 577, baseType: !961, size: 192, offset: 3648)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 192, elements: !626)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !940, file: !12, line: 578, baseType: !963, size: 64, offset: 3840)
!963 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !937, file: !12, line: 584, baseType: !965, size: 160, offset: 3904)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 160, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 5)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !937, file: !12, line: 585, baseType: !969, size: 320, offset: 4096)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 320, elements: !966)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !937, file: !12, line: 586, baseType: !971, size: 320, offset: 4416)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 320, elements: !966)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !937, file: !12, line: 587, baseType: !954, size: 544, offset: 4736)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !937, file: !12, line: 589, baseType: !969, size: 320, offset: 5312)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !937, file: !12, line: 590, baseType: !971, size: 320, offset: 5632)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !937, file: !12, line: 591, baseType: !971, size: 320, offset: 5952)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !937, file: !12, line: 592, baseType: !971, size: 320, offset: 6272)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !937, file: !12, line: 593, baseType: !971, size: 320, offset: 6592)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !937, file: !12, line: 594, baseType: !971, size: 320, offset: 6912)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !937, file: !12, line: 596, baseType: !980, size: 6080, offset: 7232)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 6080, elements: !981)
!981 = !{!967, !187}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !937, file: !12, line: 597, baseType: !983, size: 2176, offset: 13312)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 2176, elements: !180)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !937, file: !12, line: 598, baseType: !985, size: 128, offset: 15488)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 128, elements: !312)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !937, file: !12, line: 599, baseType: !987, size: 8192, offset: 15616)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 8192, elements: !988)
!988 = !{!181, !181, !834}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !937, file: !12, line: 601, baseType: !311, size: 64, offset: 23808)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_frames", scope: !937, file: !12, line: 602, baseType: !311, size: 64, offset: 23872)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "predict_16x16", scope: !211, file: !12, line: 607, baseType: !992, size: 448, offset: 191168)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 448, elements: !163)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict_t", file: !85, line: 27, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !380}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8c", scope: !211, file: !12, line: 608, baseType: !992, size: 448, offset: 191616)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8", scope: !211, file: !12, line: 609, baseType: !999, size: 768, offset: 192064)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 768, elements: !1004)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict8x8_t", file: !85, line: 28, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
