; ModuleID = 'encoder/encoder.c'
source_filename = "encoder/encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_cpu_name_t = type { [16 x i8], i32 }
%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, i32, i32, float, float, float, i32, float, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }

!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 753, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 7)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 758, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 4)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !2, line: 761, type: !144, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !2, line: 762, type: !149, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !2, line: 790, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 2)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !2, line: 795, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 25)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(scope: null, file: !2, line: 801, type: !163, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 802, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 9)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 803, type: !137, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !2, line: 804, type: !137, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !2, line: 805, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 22)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1641, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 90)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1886, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 43)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1886, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 18)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1886, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 272, elements: !201)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!201 = !{!202}
!202 = !DISubrange(count: 34)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "slice_order", scope: !205, file: !2, line: 1894, type: !1352, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "x264_encoder_close", scope: !2, file: !2, line: 1870, type: !206, scopeLine: 1871, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1277)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !29, line: 42, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !48, line: 250, size: 206080, elements: !211)
!211 = !{!212, !354, !358, !362, !363, !364, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !473, !475, !503, !505, !506, !511, !516, !520, !524, !531, !535, !536, !537, !538, !541, !543, !545, !585, !602, !763, !764, !765, !766, !770, !771, !772, !773, !787, !939, !943, !994, !1001, !1002, !1010, !1012, !1082, !1142, !1194, !1215, !1257}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !210, file: !48, line: 253, baseType: !213, size: 4928)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !29, line: 295, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !29, line: 151, size: 4928, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !256, !260, !261, !262, !263, !267, !268, !281, !282, !283, !284, !285, !312, !351, !352, !353}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !214, file: !29, line: 154, baseType: !18, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !214, file: !29, line: 155, baseType: !115, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !214, file: !29, line: 156, baseType: !115, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !214, file: !29, line: 159, baseType: !115, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !214, file: !29, line: 160, baseType: !115, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !214, file: !29, line: 161, baseType: !115, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !214, file: !29, line: 162, baseType: !115, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !214, file: !29, line: 163, baseType: !115, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !214, file: !29, line: 180, baseType: !225, size: 288, offset: 256)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !29, line: 165, size: 288, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !225, file: !29, line: 168, baseType: !115, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !225, file: !29, line: 169, baseType: !115, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !225, file: !29, line: 171, baseType: !115, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !225, file: !29, line: 174, baseType: !115, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !225, file: !29, line: 175, baseType: !115, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !225, file: !29, line: 176, baseType: !115, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !225, file: !29, line: 177, baseType: !115, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !225, file: !29, line: 178, baseType: !115, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !225, file: !29, line: 179, baseType: !115, size: 32, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !214, file: !29, line: 182, baseType: !115, size: 32, offset: 544)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !214, file: !29, line: 183, baseType: !115, size: 32, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !214, file: !29, line: 186, baseType: !115, size: 32, offset: 608)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !214, file: !29, line: 187, baseType: !115, size: 32, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !214, file: !29, line: 188, baseType: !115, size: 32, offset: 672)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !214, file: !29, line: 189, baseType: !115, size: 32, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !214, file: !29, line: 190, baseType: !115, size: 32, offset: 736)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !214, file: !29, line: 191, baseType: !115, size: 32, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !214, file: !29, line: 192, baseType: !115, size: 32, offset: 800)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !214, file: !29, line: 193, baseType: !115, size: 32, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !214, file: !29, line: 194, baseType: !115, size: 32, offset: 864)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !214, file: !29, line: 196, baseType: !115, size: 32, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !214, file: !29, line: 197, baseType: !115, size: 32, offset: 928)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !214, file: !29, line: 198, baseType: !115, size: 32, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !214, file: !29, line: 200, baseType: !115, size: 32, offset: 992)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !214, file: !29, line: 201, baseType: !115, size: 32, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !214, file: !29, line: 203, baseType: !115, size: 32, offset: 1056)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !214, file: !29, line: 205, baseType: !115, size: 32, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !214, file: !29, line: 206, baseType: !255, size: 64, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !214, file: !29, line: 207, baseType: !257, size: 128, offset: 1216)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !214, file: !29, line: 208, baseType: !257, size: 128, offset: 1344)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !214, file: !29, line: 209, baseType: !257, size: 128, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !214, file: !29, line: 210, baseType: !257, size: 128, offset: 1600)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !214, file: !29, line: 211, baseType: !264, size: 512, offset: 1728)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 512, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !214, file: !29, line: 212, baseType: !264, size: 512, offset: 2240)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !214, file: !29, line: 215, baseType: !269, size: 64, offset: 2752)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !112, !115, !272, !273}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !275)
!275 = !{!276, !278, !279, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !274, file: !277, baseType: !18, size: 32)
!277 = !DIFile(filename: "encoder/encoder.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !274, file: !277, baseType: !18, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !274, file: !277, baseType: !112, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !274, file: !277, baseType: !112, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !214, file: !29, line: 216, baseType: !112, size: 64, offset: 2816)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !214, file: !29, line: 217, baseType: !115, size: 32, offset: 2880)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !214, file: !29, line: 218, baseType: !115, size: 32, offset: 2912)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !214, file: !29, line: 219, baseType: !255, size: 64, offset: 2944)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !214, file: !29, line: 252, baseType: !286, size: 768, offset: 3008)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !29, line: 222, size: 768, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !310, !311}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !286, file: !29, line: 224, baseType: !18, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !286, file: !29, line: 225, baseType: !18, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !286, file: !29, line: 227, baseType: !115, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !286, file: !29, line: 228, baseType: !115, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !286, file: !29, line: 229, baseType: !115, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !286, file: !29, line: 230, baseType: !115, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !286, file: !29, line: 231, baseType: !115, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !286, file: !29, line: 233, baseType: !115, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !286, file: !29, line: 234, baseType: !115, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !286, file: !29, line: 235, baseType: !115, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !286, file: !29, line: 236, baseType: !115, size: 32, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !286, file: !29, line: 237, baseType: !115, size: 32, offset: 352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !286, file: !29, line: 238, baseType: !115, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !286, file: !29, line: 239, baseType: !115, size: 32, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !286, file: !29, line: 240, baseType: !115, size: 32, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !286, file: !29, line: 241, baseType: !115, size: 32, offset: 480)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !286, file: !29, line: 242, baseType: !115, size: 32, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !286, file: !29, line: 243, baseType: !115, size: 32, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !286, file: !29, line: 244, baseType: !114, size: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !286, file: !29, line: 245, baseType: !114, size: 32, offset: 608)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !286, file: !29, line: 248, baseType: !309, size: 64, offset: 640)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 64, elements: !159)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !286, file: !29, line: 250, baseType: !115, size: 32, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !286, file: !29, line: 251, baseType: !115, size: 32, offset: 736)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !214, file: !29, line: 289, baseType: !313, size: 1024, offset: 3776)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !29, line: 255, size: 1024, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !349, !350}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !313, file: !29, line: 257, baseType: !115, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !313, file: !29, line: 259, baseType: !115, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !313, file: !29, line: 260, baseType: !115, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !313, file: !29, line: 261, baseType: !115, size: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !313, file: !29, line: 262, baseType: !115, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !313, file: !29, line: 264, baseType: !115, size: 32, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !313, file: !29, line: 265, baseType: !114, size: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !313, file: !29, line: 266, baseType: !114, size: 32, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !313, file: !29, line: 267, baseType: !115, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !313, file: !29, line: 268, baseType: !115, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !313, file: !29, line: 269, baseType: !114, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !313, file: !29, line: 270, baseType: !114, size: 32, offset: 352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !313, file: !29, line: 271, baseType: !114, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !313, file: !29, line: 273, baseType: !115, size: 32, offset: 416)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !313, file: !29, line: 274, baseType: !114, size: 32, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !313, file: !29, line: 277, baseType: !115, size: 32, offset: 480)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !313, file: !29, line: 278, baseType: !255, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !313, file: !29, line: 279, baseType: !115, size: 32, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !313, file: !29, line: 280, baseType: !255, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !313, file: !29, line: 283, baseType: !114, size: 32, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !313, file: !29, line: 284, baseType: !114, size: 32, offset: 736)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !313, file: !29, line: 285, baseType: !114, size: 32, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !313, file: !29, line: 286, baseType: !338, size: 64, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !29, line: 149, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 142, size: 256, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !340, file: !29, line: 144, baseType: !115, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !340, file: !29, line: 144, baseType: !115, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !340, file: !29, line: 145, baseType: !115, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !340, file: !29, line: 146, baseType: !115, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !340, file: !29, line: 147, baseType: !114, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !340, file: !29, line: 148, baseType: !348, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !313, file: !29, line: 287, baseType: !115, size: 32, offset: 896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !313, file: !29, line: 288, baseType: !255, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !214, file: !29, line: 292, baseType: !115, size: 32, offset: 4800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !214, file: !29, line: 293, baseType: !115, size: 32, offset: 4832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !214, file: !29, line: 294, baseType: !115, size: 32, offset: 4864)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !210, file: !48, line: 255, baseType: !355, size: 8192, offset: 4928)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 8192, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !210, file: !48, line: 256, baseType: !359, size: 64, offset: 13120)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !360, line: 27, baseType: !361)
!360 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!361 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !210, file: !48, line: 257, baseType: !115, size: 32, offset: 13184)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !210, file: !48, line: 258, baseType: !115, size: 32, offset: 13216)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !210, file: !48, line: 269, baseType: !365, size: 2112, offset: 13248)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !48, line: 261, size: 2112, elements: !366)
!366 = !{!367, !368, !379, !380, !381, !392}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !365, file: !48, line: 263, baseType: !115, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !365, file: !48, line: 264, baseType: !369, size: 1536, offset: 64)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 1536, elements: !377)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !29, line: 399, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 391, size: 192, elements: !372)
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !371, file: !29, line: 393, baseType: !115, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !371, file: !29, line: 394, baseType: !115, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !371, file: !29, line: 397, baseType: !115, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !371, file: !29, line: 398, baseType: !119, size: 64, offset: 128)
!377 = !{!378}
!378 = !DISubrange(count: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !365, file: !48, line: 265, baseType: !115, size: 32, offset: 1600)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !365, file: !48, line: 266, baseType: !119, size: 64, offset: 1664)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !365, file: !48, line: 267, baseType: !382, size: 320, offset: 1728)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !383, line: 49, baseType: !384)
!383 = !DIFile(filename: "./common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !383, line: 40, size: 320, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !384, file: !383, line: 42, baseType: !119, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !384, file: !383, line: 43, baseType: !119, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !384, file: !383, line: 44, baseType: !119, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !384, file: !383, line: 46, baseType: !116, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !384, file: !383, line: 47, baseType: !115, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !384, file: !383, line: 48, baseType: !115, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !365, file: !48, line: 268, baseType: !115, size: 32, offset: 2048)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !210, file: !48, line: 274, baseType: !115, size: 32, offset: 15360)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !210, file: !48, line: 276, baseType: !115, size: 32, offset: 15392)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !210, file: !48, line: 277, baseType: !115, size: 32, offset: 15424)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !210, file: !48, line: 278, baseType: !115, size: 32, offset: 15456)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !210, file: !48, line: 279, baseType: !115, size: 32, offset: 15488)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !210, file: !48, line: 280, baseType: !115, size: 32, offset: 15520)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !210, file: !48, line: 282, baseType: !115, size: 32, offset: 15552)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !210, file: !48, line: 283, baseType: !115, size: 32, offset: 15584)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !210, file: !48, line: 284, baseType: !115, size: 32, offset: 15616)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !210, file: !48, line: 287, baseType: !403, size: 9920, offset: 15648)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 9920, elements: !471)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !17, line: 133, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 52, size: 9920, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !424, !425, !426, !427, !428, !429, !430, !431, !432, !439, !440, !470}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !405, file: !17, line: 54, baseType: !115, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !405, file: !17, line: 56, baseType: !115, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !405, file: !17, line: 57, baseType: !115, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !405, file: !17, line: 59, baseType: !115, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !405, file: !17, line: 60, baseType: !115, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !405, file: !17, line: 61, baseType: !115, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !405, file: !17, line: 63, baseType: !115, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !405, file: !17, line: 65, baseType: !115, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !405, file: !17, line: 67, baseType: !115, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !405, file: !17, line: 69, baseType: !115, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !405, file: !17, line: 70, baseType: !115, size: 32, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !405, file: !17, line: 71, baseType: !115, size: 32, offset: 352)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !405, file: !17, line: 72, baseType: !115, size: 32, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !405, file: !17, line: 73, baseType: !421, size: 8192, offset: 416)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8192, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !405, file: !17, line: 75, baseType: !115, size: 32, offset: 8608)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !405, file: !17, line: 76, baseType: !115, size: 32, offset: 8640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !405, file: !17, line: 77, baseType: !115, size: 32, offset: 8672)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !405, file: !17, line: 78, baseType: !115, size: 32, offset: 8704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !405, file: !17, line: 79, baseType: !115, size: 32, offset: 8736)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !405, file: !17, line: 80, baseType: !115, size: 32, offset: 8768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !405, file: !17, line: 81, baseType: !115, size: 32, offset: 8800)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !405, file: !17, line: 83, baseType: !115, size: 32, offset: 8832)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !405, file: !17, line: 90, baseType: !433, size: 128, offset: 8864)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !405, file: !17, line: 84, size: 128, elements: !434)
!434 = !{!435, !436, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !433, file: !17, line: 86, baseType: !115, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !433, file: !17, line: 87, baseType: !115, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !433, file: !17, line: 88, baseType: !115, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !433, file: !17, line: 89, baseType: !115, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !405, file: !17, line: 92, baseType: !115, size: 32, offset: 8992)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !405, file: !17, line: 129, baseType: !441, size: 864, offset: 9024)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !405, file: !17, line: 93, size: 864, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !441, file: !17, line: 95, baseType: !115, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !441, file: !17, line: 96, baseType: !115, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !441, file: !17, line: 97, baseType: !115, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !441, file: !17, line: 99, baseType: !115, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !441, file: !17, line: 100, baseType: !115, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !441, file: !17, line: 102, baseType: !115, size: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !441, file: !17, line: 103, baseType: !115, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !441, file: !17, line: 104, baseType: !115, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !441, file: !17, line: 105, baseType: !115, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !441, file: !17, line: 106, baseType: !115, size: 32, offset: 288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !441, file: !17, line: 107, baseType: !115, size: 32, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !441, file: !17, line: 108, baseType: !115, size: 32, offset: 352)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !441, file: !17, line: 110, baseType: !115, size: 32, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !441, file: !17, line: 111, baseType: !115, size: 32, offset: 416)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !441, file: !17, line: 112, baseType: !115, size: 32, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !441, file: !17, line: 114, baseType: !115, size: 32, offset: 480)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !441, file: !17, line: 115, baseType: !115, size: 32, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !441, file: !17, line: 116, baseType: !115, size: 32, offset: 544)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !441, file: !17, line: 117, baseType: !115, size: 32, offset: 576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !441, file: !17, line: 119, baseType: !115, size: 32, offset: 608)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !441, file: !17, line: 120, baseType: !115, size: 32, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !441, file: !17, line: 121, baseType: !115, size: 32, offset: 672)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !441, file: !17, line: 122, baseType: !115, size: 32, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !441, file: !17, line: 123, baseType: !115, size: 32, offset: 736)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !441, file: !17, line: 124, baseType: !115, size: 32, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !441, file: !17, line: 125, baseType: !115, size: 32, offset: 800)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !441, file: !17, line: 126, baseType: !115, size: 32, offset: 832)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !405, file: !17, line: 131, baseType: !115, size: 32, offset: 9888)
!471 = !{!472}
!472 = !DISubrange(count: 1)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !210, file: !48, line: 288, baseType: !474, size: 64, offset: 25600)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !210, file: !48, line: 289, baseType: !476, size: 960, offset: 25664)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 960, elements: !471)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !17, line: 165, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 135, size: 960, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !478, file: !17, line: 137, baseType: !115, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !478, file: !17, line: 138, baseType: !115, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !478, file: !17, line: 140, baseType: !115, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !478, file: !17, line: 142, baseType: !115, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !478, file: !17, line: 143, baseType: !115, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !478, file: !17, line: 145, baseType: !115, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !478, file: !17, line: 146, baseType: !115, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !478, file: !17, line: 148, baseType: !115, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !478, file: !17, line: 149, baseType: !115, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !478, file: !17, line: 151, baseType: !115, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !478, file: !17, line: 152, baseType: !115, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !478, file: !17, line: 154, baseType: !115, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !478, file: !17, line: 156, baseType: !115, size: 32, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !478, file: !17, line: 157, baseType: !115, size: 32, offset: 416)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !478, file: !17, line: 158, baseType: !115, size: 32, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !478, file: !17, line: 160, baseType: !115, size: 32, offset: 480)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !478, file: !17, line: 162, baseType: !115, size: 32, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !478, file: !17, line: 163, baseType: !498, size: 384, offset: 576)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 384, elements: !501)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!501 = !{!502}
!502 = !DISubrange(count: 6)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !210, file: !48, line: 290, baseType: !504, size: 64, offset: 26624)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !210, file: !48, line: 291, baseType: !115, size: 32, offset: 26688)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !210, file: !48, line: 294, baseType: !507, size: 256, offset: 26752)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 256, elements: !150)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !510)
!510 = !{!151, !151}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !210, file: !48, line: 295, baseType: !512, size: 128, offset: 27008)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 128, elements: !159)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, elements: !515)
!515 = !{!378, !378}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !210, file: !48, line: 297, baseType: !517, size: 256, offset: 27136)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 256, elements: !150)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !258)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !210, file: !48, line: 298, baseType: !521, size: 128, offset: 27392)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 128, elements: !159)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, elements: !265)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !210, file: !48, line: 300, baseType: !525, size: 256, offset: 27520)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 256, elements: !150)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 256, elements: !258)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !121, line: 25, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !123, line: 40, baseType: !530)
!530 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !210, file: !48, line: 301, baseType: !532, size: 128, offset: 27776)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 128, elements: !159)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 1024, elements: !265)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !210, file: !48, line: 302, baseType: !525, size: 256, offset: 27904)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !210, file: !48, line: 303, baseType: !532, size: 128, offset: 28160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !210, file: !48, line: 305, baseType: !499, size: 64, offset: 28288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !210, file: !48, line: 307, baseType: !539, size: 4096, align: 128, offset: 28416)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 4096, elements: !540)
!540 = !{!160, !266}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !210, file: !48, line: 308, baseType: !542, size: 2048, align: 128, offset: 32512)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 2048, elements: !540)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !210, file: !48, line: 309, baseType: !544, size: 64, offset: 34560)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 64, elements: !159)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !210, file: !48, line: 312, baseType: !546, size: 3072, offset: 34624)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !48, line: 209, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 159, size: 3072, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !577, !578, !579, !580, !581, !582, !583, !584}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !547, file: !48, line: 161, baseType: !474, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !547, file: !48, line: 162, baseType: !504, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !547, file: !48, line: 164, baseType: !115, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !547, file: !48, line: 165, baseType: !115, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !547, file: !48, line: 166, baseType: !115, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !547, file: !48, line: 168, baseType: !115, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !547, file: !48, line: 170, baseType: !115, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !547, file: !48, line: 172, baseType: !115, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !547, file: !48, line: 173, baseType: !115, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !547, file: !48, line: 174, baseType: !115, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !547, file: !48, line: 176, baseType: !115, size: 32, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !547, file: !48, line: 178, baseType: !115, size: 32, offset: 416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !547, file: !48, line: 179, baseType: !115, size: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !547, file: !48, line: 181, baseType: !309, size: 64, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !547, file: !48, line: 182, baseType: !115, size: 32, offset: 544)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !547, file: !48, line: 184, baseType: !115, size: 32, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !547, file: !48, line: 186, baseType: !115, size: 32, offset: 608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !547, file: !48, line: 187, baseType: !115, size: 32, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !547, file: !48, line: 188, baseType: !115, size: 32, offset: 672)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !547, file: !48, line: 190, baseType: !115, size: 32, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !547, file: !48, line: 191, baseType: !115, size: 32, offset: 736)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !547, file: !48, line: 195, baseType: !571, size: 2048, offset: 768)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 2048, elements: !576)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !48, line: 192, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !572, file: !48, line: 193, baseType: !115, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !572, file: !48, line: 194, baseType: !115, size: 32, offset: 32)
!576 = !{!160, !259}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !547, file: !48, line: 197, baseType: !115, size: 32, offset: 2816)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !547, file: !48, line: 199, baseType: !115, size: 32, offset: 2848)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !547, file: !48, line: 200, baseType: !115, size: 32, offset: 2880)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !547, file: !48, line: 201, baseType: !115, size: 32, offset: 2912)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !547, file: !48, line: 202, baseType: !115, size: 32, offset: 2944)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !547, file: !48, line: 205, baseType: !115, size: 32, offset: 2976)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !547, file: !48, line: 206, baseType: !115, size: 32, offset: 3008)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !547, file: !48, line: 207, baseType: !115, size: 32, offset: 3040)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !210, file: !48, line: 315, baseType: !586, size: 4096, offset: 37760)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !587, line: 46, baseType: !588)
!587 = !DIFile(filename: "./common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !587, line: 27, size: 4096, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !588, file: !587, line: 30, baseType: !115, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !588, file: !587, line: 31, baseType: !115, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !588, file: !587, line: 34, baseType: !115, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !588, file: !587, line: 35, baseType: !115, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !588, file: !587, line: 37, baseType: !119, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !588, file: !587, line: 38, baseType: !119, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !588, file: !587, line: 39, baseType: !119, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !588, file: !587, line: 42, baseType: !115, size: 32, align: 128, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !588, file: !587, line: 45, baseType: !599, size: 3680, offset: 416)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 3680, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 460)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !210, file: !48, line: 340, baseType: !603, size: 31808, offset: 41856)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !48, line: 317, size: 31808, elements: !604)
!604 = !{!605, !748, !749, !753, !754, !756, !757, !758, !759, !760, !761, !762}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !603, file: !48, line: 320, baseType: !606, size: 4288)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 4288, elements: !746)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !609, line: 94, baseType: !610)
!609 = !DIFile(filename: "./common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !609, line: 31, size: 51648, elements: !611)
!611 = !{!612, !613, !614, !615, !619, !620, !621, !622, !623, !624, !625, !629, !630, !631, !632, !633, !634, !636, !638, !639, !641, !642, !643, !648, !655, !658, !661, !663, !664, !666, !667, !670, !671, !672, !674, !676, !677, !678, !679, !681, !682, !683, !684, !685, !686, !714}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !610, file: !609, line: 34, baseType: !115, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !610, file: !609, line: 35, baseType: !115, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !610, file: !609, line: 36, baseType: !115, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !610, file: !609, line: 37, baseType: !616, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !617, line: 27, baseType: !618)
!617 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !123, line: 44, baseType: !118)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !610, file: !609, line: 38, baseType: !115, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !610, file: !609, line: 39, baseType: !115, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !610, file: !609, line: 40, baseType: !115, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !610, file: !609, line: 41, baseType: !114, size: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !610, file: !609, line: 42, baseType: !114, size: 32, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !610, file: !609, line: 45, baseType: !115, size: 32, offset: 352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !610, file: !609, line: 46, baseType: !626, size: 96, offset: 384)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 96, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 3)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !610, file: !609, line: 47, baseType: !626, size: 96, offset: 480)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !610, file: !609, line: 48, baseType: !626, size: 96, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !610, file: !609, line: 49, baseType: !115, size: 32, offset: 672)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !610, file: !609, line: 50, baseType: !115, size: 32, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !610, file: !609, line: 51, baseType: !115, size: 32, offset: 736)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !610, file: !609, line: 52, baseType: !635, size: 192, offset: 768)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 192, elements: !627)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !610, file: !609, line: 53, baseType: !637, size: 256, offset: 960)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 256, elements: !150)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !610, file: !609, line: 54, baseType: !637, size: 256, offset: 1216)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !610, file: !609, line: 55, baseType: !640, size: 64, offset: 1472)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !610, file: !609, line: 59, baseType: !637, size: 256, offset: 1536)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !610, file: !609, line: 60, baseType: !637, size: 256, offset: 1792)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !610, file: !609, line: 63, baseType: !644, size: 64, offset: 2048)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !617, line: 24, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !123, line: 37, baseType: !647)
!647 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !610, file: !609, line: 64, baseType: !649, size: 128, offset: 2112)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 128, elements: !159)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 32, elements: !159)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !617, line: 25, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !123, line: 39, baseType: !654)
!654 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !610, file: !609, line: 65, baseType: !656, size: 2176, offset: 2240)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 2176, elements: !657)
!657 = !{!160, !11}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !610, file: !609, line: 66, baseType: !659, size: 2176, offset: 4416)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 2176, elements: !657)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !610, file: !609, line: 67, baseType: !662, size: 128, offset: 6592)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 128, elements: !159)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !610, file: !609, line: 68, baseType: !309, size: 64, offset: 6720)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !610, file: !609, line: 69, baseType: !665, size: 1024, offset: 6784)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 1024, elements: !576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !610, file: !609, line: 70, baseType: !519, size: 512, offset: 7808)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !610, file: !609, line: 75, baseType: !668, size: 10368, offset: 8320)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 10368, elements: !669)
!669 = !{!196, !196}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !610, file: !609, line: 76, baseType: !668, size: 10368, offset: 18688)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !610, file: !609, line: 77, baseType: !115, size: 32, offset: 29056)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !610, file: !609, line: 78, baseType: !673, size: 576, offset: 29088)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 576, elements: !195)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !610, file: !609, line: 79, baseType: !675, size: 20736, offset: 29696)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 20736, elements: !669)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !610, file: !609, line: 80, baseType: !660, size: 64, offset: 50432)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !610, file: !609, line: 81, baseType: !660, size: 64, offset: 50496)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !610, file: !609, line: 82, baseType: !660, size: 64, offset: 50560)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !610, file: !609, line: 83, baseType: !680, size: 64, offset: 50624)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !610, file: !609, line: 84, baseType: !115, size: 32, offset: 50688)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !610, file: !609, line: 85, baseType: !640, size: 64, offset: 50752)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !610, file: !609, line: 86, baseType: !640, size: 64, offset: 50816)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !610, file: !609, line: 89, baseType: !115, size: 32, offset: 50880)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !610, file: !609, line: 90, baseType: !115, size: 32, offset: 50912)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !610, file: !609, line: 91, baseType: !687, size: 320, offset: 50944)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !360, line: 72, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !360, line: 67, size: 320, elements: !689)
!689 = !{!690, !709, !713}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !688, file: !360, line: 69, baseType: !691, size: 320)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !692, line: 22, size: 320, elements: !693)
!692 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !691, file: !692, line: 24, baseType: !115, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !691, file: !692, line: 25, baseType: !18, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !691, file: !692, line: 26, baseType: !115, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !691, file: !692, line: 28, baseType: !18, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !691, file: !692, line: 32, baseType: !115, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !691, file: !692, line: 34, baseType: !654, size: 16, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !691, file: !692, line: 35, baseType: !654, size: 16, offset: 176)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !691, file: !692, line: 36, baseType: !702, size: 128, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !703, line: 55, baseType: !704)
!703 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !703, line: 51, size: 128, elements: !705)
!705 = !{!706, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !704, file: !703, line: 53, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !704, file: !703, line: 54, baseType: !707, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !688, file: !360, line: 70, baseType: !710, size: 320)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 40)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !688, file: !360, line: 71, baseType: !118, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !610, file: !609, line: 92, baseType: !715, size: 384, offset: 51264)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !360, line: 80, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !360, line: 75, size: 384, elements: !717)
!717 = !{!718, !740, !744}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !716, file: !360, line: 77, baseType: !719, size: 384)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !703, line: 94, size: 384, elements: !720)
!720 = !{!721, !733, !734, !736, !737, !738, !739}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !719, file: !703, line: 96, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !723, line: 33, baseType: !724)
!723 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !723, line: 25, size: 64, elements: !725)
!725 = !{!726, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !724, file: !723, line: 27, baseType: !727, size: 64)
!727 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !724, file: !723, line: 32, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !723, line: 28, size: 64, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !729, file: !723, line: 30, baseType: !18, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !729, file: !723, line: 31, baseType: !18, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !719, file: !703, line: 97, baseType: !722, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !719, file: !703, line: 98, baseType: !735, size: 64, offset: 128)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !159)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !719, file: !703, line: 99, baseType: !735, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !719, file: !703, line: 100, baseType: !18, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !719, file: !703, line: 101, baseType: !18, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !719, file: !703, line: 102, baseType: !735, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !716, file: !360, line: 78, baseType: !741, size: 384)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 48)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !716, file: !360, line: 79, baseType: !745, size: 64)
!745 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!746 = !{!747}
!747 = !DISubrange(count: 67)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !603, file: !48, line: 322, baseType: !606, size: 4288, offset: 4288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !603, file: !48, line: 324, baseType: !750, size: 21760, offset: 8576)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 21760, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 340)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !603, file: !48, line: 326, baseType: !607, size: 64, offset: 30336)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !603, file: !48, line: 329, baseType: !755, size: 1152, offset: 30400)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 1152, elements: !195)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !603, file: !48, line: 331, baseType: !115, size: 32, offset: 31552)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !603, file: !48, line: 333, baseType: !115, size: 32, offset: 31584)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !603, file: !48, line: 335, baseType: !115, size: 32, offset: 31616)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !603, file: !48, line: 336, baseType: !115, size: 32, offset: 31648)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !603, file: !48, line: 337, baseType: !115, size: 32, offset: 31680)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !603, file: !48, line: 338, baseType: !115, size: 32, offset: 31712)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !603, file: !48, line: 339, baseType: !115, size: 32, offset: 31744)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !210, file: !48, line: 343, baseType: !607, size: 64, offset: 73664)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !210, file: !48, line: 346, baseType: !607, size: 64, offset: 73728)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !210, file: !48, line: 349, baseType: !115, size: 32, offset: 73792)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !210, file: !48, line: 350, baseType: !767, size: 1216, offset: 73856)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 1216, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 19)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !210, file: !48, line: 351, baseType: !115, size: 32, offset: 75072)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !210, file: !48, line: 352, baseType: !767, size: 1216, offset: 75136)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !210, file: !48, line: 353, baseType: !309, size: 64, offset: 76352)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !210, file: !48, line: 365, baseType: !774, size: 10624, offset: 76416)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !48, line: 358, size: 10624, elements: !775)
!775 = !{!776, !778, !781, !784}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !774, file: !48, line: 360, baseType: !777, size: 256, align: 128)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 256, elements: !258)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !774, file: !48, line: 361, baseType: !779, size: 128, align: 128, offset: 256)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 128, elements: !780)
!780 = !{!160, !151}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !774, file: !48, line: 363, baseType: !782, size: 4096, align: 128, offset: 384)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 4096, elements: !783)
!783 = !{!151, !266}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !774, file: !48, line: 364, baseType: !785, size: 6144, align: 128, offset: 4480)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 6144, elements: !786)
!786 = !{!134, !259}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !210, file: !48, line: 544, baseType: !788, size: 80128, offset: 87040)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !48, line: 368, size: 80128, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !816, !818, !819, !820, !821, !822, !823, !824, !825, !826, !828, !831, !834, !835, !836, !837, !838, !842, !843, !844, !847, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859, !860, !901, !921, !922, !923, !924, !925, !926, !927, !928, !929, !932, !935, !937}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !788, file: !48, line: 370, baseType: !115, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !788, file: !48, line: 373, baseType: !115, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !788, file: !48, line: 374, baseType: !115, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !788, file: !48, line: 375, baseType: !115, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !788, file: !48, line: 378, baseType: !115, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !788, file: !48, line: 379, baseType: !115, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !788, file: !48, line: 380, baseType: !115, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !788, file: !48, line: 381, baseType: !115, size: 32, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !788, file: !48, line: 382, baseType: !115, size: 32, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !788, file: !48, line: 385, baseType: !115, size: 32, offset: 288)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !788, file: !48, line: 386, baseType: !115, size: 32, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !788, file: !48, line: 387, baseType: !115, size: 32, offset: 352)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !788, file: !48, line: 388, baseType: !115, size: 32, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !788, file: !48, line: 389, baseType: !115, size: 32, offset: 416)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !788, file: !48, line: 390, baseType: !115, size: 32, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !788, file: !48, line: 391, baseType: !115, size: 32, offset: 480)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !788, file: !48, line: 393, baseType: !115, size: 32, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !788, file: !48, line: 396, baseType: !309, size: 64, offset: 544)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !788, file: !48, line: 397, baseType: !309, size: 64, offset: 608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !788, file: !48, line: 400, baseType: !309, size: 64, offset: 672)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !788, file: !48, line: 401, baseType: !309, size: 64, offset: 736)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !788, file: !48, line: 403, baseType: !309, size: 64, offset: 800)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !788, file: !48, line: 404, baseType: !309, size: 64, offset: 864)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !788, file: !48, line: 407, baseType: !18, size: 32, offset: 928)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !788, file: !48, line: 408, baseType: !815, size: 128, offset: 960)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !150)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !788, file: !48, line: 409, baseType: !817, size: 512, offset: 1088)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, elements: !258)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !788, file: !48, line: 410, baseType: !115, size: 32, offset: 1600)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !788, file: !48, line: 411, baseType: !115, size: 32, offset: 1632)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !788, file: !48, line: 412, baseType: !115, size: 32, offset: 1664)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !788, file: !48, line: 413, baseType: !115, size: 32, offset: 1696)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !788, file: !48, line: 414, baseType: !115, size: 32, offset: 1728)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !788, file: !48, line: 415, baseType: !115, size: 32, offset: 1760)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !788, file: !48, line: 422, baseType: !644, size: 64, offset: 1792)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !788, file: !48, line: 423, baseType: !644, size: 64, offset: 1856)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !788, file: !48, line: 424, baseType: !827, size: 64, offset: 1920)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !788, file: !48, line: 425, baseType: !829, size: 64, offset: 1984)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 64, elements: !377)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !788, file: !48, line: 427, baseType: !832, size: 64, offset: 2048)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 192, elements: !133)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !788, file: !48, line: 428, baseType: !644, size: 64, offset: 2112)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !788, file: !48, line: 429, baseType: !649, size: 128, offset: 2176)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !788, file: !48, line: 430, baseType: !649, size: 128, offset: 2304)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !788, file: !48, line: 431, baseType: !662, size: 128, offset: 2432)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !788, file: !48, line: 432, baseType: !839, size: 4096, offset: 2560)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 4096, elements: !840)
!840 = !{!160, !841}
!841 = !DISubrange(count: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !788, file: !48, line: 433, baseType: !644, size: 64, offset: 6656)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !788, file: !48, line: 434, baseType: !644, size: 64, offset: 6720)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !788, file: !48, line: 435, baseType: !845, size: 384, offset: 6784)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 384, elements: !846)
!846 = !{!160, !628}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !788, file: !48, line: 436, baseType: !848, size: 64, offset: 7168)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !788, file: !48, line: 439, baseType: !115, size: 32, offset: 7232)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !788, file: !48, line: 440, baseType: !115, size: 32, offset: 7264)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !788, file: !48, line: 441, baseType: !852, size: 128, offset: 7296)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !150)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !788, file: !48, line: 442, baseType: !115, size: 32, offset: 7424)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !788, file: !48, line: 444, baseType: !115, size: 32, offset: 7456)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !788, file: !48, line: 445, baseType: !115, size: 32, offset: 7488)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !788, file: !48, line: 447, baseType: !115, size: 32, offset: 7520)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !788, file: !48, line: 448, baseType: !115, size: 32, offset: 7552)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !788, file: !48, line: 454, baseType: !115, size: 32, offset: 7584)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !788, file: !48, line: 457, baseType: !115, size: 32, offset: 7616)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !788, file: !48, line: 498, baseType: !861, size: 57344, offset: 7680)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !788, file: !48, line: 459, size: 57344, elements: !862)
!862 = !{!863, !867, !871, !873, !874, !877, !881, !882, !885, !886, !887, !890, !891, !892, !893, !894, !895, !898, !900}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !861, file: !48, line: 464, baseType: !864, size: 3072, align: 128)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 3072, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !861, file: !48, line: 465, baseType: !868, size: 6912, align: 128, offset: 3072)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 6912, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 864)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !861, file: !48, line: 468, baseType: !872, size: 2048, align: 128, offset: 9984)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 2048, elements: !422)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !861, file: !48, line: 469, baseType: !872, size: 2048, align: 128, offset: 12032)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !861, file: !48, line: 470, baseType: !875, size: 3072, align: 128, offset: 14080)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 3072, elements: !876)
!876 = !{!628, !266}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !861, file: !48, line: 471, baseType: !878, size: 3840, align: 128, offset: 17152)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 3840, elements: !879)
!879 = !{!880, !259}
!880 = !DISubrange(count: 15)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !861, file: !48, line: 474, baseType: !782, size: 4096, align: 128, offset: 20992)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !861, file: !48, line: 475, baseType: !883, size: 4096, align: 128, offset: 25088)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 4096, elements: !884)
!884 = !{!259, !259}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !861, file: !48, line: 478, baseType: !509, size: 512, offset: 29184)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !861, file: !48, line: 479, baseType: !115, size: 32, offset: 29696)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !861, file: !48, line: 480, baseType: !888, size: 128, offset: 29728)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !889)
!889 = !{!160, !160}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !861, file: !48, line: 481, baseType: !115, size: 32, offset: 29856)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !861, file: !48, line: 484, baseType: !635, size: 192, offset: 29888)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !861, file: !48, line: 486, baseType: !635, size: 192, offset: 30080)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !861, file: !48, line: 489, baseType: !635, size: 192, offset: 30272)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !861, file: !48, line: 492, baseType: !309, size: 64, offset: 30464)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !861, file: !48, line: 493, baseType: !896, size: 24576, offset: 30528)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 24576, elements: !897)
!897 = !{!160, !841, !502}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !861, file: !48, line: 494, baseType: !899, size: 2048, offset: 55104)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 2048, elements: !576)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !861, file: !48, line: 497, baseType: !626, size: 96, offset: 57152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !788, file: !48, line: 526, baseType: !902, size: 12032, offset: 65024)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !788, file: !48, line: 501, size: 12032, elements: !903)
!903 = !{!904, !906, !908, !911, !914, !915, !916, !917, !918, !919, !920}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !902, file: !48, line: 504, baseType: !905, size: 384)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 384, elements: !742)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !902, file: !48, line: 507, baseType: !907, size: 384, offset: 384)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 384, elements: !742)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !902, file: !48, line: 510, baseType: !909, size: 768, align: 32, offset: 768)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 768, elements: !910)
!910 = !{!160, !743}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !902, file: !48, line: 513, baseType: !912, size: 3072, align: 128, offset: 1536)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 3072, elements: !913)
!913 = !{!160, !743, !160}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !902, file: !48, line: 514, baseType: !912, size: 3072, align: 64, offset: 4608)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !902, file: !48, line: 517, baseType: !905, size: 384, align: 32, offset: 7680)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !902, file: !48, line: 519, baseType: !912, size: 3072, align: 128, offset: 8064)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !902, file: !48, line: 520, baseType: !909, size: 768, align: 32, offset: 11136)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !902, file: !48, line: 521, baseType: !651, size: 32, align: 32, offset: 11904)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !902, file: !48, line: 524, baseType: !115, size: 32, offset: 11936)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !902, file: !48, line: 525, baseType: !115, size: 32, offset: 11968)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !788, file: !48, line: 529, baseType: !115, size: 32, offset: 77056)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !788, file: !48, line: 530, baseType: !115, size: 32, offset: 77088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !788, file: !48, line: 531, baseType: !115, size: 32, offset: 77120)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !788, file: !48, line: 532, baseType: !115, size: 32, offset: 77152)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !788, file: !48, line: 533, baseType: !115, size: 32, offset: 77184)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !788, file: !48, line: 534, baseType: !115, size: 32, offset: 77216)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !788, file: !48, line: 535, baseType: !115, size: 32, offset: 77248)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !788, file: !48, line: 536, baseType: !115, size: 32, offset: 77280)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !788, file: !48, line: 539, baseType: !930, size: 512, offset: 77312)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 512, elements: !931)
!931 = !{!259, !160}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !788, file: !48, line: 540, baseType: !933, size: 2048, offset: 77824)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 2048, elements: !934)
!934 = !{!841, !151}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !788, file: !48, line: 542, baseType: !936, size: 16, offset: 79872)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 16, elements: !159)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !788, file: !48, line: 543, baseType: !938, size: 128, offset: 79888)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 128, elements: !258)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !210, file: !48, line: 547, baseType: !940, size: 64, offset: 167168)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !48, line: 248, baseType: !942)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !48, line: 248, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !210, file: !48, line: 604, baseType: !944, size: 23936, offset: 167232)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !48, line: 550, size: 23936, elements: !945)
!945 = !{!946, !969, !971, !973, !975, !976, !977, !978, !979, !980, !981, !982, !985, !987, !989, !992, !993}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !944, file: !48, line: 579, baseType: !947, size: 3904)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !944, file: !48, line: 553, size: 3904, elements: !948)
!948 = !{!949, !950, !951, !952, !954, !955, !956, !957, !958, !960, !962, !963, !964, !965, !966, !968}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !947, file: !48, line: 556, baseType: !115, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !947, file: !48, line: 558, baseType: !115, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !947, file: !48, line: 560, baseType: !115, size: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !947, file: !48, line: 562, baseType: !953, size: 608, offset: 96)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 608, elements: !768)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !947, file: !48, line: 563, baseType: !115, size: 32, offset: 704)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !947, file: !48, line: 564, baseType: !115, size: 32, offset: 736)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !947, file: !48, line: 565, baseType: !115, size: 32, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !947, file: !48, line: 566, baseType: !309, size: 64, offset: 800)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !947, file: !48, line: 567, baseType: !959, size: 2048, offset: 864)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 2048, elements: !840)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !947, file: !48, line: 568, baseType: !961, size: 544, offset: 2912)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 544, elements: !10)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !947, file: !48, line: 571, baseType: !115, size: 32, offset: 3456)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !947, file: !48, line: 572, baseType: !115, size: 32, offset: 3488)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !947, file: !48, line: 573, baseType: !115, size: 32, offset: 3520)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !947, file: !48, line: 575, baseType: !309, size: 64, offset: 3552)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !947, file: !48, line: 577, baseType: !967, size: 192, offset: 3648)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 192, elements: !627)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !947, file: !48, line: 578, baseType: !113, size: 64, offset: 3840)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !944, file: !48, line: 584, baseType: !970, size: 160, offset: 3904)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 160, elements: !138)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !944, file: !48, line: 585, baseType: !972, size: 320, offset: 4096)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 320, elements: !138)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !944, file: !48, line: 586, baseType: !974, size: 320, offset: 4416)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 320, elements: !138)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !944, file: !48, line: 587, baseType: !961, size: 544, offset: 4736)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !944, file: !48, line: 589, baseType: !972, size: 320, offset: 5312)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !944, file: !48, line: 590, baseType: !974, size: 320, offset: 5632)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !944, file: !48, line: 591, baseType: !974, size: 320, offset: 5952)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !944, file: !48, line: 592, baseType: !974, size: 320, offset: 6272)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !944, file: !48, line: 593, baseType: !974, size: 320, offset: 6592)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !944, file: !48, line: 594, baseType: !974, size: 320, offset: 6912)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !944, file: !48, line: 596, baseType: !983, size: 6080, offset: 7232)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 6080, elements: !984)
!984 = !{!139, !769}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !944, file: !48, line: 597, baseType: !986, size: 2176, offset: 13312)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 2176, elements: !657)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !944, file: !48, line: 598, baseType: !988, size: 128, offset: 15488)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 128, elements: !159)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !944, file: !48, line: 599, baseType: !990, size: 8192, offset: 15616)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 8192, elements: !991)
!991 = !{!160, !160, !841}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !944, file: !48, line: 601, baseType: !309, size: 64, offset: 23808)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_frames", scope: !944, file: !48, line: 602, baseType: !309, size: 64, offset: 23872)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "predict_16x16", scope: !210, file: !48, line: 607, baseType: !995, size: 448, offset: 191168)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 448, elements: !145)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict_t", file: !997, line: 27, baseType: !998)
!997 = !DIFile(filename: "./common/predict.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "c7827bfe44f4a550b7080533457a8327")
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !119}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8c", scope: !210, file: !48, line: 608, baseType: !995, size: 448, offset: 191616)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8", scope: !210, file: !48, line: 609, baseType: !1003, size: 768, offset: 192064)
