; ModuleID = 'common/frame.c'
source_filename = "common/frame.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [128 x ptr], i64, i32, i32, %struct.anon.3, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], ptr, [8 x i8], [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], %struct.x264_slice_header_t, [8 x i8], %struct.x264_cabac_t, %struct.anon.7, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], %struct.anon.8, %struct.anon.9, ptr, %struct.anon.12, [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon.0, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.1, %struct.anon.2, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!65 = !DIEnumerator(name: "I_4x4", value: 0)
!66 = !DIEnumerator(name: "I_8x8", value: 1)
!67 = !DIEnumerator(name: "I_16x16", value: 2)
!68 = !DIEnumerator(name: "I_PCM", value: 3)
!69 = !DIEnumerator(name: "P_L0", value: 4)
!70 = !DIEnumerator(name: "P_8x8", value: 5)
!71 = !DIEnumerator(name: "P_SKIP", value: 6)
!72 = !DIEnumerator(name: "B_DIRECT", value: 7)
!73 = !DIEnumerator(name: "B_L0_L0", value: 8)
!74 = !DIEnumerator(name: "B_L0_L1", value: 9)
!75 = !DIEnumerator(name: "B_L0_BI", value: 10)
!76 = !DIEnumerator(name: "B_L1_L0", value: 11)
!77 = !DIEnumerator(name: "B_L1_L1", value: 12)
!78 = !DIEnumerator(name: "B_L1_BI", value: 13)
!79 = !DIEnumerator(name: "B_BI_L0", value: 14)
!80 = !DIEnumerator(name: "B_BI_L1", value: 15)
!81 = !DIEnumerator(name: "B_BI_BI", value: 16)
!82 = !DIEnumerator(name: "B_8x8", value: 17)
!83 = !DIEnumerator(name: "B_SKIP", value: 18)
!84 = !DIEnumerator(name: "X264_MBTYPE_MAX", value: 19)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "slice_type_e", file: !86, line: 148, baseType: !63, size: 32, elements: !87)
!86 = !DIFile(filename: "common/common.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "4880b62cc871dca4002788746fbccb70")
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIEnumerator(name: "SLICE_TYPE_P", value: 0)
!89 = !DIEnumerator(name: "SLICE_TYPE_B", value: 1)
!90 = !DIEnumerator(name: "SLICE_TYPE_I", value: 2)
!91 = !DIEnumerator(name: "SLICE_TYPE_SP", value: 3)
!92 = !DIEnumerator(name: "SLICE_TYPE_SI", value: 4)
!93 = !{!94, !100, !103, !104, !95}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !96, line: 25, baseType: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !98, line: 40, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !96, line: 26, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !98, line: 42, baseType: !63)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 192, elements: !28)
!106 = !{!0, !7, !12, !17, !19, !25, !30, !35, !40, !45, !50, !55, !57, !107, !116}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "i_beta_table", scope: !59, file: !2, line: 386, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 608, elements: !114)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !96, line: 24, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !98, line: 38, baseType: !113)
!113 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !{!115}
!115 = !DISubrange(count: 76)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "i_tc0_table", scope: !59, file: !2, line: 397, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2432, elements: !124)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !121, line: 24, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !98, line: 37, baseType: !123)
!123 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!124 = !{!115, !125}
!125 = !DISubrange(count: 4)
!126 = !{i32 7, !"Dwarf Version", i32 5}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{i32 8, !"PIC Level", i32 2}
!130 = !{i32 7, !"PIE Level", i32 2}
!131 = !{i32 7, !"uwtable", i32 2}
!132 = !{!"clang version 16.0.0"}
!133 = distinct !DISubprogram(name: "x264_frame_new", scope: !2, file: !2, line: 29, type: !134, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1210)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !283}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !138, line: 94, baseType: !139)
!138 = !DIFile(filename: "common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 31, size: 51648, elements: !140)
!140 = !{!141, !143, !144, !145, !149, !150, !151, !152, !154, !155, !156, !160, !161, !162, !163, !164, !165, !168, !171, !172, !173, !174, !175, !177, !186, !189, !192, !194, !196, !200, !203, !207, !208, !209, !212, !214, !215, !216, !217, !219, !220, !221, !222, !223, !224, !253}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !139, file: !138, line: 34, baseType: !142, size: 32)
!142 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !139, file: !138, line: 35, baseType: !142, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !139, file: !138, line: 36, baseType: !142, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !139, file: !138, line: 37, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !121, line: 27, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !98, line: 44, baseType: !148)
!148 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !139, file: !138, line: 38, baseType: !142, size: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !139, file: !138, line: 39, baseType: !142, size: 32, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !139, file: !138, line: 40, baseType: !142, size: 32, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !139, file: !138, line: 41, baseType: !153, size: 32, offset: 288)
!153 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !139, file: !138, line: 42, baseType: !153, size: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !139, file: !138, line: 45, baseType: !142, size: 32, offset: 352)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !139, file: !138, line: 46, baseType: !157, size: 96, offset: 384)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 96, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 3)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !139, file: !138, line: 47, baseType: !157, size: 96, offset: 480)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !139, file: !138, line: 48, baseType: !157, size: 96, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !139, file: !138, line: 49, baseType: !142, size: 32, offset: 672)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !139, file: !138, line: 50, baseType: !142, size: 32, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !139, file: !138, line: 51, baseType: !142, size: 32, offset: 736)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !139, file: !138, line: 52, baseType: !166, size: 192, offset: 768)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 192, elements: !158)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !139, file: !138, line: 53, baseType: !169, size: 256, offset: 960)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 256, elements: !170)
!170 = !{!125}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !139, file: !138, line: 54, baseType: !169, size: 256, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !139, file: !138, line: 55, baseType: !94, size: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !139, file: !138, line: 59, baseType: !169, size: 256, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !139, file: !138, line: 60, baseType: !169, size: 256, offset: 1792)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !139, file: !138, line: 63, baseType: !176, size: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !139, file: !138, line: 64, baseType: !178, size: 128, offset: 2112)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !184)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 32, elements: !184)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !121, line: 25, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !98, line: 39, baseType: !183)
!183 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !139, file: !138, line: 65, baseType: !187, size: 2176, offset: 2240)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2176, elements: !188)
!188 = !{!185, !11}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !139, file: !138, line: 66, baseType: !190, size: 2176, offset: 4416)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 2176, elements: !188)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !139, file: !138, line: 67, baseType: !193, size: 128, offset: 6592)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !184)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !139, file: !138, line: 68, baseType: !195, size: 64, offset: 6720)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 64, elements: !184)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !139, file: !138, line: 69, baseType: !197, size: 1024, offset: 6784)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 1024, elements: !198)
!198 = !{!185, !199}
!199 = !DISubrange(count: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !139, file: !138, line: 70, baseType: !201, size: 512, offset: 7808)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 512, elements: !202)
!202 = !{!199}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !139, file: !138, line: 75, baseType: !204, size: 10368, offset: 8320)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 10368, elements: !205)
!205 = !{!206, !206}
!206 = !DISubrange(count: 18)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !139, file: !138, line: 76, baseType: !204, size: 10368, offset: 18688)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !139, file: !138, line: 77, baseType: !142, size: 32, offset: 29056)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !139, file: !138, line: 78, baseType: !210, size: 576, offset: 29088)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 576, elements: !211)
!211 = !{!206}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !139, file: !138, line: 79, baseType: !213, size: 20736, offset: 29696)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 20736, elements: !205)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !139, file: !138, line: 80, baseType: !191, size: 64, offset: 50432)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !139, file: !138, line: 81, baseType: !191, size: 64, offset: 50496)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !139, file: !138, line: 82, baseType: !191, size: 64, offset: 50560)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !139, file: !138, line: 83, baseType: !218, size: 64, offset: 50624)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !139, file: !138, line: 84, baseType: !142, size: 32, offset: 50688)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !139, file: !138, line: 85, baseType: !94, size: 64, offset: 50752)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !139, file: !138, line: 86, baseType: !94, size: 64, offset: 50816)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !139, file: !138, line: 89, baseType: !142, size: 32, offset: 50880)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !139, file: !138, line: 90, baseType: !142, size: 32, offset: 50912)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !139, file: !138, line: 91, baseType: !225, size: 320, offset: 50944)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !226, line: 72, baseType: !227)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !226, line: 67, size: 320, elements: !228)
!228 = !{!229, !248, !252}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !227, file: !226, line: 69, baseType: !230, size: 320)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !231, line: 22, size: 320, elements: !232)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !230, file: !231, line: 24, baseType: !142, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !230, file: !231, line: 25, baseType: !63, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !230, file: !231, line: 26, baseType: !142, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !230, file: !231, line: 28, baseType: !63, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !230, file: !231, line: 32, baseType: !142, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !230, file: !231, line: 34, baseType: !183, size: 16, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !230, file: !231, line: 35, baseType: !183, size: 16, offset: 176)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !230, file: !231, line: 36, baseType: !241, size: 128, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !242, line: 55, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !242, line: 51, size: 128, elements: !244)
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !243, file: !242, line: 53, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !243, file: !242, line: 54, baseType: !246, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !227, file: !226, line: 70, baseType: !249, size: 320)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 40)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !227, file: !226, line: 71, baseType: !148, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !139, file: !138, line: 92, baseType: !254, size: 384, offset: 51264)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !226, line: 80, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !226, line: 75, size: 384, elements: !256)
!256 = !{!257, !279, !281}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !255, file: !226, line: 77, baseType: !258, size: 384)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !242, line: 94, size: 384, elements: !259)
!259 = !{!260, !272, !273, !275, !276, !277, !278}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !258, file: !242, line: 96, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !262, line: 33, baseType: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !262, line: 25, size: 64, elements: !264)
!264 = !{!265, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !263, file: !262, line: 27, baseType: !266, size: 64)
!266 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !263, file: !262, line: 32, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !262, line: 28, size: 64, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !268, file: !262, line: 30, baseType: !63, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !268, file: !262, line: 31, baseType: !63, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !258, file: !242, line: 97, baseType: !261, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !258, file: !242, line: 98, baseType: !274, size: 64, offset: 128)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !184)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !258, file: !242, line: 99, baseType: !274, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !258, file: !242, line: 100, baseType: !63, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !258, file: !242, line: 101, baseType: !63, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !258, file: !242, line: 102, baseType: !274, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !255, file: !226, line: 78, baseType: !280, size: 384)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !33)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !255, file: !226, line: 79, baseType: !282, size: 64)
!282 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !285, line: 42, baseType: !286)
!285 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !86, line: 250, size: 206080, elements: !287)
!287 = !{!288, !427, !431, !434, !435, !436, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !546, !548, !573, !575, !576, !581, !586, !589, !593, !597, !601, !602, !603, !604, !607, !609, !611, !650, !667, !689, !690, !691, !692, !696, !697, !698, !699, !714, !866, !870, !924, !933, !934, !942, !944, !1015, !1075, !1127, !1148, !1190}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !286, file: !86, line: 253, baseType: !289, size: 4928)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !285, line: 295, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !285, line: 151, size: 4928, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !332, !334, !335, !336, !337, !341, !342, !355, !356, !357, !358, !359, !385, !424, !425, !426}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !290, file: !285, line: 154, baseType: !63, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !290, file: !285, line: 155, baseType: !142, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !290, file: !285, line: 156, baseType: !142, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !290, file: !285, line: 159, baseType: !142, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !290, file: !285, line: 160, baseType: !142, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !290, file: !285, line: 161, baseType: !142, size: 32, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !290, file: !285, line: 162, baseType: !142, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !290, file: !285, line: 163, baseType: !142, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !290, file: !285, line: 180, baseType: !301, size: 288, offset: 256)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !285, line: 165, size: 288, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !301, file: !285, line: 168, baseType: !142, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !301, file: !285, line: 169, baseType: !142, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !301, file: !285, line: 171, baseType: !142, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !301, file: !285, line: 174, baseType: !142, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !301, file: !285, line: 175, baseType: !142, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !301, file: !285, line: 176, baseType: !142, size: 32, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !301, file: !285, line: 177, baseType: !142, size: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !301, file: !285, line: 178, baseType: !142, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !301, file: !285, line: 179, baseType: !142, size: 32, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !290, file: !285, line: 182, baseType: !142, size: 32, offset: 544)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !290, file: !285, line: 183, baseType: !142, size: 32, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !290, file: !285, line: 186, baseType: !142, size: 32, offset: 608)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !290, file: !285, line: 187, baseType: !142, size: 32, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !290, file: !285, line: 188, baseType: !142, size: 32, offset: 672)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !290, file: !285, line: 189, baseType: !142, size: 32, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !290, file: !285, line: 190, baseType: !142, size: 32, offset: 736)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !290, file: !285, line: 191, baseType: !142, size: 32, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !290, file: !285, line: 192, baseType: !142, size: 32, offset: 800)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !290, file: !285, line: 193, baseType: !142, size: 32, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !290, file: !285, line: 194, baseType: !142, size: 32, offset: 864)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !290, file: !285, line: 196, baseType: !142, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !290, file: !285, line: 197, baseType: !142, size: 32, offset: 928)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !290, file: !285, line: 198, baseType: !142, size: 32, offset: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !290, file: !285, line: 200, baseType: !142, size: 32, offset: 992)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !290, file: !285, line: 201, baseType: !142, size: 32, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !290, file: !285, line: 203, baseType: !142, size: 32, offset: 1056)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !290, file: !285, line: 205, baseType: !142, size: 32, offset: 1088)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !290, file: !285, line: 206, baseType: !331, size: 64, offset: 1152)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !290, file: !285, line: 207, baseType: !333, size: 128, offset: 1216)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !202)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !290, file: !285, line: 208, baseType: !333, size: 128, offset: 1344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !290, file: !285, line: 209, baseType: !333, size: 128, offset: 1472)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !290, file: !285, line: 210, baseType: !333, size: 128, offset: 1600)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !290, file: !285, line: 211, baseType: !338, size: 512, offset: 1728)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 512, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !290, file: !285, line: 212, baseType: !338, size: 512, offset: 2240)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !290, file: !285, line: 215, baseType: !343, size: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !103, !142, !346, !347}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !349)
!349 = !{!350, !352, !353, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !348, file: !351, baseType: !63, size: 32)
!351 = !DIFile(filename: "common/frame.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !348, file: !351, baseType: !63, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !348, file: !351, baseType: !103, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !348, file: !351, baseType: !103, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !290, file: !285, line: 216, baseType: !103, size: 64, offset: 2816)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !290, file: !285, line: 217, baseType: !142, size: 32, offset: 2880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !290, file: !285, line: 218, baseType: !142, size: 32, offset: 2912)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !290, file: !285, line: 219, baseType: !331, size: 64, offset: 2944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !290, file: !285, line: 252, baseType: !360, size: 768, offset: 3008)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !285, line: 222, size: 768, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !360, file: !285, line: 224, baseType: !63, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !360, file: !285, line: 225, baseType: !63, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !360, file: !285, line: 227, baseType: !142, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !360, file: !285, line: 228, baseType: !142, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !360, file: !285, line: 229, baseType: !142, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !360, file: !285, line: 230, baseType: !142, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !360, file: !285, line: 231, baseType: !142, size: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !360, file: !285, line: 233, baseType: !142, size: 32, offset: 224)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !360, file: !285, line: 234, baseType: !142, size: 32, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !360, file: !285, line: 235, baseType: !142, size: 32, offset: 288)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !360, file: !285, line: 236, baseType: !142, size: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !360, file: !285, line: 237, baseType: !142, size: 32, offset: 352)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !360, file: !285, line: 238, baseType: !142, size: 32, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !360, file: !285, line: 239, baseType: !142, size: 32, offset: 416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !360, file: !285, line: 240, baseType: !142, size: 32, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !360, file: !285, line: 241, baseType: !142, size: 32, offset: 480)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !360, file: !285, line: 242, baseType: !142, size: 32, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !360, file: !285, line: 243, baseType: !142, size: 32, offset: 544)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !360, file: !285, line: 244, baseType: !153, size: 32, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !360, file: !285, line: 245, baseType: !153, size: 32, offset: 608)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !360, file: !285, line: 248, baseType: !195, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !360, file: !285, line: 250, baseType: !142, size: 32, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !360, file: !285, line: 251, baseType: !142, size: 32, offset: 736)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !290, file: !285, line: 289, baseType: !386, size: 1024, offset: 3776)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !285, line: 255, size: 1024, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !422, !423}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !386, file: !285, line: 257, baseType: !142, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !386, file: !285, line: 259, baseType: !142, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !386, file: !285, line: 260, baseType: !142, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !386, file: !285, line: 261, baseType: !142, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !386, file: !285, line: 262, baseType: !142, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !386, file: !285, line: 264, baseType: !142, size: 32, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !386, file: !285, line: 265, baseType: !153, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !386, file: !285, line: 266, baseType: !153, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !386, file: !285, line: 267, baseType: !142, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !386, file: !285, line: 268, baseType: !142, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !386, file: !285, line: 269, baseType: !153, size: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !386, file: !285, line: 270, baseType: !153, size: 32, offset: 352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !386, file: !285, line: 271, baseType: !153, size: 32, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !386, file: !285, line: 273, baseType: !142, size: 32, offset: 416)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !386, file: !285, line: 274, baseType: !153, size: 32, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !386, file: !285, line: 277, baseType: !142, size: 32, offset: 480)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !386, file: !285, line: 278, baseType: !331, size: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !386, file: !285, line: 279, baseType: !142, size: 32, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !386, file: !285, line: 280, baseType: !331, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !386, file: !285, line: 283, baseType: !153, size: 32, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !386, file: !285, line: 284, baseType: !153, size: 32, offset: 736)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !386, file: !285, line: 285, baseType: !153, size: 32, offset: 768)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !386, file: !285, line: 286, baseType: !411, size: 64, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !285, line: 149, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 142, size: 256, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !413, file: !285, line: 144, baseType: !142, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !413, file: !285, line: 144, baseType: !142, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !413, file: !285, line: 145, baseType: !142, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !413, file: !285, line: 146, baseType: !142, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !413, file: !285, line: 147, baseType: !153, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !413, file: !285, line: 148, baseType: !421, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !386, file: !285, line: 287, baseType: !142, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !386, file: !285, line: 288, baseType: !331, size: 64, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !290, file: !285, line: 292, baseType: !142, size: 32, offset: 4800)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !290, file: !285, line: 293, baseType: !142, size: 32, offset: 4832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !290, file: !285, line: 294, baseType: !142, size: 32, offset: 4864)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !286, file: !86, line: 255, baseType: !428, size: 8192, offset: 4928)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 8192, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !286, file: !86, line: 256, baseType: !432, size: 64, offset: 13120)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !226, line: 27, baseType: !433)
!433 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !286, file: !86, line: 257, baseType: !142, size: 32, offset: 13184)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !286, file: !86, line: 258, baseType: !142, size: 32, offset: 13216)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !286, file: !86, line: 269, baseType: !437, size: 2112, offset: 13248)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !86, line: 261, size: 2112, elements: !438)
!438 = !{!439, !440, !449, !450, !451, !464}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !437, file: !86, line: 263, baseType: !142, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !437, file: !86, line: 264, baseType: !441, size: 1536, offset: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 1536, elements: !15)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !285, line: 399, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 391, size: 192, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !443, file: !285, line: 393, baseType: !142, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !443, file: !285, line: 394, baseType: !142, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !443, file: !285, line: 397, baseType: !142, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !443, file: !285, line: 398, baseType: !167, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !437, file: !86, line: 265, baseType: !142, size: 32, offset: 1600)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !437, file: !86, line: 266, baseType: !167, size: 64, offset: 1664)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !437, file: !86, line: 267, baseType: !452, size: 320, offset: 1728)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !453, line: 49, baseType: !454)
!453 = !DIFile(filename: "common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !453, line: 40, size: 320, elements: !455)
!455 = !{!456, !457, !458, !459, !462, !463}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !454, file: !453, line: 42, baseType: !167, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !454, file: !453, line: 43, baseType: !167, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !454, file: !453, line: 44, baseType: !167, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !454, file: !453, line: 46, baseType: !460, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !461, line: 87, baseType: !148)
!461 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !454, file: !453, line: 47, baseType: !142, size: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !454, file: !453, line: 48, baseType: !142, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !437, file: !86, line: 268, baseType: !142, size: 32, offset: 2048)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !286, file: !86, line: 274, baseType: !142, size: 32, offset: 15360)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !286, file: !86, line: 276, baseType: !142, size: 32, offset: 15392)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !286, file: !86, line: 277, baseType: !142, size: 32, offset: 15424)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !286, file: !86, line: 278, baseType: !142, size: 32, offset: 15456)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !286, file: !86, line: 279, baseType: !142, size: 32, offset: 15488)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !286, file: !86, line: 280, baseType: !142, size: 32, offset: 15520)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !286, file: !86, line: 282, baseType: !142, size: 32, offset: 15552)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !286, file: !86, line: 283, baseType: !142, size: 32, offset: 15584)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !286, file: !86, line: 284, baseType: !142, size: 32, offset: 15616)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !286, file: !86, line: 287, baseType: !475, size: 9920, offset: 15648)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 9920, elements: !544)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !477, line: 133, baseType: !478)
!477 = !DIFile(filename: "common/set.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "06164d1fd824dd844d17e97dd39e9ac3")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 52, size: 9920, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !497, !498, !499, !500, !501, !502, !503, !504, !505, !512, !513, !543}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !478, file: !477, line: 54, baseType: !142, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !478, file: !477, line: 56, baseType: !142, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !478, file: !477, line: 57, baseType: !142, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !478, file: !477, line: 59, baseType: !142, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !478, file: !477, line: 60, baseType: !142, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !478, file: !477, line: 61, baseType: !142, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !478, file: !477, line: 63, baseType: !142, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !478, file: !477, line: 65, baseType: !142, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !478, file: !477, line: 67, baseType: !142, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !478, file: !477, line: 69, baseType: !142, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !478, file: !477, line: 70, baseType: !142, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !478, file: !477, line: 71, baseType: !142, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !478, file: !477, line: 72, baseType: !142, size: 32, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !478, file: !477, line: 73, baseType: !494, size: 8192, offset: 416)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 8192, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !478, file: !477, line: 75, baseType: !142, size: 32, offset: 8608)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !478, file: !477, line: 76, baseType: !142, size: 32, offset: 8640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !478, file: !477, line: 77, baseType: !142, size: 32, offset: 8672)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !478, file: !477, line: 78, baseType: !142, size: 32, offset: 8704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !478, file: !477, line: 79, baseType: !142, size: 32, offset: 8736)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !478, file: !477, line: 80, baseType: !142, size: 32, offset: 8768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !478, file: !477, line: 81, baseType: !142, size: 32, offset: 8800)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !478, file: !477, line: 83, baseType: !142, size: 32, offset: 8832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !478, file: !477, line: 90, baseType: !506, size: 128, offset: 8864)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !478, file: !477, line: 84, size: 128, elements: !507)
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !506, file: !477, line: 86, baseType: !142, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !506, file: !477, line: 87, baseType: !142, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !506, file: !477, line: 88, baseType: !142, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !506, file: !477, line: 89, baseType: !142, size: 32, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !478, file: !477, line: 92, baseType: !142, size: 32, offset: 8992)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !478, file: !477, line: 129, baseType: !514, size: 864, offset: 9024)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !478, file: !477, line: 93, size: 864, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !514, file: !477, line: 95, baseType: !142, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !514, file: !477, line: 96, baseType: !142, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !514, file: !477, line: 97, baseType: !142, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !514, file: !477, line: 99, baseType: !142, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !514, file: !477, line: 100, baseType: !142, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !514, file: !477, line: 102, baseType: !142, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !514, file: !477, line: 103, baseType: !142, size: 32, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !514, file: !477, line: 104, baseType: !142, size: 32, offset: 224)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !514, file: !477, line: 105, baseType: !142, size: 32, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !514, file: !477, line: 106, baseType: !142, size: 32, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !514, file: !477, line: 107, baseType: !142, size: 32, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !514, file: !477, line: 108, baseType: !142, size: 32, offset: 352)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !514, file: !477, line: 110, baseType: !142, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !514, file: !477, line: 111, baseType: !142, size: 32, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !514, file: !477, line: 112, baseType: !142, size: 32, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !514, file: !477, line: 114, baseType: !142, size: 32, offset: 480)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !514, file: !477, line: 115, baseType: !142, size: 32, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !514, file: !477, line: 116, baseType: !142, size: 32, offset: 544)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !514, file: !477, line: 117, baseType: !142, size: 32, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !514, file: !477, line: 119, baseType: !142, size: 32, offset: 608)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !514, file: !477, line: 120, baseType: !142, size: 32, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !514, file: !477, line: 121, baseType: !142, size: 32, offset: 672)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !514, file: !477, line: 122, baseType: !142, size: 32, offset: 704)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !514, file: !477, line: 123, baseType: !142, size: 32, offset: 736)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !514, file: !477, line: 124, baseType: !142, size: 32, offset: 768)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !514, file: !477, line: 125, baseType: !142, size: 32, offset: 800)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !514, file: !477, line: 126, baseType: !142, size: 32, offset: 832)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !478, file: !477, line: 131, baseType: !142, size: 32, offset: 9888)
!544 = !{!545}
!545 = !DISubrange(count: 1)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !286, file: !86, line: 288, baseType: !547, size: 64, offset: 25600)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !286, file: !86, line: 289, baseType: !549, size: 960, offset: 25664)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 960, elements: !544)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !477, line: 165, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 135, size: 960, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !551, file: !477, line: 137, baseType: !142, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !551, file: !477, line: 138, baseType: !142, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !551, file: !477, line: 140, baseType: !142, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !551, file: !477, line: 142, baseType: !142, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !551, file: !477, line: 143, baseType: !142, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !551, file: !477, line: 145, baseType: !142, size: 32, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !551, file: !477, line: 146, baseType: !142, size: 32, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !551, file: !477, line: 148, baseType: !142, size: 32, offset: 224)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !551, file: !477, line: 149, baseType: !142, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !551, file: !477, line: 151, baseType: !142, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !551, file: !477, line: 152, baseType: !142, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !551, file: !477, line: 154, baseType: !142, size: 32, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !551, file: !477, line: 156, baseType: !142, size: 32, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !551, file: !477, line: 157, baseType: !142, size: 32, offset: 416)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !551, file: !477, line: 158, baseType: !142, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !551, file: !477, line: 160, baseType: !142, size: 32, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !551, file: !477, line: 162, baseType: !142, size: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !551, file: !477, line: 163, baseType: !571, size: 384, offset: 576)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 384, elements: !28)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !286, file: !86, line: 290, baseType: !574, size: 64, offset: 26624)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !286, file: !86, line: 291, baseType: !142, size: 32, offset: 26688)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !286, file: !86, line: 294, baseType: !577, size: 256, offset: 26752)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 256, elements: !170)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 512, elements: !580)
!580 = !{!125, !125}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !286, file: !86, line: 295, baseType: !582, size: 128, offset: 27008)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 128, elements: !184)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 2048, elements: !585)
!585 = !{!16, !16}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !286, file: !86, line: 297, baseType: !587, size: 256, offset: 27136)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 256, elements: !170)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !286, file: !86, line: 298, baseType: !590, size: 128, offset: 27392)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 128, elements: !184)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 2048, elements: !339)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !286, file: !86, line: 300, baseType: !594, size: 256, offset: 27520)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 256, elements: !170)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, elements: !202)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !286, file: !86, line: 301, baseType: !598, size: 128, offset: 27776)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 128, elements: !184)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 1024, elements: !339)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !286, file: !86, line: 302, baseType: !594, size: 256, offset: 27904)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !286, file: !86, line: 303, baseType: !598, size: 128, offset: 28160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !286, file: !86, line: 305, baseType: !572, size: 64, offset: 28288)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !286, file: !86, line: 307, baseType: !605, size: 4096, align: 128, offset: 28416)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 4096, elements: !606)
!606 = !{!185, !340}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !286, file: !86, line: 308, baseType: !608, size: 2048, align: 128, offset: 32512)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2048, elements: !606)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !286, file: !86, line: 309, baseType: !610, size: 64, offset: 34560)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !184)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !286, file: !86, line: 312, baseType: !612, size: 3072, offset: 34624)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !86, line: 209, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 159, size: 3072, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !642, !643, !644, !645, !646, !647, !648, !649}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !613, file: !86, line: 161, baseType: !547, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !613, file: !86, line: 162, baseType: !574, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !613, file: !86, line: 164, baseType: !142, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !613, file: !86, line: 165, baseType: !142, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !613, file: !86, line: 166, baseType: !142, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !613, file: !86, line: 168, baseType: !142, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !613, file: !86, line: 170, baseType: !142, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !613, file: !86, line: 172, baseType: !142, size: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !613, file: !86, line: 173, baseType: !142, size: 32, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !613, file: !86, line: 174, baseType: !142, size: 32, offset: 352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !613, file: !86, line: 176, baseType: !142, size: 32, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !613, file: !86, line: 178, baseType: !142, size: 32, offset: 416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !613, file: !86, line: 179, baseType: !142, size: 32, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !613, file: !86, line: 181, baseType: !195, size: 64, offset: 480)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !613, file: !86, line: 182, baseType: !142, size: 32, offset: 544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !613, file: !86, line: 184, baseType: !142, size: 32, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !613, file: !86, line: 186, baseType: !142, size: 32, offset: 608)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !613, file: !86, line: 187, baseType: !142, size: 32, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !613, file: !86, line: 188, baseType: !142, size: 32, offset: 672)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !613, file: !86, line: 190, baseType: !142, size: 32, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !613, file: !86, line: 191, baseType: !142, size: 32, offset: 736)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !613, file: !86, line: 195, baseType: !637, size: 2048, offset: 768)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 2048, elements: !198)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !613, file: !86, line: 192, size: 64, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !638, file: !86, line: 193, baseType: !142, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !638, file: !86, line: 194, baseType: !142, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !613, file: !86, line: 197, baseType: !142, size: 32, offset: 2816)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !613, file: !86, line: 199, baseType: !142, size: 32, offset: 2848)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !613, file: !86, line: 200, baseType: !142, size: 32, offset: 2880)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !613, file: !86, line: 201, baseType: !142, size: 32, offset: 2912)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !613, file: !86, line: 202, baseType: !142, size: 32, offset: 2944)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !613, file: !86, line: 205, baseType: !142, size: 32, offset: 2976)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !613, file: !86, line: 206, baseType: !142, size: 32, offset: 3008)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !613, file: !86, line: 207, baseType: !142, size: 32, offset: 3040)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !286, file: !86, line: 315, baseType: !651, size: 4096, offset: 37760)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !652, line: 46, baseType: !653)
!652 = !DIFile(filename: "common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 27, size: 4096, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !653, file: !652, line: 30, baseType: !142, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !653, file: !652, line: 31, baseType: !142, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !653, file: !652, line: 34, baseType: !142, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !653, file: !652, line: 35, baseType: !142, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !653, file: !652, line: 37, baseType: !167, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !653, file: !652, line: 38, baseType: !167, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !653, file: !652, line: 39, baseType: !167, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !653, file: !652, line: 42, baseType: !142, size: 32, align: 128, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !653, file: !652, line: 45, baseType: !664, size: 3680, offset: 416)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 3680, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 460)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !286, file: !86, line: 340, baseType: !668, size: 31808, offset: 41856)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !86, line: 317, size: 31808, elements: !669)
!669 = !{!670, !674, !675, !679, !680, !682, !683, !684, !685, !686, !687, !688}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !668, file: !86, line: 320, baseType: !671, size: 4288)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 4288, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 67)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !668, file: !86, line: 322, baseType: !671, size: 4288, offset: 4288)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !668, file: !86, line: 324, baseType: !676, size: 21760, offset: 8576)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 21760, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 340)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !668, file: !86, line: 326, baseType: !136, size: 64, offset: 30336)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !668, file: !86, line: 329, baseType: !681, size: 1152, offset: 30400)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1152, elements: !211)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !668, file: !86, line: 331, baseType: !142, size: 32, offset: 31552)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !668, file: !86, line: 333, baseType: !142, size: 32, offset: 31584)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !668, file: !86, line: 335, baseType: !142, size: 32, offset: 31616)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !668, file: !86, line: 336, baseType: !142, size: 32, offset: 31648)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !668, file: !86, line: 337, baseType: !142, size: 32, offset: 31680)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !668, file: !86, line: 338, baseType: !142, size: 32, offset: 31712)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !668, file: !86, line: 339, baseType: !142, size: 32, offset: 31744)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !286, file: !86, line: 343, baseType: !136, size: 64, offset: 73664)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !286, file: !86, line: 346, baseType: !136, size: 64, offset: 73728)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !286, file: !86, line: 349, baseType: !142, size: 32, offset: 73792)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !286, file: !86, line: 350, baseType: !693, size: 1216, offset: 73856)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1216, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 19)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !286, file: !86, line: 351, baseType: !142, size: 32, offset: 75072)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !286, file: !86, line: 352, baseType: !693, size: 1216, offset: 75136)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !286, file: !86, line: 353, baseType: !195, size: 64, offset: 76352)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !286, file: !86, line: 365, baseType: !700, size: 10624, offset: 76416)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !86, line: 358, size: 10624, elements: !701)
!701 = !{!702, !704, !707, !710}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !700, file: !86, line: 360, baseType: !703, size: 256, align: 128)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 256, elements: !202)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !700, file: !86, line: 361, baseType: !705, size: 128, align: 128, offset: 256)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !706)
!706 = !{!185, !125}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !700, file: !86, line: 363, baseType: !708, size: 4096, align: 128, offset: 384)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 4096, elements: !709)
!709 = !{!125, !340}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !700, file: !86, line: 364, baseType: !711, size: 6144, align: 128, offset: 4480)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 6144, elements: !712)
!712 = !{!713, !199}
!713 = !DISubrange(count: 24)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !286, file: !86, line: 544, baseType: !715, size: 80128, offset: 87040)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !86, line: 368, size: 80128, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !743, !745, !746, !747, !748, !749, !750, !751, !752, !753, !755, !758, !762, !763, !764, !765, !766, !770, !771, !772, !775, !777, !778, !779, !781, !782, !783, !784, !785, !786, !787, !788, !828, !848, !849, !850, !851, !852, !853, !854, !855, !856, !859, !862, !864}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !715, file: !86, line: 370, baseType: !142, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !715, file: !86, line: 373, baseType: !142, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !715, file: !86, line: 374, baseType: !142, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !715, file: !86, line: 375, baseType: !142, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !715, file: !86, line: 378, baseType: !142, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !715, file: !86, line: 379, baseType: !142, size: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !715, file: !86, line: 380, baseType: !142, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !715, file: !86, line: 381, baseType: !142, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !715, file: !86, line: 382, baseType: !142, size: 32, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !715, file: !86, line: 385, baseType: !142, size: 32, offset: 288)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !715, file: !86, line: 386, baseType: !142, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !715, file: !86, line: 387, baseType: !142, size: 32, offset: 352)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !715, file: !86, line: 388, baseType: !142, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !715, file: !86, line: 389, baseType: !142, size: 32, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !715, file: !86, line: 390, baseType: !142, size: 32, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !715, file: !86, line: 391, baseType: !142, size: 32, offset: 480)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !715, file: !86, line: 393, baseType: !142, size: 32, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !715, file: !86, line: 396, baseType: !195, size: 64, offset: 544)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !715, file: !86, line: 397, baseType: !195, size: 64, offset: 608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !715, file: !86, line: 400, baseType: !195, size: 64, offset: 672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !715, file: !86, line: 401, baseType: !195, size: 64, offset: 736)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !715, file: !86, line: 403, baseType: !195, size: 64, offset: 800)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !715, file: !86, line: 404, baseType: !195, size: 64, offset: 864)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !715, file: !86, line: 407, baseType: !63, size: 32, offset: 928)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !715, file: !86, line: 408, baseType: !742, size: 128, offset: 960)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !170)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !715, file: !86, line: 409, baseType: !744, size: 512, offset: 1088)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, elements: !202)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !715, file: !86, line: 410, baseType: !142, size: 32, offset: 1600)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !715, file: !86, line: 411, baseType: !142, size: 32, offset: 1632)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !715, file: !86, line: 412, baseType: !142, size: 32, offset: 1664)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !715, file: !86, line: 413, baseType: !142, size: 32, offset: 1696)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !715, file: !86, line: 414, baseType: !142, size: 32, offset: 1728)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !715, file: !86, line: 415, baseType: !142, size: 32, offset: 1760)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !86, line: 422, baseType: !176, size: 64, offset: 1792)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !715, file: !86, line: 423, baseType: !176, size: 64, offset: 1856)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !715, file: !86, line: 424, baseType: !754, size: 64, offset: 1920)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !715, file: !86, line: 425, baseType: !756, size: 64, offset: 1984)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !15)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !715, file: !86, line: 427, baseType: !759, size: 64, offset: 2048)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 192, elements: !761)
!761 = !{!713}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !715, file: !86, line: 428, baseType: !176, size: 64, offset: 2112)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !715, file: !86, line: 429, baseType: !178, size: 128, offset: 2176)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !715, file: !86, line: 430, baseType: !178, size: 128, offset: 2304)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !715, file: !86, line: 431, baseType: !193, size: 128, offset: 2432)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !715, file: !86, line: 432, baseType: !767, size: 4096, offset: 2560)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 4096, elements: !768)
!768 = !{!185, !769}
!769 = !DISubrange(count: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !715, file: !86, line: 433, baseType: !176, size: 64, offset: 6656)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !715, file: !86, line: 434, baseType: !176, size: 64, offset: 6720)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !715, file: !86, line: 435, baseType: !773, size: 384, offset: 6784)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 384, elements: !774)
!774 = !{!185, !159}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !715, file: !86, line: 436, baseType: !776, size: 64, offset: 7168)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !715, file: !86, line: 439, baseType: !142, size: 32, offset: 7232)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !715, file: !86, line: 440, baseType: !142, size: 32, offset: 7264)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !715, file: !86, line: 441, baseType: !780, size: 128, offset: 7296)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !170)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !715, file: !86, line: 442, baseType: !142, size: 32, offset: 7424)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !715, file: !86, line: 444, baseType: !142, size: 32, offset: 7456)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !715, file: !86, line: 445, baseType: !142, size: 32, offset: 7488)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !715, file: !86, line: 447, baseType: !142, size: 32, offset: 7520)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !715, file: !86, line: 448, baseType: !142, size: 32, offset: 7552)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !715, file: !86, line: 454, baseType: !142, size: 32, offset: 7584)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !715, file: !86, line: 457, baseType: !142, size: 32, offset: 7616)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !715, file: !86, line: 498, baseType: !789, size: 57344, offset: 7680)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !715, file: !86, line: 459, size: 57344, elements: !790)
!790 = !{!791, !795, !799, !801, !802, !805, !808, !809, !812, !813, !814, !817, !818, !819, !820, !821, !822, !825, !827}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !789, file: !86, line: 464, baseType: !792, size: 3072, align: 128)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 3072, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !789, file: !86, line: 465, baseType: !796, size: 6912, align: 128, offset: 3072)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 6912, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 864)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !789, file: !86, line: 468, baseType: !800, size: 2048, align: 128, offset: 9984)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 2048, elements: !495)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !789, file: !86, line: 469, baseType: !800, size: 2048, align: 128, offset: 12032)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !789, file: !86, line: 470, baseType: !803, size: 3072, align: 128, offset: 14080)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 3072, elements: !804)
!804 = !{!159, !340}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !789, file: !86, line: 471, baseType: !806, size: 3840, align: 128, offset: 17152)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 3840, elements: !807)
!807 = !{!6, !199}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !789, file: !86, line: 474, baseType: !708, size: 4096, align: 128, offset: 20992)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !789, file: !86, line: 475, baseType: !810, size: 4096, align: 128, offset: 25088)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 4096, elements: !811)
!811 = !{!199, !199}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !789, file: !86, line: 478, baseType: !579, size: 512, offset: 29184)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !789, file: !86, line: 479, baseType: !142, size: 32, offset: 29696)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !789, file: !86, line: 480, baseType: !815, size: 128, offset: 29728)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !816)
!816 = !{!185, !185}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !789, file: !86, line: 481, baseType: !142, size: 32, offset: 29856)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !789, file: !86, line: 484, baseType: !166, size: 192, offset: 29888)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !789, file: !86, line: 486, baseType: !166, size: 192, offset: 30080)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !789, file: !86, line: 489, baseType: !166, size: 192, offset: 30272)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !789, file: !86, line: 492, baseType: !195, size: 64, offset: 30464)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !789, file: !86, line: 493, baseType: !823, size: 24576, offset: 30528)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 24576, elements: !824)
!824 = !{!185, !769, !29}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !789, file: !86, line: 494, baseType: !826, size: 2048, offset: 55104)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2048, elements: !198)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !789, file: !86, line: 497, baseType: !157, size: 96, offset: 57152)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !715, file: !86, line: 526, baseType: !829, size: 12032, offset: 65024)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !715, file: !86, line: 501, size: 12032, elements: !830)
!830 = !{!831, !833, !835, !838, !841, !842, !843, !844, !845, !846, !847}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !829, file: !86, line: 504, baseType: !832, size: 384)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 384, elements: !33)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !829, file: !86, line: 507, baseType: !834, size: 384, offset: 384)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 384, elements: !33)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !829, file: !86, line: 510, baseType: !836, size: 768, align: 32, offset: 768)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 768, elements: !837)
!837 = !{!185, !34}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !829, file: !86, line: 513, baseType: !839, size: 3072, align: 128, offset: 1536)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 3072, elements: !840)
!840 = !{!185, !34, !185}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !829, file: !86, line: 514, baseType: !839, size: 3072, align: 64, offset: 4608)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !829, file: !86, line: 517, baseType: !832, size: 384, align: 32, offset: 7680)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !829, file: !86, line: 519, baseType: !839, size: 3072, align: 128, offset: 8064)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !829, file: !86, line: 520, baseType: !836, size: 768, align: 32, offset: 11136)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !829, file: !86, line: 521, baseType: !180, size: 32, align: 32, offset: 11904)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !829, file: !86, line: 524, baseType: !142, size: 32, offset: 11936)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !829, file: !86, line: 525, baseType: !142, size: 32, offset: 11968)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !715, file: !86, line: 529, baseType: !142, size: 32, offset: 77056)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !715, file: !86, line: 530, baseType: !142, size: 32, offset: 77088)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !715, file: !86, line: 531, baseType: !142, size: 32, offset: 77120)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !715, file: !86, line: 532, baseType: !142, size: 32, offset: 77152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !715, file: !86, line: 533, baseType: !142, size: 32, offset: 77184)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !715, file: !86, line: 534, baseType: !142, size: 32, offset: 77216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !715, file: !86, line: 535, baseType: !142, size: 32, offset: 77248)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !715, file: !86, line: 536, baseType: !142, size: 32, offset: 77280)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !715, file: !86, line: 539, baseType: !857, size: 512, offset: 77312)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 512, elements: !858)
!858 = !{!199, !185}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !715, file: !86, line: 540, baseType: !860, size: 2048, offset: 77824)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, elements: !861)
!861 = !{!769, !125}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !715, file: !86, line: 542, baseType: !863, size: 16, offset: 79872)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 16, elements: !184)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !715, file: !86, line: 543, baseType: !865, size: 128, offset: 79888)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !202)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !286, file: !86, line: 547, baseType: !867, size: 64, offset: 167168)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !86, line: 248, baseType: !869)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !86, line: 248, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !286, file: !86, line: 604, baseType: !871, size: 23936, offset: 167232)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !86, line: 550, size: 23936, elements: !872)
!872 = !{!873, !897, !901, !903, !905, !906, !907, !908, !909, !910, !911, !912, !915, !917, !919, !922, !923}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !871, file: !86, line: 579, baseType: !874, size: 3904)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !86, line: 553, size: 3904, elements: !875)
!875 = !{!876, !877, !878, !879, !881, !882, !883, !884, !885, !887, !889, !890, !891, !892, !893, !895}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !874, file: !86, line: 556, baseType: !142, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !874, file: !86, line: 558, baseType: !142, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !874, file: !86, line: 560, baseType: !142, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !874, file: !86, line: 562, baseType: !880, size: 608, offset: 96)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 608, elements: !694)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !874, file: !86, line: 563, baseType: !142, size: 32, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !874, file: !86, line: 564, baseType: !142, size: 32, offset: 736)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !874, file: !86, line: 565, baseType: !142, size: 32, offset: 768)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !874, file: !86, line: 566, baseType: !195, size: 64, offset: 800)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !874, file: !86, line: 567, baseType: !886, size: 2048, offset: 864)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 2048, elements: !768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !874, file: !86, line: 568, baseType: !888, size: 544, offset: 2912)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 544, elements: !10)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !874, file: !86, line: 571, baseType: !142, size: 32, offset: 3456)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !874, file: !86, line: 572, baseType: !142, size: 32, offset: 3488)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !874, file: !86, line: 573, baseType: !142, size: 32, offset: 3520)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !874, file: !86, line: 575, baseType: !195, size: 64, offset: 3552)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !874, file: !86, line: 577, baseType: !894, size: 192, offset: 3648)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 192, elements: !158)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !874, file: !86, line: 578, baseType: !896, size: 64, offset: 3840)
!896 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !871, file: !86, line: 584, baseType: !898, size: 160, offset: 3904)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 160, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 5)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !871, file: !86, line: 585, baseType: !902, size: 320, offset: 4096)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 320, elements: !899)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !871, file: !86, line: 586, baseType: !904, size: 320, offset: 4416)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 320, elements: !899)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !871, file: !86, line: 587, baseType: !888, size: 544, offset: 4736)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !871, file: !86, line: 589, baseType: !902, size: 320, offset: 5312)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !871, file: !86, line: 590, baseType: !904, size: 320, offset: 5632)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !871, file: !86, line: 591, baseType: !904, size: 320, offset: 5952)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !871, file: !86, line: 592, baseType: !904, size: 320, offset: 6272)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !871, file: !86, line: 593, baseType: !904, size: 320, offset: 6592)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !871, file: !86, line: 594, baseType: !904, size: 320, offset: 6912)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !871, file: !86, line: 596, baseType: !913, size: 6080, offset: 7232)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 6080, elements: !914)
!914 = !{!900, !695}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !871, file: !86, line: 597, baseType: !916, size: 2176, offset: 13312)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 2176, elements: !188)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !871, file: !86, line: 598, baseType: !918, size: 128, offset: 15488)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 128, elements: !184)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !871, file: !86, line: 599, baseType: !920, size: 8192, offset: 15616)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8192, elements: !921)
!921 = !{!185, !185, !769}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !871, file: !86, line: 601, baseType: !195, size: 64, offset: 23808)
