; ModuleID = 'encoder/macroblock.c'
source_filename = "encoder/macroblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [128 x ptr], i64, i32, i32, %struct.anon.2, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], ptr, [8 x i8], [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], %struct.x264_slice_header_t, [8 x i8], %struct.x264_cabac_t, %struct.anon.6, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], %struct.anon.8, %struct.anon.9, ptr, %struct.anon.12, [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!171 = !DILocalVariable(name: "v", arg: 1, scope: !165, file: !164, line: 99, type: !169)
!172 = !DILocalVariable(name: "i_count", arg: 2, scope: !165, file: !164, line: 99, type: !168)
!173 = !DILocalVariable(name: "nonzero", scope: !174, file: !164, line: 103, type: !168)
!174 = distinct !DILexicalBlock(scope: !175, file: !164, line: 102, column: 5)
!175 = distinct !DILexicalBlock(scope: !165, file: !164, line: 101, column: 8)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !163, file: !164, line: 124, baseType: !178, size: 1024)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1024, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 64)
!181 = !{!0, !182, !188, !195, !197, !203, !205, !207, !212, !216}
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "block_idx_xy_fdec", scope: !2, file: !6, line: 242, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 256, elements: !186)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!186 = !{!187}
!187 = !DISubrange(count: 16)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "block_idx_x", scope: !2, file: !6, line: 208, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 128, elements: !186)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !153, line: 24, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !149, line: 38, baseType: !194)
!194 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "block_idx_y", scope: !2, file: !6, line: 212, type: !190, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "x264_scan8", scope: !2, file: !27, line: 216, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 864, elements: !201)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!201 = !{!202}
!202 = !DISubrange(count: 27)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "block_idx_yx_1d", scope: !2, file: !6, line: 227, type: !190, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "block_idx_xy_1d", scope: !2, file: !6, line: 223, type: !190, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "x264_pred_i4x4_neighbors", scope: !2, file: !6, line: 40, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 96, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 12)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "x264_dct8_weight2_tab", scope: !2, file: !214, line: 73, type: !215, isLocal: true, isDefinition: true)
!214 = !DIFile(filename: "./common/dct.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "eb76275dd7785989f0d8a4ada39e3c74")
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 1024, elements: !179)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "x264_dct4_weight2_tab", scope: !2, file: !214, line: 59, type: !184, isLocal: true, isDefinition: true)
!218 = !{i32 7, !"Dwarf Version", i32 5}
!219 = !{i32 2, !"Debug Info Version", i32 3}
!220 = !{i32 1, !"wchar_size", i32 4}
!221 = !{i32 8, !"PIC Level", i32 2}
!222 = !{i32 7, !"PIE Level", i32 2}
!223 = !{i32 7, !"uwtable", i32 2}
!224 = !{!"clang version 16.0.0"}
!225 = distinct !DISubprogram(name: "x264_mb_encode_i4x4", scope: !3, file: !3, line: 93, type: !226, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1299)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228, !168, !168}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !230, line: 42, baseType: !231)
!230 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !27, line: 250, size: 206080, elements: !232)
!232 = !{!233, !376, !380, !383, !384, !385, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !498, !500, !527, !529, !530, !537, !542, !546, !550, !554, !558, !559, !560, !561, !564, !566, !568, !608, !625, !784, !785, !786, !787, !791, !792, !793, !794, !809, !961, !965, !1020, !1028, !1029, !1035, !1037, !1105, !1165, !1216, !1237, !1279}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !231, file: !27, line: 253, baseType: !234, size: 4928)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !230, line: 295, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !230, line: 151, size: 4928, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !278, !280, !281, !282, !283, !285, !286, !300, !301, !302, !303, !304, !334, !373, !374, !375}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !235, file: !230, line: 154, baseType: !7, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !235, file: !230, line: 155, baseType: !168, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !235, file: !230, line: 156, baseType: !168, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !235, file: !230, line: 159, baseType: !168, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !235, file: !230, line: 160, baseType: !168, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !235, file: !230, line: 161, baseType: !168, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !235, file: !230, line: 162, baseType: !168, size: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !235, file: !230, line: 163, baseType: !168, size: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !235, file: !230, line: 180, baseType: !246, size: 288, offset: 256)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !230, line: 165, size: 288, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !246, file: !230, line: 168, baseType: !168, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !246, file: !230, line: 169, baseType: !168, size: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !246, file: !230, line: 171, baseType: !168, size: 32, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !246, file: !230, line: 174, baseType: !168, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !246, file: !230, line: 175, baseType: !168, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !246, file: !230, line: 176, baseType: !168, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !246, file: !230, line: 177, baseType: !168, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !246, file: !230, line: 178, baseType: !168, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !246, file: !230, line: 179, baseType: !168, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !235, file: !230, line: 182, baseType: !168, size: 32, offset: 544)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !235, file: !230, line: 183, baseType: !168, size: 32, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !235, file: !230, line: 186, baseType: !168, size: 32, offset: 608)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !235, file: !230, line: 187, baseType: !168, size: 32, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !235, file: !230, line: 188, baseType: !168, size: 32, offset: 672)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !235, file: !230, line: 189, baseType: !168, size: 32, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !235, file: !230, line: 190, baseType: !168, size: 32, offset: 736)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !235, file: !230, line: 191, baseType: !168, size: 32, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !235, file: !230, line: 192, baseType: !168, size: 32, offset: 800)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !235, file: !230, line: 193, baseType: !168, size: 32, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !235, file: !230, line: 194, baseType: !168, size: 32, offset: 864)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !235, file: !230, line: 196, baseType: !168, size: 32, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !235, file: !230, line: 197, baseType: !168, size: 32, offset: 928)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !235, file: !230, line: 198, baseType: !168, size: 32, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !235, file: !230, line: 200, baseType: !168, size: 32, offset: 992)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !235, file: !230, line: 201, baseType: !168, size: 32, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !235, file: !230, line: 203, baseType: !168, size: 32, offset: 1056)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !235, file: !230, line: 205, baseType: !168, size: 32, offset: 1088)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !235, file: !230, line: 206, baseType: !276, size: 64, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !235, file: !230, line: 207, baseType: !279, size: 128, offset: 1216)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !186)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !235, file: !230, line: 208, baseType: !279, size: 128, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !235, file: !230, line: 209, baseType: !279, size: 128, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !235, file: !230, line: 210, baseType: !279, size: 128, offset: 1600)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !235, file: !230, line: 211, baseType: !284, size: 512, offset: 1728)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 512, elements: !179)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !235, file: !230, line: 212, baseType: !284, size: 512, offset: 2240)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !235, file: !230, line: 215, baseType: !287, size: 64, offset: 2752)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !169, !168, !290, !292}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !294)
!294 = !{!295, !297, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !293, file: !296, baseType: !7, size: 32)
!296 = !DIFile(filename: "encoder/macroblock.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !293, file: !296, baseType: !7, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !293, file: !296, baseType: !169, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !293, file: !296, baseType: !169, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !235, file: !230, line: 216, baseType: !169, size: 64, offset: 2816)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !235, file: !230, line: 217, baseType: !168, size: 32, offset: 2880)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !235, file: !230, line: 218, baseType: !168, size: 32, offset: 2912)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !235, file: !230, line: 219, baseType: !276, size: 64, offset: 2944)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !235, file: !230, line: 252, baseType: !305, size: 768, offset: 3008)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !230, line: 222, size: 768, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !327, !328, !332, !333}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !305, file: !230, line: 224, baseType: !7, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !305, file: !230, line: 225, baseType: !7, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !305, file: !230, line: 227, baseType: !168, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !305, file: !230, line: 228, baseType: !168, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !305, file: !230, line: 229, baseType: !168, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !305, file: !230, line: 230, baseType: !168, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !305, file: !230, line: 231, baseType: !168, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !305, file: !230, line: 233, baseType: !168, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !305, file: !230, line: 234, baseType: !168, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !305, file: !230, line: 235, baseType: !168, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !305, file: !230, line: 236, baseType: !168, size: 32, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !305, file: !230, line: 237, baseType: !168, size: 32, offset: 352)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !305, file: !230, line: 238, baseType: !168, size: 32, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !305, file: !230, line: 239, baseType: !168, size: 32, offset: 416)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !305, file: !230, line: 240, baseType: !168, size: 32, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !305, file: !230, line: 241, baseType: !168, size: 32, offset: 480)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !305, file: !230, line: 242, baseType: !168, size: 32, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !305, file: !230, line: 243, baseType: !168, size: 32, offset: 544)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !305, file: !230, line: 244, baseType: !326, size: 32, offset: 576)
!326 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !305, file: !230, line: 245, baseType: !326, size: 32, offset: 608)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !305, file: !230, line: 248, baseType: !329, size: 64, offset: 640)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 2)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !305, file: !230, line: 250, baseType: !168, size: 32, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !305, file: !230, line: 251, baseType: !168, size: 32, offset: 736)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !235, file: !230, line: 289, baseType: !335, size: 1024, offset: 3776)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !230, line: 255, size: 1024, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !371, !372}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !335, file: !230, line: 257, baseType: !168, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !335, file: !230, line: 259, baseType: !168, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !335, file: !230, line: 260, baseType: !168, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !335, file: !230, line: 261, baseType: !168, size: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !335, file: !230, line: 262, baseType: !168, size: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !335, file: !230, line: 264, baseType: !168, size: 32, offset: 160)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !335, file: !230, line: 265, baseType: !326, size: 32, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !335, file: !230, line: 266, baseType: !326, size: 32, offset: 224)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !335, file: !230, line: 267, baseType: !168, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !335, file: !230, line: 268, baseType: !168, size: 32, offset: 288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !335, file: !230, line: 269, baseType: !326, size: 32, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !335, file: !230, line: 270, baseType: !326, size: 32, offset: 352)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !335, file: !230, line: 271, baseType: !326, size: 32, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !335, file: !230, line: 273, baseType: !168, size: 32, offset: 416)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !335, file: !230, line: 274, baseType: !326, size: 32, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !335, file: !230, line: 277, baseType: !168, size: 32, offset: 480)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !335, file: !230, line: 278, baseType: !276, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !335, file: !230, line: 279, baseType: !168, size: 32, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !335, file: !230, line: 280, baseType: !276, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !335, file: !230, line: 283, baseType: !326, size: 32, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !335, file: !230, line: 284, baseType: !326, size: 32, offset: 736)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !335, file: !230, line: 285, baseType: !326, size: 32, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !335, file: !230, line: 286, baseType: !360, size: 64, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !230, line: 149, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 142, size: 256, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !362, file: !230, line: 144, baseType: !168, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !362, file: !230, line: 144, baseType: !168, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !362, file: !230, line: 145, baseType: !168, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !362, file: !230, line: 146, baseType: !168, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !362, file: !230, line: 147, baseType: !326, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !362, file: !230, line: 148, baseType: !370, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !335, file: !230, line: 287, baseType: !168, size: 32, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !335, file: !230, line: 288, baseType: !276, size: 64, offset: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !235, file: !230, line: 292, baseType: !168, size: 32, offset: 4800)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !235, file: !230, line: 293, baseType: !168, size: 32, offset: 4832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !235, file: !230, line: 294, baseType: !168, size: 32, offset: 4864)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !231, file: !27, line: 255, baseType: !377, size: 8192, offset: 4928)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 8192, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !231, file: !27, line: 256, baseType: !381, size: 64, offset: 13120)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !382, line: 27, baseType: !161)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !231, file: !27, line: 257, baseType: !168, size: 32, offset: 13184)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !231, file: !27, line: 258, baseType: !168, size: 32, offset: 13216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !231, file: !27, line: 269, baseType: !386, size: 2112, offset: 13248)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !27, line: 261, size: 2112, elements: !387)
!387 = !{!388, !389, !401, !402, !403, !417}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !386, file: !27, line: 263, baseType: !168, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !386, file: !27, line: 264, baseType: !390, size: 1536, offset: 64)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 1536, elements: !399)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !230, line: 399, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 391, size: 192, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !392, file: !230, line: 393, baseType: !168, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !392, file: !230, line: 394, baseType: !168, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !392, file: !230, line: 397, baseType: !168, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !392, file: !230, line: 398, baseType: !398, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!399 = !{!400}
!400 = !DISubrange(count: 8)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !386, file: !27, line: 265, baseType: !168, size: 32, offset: 1600)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !386, file: !27, line: 266, baseType: !398, size: 64, offset: 1664)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !386, file: !27, line: 267, baseType: !404, size: 320, offset: 1728)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !405, line: 49, baseType: !406)
!405 = !DIFile(filename: "./common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !405, line: 40, size: 320, elements: !407)
!407 = !{!408, !409, !410, !411, !415, !416}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !406, file: !405, line: 42, baseType: !398, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !406, file: !405, line: 43, baseType: !398, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !406, file: !405, line: 44, baseType: !398, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !406, file: !405, line: 46, baseType: !412, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !413, line: 87, baseType: !414)
!413 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!414 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !406, file: !405, line: 47, baseType: !168, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !406, file: !405, line: 48, baseType: !168, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !386, file: !27, line: 268, baseType: !168, size: 32, offset: 2048)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !231, file: !27, line: 274, baseType: !168, size: 32, offset: 15360)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !231, file: !27, line: 276, baseType: !168, size: 32, offset: 15392)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !231, file: !27, line: 277, baseType: !168, size: 32, offset: 15424)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !231, file: !27, line: 278, baseType: !168, size: 32, offset: 15456)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !231, file: !27, line: 279, baseType: !168, size: 32, offset: 15488)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !231, file: !27, line: 280, baseType: !168, size: 32, offset: 15520)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !231, file: !27, line: 282, baseType: !168, size: 32, offset: 15552)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !231, file: !27, line: 283, baseType: !168, size: 32, offset: 15584)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !231, file: !27, line: 284, baseType: !168, size: 32, offset: 15616)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !231, file: !27, line: 287, baseType: !428, size: 9920, offset: 15648)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 9920, elements: !496)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !16, line: 133, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 52, size: 9920, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !450, !451, !452, !453, !454, !455, !456, !457, !464, !465, !495}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !430, file: !16, line: 54, baseType: !168, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !430, file: !16, line: 56, baseType: !168, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !430, file: !16, line: 57, baseType: !168, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !430, file: !16, line: 59, baseType: !168, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !430, file: !16, line: 60, baseType: !168, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !430, file: !16, line: 61, baseType: !168, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !430, file: !16, line: 63, baseType: !168, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !430, file: !16, line: 65, baseType: !168, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !430, file: !16, line: 67, baseType: !168, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !430, file: !16, line: 69, baseType: !168, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !430, file: !16, line: 70, baseType: !168, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !430, file: !16, line: 71, baseType: !168, size: 32, offset: 352)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !430, file: !16, line: 72, baseType: !168, size: 32, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !430, file: !16, line: 73, baseType: !446, size: 8192, offset: 416)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 8192, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !430, file: !16, line: 75, baseType: !168, size: 32, offset: 8608)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !430, file: !16, line: 76, baseType: !168, size: 32, offset: 8640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !430, file: !16, line: 77, baseType: !168, size: 32, offset: 8672)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !430, file: !16, line: 78, baseType: !168, size: 32, offset: 8704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !430, file: !16, line: 79, baseType: !168, size: 32, offset: 8736)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !430, file: !16, line: 80, baseType: !168, size: 32, offset: 8768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !430, file: !16, line: 81, baseType: !168, size: 32, offset: 8800)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !430, file: !16, line: 83, baseType: !168, size: 32, offset: 8832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !430, file: !16, line: 90, baseType: !458, size: 128, offset: 8864)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !16, line: 84, size: 128, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !458, file: !16, line: 86, baseType: !168, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !458, file: !16, line: 87, baseType: !168, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !458, file: !16, line: 88, baseType: !168, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !458, file: !16, line: 89, baseType: !168, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !430, file: !16, line: 92, baseType: !168, size: 32, offset: 8992)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !430, file: !16, line: 129, baseType: !466, size: 864, offset: 9024)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !16, line: 93, size: 864, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !466, file: !16, line: 95, baseType: !168, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !466, file: !16, line: 96, baseType: !168, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !466, file: !16, line: 97, baseType: !168, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !466, file: !16, line: 99, baseType: !168, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !466, file: !16, line: 100, baseType: !168, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !466, file: !16, line: 102, baseType: !168, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !466, file: !16, line: 103, baseType: !168, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !466, file: !16, line: 104, baseType: !168, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !466, file: !16, line: 105, baseType: !168, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !466, file: !16, line: 106, baseType: !168, size: 32, offset: 288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !466, file: !16, line: 107, baseType: !168, size: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !466, file: !16, line: 108, baseType: !168, size: 32, offset: 352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !466, file: !16, line: 110, baseType: !168, size: 32, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !466, file: !16, line: 111, baseType: !168, size: 32, offset: 416)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !466, file: !16, line: 112, baseType: !168, size: 32, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !466, file: !16, line: 114, baseType: !168, size: 32, offset: 480)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !466, file: !16, line: 115, baseType: !168, size: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !466, file: !16, line: 116, baseType: !168, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !466, file: !16, line: 117, baseType: !168, size: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !466, file: !16, line: 119, baseType: !168, size: 32, offset: 608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !466, file: !16, line: 120, baseType: !168, size: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !466, file: !16, line: 121, baseType: !168, size: 32, offset: 672)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !466, file: !16, line: 122, baseType: !168, size: 32, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !466, file: !16, line: 123, baseType: !168, size: 32, offset: 736)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !466, file: !16, line: 124, baseType: !168, size: 32, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !466, file: !16, line: 125, baseType: !168, size: 32, offset: 800)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !466, file: !16, line: 126, baseType: !168, size: 32, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !430, file: !16, line: 131, baseType: !168, size: 32, offset: 9888)
!496 = !{!497}
!497 = !DISubrange(count: 1)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !231, file: !27, line: 288, baseType: !499, size: 64, offset: 25600)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !231, file: !27, line: 289, baseType: !501, size: 960, offset: 25664)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 960, elements: !496)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !16, line: 165, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 135, size: 960, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !503, file: !16, line: 137, baseType: !168, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !503, file: !16, line: 138, baseType: !168, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !503, file: !16, line: 140, baseType: !168, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !503, file: !16, line: 142, baseType: !168, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !503, file: !16, line: 143, baseType: !168, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !503, file: !16, line: 145, baseType: !168, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !503, file: !16, line: 146, baseType: !168, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !503, file: !16, line: 148, baseType: !168, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !503, file: !16, line: 149, baseType: !168, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !503, file: !16, line: 151, baseType: !168, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !503, file: !16, line: 152, baseType: !168, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !503, file: !16, line: 154, baseType: !168, size: 32, offset: 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !503, file: !16, line: 156, baseType: !168, size: 32, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !503, file: !16, line: 157, baseType: !168, size: 32, offset: 416)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !503, file: !16, line: 158, baseType: !168, size: 32, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !503, file: !16, line: 160, baseType: !168, size: 32, offset: 480)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !503, file: !16, line: 162, baseType: !168, size: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !503, file: !16, line: 163, baseType: !523, size: 384, offset: 576)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 384, elements: !525)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!525 = !{!526}
!526 = !DISubrange(count: 6)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !231, file: !27, line: 290, baseType: !528, size: 64, offset: 26624)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !231, file: !27, line: 291, baseType: !168, size: 32, offset: 26688)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !231, file: !27, line: 294, baseType: !531, size: 256, offset: 26752)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 256, elements: !536)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 512, elements: !534)
!534 = !{!535, !535}
!535 = !DISubrange(count: 4)
!536 = !{!535}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !231, file: !27, line: 295, baseType: !538, size: 128, offset: 27008)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 128, elements: !330)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 2048, elements: !541)
!541 = !{!400, !400}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !231, file: !27, line: 297, baseType: !543, size: 256, offset: 27136)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 256, elements: !536)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 512, elements: !186)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !231, file: !27, line: 298, baseType: !547, size: 128, offset: 27392)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 128, elements: !330)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 2048, elements: !179)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !231, file: !27, line: 300, baseType: !551, size: 256, offset: 27520)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 256, elements: !536)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 256, elements: !186)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !231, file: !27, line: 301, baseType: !555, size: 128, offset: 27776)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 128, elements: !330)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 1024, elements: !179)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !231, file: !27, line: 302, baseType: !551, size: 256, offset: 27904)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !231, file: !27, line: 303, baseType: !555, size: 128, offset: 28160)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !231, file: !27, line: 305, baseType: !524, size: 64, offset: 28288)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !231, file: !27, line: 307, baseType: !562, size: 4096, align: 128, offset: 28416)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 4096, elements: !563)
!563 = !{!331, !180}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !231, file: !27, line: 308, baseType: !565, size: 2048, align: 128, offset: 32512)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 2048, elements: !563)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !231, file: !27, line: 309, baseType: !567, size: 64, offset: 34560)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !330)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !231, file: !27, line: 312, baseType: !569, size: 3072, offset: 34624)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !27, line: 209, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 159, size: 3072, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !600, !601, !602, !603, !604, !605, !606, !607}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !570, file: !27, line: 161, baseType: !499, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !570, file: !27, line: 162, baseType: !528, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !570, file: !27, line: 164, baseType: !168, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !570, file: !27, line: 165, baseType: !168, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !570, file: !27, line: 166, baseType: !168, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !570, file: !27, line: 168, baseType: !168, size: 32, offset: 224)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !570, file: !27, line: 170, baseType: !168, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !570, file: !27, line: 172, baseType: !168, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !570, file: !27, line: 173, baseType: !168, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !570, file: !27, line: 174, baseType: !168, size: 32, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !570, file: !27, line: 176, baseType: !168, size: 32, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !570, file: !27, line: 178, baseType: !168, size: 32, offset: 416)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !570, file: !27, line: 179, baseType: !168, size: 32, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !570, file: !27, line: 181, baseType: !329, size: 64, offset: 480)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !570, file: !27, line: 182, baseType: !168, size: 32, offset: 544)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !570, file: !27, line: 184, baseType: !168, size: 32, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !570, file: !27, line: 186, baseType: !168, size: 32, offset: 608)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !570, file: !27, line: 187, baseType: !168, size: 32, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !570, file: !27, line: 188, baseType: !168, size: 32, offset: 672)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !570, file: !27, line: 190, baseType: !168, size: 32, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !570, file: !27, line: 191, baseType: !168, size: 32, offset: 736)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !570, file: !27, line: 195, baseType: !594, size: 2048, offset: 768)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 2048, elements: !599)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !570, file: !27, line: 192, size: 64, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !595, file: !27, line: 193, baseType: !168, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !595, file: !27, line: 194, baseType: !168, size: 32, offset: 32)
!599 = !{!331, !187}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !570, file: !27, line: 197, baseType: !168, size: 32, offset: 2816)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !570, file: !27, line: 199, baseType: !168, size: 32, offset: 2848)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !570, file: !27, line: 200, baseType: !168, size: 32, offset: 2880)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !570, file: !27, line: 201, baseType: !168, size: 32, offset: 2912)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !570, file: !27, line: 202, baseType: !168, size: 32, offset: 2944)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !570, file: !27, line: 205, baseType: !168, size: 32, offset: 2976)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !570, file: !27, line: 206, baseType: !168, size: 32, offset: 3008)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !570, file: !27, line: 207, baseType: !168, size: 32, offset: 3040)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !231, file: !27, line: 315, baseType: !609, size: 4096, offset: 37760)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !610, line: 46, baseType: !611)
!610 = !DIFile(filename: "./common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 27, size: 4096, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !611, file: !610, line: 30, baseType: !168, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !611, file: !610, line: 31, baseType: !168, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !611, file: !610, line: 34, baseType: !168, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !611, file: !610, line: 35, baseType: !168, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !611, file: !610, line: 37, baseType: !398, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !611, file: !610, line: 38, baseType: !398, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !611, file: !610, line: 39, baseType: !398, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !611, file: !610, line: 42, baseType: !168, size: 32, align: 128, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !611, file: !610, line: 45, baseType: !622, size: 3680, offset: 416)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 3680, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 460)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !231, file: !27, line: 340, baseType: !626, size: 31808, offset: 41856)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !27, line: 317, size: 31808, elements: !627)
!627 = !{!628, !769, !770, !774, !775, !777, !778, !779, !780, !781, !782, !783}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !626, file: !27, line: 320, baseType: !629, size: 4288)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 4288, elements: !767)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !632, line: 94, baseType: !633)
!632 = !DIFile(filename: "./common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !632, line: 31, size: 51648, elements: !634)
!634 = !{!635, !636, !637, !638, !641, !642, !643, !644, !645, !646, !647, !651, !652, !653, !654, !655, !656, !658, !660, !661, !662, !663, !664, !669, !673, !677, !680, !682, !683, !685, !686, !690, !691, !692, !695, !697, !698, !699, !700, !702, !703, !704, !705, !706, !707, !735}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !633, file: !632, line: 34, baseType: !168, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !633, file: !632, line: 35, baseType: !168, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !633, file: !632, line: 36, baseType: !168, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !633, file: !632, line: 37, baseType: !639, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !147, line: 27, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !149, line: 44, baseType: !414)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !633, file: !632, line: 38, baseType: !168, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !633, file: !632, line: 39, baseType: !168, size: 32, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !633, file: !632, line: 40, baseType: !168, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !633, file: !632, line: 41, baseType: !326, size: 32, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !633, file: !632, line: 42, baseType: !326, size: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !633, file: !632, line: 45, baseType: !168, size: 32, offset: 352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !633, file: !632, line: 46, baseType: !648, size: 96, offset: 384)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 96, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 3)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !633, file: !632, line: 47, baseType: !648, size: 96, offset: 480)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !633, file: !632, line: 48, baseType: !648, size: 96, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !633, file: !632, line: 49, baseType: !168, size: 32, offset: 672)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !633, file: !632, line: 50, baseType: !168, size: 32, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !633, file: !632, line: 51, baseType: !168, size: 32, offset: 736)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !633, file: !632, line: 52, baseType: !657, size: 192, offset: 768)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 192, elements: !649)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !633, file: !632, line: 53, baseType: !659, size: 256, offset: 960)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 256, elements: !536)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !633, file: !632, line: 54, baseType: !659, size: 256, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !633, file: !632, line: 55, baseType: !155, size: 64, offset: 1472)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !633, file: !632, line: 59, baseType: !659, size: 256, offset: 1536)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !633, file: !632, line: 60, baseType: !659, size: 256, offset: 1792)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !633, file: !632, line: 63, baseType: !665, size: 64, offset: 2048)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !147, line: 24, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !149, line: 37, baseType: !668)
!668 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !633, file: !632, line: 64, baseType: !670, size: 128, offset: 2112)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 128, elements: !330)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 32, elements: !330)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !633, file: !632, line: 65, baseType: !674, size: 2176, offset: 2240)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 2176, elements: !675)
!675 = !{!331, !676}
!676 = !DISubrange(count: 17)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !633, file: !632, line: 66, baseType: !678, size: 2176, offset: 4416)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 2176, elements: !675)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !633, file: !632, line: 67, baseType: !681, size: 128, offset: 6592)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 128, elements: !330)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !633, file: !632, line: 68, baseType: !329, size: 64, offset: 6720)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !633, file: !632, line: 69, baseType: !684, size: 1024, offset: 6784)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1024, elements: !599)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !633, file: !632, line: 70, baseType: !545, size: 512, offset: 7808)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !633, file: !632, line: 75, baseType: !687, size: 10368, offset: 8320)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 10368, elements: !688)
!688 = !{!689, !689}
!689 = !DISubrange(count: 18)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !633, file: !632, line: 76, baseType: !687, size: 10368, offset: 18688)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !633, file: !632, line: 77, baseType: !168, size: 32, offset: 29056)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !633, file: !632, line: 78, baseType: !693, size: 576, offset: 29088)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 576, elements: !694)
!694 = !{!689}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !633, file: !632, line: 79, baseType: !696, size: 20736, offset: 29696)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 20736, elements: !688)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !633, file: !632, line: 80, baseType: !679, size: 64, offset: 50432)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !633, file: !632, line: 81, baseType: !679, size: 64, offset: 50496)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !633, file: !632, line: 82, baseType: !679, size: 64, offset: 50560)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !633, file: !632, line: 83, baseType: !701, size: 64, offset: 50624)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !633, file: !632, line: 84, baseType: !168, size: 32, offset: 50688)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !633, file: !632, line: 85, baseType: !155, size: 64, offset: 50752)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !633, file: !632, line: 86, baseType: !155, size: 64, offset: 50816)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !633, file: !632, line: 89, baseType: !168, size: 32, offset: 50880)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !633, file: !632, line: 90, baseType: !168, size: 32, offset: 50912)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !633, file: !632, line: 91, baseType: !708, size: 320, offset: 50944)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !382, line: 72, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !382, line: 67, size: 320, elements: !710)
!710 = !{!711, !730, !734}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !709, file: !382, line: 69, baseType: !712, size: 320)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !713, line: 22, size: 320, elements: !714)
!713 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !712, file: !713, line: 24, baseType: !168, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !712, file: !713, line: 25, baseType: !7, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !712, file: !713, line: 26, baseType: !168, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !712, file: !713, line: 28, baseType: !7, size: 32, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !712, file: !713, line: 32, baseType: !168, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !712, file: !713, line: 34, baseType: !150, size: 16, offset: 160)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !712, file: !713, line: 35, baseType: !150, size: 16, offset: 176)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !712, file: !713, line: 36, baseType: !723, size: 128, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !724, line: 55, baseType: !725)
!724 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !724, line: 51, size: 128, elements: !726)
!726 = !{!727, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !725, file: !724, line: 53, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !725, file: !724, line: 54, baseType: !728, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !709, file: !382, line: 70, baseType: !731, size: 320)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 320, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 40)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !709, file: !382, line: 71, baseType: !414, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !633, file: !632, line: 92, baseType: !736, size: 384, offset: 51264)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !382, line: 80, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !382, line: 75, size: 384, elements: !738)
!738 = !{!739, !761, !765}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !737, file: !382, line: 77, baseType: !740, size: 384)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !724, line: 94, size: 384, elements: !741)
!741 = !{!742, !754, !755, !757, !758, !759, !760}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !740, file: !724, line: 96, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !744, line: 33, baseType: !745)
!744 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !744, line: 25, size: 64, elements: !746)
!746 = !{!747, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !745, file: !744, line: 27, baseType: !748, size: 64)
!748 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !745, file: !744, line: 32, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !745, file: !744, line: 28, size: 64, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !750, file: !744, line: 30, baseType: !7, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !750, file: !744, line: 31, baseType: !7, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !740, file: !724, line: 97, baseType: !743, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !740, file: !724, line: 98, baseType: !756, size: 64, offset: 128)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !330)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !740, file: !724, line: 99, baseType: !756, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !740, file: !724, line: 100, baseType: !7, size: 32, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !740, file: !724, line: 101, baseType: !7, size: 32, offset: 288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !740, file: !724, line: 102, baseType: !756, size: 64, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !737, file: !382, line: 78, baseType: !762, size: 384)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 384, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 48)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !737, file: !382, line: 79, baseType: !766, size: 64)
!766 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!767 = !{!768}
!768 = !DISubrange(count: 67)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !626, file: !27, line: 322, baseType: !629, size: 4288, offset: 4288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !626, file: !27, line: 324, baseType: !771, size: 21760, offset: 8576)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 21760, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 340)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !626, file: !27, line: 326, baseType: !630, size: 64, offset: 30336)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !626, file: !27, line: 329, baseType: !776, size: 1152, offset: 30400)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 1152, elements: !694)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !626, file: !27, line: 331, baseType: !168, size: 32, offset: 31552)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !626, file: !27, line: 333, baseType: !168, size: 32, offset: 31584)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !626, file: !27, line: 335, baseType: !168, size: 32, offset: 31616)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !626, file: !27, line: 336, baseType: !168, size: 32, offset: 31648)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !626, file: !27, line: 337, baseType: !168, size: 32, offset: 31680)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !626, file: !27, line: 338, baseType: !168, size: 32, offset: 31712)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !626, file: !27, line: 339, baseType: !168, size: 32, offset: 31744)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !231, file: !27, line: 343, baseType: !630, size: 64, offset: 73664)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !231, file: !27, line: 346, baseType: !630, size: 64, offset: 73728)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !231, file: !27, line: 349, baseType: !168, size: 32, offset: 73792)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !231, file: !27, line: 350, baseType: !788, size: 1216, offset: 73856)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 1216, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 19)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !231, file: !27, line: 351, baseType: !168, size: 32, offset: 75072)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !231, file: !27, line: 352, baseType: !788, size: 1216, offset: 75136)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !231, file: !27, line: 353, baseType: !329, size: 64, offset: 76352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !231, file: !27, line: 365, baseType: !795, size: 10624, offset: 76416)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !27, line: 358, size: 10624, elements: !796)
!796 = !{!797, !799, !802, !805}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !795, file: !27, line: 360, baseType: !798, size: 256, align: 128)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 256, elements: !186)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !795, file: !27, line: 361, baseType: !800, size: 128, align: 128, offset: 256)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 128, elements: !801)
!801 = !{!331, !535}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !795, file: !27, line: 363, baseType: !803, size: 4096, align: 128, offset: 384)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 4096, elements: !804)
!804 = !{!535, !180}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !795, file: !27, line: 364, baseType: !806, size: 6144, align: 128, offset: 4480)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 6144, elements: !807)
!807 = !{!808, !187}
!808 = !DISubrange(count: 24)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !231, file: !27, line: 544, baseType: !810, size: 80128, offset: 87040)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !27, line: 368, size: 80128, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !838, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !852, !856, !857, !858, !859, !860, !864, !865, !866, !869, !871, !872, !873, !875, !876, !877, !878, !879, !880, !881, !882, !923, !943, !944, !945, !946, !947, !948, !949, !950, !951, !954, !957, !959}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !810, file: !27, line: 370, baseType: !168, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !810, file: !27, line: 373, baseType: !168, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !810, file: !27, line: 374, baseType: !168, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !810, file: !27, line: 375, baseType: !168, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !810, file: !27, line: 378, baseType: !168, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !810, file: !27, line: 379, baseType: !168, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !810, file: !27, line: 380, baseType: !168, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !810, file: !27, line: 381, baseType: !168, size: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !810, file: !27, line: 382, baseType: !168, size: 32, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !810, file: !27, line: 385, baseType: !168, size: 32, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !810, file: !27, line: 386, baseType: !168, size: 32, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !810, file: !27, line: 387, baseType: !168, size: 32, offset: 352)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !810, file: !27, line: 388, baseType: !168, size: 32, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !810, file: !27, line: 389, baseType: !168, size: 32, offset: 416)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !810, file: !27, line: 390, baseType: !168, size: 32, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !810, file: !27, line: 391, baseType: !168, size: 32, offset: 480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !810, file: !27, line: 393, baseType: !168, size: 32, offset: 512)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !810, file: !27, line: 396, baseType: !329, size: 64, offset: 544)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !810, file: !27, line: 397, baseType: !329, size: 64, offset: 608)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !810, file: !27, line: 400, baseType: !329, size: 64, offset: 672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !810, file: !27, line: 401, baseType: !329, size: 64, offset: 736)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !810, file: !27, line: 403, baseType: !329, size: 64, offset: 800)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !810, file: !27, line: 404, baseType: !329, size: 64, offset: 864)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !810, file: !27, line: 407, baseType: !7, size: 32, offset: 928)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !810, file: !27, line: 408, baseType: !837, size: 128, offset: 960)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !536)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !810, file: !27, line: 409, baseType: !839, size: 512, offset: 1088)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !186)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !810, file: !27, line: 410, baseType: !168, size: 32, offset: 1600)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !810, file: !27, line: 411, baseType: !168, size: 32, offset: 1632)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !810, file: !27, line: 412, baseType: !168, size: 32, offset: 1664)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !810, file: !27, line: 413, baseType: !168, size: 32, offset: 1696)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !810, file: !27, line: 414, baseType: !168, size: 32, offset: 1728)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !810, file: !27, line: 415, baseType: !168, size: 32, offset: 1760)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !810, file: !27, line: 422, baseType: !665, size: 64, offset: 1792)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !810, file: !27, line: 423, baseType: !665, size: 64, offset: 1856)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !810, file: !27, line: 424, baseType: !145, size: 64, offset: 1920)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !810, file: !27, line: 425, baseType: !850, size: 64, offset: 1984)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 64, elements: !399)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !810, file: !27, line: 427, baseType: !853, size: 64, offset: 2048)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 192, elements: !855)
!855 = !{!808}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !810, file: !27, line: 428, baseType: !665, size: 64, offset: 2112)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !810, file: !27, line: 429, baseType: !670, size: 128, offset: 2176)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !810, file: !27, line: 430, baseType: !670, size: 128, offset: 2304)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !810, file: !27, line: 431, baseType: !681, size: 128, offset: 2432)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !810, file: !27, line: 432, baseType: !861, size: 4096, offset: 2560)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 4096, elements: !862)
!862 = !{!331, !863}
!863 = !DISubrange(count: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !810, file: !27, line: 433, baseType: !665, size: 64, offset: 6656)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !810, file: !27, line: 434, baseType: !665, size: 64, offset: 6720)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !810, file: !27, line: 435, baseType: !867, size: 384, offset: 6784)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 384, elements: !868)
!868 = !{!331, !650}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !810, file: !27, line: 436, baseType: !870, size: 64, offset: 7168)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !810, file: !27, line: 439, baseType: !168, size: 32, offset: 7232)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !810, file: !27, line: 440, baseType: !168, size: 32, offset: 7264)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !810, file: !27, line: 441, baseType: !874, size: 128, offset: 7296)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, elements: !536)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !810, file: !27, line: 442, baseType: !168, size: 32, offset: 7424)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !810, file: !27, line: 444, baseType: !168, size: 32, offset: 7456)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !810, file: !27, line: 445, baseType: !168, size: 32, offset: 7488)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !810, file: !27, line: 447, baseType: !168, size: 32, offset: 7520)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !810, file: !27, line: 448, baseType: !168, size: 32, offset: 7552)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !810, file: !27, line: 454, baseType: !168, size: 32, offset: 7584)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !810, file: !27, line: 457, baseType: !168, size: 32, offset: 7616)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !810, file: !27, line: 498, baseType: !883, size: 57344, offset: 7680)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !27, line: 459, size: 57344, elements: !884)
!884 = !{!885, !889, !893, !895, !896, !899, !903, !904, !907, !908, !909, !912, !913, !914, !915, !916, !917, !920, !922}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !883, file: !27, line: 464, baseType: !886, size: 3072, align: 128)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 3072, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !883, file: !27, line: 465, baseType: !890, size: 6912, align: 128, offset: 3072)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 6912, elements: !891)
!891 = !{!892}
!892 = !DISubrange(count: 864)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !883, file: !27, line: 468, baseType: !894, size: 2048, align: 128, offset: 9984)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 2048, elements: !447)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !883, file: !27, line: 469, baseType: !894, size: 2048, align: 128, offset: 12032)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !883, file: !27, line: 470, baseType: !897, size: 3072, align: 128, offset: 14080)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 3072, elements: !898)
!898 = !{!650, !180}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !883, file: !27, line: 471, baseType: !900, size: 3840, align: 128, offset: 17152)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 3840, elements: !901)
!901 = !{!902, !187}
!902 = !DISubrange(count: 15)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !883, file: !27, line: 474, baseType: !803, size: 4096, align: 128, offset: 20992)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !883, file: !27, line: 475, baseType: !905, size: 4096, align: 128, offset: 25088)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 4096, elements: !906)
!906 = !{!187, !187}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !883, file: !27, line: 478, baseType: !533, size: 512, offset: 29184)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !883, file: !27, line: 479, baseType: !168, size: 32, offset: 29696)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !883, file: !27, line: 480, baseType: !910, size: 128, offset: 29728)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, elements: !911)
!911 = !{!331, !331}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !883, file: !27, line: 481, baseType: !168, size: 32, offset: 29856)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !883, file: !27, line: 484, baseType: !657, size: 192, offset: 29888)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !883, file: !27, line: 486, baseType: !657, size: 192, offset: 30080)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !883, file: !27, line: 489, baseType: !657, size: 192, offset: 30272)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !883, file: !27, line: 492, baseType: !329, size: 64, offset: 30464)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !883, file: !27, line: 493, baseType: !918, size: 24576, offset: 30528)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 24576, elements: !919)
!919 = !{!331, !863, !526}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !883, file: !27, line: 494, baseType: !921, size: 2048, offset: 55104)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 2048, elements: !599)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !883, file: !27, line: 497, baseType: !648, size: 96, offset: 57152)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !810, file: !27, line: 526, baseType: !924, size: 12032, offset: 65024)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !27, line: 501, size: 12032, elements: !925)
!925 = !{!926, !928, !930, !933, !936, !937, !938, !939, !940, !941, !942}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !924, file: !27, line: 504, baseType: !927, size: 384)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 384, elements: !763)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !924, file: !27, line: 507, baseType: !929, size: 384, offset: 384)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 384, elements: !763)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !924, file: !27, line: 510, baseType: !931, size: 768, align: 32, offset: 768)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 768, elements: !932)
!932 = !{!331, !764}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !924, file: !27, line: 513, baseType: !934, size: 3072, align: 128, offset: 1536)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 3072, elements: !935)
!935 = !{!331, !764, !331}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !924, file: !27, line: 514, baseType: !934, size: 3072, align: 64, offset: 4608)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !924, file: !27, line: 517, baseType: !927, size: 384, align: 32, offset: 7680)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !924, file: !27, line: 519, baseType: !934, size: 3072, align: 128, offset: 8064)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !924, file: !27, line: 520, baseType: !931, size: 768, align: 32, offset: 11136)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !924, file: !27, line: 521, baseType: !672, size: 32, align: 32, offset: 11904)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !924, file: !27, line: 524, baseType: !168, size: 32, offset: 11936)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !924, file: !27, line: 525, baseType: !168, size: 32, offset: 11968)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !810, file: !27, line: 529, baseType: !168, size: 32, offset: 77056)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !810, file: !27, line: 530, baseType: !168, size: 32, offset: 77088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !810, file: !27, line: 531, baseType: !168, size: 32, offset: 77120)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !810, file: !27, line: 532, baseType: !168, size: 32, offset: 77152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !810, file: !27, line: 533, baseType: !168, size: 32, offset: 77184)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !810, file: !27, line: 534, baseType: !168, size: 32, offset: 77216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !810, file: !27, line: 535, baseType: !168, size: 32, offset: 77248)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !810, file: !27, line: 536, baseType: !168, size: 32, offset: 77280)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !810, file: !27, line: 539, baseType: !952, size: 512, offset: 77312)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 512, elements: !953)
!953 = !{!187, !331}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !810, file: !27, line: 540, baseType: !955, size: 2048, offset: 77824)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 2048, elements: !956)
!956 = !{!863, !535}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !810, file: !27, line: 542, baseType: !958, size: 16, offset: 79872)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 16, elements: !330)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !810, file: !27, line: 543, baseType: !960, size: 128, offset: 79888)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 128, elements: !186)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !231, file: !27, line: 547, baseType: !962, size: 64, offset: 167168)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !27, line: 248, baseType: !964)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !27, line: 248, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !231, file: !27, line: 604, baseType: !966, size: 23936, offset: 167232)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !27, line: 550, size: 23936, elements: !967)
!967 = !{!968, !993, !997, !999, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1011, !1013, !1015, !1018, !1019}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !966, file: !27, line: 579, baseType: !969, size: 3904)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !966, file: !27, line: 553, size: 3904, elements: !970)
!970 = !{!971, !972, !973, !974, !976, !977, !978, !979, !980, !982, !985, !986, !987, !988, !989, !991}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !969, file: !27, line: 556, baseType: !168, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !969, file: !27, line: 558, baseType: !168, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !969, file: !27, line: 560, baseType: !168, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !969, file: !27, line: 562, baseType: !975, size: 608, offset: 96)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 608, elements: !789)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !969, file: !27, line: 563, baseType: !168, size: 32, offset: 704)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !969, file: !27, line: 564, baseType: !168, size: 32, offset: 736)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !969, file: !27, line: 565, baseType: !168, size: 32, offset: 768)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !969, file: !27, line: 566, baseType: !329, size: 64, offset: 800)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !969, file: !27, line: 567, baseType: !981, size: 2048, offset: 864)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 2048, elements: !862)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !969, file: !27, line: 568, baseType: !983, size: 544, offset: 2912)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 544, elements: !984)
!984 = !{!676}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !969, file: !27, line: 571, baseType: !168, size: 32, offset: 3456)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !969, file: !27, line: 572, baseType: !168, size: 32, offset: 3488)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !969, file: !27, line: 573, baseType: !168, size: 32, offset: 3520)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !969, file: !27, line: 575, baseType: !329, size: 64, offset: 3552)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !969, file: !27, line: 577, baseType: !990, size: 192, offset: 3648)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 192, elements: !649)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !969, file: !27, line: 578, baseType: !992, size: 64, offset: 3840)
!992 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !966, file: !27, line: 584, baseType: !994, size: 160, offset: 3904)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 160, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 5)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !966, file: !27, line: 585, baseType: !998, size: 320, offset: 4096)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 320, elements: !995)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !966, file: !27, line: 586, baseType: !1000, size: 320, offset: 4416)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 320, elements: !995)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !966, file: !27, line: 587, baseType: !983, size: 544, offset: 4736)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !966, file: !27, line: 589, baseType: !998, size: 320, offset: 5312)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !966, file: !27, line: 590, baseType: !1000, size: 320, offset: 5632)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !966, file: !27, line: 591, baseType: !1000, size: 320, offset: 5952)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !966, file: !27, line: 592, baseType: !1000, size: 320, offset: 6272)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !966, file: !27, line: 593, baseType: !1000, size: 320, offset: 6592)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !966, file: !27, line: 594, baseType: !1000, size: 320, offset: 6912)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !966, file: !27, line: 596, baseType: !1009, size: 6080, offset: 7232)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 6080, elements: !1010)
!1010 = !{!996, !790}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !966, file: !27, line: 597, baseType: !1012, size: 2176, offset: 13312)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 2176, elements: !675)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !966, file: !27, line: 598, baseType: !1014, size: 128, offset: 15488)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 128, elements: !330)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !966, file: !27, line: 599, baseType: !1016, size: 8192, offset: 15616)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 8192, elements: !1017)
!1017 = !{!331, !331, !863}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !966, file: !27, line: 601, baseType: !329, size: 64, offset: 23808)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_frames", scope: !966, file: !27, line: 602, baseType: !329, size: 64, offset: 23872)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "predict_16x16", scope: !231, file: !27, line: 607, baseType: !1021, size: 448, offset: 191168)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 448, elements: !1026)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict_t", file: !35, line: 27, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !398}
!1026 = !{!1027}
!1027 = !DISubrange(count: 7)
