; ModuleID = 'matroska.c'
source_filename = "matroska.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mk_Context = type { ptr, ptr, ptr, ptr, i32, ptr, i32, i32 }
%struct.mk_Writer = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i64, i64, i64, i8, i8, i8 }

@.str = private unnamed_addr constant [3 x i8] c"wb\00", align 1, !dbg !0
@.str.2 = private unnamed_addr constant [25 x i8] c"Haali Matroska Writer b0\00", align 1, !dbg !7

; Function Attrs: nounwind uwtable
define dso_local ptr @mk_createWriter(ptr nocapture noundef readonly %0) local_unnamed_addr #0 !dbg !31 {
  call void @llvm.dbg.value(metadata ptr %0, metadata !137, metadata !DIExpression()), !dbg !139
  %2 = tail call dereferenceable_or_null(112) ptr @calloc(i64 1, i64 112), !dbg !140
  call void @llvm.dbg.value(metadata ptr %2, metadata !138, metadata !DIExpression()), !dbg !139
  %3 = icmp eq ptr %2, null, !dbg !141
  br i1 %3, label %34, label %4, !dbg !143

4:                                                ; preds = %1
  call void @llvm.dbg.value(metadata ptr %2, metadata !144, metadata !DIExpression()), !dbg !152
  call void @llvm.dbg.value(metadata ptr null, metadata !149, metadata !DIExpression()), !dbg !152
  call void @llvm.dbg.value(metadata i32 0, metadata !150, metadata !DIExpression()), !dbg !152
  %5 = tail call dereferenceable_or_null(56) ptr @calloc(i64 1, i64 56), !dbg !154

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "matroska.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "ba2b983c575f96f89498382ad6d5348c")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 3)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 25)
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !13, globals: !18, splitDebugInlining: false, nameTableKind: None)
!13 = !{!14, !15, !16, !17}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!16 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!18 = !{!0, !19, !7}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 9)
!24 = !{i32 7, !"Dwarf Version", i32 5}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{i32 8, !"PIC Level", i32 2}
!28 = !{i32 7, !"PIE Level", i32 2}
!29 = !{i32 7, !"uwtable", i32 2}
!30 = !{!"clang version 16.0.0"}
!31 = distinct !DISubprogram(name: "mk_createWriter", scope: !2, file: !2, line: 302, type: !32, scopeLine: 302, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !136)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !134}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_Writer", file: !36, line: 24, baseType: !37)
!36 = !DIFile(filename: "./matroska.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9c5d0a3c9bb78602e48a8524a1154b90")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_Writer", file: !2, line: 40, size: 896, elements: !38)
!38 = !{!39, !100, !102, !118, !119, !120, !121, !122, !126, !127, !128, !129, !130, !131, !132, !133}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !37, file: !2, line: 41, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !42, line: 7, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 49, size: 1728, elements: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!45 = !{!46, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !62, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !91, !95, !96}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !43, file: !44, line: 51, baseType: !47, size: 32)
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !43, file: !44, line: 54, baseType: !17, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !43, file: !44, line: 55, baseType: !17, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !43, file: !44, line: 56, baseType: !17, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !43, file: !44, line: 57, baseType: !17, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !43, file: !44, line: 58, baseType: !17, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !43, file: !44, line: 59, baseType: !17, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !43, file: !44, line: 60, baseType: !17, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !43, file: !44, line: 61, baseType: !17, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !43, file: !44, line: 64, baseType: !17, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !43, file: !44, line: 65, baseType: !17, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !43, file: !44, line: 66, baseType: !17, size: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !43, file: !44, line: 68, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !44, line: 36, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !43, file: !44, line: 70, baseType: !63, size: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !43, file: !44, line: 72, baseType: !47, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !43, file: !44, line: 73, baseType: !47, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !43, file: !44, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!69 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !43, file: !44, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !43, file: !44, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !43, file: !44, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !43, file: !44, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !44, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !43, file: !44, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !43, file: !44, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !44, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !43, file: !44, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !44, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !43, file: !44, line: 93, baseType: !63, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !43, file: !44, line: 94, baseType: !14, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !43, file: !44, line: 95, baseType: !92, size: 64, offset: 1472)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 46, baseType: !94)
!93 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!94 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !43, file: !44, line: 96, baseType: !47, size: 32, offset: 1536)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !43, file: !44, line: 98, baseType: !97, size: 160, offset: 1568)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 20)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "duration_ptr", scope: !37, file: !2, line: 43, baseType: !101, size: 32, offset: 64)
!101 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !37, file: !2, line: 45, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_Context", file: !2, line: 38, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_Context", file: !2, line: 29, size: 448, elements: !106)
!106 = !{!107, !109, !111, !112, !114, !115, !116, !117}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !2, line: 30, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !105, file: !2, line: 30, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !105, file: !2, line: 30, baseType: !108, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !105, file: !2, line: 31, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !2, line: 32, baseType: !101, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !2, line: 34, baseType: !14, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !105, file: !2, line: 35, baseType: !101, size: 32, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !105, file: !2, line: 35, baseType: !101, size: 32, offset: 416)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cluster", scope: !37, file: !2, line: 45, baseType: !103, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !37, file: !2, line: 45, baseType: !103, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !37, file: !2, line: 46, baseType: !103, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "actlist", scope: !37, file: !2, line: 47, baseType: !103, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "def_duration", scope: !37, file: !2, line: 49, baseType: !123, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !124, line: 27, baseType: !125)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !68, line: 44, baseType: !69)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "timescale", scope: !37, file: !2, line: 50, baseType: !123, size: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_tc_scaled", scope: !37, file: !2, line: 51, baseType: !123, size: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "frame_tc", scope: !37, file: !2, line: 52, baseType: !123, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev_frame_tc_scaled", scope: !37, file: !2, line: 52, baseType: !123, size: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_tc", scope: !37, file: !2, line: 52, baseType: !123, size: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "wrote_header", scope: !37, file: !2, line: 54, baseType: !4, size: 8, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "in_frame", scope: !37, file: !2, line: 54, baseType: !4, size: 8, offset: 840)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe", scope: !37, file: !2, line: 54, baseType: !4, size: 8, offset: 848)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!136 = !{!137, !138}
!137 = !DILocalVariable(name: "filename", arg: 1, scope: !31, file: !2, line: 302, type: !134)
!138 = !DILocalVariable(name: "w", scope: !31, file: !2, line: 303, type: !34)
!139 = !DILocation(line: 0, scope: !31)
!140 = !DILocation(line: 303, column: 18, scope: !31)
!141 = !DILocation(line: 304, column: 9, scope: !142)
!142 = distinct !DILexicalBlock(scope: !31, file: !2, line: 304, column: 7)
!143 = !DILocation(line: 304, column: 7, scope: !31)
!144 = !DILocalVariable(name: "w", arg: 1, scope: !145, file: !2, line: 57, type: !34)
!145 = distinct !DISubprogram(name: "mk_createContext", scope: !2, file: !2, line: 57, type: !146, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !148)
!146 = !DISubroutineType(types: !147)
!147 = !{!103, !34, !103, !101}
!148 = !{!144, !149, !150, !151}
!149 = !DILocalVariable(name: "parent", arg: 2, scope: !145, file: !2, line: 57, type: !103)
!150 = !DILocalVariable(name: "id", arg: 3, scope: !145, file: !2, line: 57, type: !101)
!151 = !DILocalVariable(name: "c", scope: !145, file: !2, line: 58, type: !103)
!152 = !DILocation(line: 0, scope: !145, inlinedAt: !153)
!153 = distinct !DILocation(line: 309, column: 13, scope: !31)
!154 = !DILocation(line: 64, column: 9, scope: !155, inlinedAt: !153)
!155 = distinct !DILexicalBlock(scope: !156, file: !2, line: 63, column: 10)
!156 = distinct !DILexicalBlock(scope: !145, file: !2, line: 60, column: 7)
!157 = !DILocation(line: 72, column: 6, scope: !145, inlinedAt: !153)
!158 = !DILocation(line: 72, column: 12, scope: !145, inlinedAt: !153)
!159 = !{!160, !161, i64 24}
!160 = !{!"mk_Context", !161, i64 0, !161, i64 8, !161, i64 16, !161, i64 24, !164, i64 32, !161, i64 40, !164, i64 48, !164, i64 52}
!161 = !{!"any pointer", !162, i64 0}
!162 = !{!"omnipotent char", !163, i64 0}
!163 = !{!"Simple C/C++ TBAA"}
!164 = !{!"int", !162, i64 0}
!165 = !DILocation(line: 75, column: 17, scope: !166, inlinedAt: !153)
!166 = distinct !DILexicalBlock(scope: !145, file: !2, line: 75, column: 7)
!167 = !DILocation(line: 78, column: 6, scope: !145, inlinedAt: !153)
!168 = !DILocation(line: 78, column: 11, scope: !145, inlinedAt: !153)
!169 = !{!160, !161, i64 8}
!170 = !DILocation(line: 79, column: 21, scope: !145, inlinedAt: !153)
!171 = !{!172, !161, i64 48}
!172 = !{!"mk_Writer", !161, i64 0, !164, i64 8, !161, i64 16, !161, i64 24, !161, i64 32, !161, i64 40, !161, i64 48, !173, i64 56, !173, i64 64, !173, i64 72, !173, i64 80, !173, i64 88, !173, i64 96, !162, i64 104, !162, i64 105, !162, i64 106}
!173 = !{!"long", !162, i64 0}
!174 = !DILocation(line: 309, column: 6, scope: !31)
!175 = !DILocation(line: 309, column: 11, scope: !31)
!176 = !{!172, !161, i64 16}
!177 = !DILocation(line: 315, column: 11, scope: !31)
!178 = !DILocation(line: 315, column: 9, scope: !31)
!179 = !{!172, !161, i64 0}
!180 = !DILocation(line: 316, column: 13, scope: !181)
!181 = distinct !DILexicalBlock(scope: !31, file: !2, line: 316, column: 7)
!182 = !DILocation(line: 316, column: 7, scope: !31)
!183 = !DILocation(line: 60, column: 10, scope: !156, inlinedAt: !153)
!184 = !DILocalVariable(name: "w", arg: 1, scope: !185, file: !2, line: 191, type: !34)
!185 = distinct !DISubprogram(name: "mk_destroyContexts", scope: !2, file: !2, line: 191, type: !186, scopeLine: 191, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !188)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !34}
!188 = !{!184, !189, !190}
!189 = !DILocalVariable(name: "cur", scope: !185, file: !2, line: 192, type: !103)
