; ModuleID = 'common/x86/mc-c.c'
source_filename = "common/x86/mc-c.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_mc_functions_t = type { ptr, ptr, ptr, [10 x ptr], [7 x ptr], ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@hpel_ref0 = internal unnamed_addr constant [16 x i32] [i32 0, i32 1, i32 1, i32 1, i32 0, i32 1, i32 1, i32 1, i32 2, i32 3, i32 3, i32 3, i32 0, i32 1, i32 1, i32 1], align 16, !dbg !0
@hpel_ref1 = internal unnamed_addr constant [16 x i32] [i32 0, i32 0, i32 0, i32 0, i32 2, i32 2, i32 3, i32 2, i32 2, i32 2, i32 3, i32 2, i32 2, i32 2, i32 3, i32 2], align 16, !dbg !22
@x264_pixel_avg_wtab_mmxext = internal unnamed_addr constant [6 x ptr] [ptr null, ptr @x264_pixel_avg2_w4_mmxext, ptr @x264_pixel_avg2_w8_mmxext, ptr @x264_pixel_avg2_w12_mmxext, ptr @x264_pixel_avg2_w16_mmxext, ptr @x264_pixel_avg2_w20_mmxext], align 16, !dbg !29
@x264_mc_copy_wtab_mmx = internal unnamed_addr constant [5 x ptr] [ptr null, ptr @x264_mc_copy_w4_mmx, ptr @x264_mc_copy_w8_mmx, ptr null, ptr @x264_mc_copy_w16_mmx], align 16, !dbg !44
@x264_pixel_avg_wtab_sse2 = internal unnamed_addr constant [6 x ptr] [ptr null, ptr @x264_pixel_avg2_w4_mmxext, ptr @x264_pixel_avg2_w8_mmxext, ptr @x264_pixel_avg2_w16_sse2, ptr @x264_pixel_avg2_w16_sse2, ptr @x264_pixel_avg2_w20_sse2], align 16, !dbg !53

!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !21, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "common/x86/mc-c.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "b3fbcb41a4bfcc64fb8689e8a951dd43")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./common/pixel.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "aba138e44f0e52bc0158be0d182b79c1")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!10 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!11 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!12 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!13 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!14 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!15 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!16 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!17 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!18 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!19 = !{!20}
!20 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!21 = !{!0, !22, !29, !44, !53, !55, !57, !59}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "hpel_ref1", scope: !2, file: !3, line: 127, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, elements: !27)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28}
!28 = !DISubrange(count: 16)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "x264_pixel_avg_wtab_mmxext", scope: !2, file: !3, line: 104, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 384, elements: !42)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36, !26, !36, !26, !36, !26}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !38, line: 24, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !40, line: 38, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !{!43}
!43 = !DISubrange(count: 6)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "x264_mc_copy_wtab_mmx", scope: !2, file: !3, line: 123, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 320, elements: !51)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !36, !26, !36, !26, !26}
!51 = !{!52}
!52 = !DISubrange(count: 5)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "x264_pixel_avg_wtab_sse2", scope: !2, file: !3, line: 109, type: !31, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "x264_mc_copy_wtab_sse2", scope: !2, file: !3, line: 124, type: !46, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "x264_pixel_avg_wtab_cache64_sse2", scope: !2, file: !3, line: 111, type: !31, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "x264_pixel_avg_wtab_sse2_misalign", scope: !2, file: !3, line: 110, type: !31, isLocal: true, isDefinition: true)
!61 = !{i32 7, !"Dwarf Version", i32 5}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{i32 1, !"wchar_size", i32 4}
!64 = !{i32 8, !"PIC Level", i32 2}
!65 = !{i32 7, !"PIE Level", i32 2}
!66 = !{i32 7, !"uwtable", i32 2}
!67 = !{!"clang version 16.0.0"}
!68 = distinct !DISubprogram(name: "x264_mc_init_mmx", scope: !3, file: !3, line: 234, type: !69, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !133)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !26, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_mc_functions_t", file: !73, line: 71, baseType: !74)
!73 = !DIFile(filename: "./common/mc.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "d49d7420aafa05a86bee506aef111ff0")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 31, size: 1792, elements: !75)
!75 = !{!76, !81, !86, !90, !97, !101, !102, !106, !110, !111, !115, !125, !129}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mc_luma", scope: !74, file: !73, line: 33, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !36, !26, !80, !26, !26, !26, !26, !26}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "get_ref", scope: !74, file: !73, line: 38, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!36, !36, !85, !80, !26, !26, !26, !26, !26}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mc_chroma", scope: !74, file: !73, line: 44, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !36, !26, !36, !26, !26, !26, !26, !26}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !74, file: !73, line: 48, baseType: !91, size: 640, offset: 192)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 640, elements: !95)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !36, !26, !36, !26, !36, !26, !26}
!95 = !{!96}
!96 = !DISubrange(count: 10)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !74, file: !73, line: 51, baseType: !98, size: 448, offset: 832)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 448, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 7)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "copy_16x16_unaligned", scope: !74, file: !73, line: 52, baseType: !48, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "plane_copy", scope: !74, file: !73, line: 54, baseType: !103, size: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !36, !26, !36, !26, !26, !26}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hpel_filter", scope: !74, file: !73, line: 57, baseType: !107, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !36, !36, !36, !36, !26, !26, !26}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prefetch_fenc", scope: !74, file: !73, line: 61, baseType: !48, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prefetch_ref", scope: !74, file: !73, line: 64, baseType: !112, size: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !36, !26, !26}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "memcpy_aligned", scope: !74, file: !73, line: 66, baseType: !116, size: 64, offset: 1600)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !119, !120, !122}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 46, baseType: !124)
!123 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!124 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "memzero_aligned", scope: !74, file: !73, line: 67, baseType: !126, size: 64, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !119, !26}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "frame_init_lowres_core", scope: !74, file: !73, line: 69, baseType: !130, size: 64, offset: 1728)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !36, !36, !36, !36, !36, !26, !26, !26, !26}
!133 = !{!134, !135}
!134 = !DILocalVariable(name: "cpu", arg: 1, scope: !68, file: !3, line: 234, type: !26)
!135 = !DILocalVariable(name: "pf", arg: 2, scope: !68, file: !3, line: 234, type: !71)
!136 = !DILocation(line: 0, scope: !68)
!137 = !DILocation(line: 236, column: 14, scope: !138)
!138 = distinct !DILexicalBlock(scope: !68, file: !3, line: 236, column: 9)
!139 = !DILocation(line: 236, column: 9, scope: !68)
!140 = !DILocation(line: 239, column: 9, scope: !68)
!141 = !DILocation(line: 239, column: 30, scope: !68)
!142 = !{!143, !144, i64 160}
!143 = !{!"", !144, i64 0, !144, i64 8, !144, i64 16, !145, i64 24, !145, i64 104, !144, i64 160, !144, i64 168, !144, i64 176, !144, i64 184, !144, i64 192, !144, i64 200, !144, i64 208, !144, i64 216}
!144 = !{!"any pointer", !145, i64 0}
!145 = !{!"omnipotent char", !146, i64 0}
!146 = !{!"Simple C/C++ TBAA"}
!147 = !DILocation(line: 240, column: 9, scope: !68)
!148 = !DILocation(line: 240, column: 27, scope: !68)
!149 = !{!144, !144, i64 0}
!150 = !DILocation(line: 241, column: 5, scope: !68)
!151 = !DILocation(line: 241, column: 27, scope: !68)
!152 = !DILocation(line: 242, column: 5, scope: !68)
!153 = !DILocation(line: 242, column: 27, scope: !68)
!154 = !DILocation(line: 243, column: 9, scope: !68)
!155 = !DILocation(line: 243, column: 24, scope: !68)
!156 = !{!143, !144, i64 200}
!157 = !DILocation(line: 244, column: 9, scope: !68)
!158 = !DILocation(line: 244, column: 25, scope: !68)
!159 = !{!143, !144, i64 208}
!160 = !DILocation(line: 246, column: 14, scope: !161)
!161 = distinct !DILexicalBlock(scope: !68, file: !3, line: 246, column: 9)
!162 = !DILocation(line: 246, column: 9, scope: !68)
!163 = !DILocation(line: 249, column: 17, scope: !68)
!164 = !{!143, !144, i64 0}
!165 = !DILocation(line: 250, column: 9, scope: !68)
!166 = !DILocation(line: 250, column: 17, scope: !68)
!167 = !{!143, !144, i64 8}
!168 = !DILocation(line: 251, column: 9, scope: !68)
!169 = !DILocation(line: 251, column: 19, scope: !68)
!170 = !{!143, !144, i64 16}
!171 = !DILocation(line: 253, column: 9, scope: !68)
!172 = !DILocation(line: 253, column: 26, scope: !68)
!173 = !DILocation(line: 254, column: 5, scope: !68)
!174 = !DILocation(line: 254, column: 26, scope: !68)
!175 = !DILocation(line: 255, column: 5, scope: !68)
!176 = !DILocation(line: 255, column: 26, scope: !68)
!177 = !DILocation(line: 256, column: 5, scope: !68)
!178 = !DILocation(line: 256, column: 26, scope: !68)
!179 = !DILocation(line: 257, column: 5, scope: !68)
!180 = !DILocation(line: 257, column: 26, scope: !68)
!181 = !DILocation(line: 258, column: 5, scope: !68)
!182 = !DILocation(line: 258, column: 26, scope: !68)
!183 = !DILocation(line: 259, column: 5, scope: !68)
!184 = !DILocation(line: 259, column: 26, scope: !68)
!185 = !DILocation(line: 260, column: 5, scope: !68)
!186 = !DILocation(line: 260, column: 26, scope: !68)
!187 = !DILocation(line: 262, column: 9, scope: !68)
!188 = !DILocation(line: 262, column: 20, scope: !68)
!189 = !{!143, !144, i64 168}
!190 = !DILocation(line: 263, column: 9, scope: !68)
!191 = !DILocation(line: 263, column: 21, scope: !68)
!192 = !{!143, !144, i64 176}
!193 = !DILocation(line: 264, column: 9, scope: !68)
!194 = !DILocation(line: 264, column: 32, scope: !68)
!195 = !{!143, !144, i64 216}
!196 = !DILocation(line: 266, column: 9, scope: !68)
!197 = !DILocation(line: 266, column: 23, scope: !68)
!198 = !{!143, !144, i64 184}
!199 = !DILocation(line: 267, column: 9, scope: !68)
!200 = !DILocation(line: 267, column: 23, scope: !68)
!201 = !{!143, !144, i64 192}
!202 = !DILocation(line: 284, column: 14, scope: !203)
!203 = distinct !DILexicalBlock(scope: !68, file: !3, line: 284, column: 9)
