; ModuleID = 'common/mc.c'
source_filename = "common/mc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_frame_t = type { i32, i32, i32, i64, i32, i32, i32, float, float, i32, [3 x i32], [3 x i32], [3 x i32], i32, i32, i32, [3 x ptr], [4 x ptr], [4 x ptr], ptr, [4 x ptr], [4 x ptr], ptr, [2 x ptr], [2 x [17 x ptr]], [2 x [17 x ptr]], [2 x ptr], [2 x i32], [2 x [16 x i32]], [16 x i32], [18 x [18 x i32]], [18 x [18 x i32]], i32, [18 x i32], [18 x [18 x ptr]], ptr, ptr, ptr, ptr, i32, ptr, ptr, i32, i32, %union.pthread_mutex_t, %union.pthread_cond_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.__atomic_wide_counter = type { i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hpel_ref0", scope: !2, file: !3, line: 159, type: !22, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "common/mc.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "6b9c30633eec71220e2b0c2a6d9eaf33")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "common/pixel.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "aba138e44f0e52bc0158be0d182b79c1")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!10 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!11 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!12 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!13 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!14 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!15 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!16 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!17 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!18 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!19 = !{!0, !20}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "hpel_ref1", scope: !2, file: !3, line: 160, type: !22, isLocal: true, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !25)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !{!26}
!26 = !DISubrange(count: 16)
!27 = !{i32 7, !"Dwarf Version", i32 5}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 4}
!30 = !{i32 8, !"PIC Level", i32 2}
!31 = !{i32 7, !"PIE Level", i32 2}
!32 = !{i32 7, !"uwtable", i32 2}
!33 = !{!"clang version 16.0.0"}
!34 = distinct !DISubprogram(name: "x264_frame_init_lowres", scope: !3, file: !3, line: 272, type: !35, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1138)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !456}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !39, line: 42, baseType: !40)
!39 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !41, line: 250, size: 206080, elements: !42)
!41 = !DIFile(filename: "common/common.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "4880b62cc871dca4002788746fbccb70")
!42 = !{!43, !194, !198, !202, !203, !204, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !318, !320, !348, !350, !351, !358, !363, !367, !371, !378, !382, !383, !384, !385, !390, !392, !394, !434, !451, !615, !616, !617, !618, !622, !623, !624, !625, !640, !793, !797, !852, !861, !862, !870, !872, !943, !1003, !1055, !1076, !1118}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !40, file: !41, line: 253, baseType: !44, size: 4928)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !39, line: 295, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !39, line: 151, size: 4928, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !88, !95, !96, !97, !98, !102, !103, !118, !119, !120, !121, !122, !152, !191, !192, !193}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !45, file: !39, line: 154, baseType: !7, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !45, file: !39, line: 155, baseType: !24, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !45, file: !39, line: 156, baseType: !24, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !45, file: !39, line: 159, baseType: !24, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !45, file: !39, line: 160, baseType: !24, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !45, file: !39, line: 161, baseType: !24, size: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !45, file: !39, line: 162, baseType: !24, size: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !45, file: !39, line: 163, baseType: !24, size: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !45, file: !39, line: 180, baseType: !56, size: 288, offset: 256)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !45, file: !39, line: 165, size: 288, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !56, file: !39, line: 168, baseType: !24, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !56, file: !39, line: 169, baseType: !24, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !56, file: !39, line: 171, baseType: !24, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !56, file: !39, line: 174, baseType: !24, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !56, file: !39, line: 175, baseType: !24, size: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !56, file: !39, line: 176, baseType: !24, size: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !56, file: !39, line: 177, baseType: !24, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !56, file: !39, line: 178, baseType: !24, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !56, file: !39, line: 179, baseType: !24, size: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !45, file: !39, line: 182, baseType: !24, size: 32, offset: 544)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !45, file: !39, line: 183, baseType: !24, size: 32, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !45, file: !39, line: 186, baseType: !24, size: 32, offset: 608)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !45, file: !39, line: 187, baseType: !24, size: 32, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !45, file: !39, line: 188, baseType: !24, size: 32, offset: 672)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !45, file: !39, line: 189, baseType: !24, size: 32, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !45, file: !39, line: 190, baseType: !24, size: 32, offset: 736)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !45, file: !39, line: 191, baseType: !24, size: 32, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !45, file: !39, line: 192, baseType: !24, size: 32, offset: 800)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !45, file: !39, line: 193, baseType: !24, size: 32, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !45, file: !39, line: 194, baseType: !24, size: 32, offset: 864)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !45, file: !39, line: 196, baseType: !24, size: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !45, file: !39, line: 197, baseType: !24, size: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !45, file: !39, line: 198, baseType: !24, size: 32, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !45, file: !39, line: 200, baseType: !24, size: 32, offset: 992)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !45, file: !39, line: 201, baseType: !24, size: 32, offset: 1024)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !45, file: !39, line: 203, baseType: !24, size: 32, offset: 1056)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !45, file: !39, line: 205, baseType: !24, size: 32, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !45, file: !39, line: 206, baseType: !86, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !45, file: !39, line: 207, baseType: !89, size: 128, offset: 1216)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !25)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !91, line: 24, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !93, line: 38, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !45, file: !39, line: 208, baseType: !89, size: 128, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !45, file: !39, line: 209, baseType: !89, size: 128, offset: 1472)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !45, file: !39, line: 210, baseType: !89, size: 128, offset: 1600)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !45, file: !39, line: 211, baseType: !99, size: 512, offset: 1728)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 512, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !45, file: !39, line: 212, baseType: !99, size: 512, offset: 2240)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !45, file: !39, line: 215, baseType: !104, size: 64, offset: 2752)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !24, !108, !110}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !112)
!112 = !{!113, !115, !116, !117}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !111, file: !114, baseType: !7, size: 32)
!114 = !DIFile(filename: "common/mc.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !111, file: !114, baseType: !7, size: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !111, file: !114, baseType: !107, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !111, file: !114, baseType: !107, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !45, file: !39, line: 216, baseType: !107, size: 64, offset: 2816)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !45, file: !39, line: 217, baseType: !24, size: 32, offset: 2880)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !45, file: !39, line: 218, baseType: !24, size: 32, offset: 2912)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !45, file: !39, line: 219, baseType: !86, size: 64, offset: 2944)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !45, file: !39, line: 252, baseType: !123, size: 768, offset: 3008)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !45, file: !39, line: 222, size: 768, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !145, !146, !150, !151}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !123, file: !39, line: 224, baseType: !7, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !123, file: !39, line: 225, baseType: !7, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !123, file: !39, line: 227, baseType: !24, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !123, file: !39, line: 228, baseType: !24, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !123, file: !39, line: 229, baseType: !24, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !123, file: !39, line: 230, baseType: !24, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !123, file: !39, line: 231, baseType: !24, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !123, file: !39, line: 233, baseType: !24, size: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !123, file: !39, line: 234, baseType: !24, size: 32, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !123, file: !39, line: 235, baseType: !24, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !123, file: !39, line: 236, baseType: !24, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !123, file: !39, line: 237, baseType: !24, size: 32, offset: 352)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !123, file: !39, line: 238, baseType: !24, size: 32, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !123, file: !39, line: 239, baseType: !24, size: 32, offset: 416)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !123, file: !39, line: 240, baseType: !24, size: 32, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !123, file: !39, line: 241, baseType: !24, size: 32, offset: 480)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !123, file: !39, line: 242, baseType: !24, size: 32, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !123, file: !39, line: 243, baseType: !24, size: 32, offset: 544)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !123, file: !39, line: 244, baseType: !144, size: 32, offset: 576)
!144 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !123, file: !39, line: 245, baseType: !144, size: 32, offset: 608)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !123, file: !39, line: 248, baseType: !147, size: 64, offset: 640)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 2)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !123, file: !39, line: 250, baseType: !24, size: 32, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !123, file: !39, line: 251, baseType: !24, size: 32, offset: 736)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !45, file: !39, line: 289, baseType: !153, size: 1024, offset: 3776)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !45, file: !39, line: 255, size: 1024, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !189, !190}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !153, file: !39, line: 257, baseType: !24, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !153, file: !39, line: 259, baseType: !24, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !153, file: !39, line: 260, baseType: !24, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !153, file: !39, line: 261, baseType: !24, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !153, file: !39, line: 262, baseType: !24, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !153, file: !39, line: 264, baseType: !24, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !153, file: !39, line: 265, baseType: !144, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !153, file: !39, line: 266, baseType: !144, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !153, file: !39, line: 267, baseType: !24, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !153, file: !39, line: 268, baseType: !24, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !153, file: !39, line: 269, baseType: !144, size: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !153, file: !39, line: 270, baseType: !144, size: 32, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !153, file: !39, line: 271, baseType: !144, size: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !153, file: !39, line: 273, baseType: !24, size: 32, offset: 416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !153, file: !39, line: 274, baseType: !144, size: 32, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !153, file: !39, line: 277, baseType: !24, size: 32, offset: 480)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !153, file: !39, line: 278, baseType: !86, size: 64, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !153, file: !39, line: 279, baseType: !24, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !153, file: !39, line: 280, baseType: !86, size: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !153, file: !39, line: 283, baseType: !144, size: 32, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !153, file: !39, line: 284, baseType: !144, size: 32, offset: 736)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !153, file: !39, line: 285, baseType: !144, size: 32, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !153, file: !39, line: 286, baseType: !178, size: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !39, line: 149, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 142, size: 256, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !180, file: !39, line: 144, baseType: !24, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !180, file: !39, line: 144, baseType: !24, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !180, file: !39, line: 145, baseType: !24, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !180, file: !39, line: 146, baseType: !24, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !180, file: !39, line: 147, baseType: !144, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !180, file: !39, line: 148, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !153, file: !39, line: 287, baseType: !24, size: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !153, file: !39, line: 288, baseType: !86, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !45, file: !39, line: 292, baseType: !24, size: 32, offset: 4800)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !45, file: !39, line: 293, baseType: !24, size: 32, offset: 4832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !45, file: !39, line: 294, baseType: !24, size: 32, offset: 4864)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !40, file: !41, line: 255, baseType: !195, size: 8192, offset: 4928)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !40, file: !41, line: 256, baseType: !199, size: 64, offset: 13120)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !200, line: 27, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!201 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !40, file: !41, line: 257, baseType: !24, size: 32, offset: 13184)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !40, file: !41, line: 258, baseType: !24, size: 32, offset: 13216)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !40, file: !41, line: 269, baseType: !205, size: 2112, offset: 13248)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !41, line: 261, size: 2112, elements: !206)
!206 = !{!207, !208, !220, !221, !222, !236}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !205, file: !41, line: 263, baseType: !24, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !205, file: !41, line: 264, baseType: !209, size: 1536, offset: 64)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 1536, elements: !218)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !39, line: 399, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 391, size: 192, elements: !212)
!212 = !{!213, !214, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !211, file: !39, line: 393, baseType: !24, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !211, file: !39, line: 394, baseType: !24, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !211, file: !39, line: 397, baseType: !24, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !211, file: !39, line: 398, baseType: !217, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!218 = !{!219}
!219 = !DISubrange(count: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !205, file: !41, line: 265, baseType: !24, size: 32, offset: 1600)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !205, file: !41, line: 266, baseType: !217, size: 64, offset: 1664)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !205, file: !41, line: 267, baseType: !223, size: 320, offset: 1728)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !224, line: 49, baseType: !225)
!224 = !DIFile(filename: "common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !224, line: 40, size: 320, elements: !226)
!226 = !{!227, !228, !229, !230, !234, !235}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !225, file: !224, line: 42, baseType: !217, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !225, file: !224, line: 43, baseType: !217, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !225, file: !224, line: 44, baseType: !217, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !225, file: !224, line: 46, baseType: !231, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !232, line: 87, baseType: !233)
!232 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!233 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !225, file: !224, line: 47, baseType: !24, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !225, file: !224, line: 48, baseType: !24, size: 32, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !205, file: !41, line: 268, baseType: !24, size: 32, offset: 2048)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !40, file: !41, line: 274, baseType: !24, size: 32, offset: 15360)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !40, file: !41, line: 276, baseType: !24, size: 32, offset: 15392)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !40, file: !41, line: 277, baseType: !24, size: 32, offset: 15424)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !40, file: !41, line: 278, baseType: !24, size: 32, offset: 15456)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !40, file: !41, line: 279, baseType: !24, size: 32, offset: 15488)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !40, file: !41, line: 280, baseType: !24, size: 32, offset: 15520)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !40, file: !41, line: 282, baseType: !24, size: 32, offset: 15552)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !40, file: !41, line: 283, baseType: !24, size: 32, offset: 15584)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !40, file: !41, line: 284, baseType: !24, size: 32, offset: 15616)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !40, file: !41, line: 287, baseType: !247, size: 9920, offset: 15648)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 9920, elements: !316)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !249, line: 133, baseType: !250)
!249 = !DIFile(filename: "common/set.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "06164d1fd824dd844d17e97dd39e9ac3")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !249, line: 52, size: 9920, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !269, !270, !271, !272, !273, !274, !275, !276, !277, !284, !285, !315}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !250, file: !249, line: 54, baseType: !24, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !250, file: !249, line: 56, baseType: !24, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !250, file: !249, line: 57, baseType: !24, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !250, file: !249, line: 59, baseType: !24, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !250, file: !249, line: 60, baseType: !24, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !250, file: !249, line: 61, baseType: !24, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !250, file: !249, line: 63, baseType: !24, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !250, file: !249, line: 65, baseType: !24, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !250, file: !249, line: 67, baseType: !24, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !250, file: !249, line: 69, baseType: !24, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !250, file: !249, line: 70, baseType: !24, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !250, file: !249, line: 71, baseType: !24, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !250, file: !249, line: 72, baseType: !24, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !250, file: !249, line: 73, baseType: !266, size: 8192, offset: 416)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8192, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !250, file: !249, line: 75, baseType: !24, size: 32, offset: 8608)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !250, file: !249, line: 76, baseType: !24, size: 32, offset: 8640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !250, file: !249, line: 77, baseType: !24, size: 32, offset: 8672)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !250, file: !249, line: 78, baseType: !24, size: 32, offset: 8704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !250, file: !249, line: 79, baseType: !24, size: 32, offset: 8736)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !250, file: !249, line: 80, baseType: !24, size: 32, offset: 8768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !250, file: !249, line: 81, baseType: !24, size: 32, offset: 8800)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !250, file: !249, line: 83, baseType: !24, size: 32, offset: 8832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !250, file: !249, line: 90, baseType: !278, size: 128, offset: 8864)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !249, line: 84, size: 128, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !278, file: !249, line: 86, baseType: !24, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !278, file: !249, line: 87, baseType: !24, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !278, file: !249, line: 88, baseType: !24, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !278, file: !249, line: 89, baseType: !24, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !250, file: !249, line: 92, baseType: !24, size: 32, offset: 8992)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !250, file: !249, line: 129, baseType: !286, size: 864, offset: 9024)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !249, line: 93, size: 864, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !286, file: !249, line: 95, baseType: !24, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !286, file: !249, line: 96, baseType: !24, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !286, file: !249, line: 97, baseType: !24, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !286, file: !249, line: 99, baseType: !24, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !286, file: !249, line: 100, baseType: !24, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !286, file: !249, line: 102, baseType: !24, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !286, file: !249, line: 103, baseType: !24, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !286, file: !249, line: 104, baseType: !24, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !286, file: !249, line: 105, baseType: !24, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !286, file: !249, line: 106, baseType: !24, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !286, file: !249, line: 107, baseType: !24, size: 32, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !286, file: !249, line: 108, baseType: !24, size: 32, offset: 352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !286, file: !249, line: 110, baseType: !24, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !286, file: !249, line: 111, baseType: !24, size: 32, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !286, file: !249, line: 112, baseType: !24, size: 32, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !286, file: !249, line: 114, baseType: !24, size: 32, offset: 480)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !286, file: !249, line: 115, baseType: !24, size: 32, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !286, file: !249, line: 116, baseType: !24, size: 32, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !286, file: !249, line: 117, baseType: !24, size: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !286, file: !249, line: 119, baseType: !24, size: 32, offset: 608)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !286, file: !249, line: 120, baseType: !24, size: 32, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !286, file: !249, line: 121, baseType: !24, size: 32, offset: 672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !286, file: !249, line: 122, baseType: !24, size: 32, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !286, file: !249, line: 123, baseType: !24, size: 32, offset: 736)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !286, file: !249, line: 124, baseType: !24, size: 32, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !286, file: !249, line: 125, baseType: !24, size: 32, offset: 800)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !286, file: !249, line: 126, baseType: !24, size: 32, offset: 832)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !250, file: !249, line: 131, baseType: !24, size: 32, offset: 9888)
!316 = !{!317}
!317 = !DISubrange(count: 1)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !40, file: !41, line: 288, baseType: !319, size: 64, offset: 25600)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !40, file: !41, line: 289, baseType: !321, size: 960, offset: 25664)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 960, elements: !316)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !249, line: 165, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !249, line: 135, size: 960, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !323, file: !249, line: 137, baseType: !24, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !323, file: !249, line: 138, baseType: !24, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !323, file: !249, line: 140, baseType: !24, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !323, file: !249, line: 142, baseType: !24, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !323, file: !249, line: 143, baseType: !24, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !323, file: !249, line: 145, baseType: !24, size: 32, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !323, file: !249, line: 146, baseType: !24, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !323, file: !249, line: 148, baseType: !24, size: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !323, file: !249, line: 149, baseType: !24, size: 32, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !323, file: !249, line: 151, baseType: !24, size: 32, offset: 288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !323, file: !249, line: 152, baseType: !24, size: 32, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !323, file: !249, line: 154, baseType: !24, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !323, file: !249, line: 156, baseType: !24, size: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !323, file: !249, line: 157, baseType: !24, size: 32, offset: 416)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !323, file: !249, line: 158, baseType: !24, size: 32, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !323, file: !249, line: 160, baseType: !24, size: 32, offset: 480)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !323, file: !249, line: 162, baseType: !24, size: 32, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !323, file: !249, line: 163, baseType: !343, size: 384, offset: 576)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 384, elements: !346)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!346 = !{!347}
!347 = !DISubrange(count: 6)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !40, file: !41, line: 290, baseType: !349, size: 64, offset: 26624)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !40, file: !41, line: 291, baseType: !24, size: 32, offset: 26688)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !40, file: !41, line: 294, baseType: !352, size: 256, offset: 26752)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 256, elements: !357)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, elements: !355)
!355 = !{!356, !356}
!356 = !DISubrange(count: 4)
!357 = !{!356}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !40, file: !41, line: 295, baseType: !359, size: 128, offset: 27008)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 128, elements: !148)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, elements: !362)
!362 = !{!219, !219}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !40, file: !41, line: 297, baseType: !364, size: 256, offset: 27136)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 256, elements: !357)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 512, elements: !25)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !40, file: !41, line: 298, baseType: !368, size: 128, offset: 27392)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 128, elements: !148)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, elements: !100)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !40, file: !41, line: 300, baseType: !372, size: 256, offset: 27520)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 256, elements: !357)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 256, elements: !25)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !91, line: 25, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !93, line: 40, baseType: !377)
!377 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !40, file: !41, line: 301, baseType: !379, size: 128, offset: 27776)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 128, elements: !148)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 1024, elements: !100)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !40, file: !41, line: 302, baseType: !372, size: 256, offset: 27904)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !40, file: !41, line: 303, baseType: !379, size: 128, offset: 28160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !40, file: !41, line: 305, baseType: !344, size: 64, offset: 28288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !40, file: !41, line: 307, baseType: !386, size: 4096, align: 128, offset: 28416)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 4096, elements: !389)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !91, line: 26, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !93, line: 42, baseType: !7)
!389 = !{!149, !101}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !40, file: !41, line: 308, baseType: !391, size: 2048, align: 128, offset: 32512)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 2048, elements: !389)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !40, file: !41, line: 309, baseType: !393, size: 64, offset: 34560)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 64, elements: !148)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !40, file: !41, line: 312, baseType: !395, size: 3072, offset: 34624)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !41, line: 209, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 159, size: 3072, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !426, !427, !428, !429, !430, !431, !432, !433}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !396, file: !41, line: 161, baseType: !319, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !396, file: !41, line: 162, baseType: !349, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !396, file: !41, line: 164, baseType: !24, size: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !396, file: !41, line: 165, baseType: !24, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !396, file: !41, line: 166, baseType: !24, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !396, file: !41, line: 168, baseType: !24, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !396, file: !41, line: 170, baseType: !24, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !396, file: !41, line: 172, baseType: !24, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !396, file: !41, line: 173, baseType: !24, size: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !396, file: !41, line: 174, baseType: !24, size: 32, offset: 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !396, file: !41, line: 176, baseType: !24, size: 32, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !396, file: !41, line: 178, baseType: !24, size: 32, offset: 416)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !396, file: !41, line: 179, baseType: !24, size: 32, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !396, file: !41, line: 181, baseType: !147, size: 64, offset: 480)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !396, file: !41, line: 182, baseType: !24, size: 32, offset: 544)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !396, file: !41, line: 184, baseType: !24, size: 32, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !396, file: !41, line: 186, baseType: !24, size: 32, offset: 608)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !396, file: !41, line: 187, baseType: !24, size: 32, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !396, file: !41, line: 188, baseType: !24, size: 32, offset: 672)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !396, file: !41, line: 190, baseType: !24, size: 32, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !396, file: !41, line: 191, baseType: !24, size: 32, offset: 736)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !396, file: !41, line: 195, baseType: !420, size: 2048, offset: 768)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 2048, elements: !425)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !396, file: !41, line: 192, size: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !421, file: !41, line: 193, baseType: !24, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !421, file: !41, line: 194, baseType: !24, size: 32, offset: 32)
!425 = !{!149, !26}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !396, file: !41, line: 197, baseType: !24, size: 32, offset: 2816)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !396, file: !41, line: 199, baseType: !24, size: 32, offset: 2848)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !396, file: !41, line: 200, baseType: !24, size: 32, offset: 2880)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !396, file: !41, line: 201, baseType: !24, size: 32, offset: 2912)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !396, file: !41, line: 202, baseType: !24, size: 32, offset: 2944)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !396, file: !41, line: 205, baseType: !24, size: 32, offset: 2976)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !396, file: !41, line: 206, baseType: !24, size: 32, offset: 3008)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !396, file: !41, line: 207, baseType: !24, size: 32, offset: 3040)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !40, file: !41, line: 315, baseType: !435, size: 4096, offset: 37760)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !436, line: 46, baseType: !437)
!436 = !DIFile(filename: "common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 27, size: 4096, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !437, file: !436, line: 30, baseType: !24, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !437, file: !436, line: 31, baseType: !24, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !437, file: !436, line: 34, baseType: !24, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !437, file: !436, line: 35, baseType: !24, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !437, file: !436, line: 37, baseType: !217, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !437, file: !436, line: 38, baseType: !217, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !437, file: !436, line: 39, baseType: !217, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !437, file: !436, line: 42, baseType: !24, size: 32, align: 128, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !437, file: !436, line: 45, baseType: !448, size: 3680, offset: 416)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 3680, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 460)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !40, file: !41, line: 340, baseType: !452, size: 31808, offset: 41856)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !41, line: 317, size: 31808, elements: !453)
!453 = !{!454, !600, !601, !605, !606, !608, !609, !610, !611, !612, !613, !614}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !452, file: !41, line: 320, baseType: !455, size: 4288)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 4288, elements: !598)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !458, line: 94, baseType: !459)
!458 = !DIFile(filename: "common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 31, size: 51648, elements: !460)
!460 = !{!461, !462, !463, !464, !468, !469, !470, !471, !472, !473, !474, !478, !479, !480, !481, !482, !483, !485, !487, !488, !490, !491, !492, !497, !504, !508, !511, !513, !514, !516, !517, !521, !522, !523, !526, !528, !529, !530, !531, !533, !534, !535, !536, !537, !538, !566}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !459, file: !458, line: 34, baseType: !24, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !459, file: !458, line: 35, baseType: !24, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !459, file: !458, line: 36, baseType: !24, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !459, file: !458, line: 37, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !466, line: 27, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !93, line: 44, baseType: !233)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !459, file: !458, line: 38, baseType: !24, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !459, file: !458, line: 39, baseType: !24, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !459, file: !458, line: 40, baseType: !24, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !459, file: !458, line: 41, baseType: !144, size: 32, offset: 288)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !459, file: !458, line: 42, baseType: !144, size: 32, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !459, file: !458, line: 45, baseType: !24, size: 32, offset: 352)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !459, file: !458, line: 46, baseType: !475, size: 96, offset: 384)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 96, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 3)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !459, file: !458, line: 47, baseType: !475, size: 96, offset: 480)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !459, file: !458, line: 48, baseType: !475, size: 96, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !459, file: !458, line: 49, baseType: !24, size: 32, offset: 672)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !459, file: !458, line: 50, baseType: !24, size: 32, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !459, file: !458, line: 51, baseType: !24, size: 32, offset: 736)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !459, file: !458, line: 52, baseType: !484, size: 192, offset: 768)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 192, elements: !476)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !459, file: !458, line: 53, baseType: !486, size: 256, offset: 960)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 256, elements: !357)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !459, file: !458, line: 54, baseType: !486, size: 256, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !459, file: !458, line: 55, baseType: !489, size: 64, offset: 1472)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !459, file: !458, line: 59, baseType: !486, size: 256, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !459, file: !458, line: 60, baseType: !486, size: 256, offset: 1792)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !459, file: !458, line: 63, baseType: !493, size: 64, offset: 2048)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !466, line: 24, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !93, line: 37, baseType: !496)
!496 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !459, file: !458, line: 64, baseType: !498, size: 128, offset: 2112)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 128, elements: !148)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 32, elements: !148)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !466, line: 25, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !93, line: 39, baseType: !503)
!503 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !459, file: !458, line: 65, baseType: !505, size: 2176, offset: 2240)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 2176, elements: !506)
!506 = !{!149, !507}
!507 = !DISubrange(count: 17)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !459, file: !458, line: 66, baseType: !509, size: 2176, offset: 4416)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 2176, elements: !506)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !459, file: !458, line: 67, baseType: !512, size: 128, offset: 6592)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 128, elements: !148)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !459, file: !458, line: 68, baseType: !147, size: 64, offset: 6720)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !459, file: !458, line: 69, baseType: !515, size: 1024, offset: 6784)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1024, elements: !425)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !459, file: !458, line: 70, baseType: !366, size: 512, offset: 7808)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !459, file: !458, line: 75, baseType: !518, size: 10368, offset: 8320)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 10368, elements: !519)
!519 = !{!520, !520}
!520 = !DISubrange(count: 18)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !459, file: !458, line: 76, baseType: !518, size: 10368, offset: 18688)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !459, file: !458, line: 77, baseType: !24, size: 32, offset: 29056)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !459, file: !458, line: 78, baseType: !524, size: 576, offset: 29088)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 576, elements: !525)
!525 = !{!520}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !459, file: !458, line: 79, baseType: !527, size: 20736, offset: 29696)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 20736, elements: !519)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !459, file: !458, line: 80, baseType: !510, size: 64, offset: 50432)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !459, file: !458, line: 81, baseType: !510, size: 64, offset: 50496)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !459, file: !458, line: 82, baseType: !510, size: 64, offset: 50560)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !459, file: !458, line: 83, baseType: !532, size: 64, offset: 50624)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !459, file: !458, line: 84, baseType: !24, size: 32, offset: 50688)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !459, file: !458, line: 85, baseType: !489, size: 64, offset: 50752)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !459, file: !458, line: 86, baseType: !489, size: 64, offset: 50816)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !459, file: !458, line: 89, baseType: !24, size: 32, offset: 50880)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !459, file: !458, line: 90, baseType: !24, size: 32, offset: 50912)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !459, file: !458, line: 91, baseType: !539, size: 320, offset: 50944)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !200, line: 72, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !200, line: 67, size: 320, elements: !541)
!541 = !{!542, !561, !565}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !540, file: !200, line: 69, baseType: !543, size: 320)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !544, line: 22, size: 320, elements: !545)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !543, file: !544, line: 24, baseType: !24, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !543, file: !544, line: 25, baseType: !7, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !543, file: !544, line: 26, baseType: !24, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !543, file: !544, line: 28, baseType: !7, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !543, file: !544, line: 32, baseType: !24, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !543, file: !544, line: 34, baseType: !503, size: 16, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !543, file: !544, line: 35, baseType: !503, size: 16, offset: 176)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !543, file: !544, line: 36, baseType: !554, size: 128, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !555, line: 55, baseType: !556)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !555, line: 51, size: 128, elements: !557)
!557 = !{!558, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !556, file: !555, line: 53, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !556, file: !555, line: 54, baseType: !559, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !540, file: !200, line: 70, baseType: !562, size: 320)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 320, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 40)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !540, file: !200, line: 71, baseType: !233, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !459, file: !458, line: 92, baseType: !567, size: 384, offset: 51264)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !200, line: 80, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !200, line: 75, size: 384, elements: !569)
!569 = !{!570, !592, !596}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !568, file: !200, line: 77, baseType: !571, size: 384)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !555, line: 94, size: 384, elements: !572)
!572 = !{!573, !585, !586, !588, !589, !590, !591}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !571, file: !555, line: 96, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !575, line: 33, baseType: !576)
!575 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !575, line: 25, size: 64, elements: !577)
!577 = !{!578, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !576, file: !575, line: 27, baseType: !579, size: 64)
!579 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !576, file: !575, line: 32, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !575, line: 28, size: 64, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !581, file: !575, line: 30, baseType: !7, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !581, file: !575, line: 31, baseType: !7, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !571, file: !555, line: 97, baseType: !574, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !571, file: !555, line: 98, baseType: !587, size: 64, offset: 128)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !148)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !571, file: !555, line: 99, baseType: !587, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !571, file: !555, line: 100, baseType: !7, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !571, file: !555, line: 101, baseType: !7, size: 32, offset: 288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !571, file: !555, line: 102, baseType: !587, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !568, file: !200, line: 78, baseType: !593, size: 384)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 384, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 48)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !568, file: !200, line: 79, baseType: !597, size: 64)
!597 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!598 = !{!599}
!599 = !DISubrange(count: 67)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !452, file: !41, line: 322, baseType: !455, size: 4288, offset: 4288)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !452, file: !41, line: 324, baseType: !602, size: 21760, offset: 8576)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 21760, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 340)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !452, file: !41, line: 326, baseType: !456, size: 64, offset: 30336)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !452, file: !41, line: 329, baseType: !607, size: 1152, offset: 30400)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 1152, elements: !525)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !452, file: !41, line: 331, baseType: !24, size: 32, offset: 31552)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !452, file: !41, line: 333, baseType: !24, size: 32, offset: 31584)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !452, file: !41, line: 335, baseType: !24, size: 32, offset: 31616)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !452, file: !41, line: 336, baseType: !24, size: 32, offset: 31648)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !452, file: !41, line: 337, baseType: !24, size: 32, offset: 31680)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !452, file: !41, line: 338, baseType: !24, size: 32, offset: 31712)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !452, file: !41, line: 339, baseType: !24, size: 32, offset: 31744)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !40, file: !41, line: 343, baseType: !456, size: 64, offset: 73664)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !40, file: !41, line: 346, baseType: !456, size: 64, offset: 73728)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !40, file: !41, line: 349, baseType: !24, size: 32, offset: 73792)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !40, file: !41, line: 350, baseType: !619, size: 1216, offset: 73856)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 1216, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 19)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !40, file: !41, line: 351, baseType: !24, size: 32, offset: 75072)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !40, file: !41, line: 352, baseType: !619, size: 1216, offset: 75136)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !40, file: !41, line: 353, baseType: !147, size: 64, offset: 76352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !40, file: !41, line: 365, baseType: !626, size: 10624, offset: 76416)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !41, line: 358, size: 10624, elements: !627)
!627 = !{!628, !630, !633, !636}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !626, file: !41, line: 360, baseType: !629, size: 256, align: 128)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 256, elements: !25)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !626, file: !41, line: 361, baseType: !631, size: 128, align: 128, offset: 256)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 128, elements: !632)
!632 = !{!149, !356}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !626, file: !41, line: 363, baseType: !634, size: 4096, align: 128, offset: 384)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 4096, elements: !635)
!635 = !{!356, !101}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !626, file: !41, line: 364, baseType: !637, size: 6144, align: 128, offset: 4480)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 6144, elements: !638)
!638 = !{!639, !26}
!639 = !DISubrange(count: 24)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !40, file: !41, line: 544, baseType: !641, size: 80128, offset: 87040)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !41, line: 368, size: 80128, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !669, !671, !672, !673, !674, !675, !676, !677, !678, !679, !681, !684, !688, !689, !690, !691, !692, !696, !697, !698, !701, !703, !704, !705, !707, !708, !709, !710, !711, !712, !713, !714, !755, !775, !776, !777, !778, !779, !780, !781, !782, !783, !786, !789, !791}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !641, file: !41, line: 370, baseType: !24, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !641, file: !41, line: 373, baseType: !24, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !641, file: !41, line: 374, baseType: !24, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !641, file: !41, line: 375, baseType: !24, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !641, file: !41, line: 378, baseType: !24, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !641, file: !41, line: 379, baseType: !24, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !641, file: !41, line: 380, baseType: !24, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !641, file: !41, line: 381, baseType: !24, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !641, file: !41, line: 382, baseType: !24, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !641, file: !41, line: 385, baseType: !24, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !641, file: !41, line: 386, baseType: !24, size: 32, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !641, file: !41, line: 387, baseType: !24, size: 32, offset: 352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !641, file: !41, line: 388, baseType: !24, size: 32, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !641, file: !41, line: 389, baseType: !24, size: 32, offset: 416)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !641, file: !41, line: 390, baseType: !24, size: 32, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !641, file: !41, line: 391, baseType: !24, size: 32, offset: 480)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !641, file: !41, line: 393, baseType: !24, size: 32, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !641, file: !41, line: 396, baseType: !147, size: 64, offset: 544)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !641, file: !41, line: 397, baseType: !147, size: 64, offset: 608)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !641, file: !41, line: 400, baseType: !147, size: 64, offset: 672)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !641, file: !41, line: 401, baseType: !147, size: 64, offset: 736)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !641, file: !41, line: 403, baseType: !147, size: 64, offset: 800)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !641, file: !41, line: 404, baseType: !147, size: 64, offset: 864)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !641, file: !41, line: 407, baseType: !7, size: 32, offset: 928)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !641, file: !41, line: 408, baseType: !668, size: 128, offset: 960)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !357)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !641, file: !41, line: 409, baseType: !670, size: 512, offset: 1088)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !25)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !641, file: !41, line: 410, baseType: !24, size: 32, offset: 1600)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !641, file: !41, line: 411, baseType: !24, size: 32, offset: 1632)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !641, file: !41, line: 412, baseType: !24, size: 32, offset: 1664)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !641, file: !41, line: 413, baseType: !24, size: 32, offset: 1696)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !641, file: !41, line: 414, baseType: !24, size: 32, offset: 1728)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !641, file: !41, line: 415, baseType: !24, size: 32, offset: 1760)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !41, line: 422, baseType: !493, size: 64, offset: 1792)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !641, file: !41, line: 423, baseType: !493, size: 64, offset: 1856)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !641, file: !41, line: 424, baseType: !680, size: 64, offset: 1920)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !641, file: !41, line: 425, baseType: !682, size: 64, offset: 1984)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 64, elements: !218)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !641, file: !41, line: 427, baseType: !685, size: 64, offset: 2048)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 192, elements: !687)
!687 = !{!639}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !641, file: !41, line: 428, baseType: !493, size: 64, offset: 2112)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !641, file: !41, line: 429, baseType: !498, size: 128, offset: 2176)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !641, file: !41, line: 430, baseType: !498, size: 128, offset: 2304)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !641, file: !41, line: 431, baseType: !512, size: 128, offset: 2432)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !641, file: !41, line: 432, baseType: !693, size: 4096, offset: 2560)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 4096, elements: !694)
!694 = !{!149, !695}
!695 = !DISubrange(count: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !641, file: !41, line: 433, baseType: !493, size: 64, offset: 6656)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !641, file: !41, line: 434, baseType: !493, size: 64, offset: 6720)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !641, file: !41, line: 435, baseType: !699, size: 384, offset: 6784)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 384, elements: !700)
!700 = !{!149, !477}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !641, file: !41, line: 436, baseType: !702, size: 64, offset: 7168)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !641, file: !41, line: 439, baseType: !24, size: 32, offset: 7232)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !641, file: !41, line: 440, baseType: !24, size: 32, offset: 7264)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !641, file: !41, line: 441, baseType: !706, size: 128, offset: 7296)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !357)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !641, file: !41, line: 442, baseType: !24, size: 32, offset: 7424)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !641, file: !41, line: 444, baseType: !24, size: 32, offset: 7456)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !641, file: !41, line: 445, baseType: !24, size: 32, offset: 7488)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !641, file: !41, line: 447, baseType: !24, size: 32, offset: 7520)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !641, file: !41, line: 448, baseType: !24, size: 32, offset: 7552)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !641, file: !41, line: 454, baseType: !24, size: 32, offset: 7584)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !641, file: !41, line: 457, baseType: !24, size: 32, offset: 7616)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !641, file: !41, line: 498, baseType: !715, size: 57344, offset: 7680)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !641, file: !41, line: 459, size: 57344, elements: !716)
!716 = !{!717, !721, !725, !727, !728, !731, !735, !736, !739, !740, !741, !744, !745, !746, !747, !748, !749, !752, !754}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !715, file: !41, line: 464, baseType: !718, size: 3072, align: 128)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 3072, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !715, file: !41, line: 465, baseType: !722, size: 6912, align: 128, offset: 3072)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 6912, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 864)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !715, file: !41, line: 468, baseType: !726, size: 2048, align: 128, offset: 9984)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 2048, elements: !267)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !715, file: !41, line: 469, baseType: !726, size: 2048, align: 128, offset: 12032)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !715, file: !41, line: 470, baseType: !729, size: 3072, align: 128, offset: 14080)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 3072, elements: !730)
!730 = !{!477, !101}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !715, file: !41, line: 471, baseType: !732, size: 3840, align: 128, offset: 17152)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 3840, elements: !733)
!733 = !{!734, !26}
!734 = !DISubrange(count: 15)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !715, file: !41, line: 474, baseType: !634, size: 4096, align: 128, offset: 20992)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !715, file: !41, line: 475, baseType: !737, size: 4096, align: 128, offset: 25088)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 4096, elements: !738)
!738 = !{!26, !26}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !715, file: !41, line: 478, baseType: !354, size: 512, offset: 29184)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !715, file: !41, line: 479, baseType: !24, size: 32, offset: 29696)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !715, file: !41, line: 480, baseType: !742, size: 128, offset: 29728)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 128, elements: !743)
!743 = !{!149, !149}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !715, file: !41, line: 481, baseType: !24, size: 32, offset: 29856)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !715, file: !41, line: 484, baseType: !484, size: 192, offset: 29888)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !715, file: !41, line: 486, baseType: !484, size: 192, offset: 30080)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !715, file: !41, line: 489, baseType: !484, size: 192, offset: 30272)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !715, file: !41, line: 492, baseType: !147, size: 64, offset: 30464)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !715, file: !41, line: 493, baseType: !750, size: 24576, offset: 30528)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 24576, elements: !751)
!751 = !{!149, !695, !347}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !715, file: !41, line: 494, baseType: !753, size: 2048, offset: 55104)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 2048, elements: !425)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !715, file: !41, line: 497, baseType: !475, size: 96, offset: 57152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !641, file: !41, line: 526, baseType: !756, size: 12032, offset: 65024)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !641, file: !41, line: 501, size: 12032, elements: !757)
!757 = !{!758, !760, !762, !765, !768, !769, !770, !771, !772, !773, !774}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !756, file: !41, line: 504, baseType: !759, size: 384)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 384, elements: !594)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !756, file: !41, line: 507, baseType: !761, size: 384, offset: 384)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 384, elements: !594)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !756, file: !41, line: 510, baseType: !763, size: 768, align: 32, offset: 768)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 768, elements: !764)
!764 = !{!149, !595}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !756, file: !41, line: 513, baseType: !766, size: 3072, align: 128, offset: 1536)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 3072, elements: !767)
!767 = !{!149, !595, !149}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !756, file: !41, line: 514, baseType: !766, size: 3072, align: 64, offset: 4608)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !756, file: !41, line: 517, baseType: !759, size: 384, align: 32, offset: 7680)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !756, file: !41, line: 519, baseType: !766, size: 3072, align: 128, offset: 8064)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !756, file: !41, line: 520, baseType: !763, size: 768, align: 32, offset: 11136)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !756, file: !41, line: 521, baseType: !500, size: 32, align: 32, offset: 11904)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !756, file: !41, line: 524, baseType: !24, size: 32, offset: 11936)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !756, file: !41, line: 525, baseType: !24, size: 32, offset: 11968)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !641, file: !41, line: 529, baseType: !24, size: 32, offset: 77056)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !641, file: !41, line: 530, baseType: !24, size: 32, offset: 77088)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !641, file: !41, line: 531, baseType: !24, size: 32, offset: 77120)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !641, file: !41, line: 532, baseType: !24, size: 32, offset: 77152)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !641, file: !41, line: 533, baseType: !24, size: 32, offset: 77184)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !641, file: !41, line: 534, baseType: !24, size: 32, offset: 77216)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !641, file: !41, line: 535, baseType: !24, size: 32, offset: 77248)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !641, file: !41, line: 536, baseType: !24, size: 32, offset: 77280)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !641, file: !41, line: 539, baseType: !784, size: 512, offset: 77312)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 512, elements: !785)
!785 = !{!26, !149}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !641, file: !41, line: 540, baseType: !787, size: 2048, offset: 77824)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 2048, elements: !788)
!788 = !{!695, !356}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !641, file: !41, line: 542, baseType: !790, size: 16, offset: 79872)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 16, elements: !148)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !641, file: !41, line: 543, baseType: !792, size: 128, offset: 79888)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 128, elements: !25)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !40, file: !41, line: 547, baseType: !794, size: 64, offset: 167168)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !41, line: 248, baseType: !796)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !41, line: 248, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !40, file: !41, line: 604, baseType: !798, size: 23936, offset: 167232)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !41, line: 550, size: 23936, elements: !799)
!799 = !{!800, !825, !829, !831, !833, !834, !835, !836, !837, !838, !839, !840, !843, !845, !847, !850, !851}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !798, file: !41, line: 579, baseType: !801, size: 3904)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !798, file: !41, line: 553, size: 3904, elements: !802)
!802 = !{!803, !804, !805, !806, !808, !809, !810, !811, !812, !814, !817, !818, !819, !820, !821, !823}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !801, file: !41, line: 556, baseType: !24, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !801, file: !41, line: 558, baseType: !24, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !801, file: !41, line: 560, baseType: !24, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !801, file: !41, line: 562, baseType: !807, size: 608, offset: 96)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 608, elements: !620)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !801, file: !41, line: 563, baseType: !24, size: 32, offset: 704)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !801, file: !41, line: 564, baseType: !24, size: 32, offset: 736)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !801, file: !41, line: 565, baseType: !24, size: 32, offset: 768)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !801, file: !41, line: 566, baseType: !147, size: 64, offset: 800)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !801, file: !41, line: 567, baseType: !813, size: 2048, offset: 864)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, elements: !694)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !801, file: !41, line: 568, baseType: !815, size: 544, offset: 2912)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 544, elements: !816)
!816 = !{!507}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !801, file: !41, line: 571, baseType: !24, size: 32, offset: 3456)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !801, file: !41, line: 572, baseType: !24, size: 32, offset: 3488)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !801, file: !41, line: 573, baseType: !24, size: 32, offset: 3520)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !801, file: !41, line: 575, baseType: !147, size: 64, offset: 3552)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !801, file: !41, line: 577, baseType: !822, size: 192, offset: 3648)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 192, elements: !476)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !801, file: !41, line: 578, baseType: !824, size: 64, offset: 3840)
!824 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !798, file: !41, line: 584, baseType: !826, size: 160, offset: 3904)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 5)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !798, file: !41, line: 585, baseType: !830, size: 320, offset: 4096)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 320, elements: !827)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !798, file: !41, line: 586, baseType: !832, size: 320, offset: 4416)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 320, elements: !827)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !798, file: !41, line: 587, baseType: !815, size: 544, offset: 4736)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !798, file: !41, line: 589, baseType: !830, size: 320, offset: 5312)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !798, file: !41, line: 590, baseType: !832, size: 320, offset: 5632)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !798, file: !41, line: 591, baseType: !832, size: 320, offset: 5952)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !798, file: !41, line: 592, baseType: !832, size: 320, offset: 6272)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !798, file: !41, line: 593, baseType: !832, size: 320, offset: 6592)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !798, file: !41, line: 594, baseType: !832, size: 320, offset: 6912)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !798, file: !41, line: 596, baseType: !841, size: 6080, offset: 7232)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 6080, elements: !842)
!842 = !{!828, !621}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !798, file: !41, line: 597, baseType: !844, size: 2176, offset: 13312)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 2176, elements: !506)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !798, file: !41, line: 598, baseType: !846, size: 128, offset: 15488)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 128, elements: !148)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !798, file: !41, line: 599, baseType: !848, size: 8192, offset: 15616)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 8192, elements: !849)
!849 = !{!149, !149, !695}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !798, file: !41, line: 601, baseType: !147, size: 64, offset: 23808)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_frames", scope: !798, file: !41, line: 602, baseType: !147, size: 64, offset: 23872)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "predict_16x16", scope: !40, file: !41, line: 607, baseType: !853, size: 448, offset: 191168)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 448, elements: !859)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict_t", file: !855, line: 27, baseType: !856)
!855 = !DIFile(filename: "common/predict.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "c7827bfe44f4a550b7080533457a8327")
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !217}
!859 = !{!860}
!860 = !DISubrange(count: 7)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8c", scope: !40, file: !41, line: 608, baseType: !853, size: 448, offset: 191616)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8", scope: !40, file: !41, line: 609, baseType: !863, size: 768, offset: 192064)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 768, elements: !868)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict8x8_t", file: !855, line: 28, baseType: !865)
