; ModuleID = 'encoder/me.c'
source_filename = "encoder/me.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon.14 = type { i32, i32 }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, i32, i32, float, float, float, i32, float, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }
%struct.x264_me_t = type { i32, ptr, i32, i32, [6 x ptr], [3 x ptr], ptr, [2 x i32], [2 x i16], i32, i32, [2 x i16] }

!24 = !DIEnumerator(name: "SLICE_TYPE_I", value: 2)
!25 = !DIEnumerator(name: "SLICE_TYPE_SP", value: 3)
!26 = !DIEnumerator(name: "SLICE_TYPE_SI", value: 4)
!27 = !{!28, !33, !37, !34}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 26, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !32, line: 42, baseType: !7)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 27, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !32, line: 45, baseType: !36)
!36 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !40, file: !39, line: 72, size: 64, elements: !66)
!39 = !DIFile(filename: "./common/x86/util.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "5f677273b03032461bc0acac3bce37d9")
!40 = distinct !DISubprogram(name: "x264_predictor_difference_mmxext", scope: !39, file: !39, line: 46, type: !41, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !55)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !52}
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !50)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !47, line: 25, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !32, line: 39, baseType: !49)
!49 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!50 = !{!51}
!51 = !DISubrange(count: 2)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !53, line: 87, baseType: !54)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !{!56, !57, !58, !59}
!56 = !DILocalVariable(name: "mvc", arg: 1, scope: !40, file: !39, line: 46, type: !44)
!57 = !DILocalVariable(name: "i_mvc", arg: 2, scope: !40, file: !39, line: 46, type: !52)
!58 = !DILocalVariable(name: "sum", scope: !40, file: !39, line: 48, type: !43)
!59 = !DILocalVariable(name: "output", scope: !40, file: !39, line: 49, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 25, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !32, line: 40, baseType: !63)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !{!65}
!65 = !DISubrange(count: 4)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !38, file: !39, line: 72, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !64)
!69 = !{!70, !1455, !1458, !1461, !1464, !0, !1562, !1566, !1569, !1573, !1978, !1983, !1985, !1989}
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "x264_pixel_size_shift", scope: !72, file: !3, line: 312, type: !1454, isLocal: true, isDefinition: true)
!72 = distinct !DISubprogram(name: "x264_me_search_ref", scope: !3, file: !3, line: 156, type: !73, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1170)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75, !1152, !44, !43, !528}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !77, line: 42, baseType: !78)
!77 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !20, line: 250, size: 206080, elements: !79)
!79 = !{!80, !229, !233, !236, !237, !238, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !349, !351, !379, !381, !382, !387, !392, !396, !400, !404, !408, !409, !410, !411, !414, !416, !418, !458, !475, !633, !634, !635, !636, !640, !641, !642, !643, !658, !811, !815, !870, !879, !880, !888, !890, !958, !1018, !1069, !1090, !1132}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !78, file: !20, line: 253, baseType: !81, size: 4928)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !77, line: 295, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !77, line: 151, size: 4928, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !125, !132, !133, !134, !135, !139, !140, !155, !156, !157, !158, !159, !187, !226, !227, !228}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !82, file: !77, line: 154, baseType: !7, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !82, file: !77, line: 155, baseType: !43, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !82, file: !77, line: 156, baseType: !43, size: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !82, file: !77, line: 159, baseType: !43, size: 32, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !82, file: !77, line: 160, baseType: !43, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !82, file: !77, line: 161, baseType: !43, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !82, file: !77, line: 162, baseType: !43, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !82, file: !77, line: 163, baseType: !43, size: 32, offset: 224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !82, file: !77, line: 180, baseType: !93, size: 288, offset: 256)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !77, line: 165, size: 288, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !93, file: !77, line: 168, baseType: !43, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !93, file: !77, line: 169, baseType: !43, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !93, file: !77, line: 171, baseType: !43, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !93, file: !77, line: 174, baseType: !43, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !93, file: !77, line: 175, baseType: !43, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !93, file: !77, line: 176, baseType: !43, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !93, file: !77, line: 177, baseType: !43, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !93, file: !77, line: 178, baseType: !43, size: 32, offset: 224)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !93, file: !77, line: 179, baseType: !43, size: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !82, file: !77, line: 182, baseType: !43, size: 32, offset: 544)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !82, file: !77, line: 183, baseType: !43, size: 32, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !82, file: !77, line: 186, baseType: !43, size: 32, offset: 608)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !82, file: !77, line: 187, baseType: !43, size: 32, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !82, file: !77, line: 188, baseType: !43, size: 32, offset: 672)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !82, file: !77, line: 189, baseType: !43, size: 32, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !82, file: !77, line: 190, baseType: !43, size: 32, offset: 736)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !82, file: !77, line: 191, baseType: !43, size: 32, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !82, file: !77, line: 192, baseType: !43, size: 32, offset: 800)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !82, file: !77, line: 193, baseType: !43, size: 32, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !82, file: !77, line: 194, baseType: !43, size: 32, offset: 864)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !82, file: !77, line: 196, baseType: !43, size: 32, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !82, file: !77, line: 197, baseType: !43, size: 32, offset: 928)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !82, file: !77, line: 198, baseType: !43, size: 32, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !82, file: !77, line: 200, baseType: !43, size: 32, offset: 992)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !82, file: !77, line: 201, baseType: !43, size: 32, offset: 1024)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !82, file: !77, line: 203, baseType: !43, size: 32, offset: 1056)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !82, file: !77, line: 205, baseType: !43, size: 32, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !82, file: !77, line: 206, baseType: !123, size: 64, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !82, file: !77, line: 207, baseType: !126, size: 128, offset: 1216)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 128, elements: !130)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !30, line: 24, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !32, line: 38, baseType: !129)
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!131}
!131 = !DISubrange(count: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !82, file: !77, line: 208, baseType: !126, size: 128, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !82, file: !77, line: 209, baseType: !126, size: 128, offset: 1472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !82, file: !77, line: 210, baseType: !126, size: 128, offset: 1600)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !82, file: !77, line: 211, baseType: !136, size: 512, offset: 1728)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 512, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !82, file: !77, line: 212, baseType: !136, size: 512, offset: 2240)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !82, file: !77, line: 215, baseType: !141, size: 64, offset: 2752)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !43, !145, !147}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !149)
!149 = !{!150, !152, !153, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !148, file: !151, baseType: !7, size: 32)
!151 = !DIFile(filename: "encoder/me.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !148, file: !151, baseType: !7, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !148, file: !151, baseType: !144, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !148, file: !151, baseType: !144, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !82, file: !77, line: 216, baseType: !144, size: 64, offset: 2816)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !82, file: !77, line: 217, baseType: !43, size: 32, offset: 2880)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !82, file: !77, line: 218, baseType: !43, size: 32, offset: 2912)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !82, file: !77, line: 219, baseType: !123, size: 64, offset: 2944)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !82, file: !77, line: 252, baseType: !160, size: 768, offset: 3008)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !77, line: 222, size: 768, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !182, !183, !185, !186}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !160, file: !77, line: 224, baseType: !7, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !160, file: !77, line: 225, baseType: !7, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !160, file: !77, line: 227, baseType: !43, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !160, file: !77, line: 228, baseType: !43, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !160, file: !77, line: 229, baseType: !43, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !160, file: !77, line: 230, baseType: !43, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !160, file: !77, line: 231, baseType: !43, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !160, file: !77, line: 233, baseType: !43, size: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !160, file: !77, line: 234, baseType: !43, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !160, file: !77, line: 235, baseType: !43, size: 32, offset: 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !160, file: !77, line: 236, baseType: !43, size: 32, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !160, file: !77, line: 237, baseType: !43, size: 32, offset: 352)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !160, file: !77, line: 238, baseType: !43, size: 32, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !160, file: !77, line: 239, baseType: !43, size: 32, offset: 416)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !160, file: !77, line: 240, baseType: !43, size: 32, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !160, file: !77, line: 241, baseType: !43, size: 32, offset: 480)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !160, file: !77, line: 242, baseType: !43, size: 32, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !160, file: !77, line: 243, baseType: !43, size: 32, offset: 544)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !160, file: !77, line: 244, baseType: !181, size: 32, offset: 576)
!181 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !160, file: !77, line: 245, baseType: !181, size: 32, offset: 608)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !160, file: !77, line: 248, baseType: !184, size: 64, offset: 640)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !50)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !160, file: !77, line: 250, baseType: !43, size: 32, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !160, file: !77, line: 251, baseType: !43, size: 32, offset: 736)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !82, file: !77, line: 289, baseType: !188, size: 1024, offset: 3776)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !77, line: 255, size: 1024, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !224, !225}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !188, file: !77, line: 257, baseType: !43, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !188, file: !77, line: 259, baseType: !43, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !188, file: !77, line: 260, baseType: !43, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !188, file: !77, line: 261, baseType: !43, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !188, file: !77, line: 262, baseType: !43, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !188, file: !77, line: 264, baseType: !43, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !188, file: !77, line: 265, baseType: !181, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !188, file: !77, line: 266, baseType: !181, size: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !188, file: !77, line: 267, baseType: !43, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !188, file: !77, line: 268, baseType: !43, size: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !188, file: !77, line: 269, baseType: !181, size: 32, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !188, file: !77, line: 270, baseType: !181, size: 32, offset: 352)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !188, file: !77, line: 271, baseType: !181, size: 32, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !188, file: !77, line: 273, baseType: !43, size: 32, offset: 416)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !188, file: !77, line: 274, baseType: !181, size: 32, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !188, file: !77, line: 277, baseType: !43, size: 32, offset: 480)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !188, file: !77, line: 278, baseType: !123, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !188, file: !77, line: 279, baseType: !43, size: 32, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !188, file: !77, line: 280, baseType: !123, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !188, file: !77, line: 283, baseType: !181, size: 32, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !188, file: !77, line: 284, baseType: !181, size: 32, offset: 736)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !188, file: !77, line: 285, baseType: !181, size: 32, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !188, file: !77, line: 286, baseType: !213, size: 64, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !77, line: 149, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 142, size: 256, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !215, file: !77, line: 144, baseType: !43, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !215, file: !77, line: 144, baseType: !43, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !215, file: !77, line: 145, baseType: !43, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !215, file: !77, line: 146, baseType: !43, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !215, file: !77, line: 147, baseType: !181, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !215, file: !77, line: 148, baseType: !223, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !188, file: !77, line: 287, baseType: !43, size: 32, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !188, file: !77, line: 288, baseType: !123, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !82, file: !77, line: 292, baseType: !43, size: 32, offset: 4800)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !82, file: !77, line: 293, baseType: !43, size: 32, offset: 4832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !82, file: !77, line: 294, baseType: !43, size: 32, offset: 4864)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !78, file: !20, line: 255, baseType: !230, size: 8192, offset: 4928)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8192, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !78, file: !20, line: 256, baseType: !234, size: 64, offset: 13120)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !235, line: 27, baseType: !36)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !78, file: !20, line: 257, baseType: !43, size: 32, offset: 13184)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !78, file: !20, line: 258, baseType: !43, size: 32, offset: 13216)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !78, file: !20, line: 269, baseType: !239, size: 2112, offset: 13248)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !20, line: 261, size: 2112, elements: !240)
!240 = !{!241, !242, !254, !255, !256, !267}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !239, file: !20, line: 263, baseType: !43, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !239, file: !20, line: 264, baseType: !243, size: 1536, offset: 64)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 1536, elements: !252)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !77, line: 399, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 391, size: 192, elements: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !245, file: !77, line: 393, baseType: !43, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !245, file: !77, line: 394, baseType: !43, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !245, file: !77, line: 397, baseType: !43, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !245, file: !77, line: 398, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!252 = !{!253}
!253 = !DISubrange(count: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !239, file: !20, line: 265, baseType: !43, size: 32, offset: 1600)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !239, file: !20, line: 266, baseType: !251, size: 64, offset: 1664)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !239, file: !20, line: 267, baseType: !257, size: 320, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !258, line: 49, baseType: !259)
!258 = !DIFile(filename: "./common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !258, line: 40, size: 320, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !259, file: !258, line: 42, baseType: !251, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !259, file: !258, line: 43, baseType: !251, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !259, file: !258, line: 44, baseType: !251, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !259, file: !258, line: 46, baseType: !52, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !259, file: !258, line: 47, baseType: !43, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !259, file: !258, line: 48, baseType: !43, size: 32, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !239, file: !20, line: 268, baseType: !43, size: 32, offset: 2048)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !78, file: !20, line: 274, baseType: !43, size: 32, offset: 15360)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !78, file: !20, line: 276, baseType: !43, size: 32, offset: 15392)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !78, file: !20, line: 277, baseType: !43, size: 32, offset: 15424)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !78, file: !20, line: 278, baseType: !43, size: 32, offset: 15456)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !78, file: !20, line: 279, baseType: !43, size: 32, offset: 15488)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !78, file: !20, line: 280, baseType: !43, size: 32, offset: 15520)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !78, file: !20, line: 282, baseType: !43, size: 32, offset: 15552)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !78, file: !20, line: 283, baseType: !43, size: 32, offset: 15584)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !78, file: !20, line: 284, baseType: !43, size: 32, offset: 15616)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !78, file: !20, line: 287, baseType: !278, size: 9920, offset: 15648)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 9920, elements: !347)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !280, line: 133, baseType: !281)
!280 = !DIFile(filename: "./common/set.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "06164d1fd824dd844d17e97dd39e9ac3")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 52, size: 9920, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300, !301, !302, !303, !304, !305, !306, !307, !308, !315, !316, !346}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !281, file: !280, line: 54, baseType: !43, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !281, file: !280, line: 56, baseType: !43, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !281, file: !280, line: 57, baseType: !43, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !281, file: !280, line: 59, baseType: !43, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !281, file: !280, line: 60, baseType: !43, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !281, file: !280, line: 61, baseType: !43, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !281, file: !280, line: 63, baseType: !43, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !281, file: !280, line: 65, baseType: !43, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !281, file: !280, line: 67, baseType: !43, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !281, file: !280, line: 69, baseType: !43, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !281, file: !280, line: 70, baseType: !43, size: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !281, file: !280, line: 71, baseType: !43, size: 32, offset: 352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !281, file: !280, line: 72, baseType: !43, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !281, file: !280, line: 73, baseType: !297, size: 8192, offset: 416)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8192, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !281, file: !280, line: 75, baseType: !43, size: 32, offset: 8608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !281, file: !280, line: 76, baseType: !43, size: 32, offset: 8640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !281, file: !280, line: 77, baseType: !43, size: 32, offset: 8672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !281, file: !280, line: 78, baseType: !43, size: 32, offset: 8704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !281, file: !280, line: 79, baseType: !43, size: 32, offset: 8736)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !281, file: !280, line: 80, baseType: !43, size: 32, offset: 8768)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !281, file: !280, line: 81, baseType: !43, size: 32, offset: 8800)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !281, file: !280, line: 83, baseType: !43, size: 32, offset: 8832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !281, file: !280, line: 90, baseType: !309, size: 128, offset: 8864)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !280, line: 84, size: 128, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !309, file: !280, line: 86, baseType: !43, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !309, file: !280, line: 87, baseType: !43, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !309, file: !280, line: 88, baseType: !43, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !309, file: !280, line: 89, baseType: !43, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !281, file: !280, line: 92, baseType: !43, size: 32, offset: 8992)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !281, file: !280, line: 129, baseType: !317, size: 864, offset: 9024)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !280, line: 93, size: 864, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !317, file: !280, line: 95, baseType: !43, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !317, file: !280, line: 96, baseType: !43, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !317, file: !280, line: 97, baseType: !43, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !317, file: !280, line: 99, baseType: !43, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !317, file: !280, line: 100, baseType: !43, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !317, file: !280, line: 102, baseType: !43, size: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !317, file: !280, line: 103, baseType: !43, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !317, file: !280, line: 104, baseType: !43, size: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !317, file: !280, line: 105, baseType: !43, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !317, file: !280, line: 106, baseType: !43, size: 32, offset: 288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !317, file: !280, line: 107, baseType: !43, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !317, file: !280, line: 108, baseType: !43, size: 32, offset: 352)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !317, file: !280, line: 110, baseType: !43, size: 32, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !317, file: !280, line: 111, baseType: !43, size: 32, offset: 416)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !317, file: !280, line: 112, baseType: !43, size: 32, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !317, file: !280, line: 114, baseType: !43, size: 32, offset: 480)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !317, file: !280, line: 115, baseType: !43, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !317, file: !280, line: 116, baseType: !43, size: 32, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !317, file: !280, line: 117, baseType: !43, size: 32, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !317, file: !280, line: 119, baseType: !43, size: 32, offset: 608)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !317, file: !280, line: 120, baseType: !43, size: 32, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !317, file: !280, line: 121, baseType: !43, size: 32, offset: 672)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !317, file: !280, line: 122, baseType: !43, size: 32, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !317, file: !280, line: 123, baseType: !43, size: 32, offset: 736)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !317, file: !280, line: 124, baseType: !43, size: 32, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !317, file: !280, line: 125, baseType: !43, size: 32, offset: 800)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !317, file: !280, line: 126, baseType: !43, size: 32, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !281, file: !280, line: 131, baseType: !43, size: 32, offset: 9888)
!347 = !{!348}
!348 = !DISubrange(count: 1)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !78, file: !20, line: 288, baseType: !350, size: 64, offset: 25600)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !78, file: !20, line: 289, baseType: !352, size: 960, offset: 25664)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 960, elements: !347)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !280, line: 165, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !280, line: 135, size: 960, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !354, file: !280, line: 137, baseType: !43, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !354, file: !280, line: 138, baseType: !43, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !354, file: !280, line: 140, baseType: !43, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !354, file: !280, line: 142, baseType: !43, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !354, file: !280, line: 143, baseType: !43, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !354, file: !280, line: 145, baseType: !43, size: 32, offset: 160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !354, file: !280, line: 146, baseType: !43, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !354, file: !280, line: 148, baseType: !43, size: 32, offset: 224)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !354, file: !280, line: 149, baseType: !43, size: 32, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !354, file: !280, line: 151, baseType: !43, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !354, file: !280, line: 152, baseType: !43, size: 32, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !354, file: !280, line: 154, baseType: !43, size: 32, offset: 352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !354, file: !280, line: 156, baseType: !43, size: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !354, file: !280, line: 157, baseType: !43, size: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !354, file: !280, line: 158, baseType: !43, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !354, file: !280, line: 160, baseType: !43, size: 32, offset: 480)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !354, file: !280, line: 162, baseType: !43, size: 32, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !354, file: !280, line: 163, baseType: !374, size: 384, offset: 576)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 384, elements: !377)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!377 = !{!378}
!378 = !DISubrange(count: 6)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !78, file: !20, line: 290, baseType: !380, size: 64, offset: 26624)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !78, file: !20, line: 291, baseType: !43, size: 32, offset: 26688)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !78, file: !20, line: 294, baseType: !383, size: 256, offset: 26752)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 256, elements: !64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 512, elements: !386)
!386 = !{!65, !65}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !78, file: !20, line: 295, baseType: !388, size: 128, offset: 27008)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, elements: !50)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, elements: !391)
!391 = !{!253, !253}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !78, file: !20, line: 297, baseType: !393, size: 256, offset: 27136)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 256, elements: !64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 512, elements: !130)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !78, file: !20, line: 298, baseType: !397, size: 128, offset: 27392)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 128, elements: !50)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, elements: !137)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !78, file: !20, line: 300, baseType: !401, size: 256, offset: 27520)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 256, elements: !64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 256, elements: !130)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !78, file: !20, line: 301, baseType: !405, size: 128, offset: 27776)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 128, elements: !50)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1024, elements: !137)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !78, file: !20, line: 302, baseType: !401, size: 256, offset: 27904)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !78, file: !20, line: 303, baseType: !405, size: 128, offset: 28160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !78, file: !20, line: 305, baseType: !375, size: 64, offset: 28288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !78, file: !20, line: 307, baseType: !412, size: 4096, align: 128, offset: 28416)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 4096, elements: !413)
!413 = !{!51, !138}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !78, file: !20, line: 308, baseType: !415, size: 2048, align: 128, offset: 32512)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !413)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !78, file: !20, line: 309, baseType: !417, size: 64, offset: 34560)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, elements: !50)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !78, file: !20, line: 312, baseType: !419, size: 3072, offset: 34624)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !20, line: 209, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 159, size: 3072, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !450, !451, !452, !453, !454, !455, !456, !457}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !420, file: !20, line: 161, baseType: !350, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !420, file: !20, line: 162, baseType: !380, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !420, file: !20, line: 164, baseType: !43, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !420, file: !20, line: 165, baseType: !43, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !420, file: !20, line: 166, baseType: !43, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !420, file: !20, line: 168, baseType: !43, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !420, file: !20, line: 170, baseType: !43, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !420, file: !20, line: 172, baseType: !43, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !420, file: !20, line: 173, baseType: !43, size: 32, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !420, file: !20, line: 174, baseType: !43, size: 32, offset: 352)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !420, file: !20, line: 176, baseType: !43, size: 32, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !420, file: !20, line: 178, baseType: !43, size: 32, offset: 416)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !420, file: !20, line: 179, baseType: !43, size: 32, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !420, file: !20, line: 181, baseType: !184, size: 64, offset: 480)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !420, file: !20, line: 182, baseType: !43, size: 32, offset: 544)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !420, file: !20, line: 184, baseType: !43, size: 32, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !420, file: !20, line: 186, baseType: !43, size: 32, offset: 608)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !420, file: !20, line: 187, baseType: !43, size: 32, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !420, file: !20, line: 188, baseType: !43, size: 32, offset: 672)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !420, file: !20, line: 190, baseType: !43, size: 32, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !420, file: !20, line: 191, baseType: !43, size: 32, offset: 736)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !420, file: !20, line: 195, baseType: !444, size: 2048, offset: 768)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 2048, elements: !449)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !420, file: !20, line: 192, size: 64, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !445, file: !20, line: 193, baseType: !43, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !445, file: !20, line: 194, baseType: !43, size: 32, offset: 32)
!449 = !{!51, !131}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !420, file: !20, line: 197, baseType: !43, size: 32, offset: 2816)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !420, file: !20, line: 199, baseType: !43, size: 32, offset: 2848)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !420, file: !20, line: 200, baseType: !43, size: 32, offset: 2880)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !420, file: !20, line: 201, baseType: !43, size: 32, offset: 2912)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !420, file: !20, line: 202, baseType: !43, size: 32, offset: 2944)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !420, file: !20, line: 205, baseType: !43, size: 32, offset: 2976)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !420, file: !20, line: 206, baseType: !43, size: 32, offset: 3008)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !420, file: !20, line: 207, baseType: !43, size: 32, offset: 3040)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !78, file: !20, line: 315, baseType: !459, size: 4096, offset: 37760)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !460, line: 46, baseType: !461)
!460 = !DIFile(filename: "./common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 27, size: 4096, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !461, file: !460, line: 30, baseType: !43, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !461, file: !460, line: 31, baseType: !43, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !461, file: !460, line: 34, baseType: !43, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !461, file: !460, line: 35, baseType: !43, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !461, file: !460, line: 37, baseType: !251, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !461, file: !460, line: 38, baseType: !251, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !461, file: !460, line: 39, baseType: !251, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !461, file: !460, line: 42, baseType: !43, size: 32, align: 128, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !460, line: 45, baseType: !472, size: 3680, offset: 416)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 3680, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 460)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !78, file: !20, line: 340, baseType: !476, size: 31808, offset: 41856)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !20, line: 317, size: 31808, elements: !477)
!477 = !{!478, !618, !619, !623, !624, !626, !627, !628, !629, !630, !631, !632}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !476, file: !20, line: 320, baseType: !479, size: 4288)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 4288, elements: !616)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !482, line: 94, baseType: !483)
!482 = !DIFile(filename: "./common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 31, size: 51648, elements: !484)
!484 = !{!485, !486, !487, !488, !491, !492, !493, !494, !495, !496, !497, !501, !502, !503, !504, !505, !506, !508, !510, !511, !513, !514, !515, !520, !522, !526, !529, !531, !532, !534, !535, !539, !540, !541, !544, !546, !547, !548, !549, !551, !552, !553, !554, !555, !556, !584}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !483, file: !482, line: 34, baseType: !43, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !483, file: !482, line: 35, baseType: !43, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !483, file: !482, line: 36, baseType: !43, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !483, file: !482, line: 37, baseType: !489, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !47, line: 27, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !32, line: 44, baseType: !54)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !483, file: !482, line: 38, baseType: !43, size: 32, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !483, file: !482, line: 39, baseType: !43, size: 32, offset: 224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !483, file: !482, line: 40, baseType: !43, size: 32, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !483, file: !482, line: 41, baseType: !181, size: 32, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !483, file: !482, line: 42, baseType: !181, size: 32, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !483, file: !482, line: 45, baseType: !43, size: 32, offset: 352)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !483, file: !482, line: 46, baseType: !498, size: 96, offset: 384)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 96, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 3)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !483, file: !482, line: 47, baseType: !498, size: 96, offset: 480)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !483, file: !482, line: 48, baseType: !498, size: 96, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !483, file: !482, line: 49, baseType: !43, size: 32, offset: 672)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !483, file: !482, line: 50, baseType: !43, size: 32, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !483, file: !482, line: 51, baseType: !43, size: 32, offset: 736)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !483, file: !482, line: 52, baseType: !507, size: 192, offset: 768)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 192, elements: !499)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !483, file: !482, line: 53, baseType: !509, size: 256, offset: 960)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 256, elements: !64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !483, file: !482, line: 54, baseType: !509, size: 256, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !483, file: !482, line: 55, baseType: !512, size: 64, offset: 1472)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !483, file: !482, line: 59, baseType: !509, size: 256, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !483, file: !482, line: 60, baseType: !509, size: 256, offset: 1792)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !483, file: !482, line: 63, baseType: !516, size: 64, offset: 2048)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !47, line: 24, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !32, line: 37, baseType: !519)
!519 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !483, file: !482, line: 64, baseType: !521, size: 128, offset: 2112)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, elements: !50)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !483, file: !482, line: 65, baseType: !523, size: 2176, offset: 2240)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2176, elements: !524)
!524 = !{!51, !525}
!525 = !DISubrange(count: 17)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !483, file: !482, line: 66, baseType: !527, size: 2176, offset: 4416)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 2176, elements: !524)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !483, file: !482, line: 67, baseType: !530, size: 128, offset: 6592)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 128, elements: !50)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !483, file: !482, line: 68, baseType: !184, size: 64, offset: 6720)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !483, file: !482, line: 69, baseType: !533, size: 1024, offset: 6784)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1024, elements: !449)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !483, file: !482, line: 70, baseType: !395, size: 512, offset: 7808)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !483, file: !482, line: 75, baseType: !536, size: 10368, offset: 8320)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 10368, elements: !537)
!537 = !{!538, !538}
!538 = !DISubrange(count: 18)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !483, file: !482, line: 76, baseType: !536, size: 10368, offset: 18688)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !483, file: !482, line: 77, baseType: !43, size: 32, offset: 29056)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !483, file: !482, line: 78, baseType: !542, size: 576, offset: 29088)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 576, elements: !543)
!543 = !{!538}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !483, file: !482, line: 79, baseType: !545, size: 20736, offset: 29696)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 20736, elements: !537)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !483, file: !482, line: 80, baseType: !528, size: 64, offset: 50432)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !483, file: !482, line: 81, baseType: !528, size: 64, offset: 50496)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !483, file: !482, line: 82, baseType: !528, size: 64, offset: 50560)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !483, file: !482, line: 83, baseType: !550, size: 64, offset: 50624)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !483, file: !482, line: 84, baseType: !43, size: 32, offset: 50688)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !483, file: !482, line: 85, baseType: !512, size: 64, offset: 50752)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !483, file: !482, line: 86, baseType: !512, size: 64, offset: 50816)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !483, file: !482, line: 89, baseType: !43, size: 32, offset: 50880)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !483, file: !482, line: 90, baseType: !43, size: 32, offset: 50912)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !483, file: !482, line: 91, baseType: !557, size: 320, offset: 50944)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !235, line: 72, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !235, line: 67, size: 320, elements: !559)
!559 = !{!560, !579, !583}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !558, file: !235, line: 69, baseType: !561, size: 320)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !562, line: 22, size: 320, elements: !563)
!562 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !561, file: !562, line: 24, baseType: !43, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !561, file: !562, line: 25, baseType: !7, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !561, file: !562, line: 26, baseType: !43, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !561, file: !562, line: 28, baseType: !7, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !561, file: !562, line: 32, baseType: !43, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !561, file: !562, line: 34, baseType: !49, size: 16, offset: 160)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !561, file: !562, line: 35, baseType: !49, size: 16, offset: 176)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !561, file: !562, line: 36, baseType: !572, size: 128, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !573, line: 55, baseType: !574)
!573 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !573, line: 51, size: 128, elements: !575)
!575 = !{!576, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !574, file: !573, line: 53, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !574, file: !573, line: 54, baseType: !577, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !558, file: !235, line: 70, baseType: !580, size: 320)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 320, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 40)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !558, file: !235, line: 71, baseType: !54, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !483, file: !482, line: 92, baseType: !585, size: 384, offset: 51264)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !235, line: 80, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !235, line: 75, size: 384, elements: !587)
!587 = !{!588, !610, !614}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !586, file: !235, line: 77, baseType: !589, size: 384)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !573, line: 94, size: 384, elements: !590)
!590 = !{!591, !603, !604, !606, !607, !608, !609}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !589, file: !573, line: 96, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !593, line: 33, baseType: !594)
!593 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !593, line: 25, size: 64, elements: !595)
!595 = !{!596, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !594, file: !593, line: 27, baseType: !597, size: 64)
!597 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !594, file: !593, line: 32, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !594, file: !593, line: 28, size: 64, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !599, file: !593, line: 30, baseType: !7, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !599, file: !593, line: 31, baseType: !7, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !589, file: !573, line: 97, baseType: !592, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !589, file: !573, line: 98, baseType: !605, size: 64, offset: 128)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !50)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !589, file: !573, line: 99, baseType: !605, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !589, file: !573, line: 100, baseType: !7, size: 32, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !589, file: !573, line: 101, baseType: !7, size: 32, offset: 288)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !589, file: !573, line: 102, baseType: !605, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !586, file: !235, line: 78, baseType: !611, size: 384)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 384, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 48)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !586, file: !235, line: 79, baseType: !615, size: 64)
!615 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!616 = !{!617}
!617 = !DISubrange(count: 67)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !20, line: 322, baseType: !479, size: 4288, offset: 4288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !476, file: !20, line: 324, baseType: !620, size: 21760, offset: 8576)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 21760, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 340)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !476, file: !20, line: 326, baseType: !480, size: 64, offset: 30336)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !476, file: !20, line: 329, baseType: !625, size: 1152, offset: 30400)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 1152, elements: !543)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !476, file: !20, line: 331, baseType: !43, size: 32, offset: 31552)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !476, file: !20, line: 333, baseType: !43, size: 32, offset: 31584)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !476, file: !20, line: 335, baseType: !43, size: 32, offset: 31616)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !476, file: !20, line: 336, baseType: !43, size: 32, offset: 31648)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !476, file: !20, line: 337, baseType: !43, size: 32, offset: 31680)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !476, file: !20, line: 338, baseType: !43, size: 32, offset: 31712)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !476, file: !20, line: 339, baseType: !43, size: 32, offset: 31744)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !78, file: !20, line: 343, baseType: !480, size: 64, offset: 73664)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !78, file: !20, line: 346, baseType: !480, size: 64, offset: 73728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !78, file: !20, line: 349, baseType: !43, size: 32, offset: 73792)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !78, file: !20, line: 350, baseType: !637, size: 1216, offset: 73856)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 1216, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 19)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !78, file: !20, line: 351, baseType: !43, size: 32, offset: 75072)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !78, file: !20, line: 352, baseType: !637, size: 1216, offset: 75136)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !78, file: !20, line: 353, baseType: !184, size: 64, offset: 76352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !78, file: !20, line: 365, baseType: !644, size: 10624, offset: 76416)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !20, line: 358, size: 10624, elements: !645)
!645 = !{!646, !648, !651, !654}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !644, file: !20, line: 360, baseType: !647, size: 256, align: 128)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !130)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !644, file: !20, line: 361, baseType: !649, size: 128, align: 128, offset: 256)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !650)
!650 = !{!51, !65}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !644, file: !20, line: 363, baseType: !652, size: 4096, align: 128, offset: 384)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 4096, elements: !653)
!653 = !{!65, !138}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !644, file: !20, line: 364, baseType: !655, size: 6144, align: 128, offset: 4480)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 6144, elements: !656)
!656 = !{!657, !131}
!657 = !DISubrange(count: 24)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !78, file: !20, line: 544, baseType: !659, size: 80128, offset: 87040)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !20, line: 368, size: 80128, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !687, !689, !690, !691, !692, !693, !694, !695, !696, !697, !699, !702, !706, !707, !708, !709, !710, !714, !715, !716, !719, !721, !722, !723, !725, !726, !727, !728, !729, !730, !731, !732, !773, !793, !794, !795, !796, !797, !798, !799, !800, !801, !804, !807, !809}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !659, file: !20, line: 370, baseType: !43, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !659, file: !20, line: 373, baseType: !43, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !659, file: !20, line: 374, baseType: !43, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !659, file: !20, line: 375, baseType: !43, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !659, file: !20, line: 378, baseType: !43, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !659, file: !20, line: 379, baseType: !43, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !659, file: !20, line: 380, baseType: !43, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !659, file: !20, line: 381, baseType: !43, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !659, file: !20, line: 382, baseType: !43, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !659, file: !20, line: 385, baseType: !43, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !659, file: !20, line: 386, baseType: !43, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !659, file: !20, line: 387, baseType: !43, size: 32, offset: 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !659, file: !20, line: 388, baseType: !43, size: 32, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !659, file: !20, line: 389, baseType: !43, size: 32, offset: 416)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !659, file: !20, line: 390, baseType: !43, size: 32, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !659, file: !20, line: 391, baseType: !43, size: 32, offset: 480)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !659, file: !20, line: 393, baseType: !43, size: 32, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !659, file: !20, line: 396, baseType: !184, size: 64, offset: 544)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !659, file: !20, line: 397, baseType: !184, size: 64, offset: 608)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !659, file: !20, line: 400, baseType: !184, size: 64, offset: 672)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !659, file: !20, line: 401, baseType: !184, size: 64, offset: 736)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !659, file: !20, line: 403, baseType: !184, size: 64, offset: 800)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !659, file: !20, line: 404, baseType: !184, size: 64, offset: 864)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !659, file: !20, line: 407, baseType: !7, size: 32, offset: 928)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !659, file: !20, line: 408, baseType: !686, size: 128, offset: 960)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !659, file: !20, line: 409, baseType: !688, size: 512, offset: 1088)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !130)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !659, file: !20, line: 410, baseType: !43, size: 32, offset: 1600)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !659, file: !20, line: 411, baseType: !43, size: 32, offset: 1632)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !659, file: !20, line: 412, baseType: !43, size: 32, offset: 1664)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !659, file: !20, line: 413, baseType: !43, size: 32, offset: 1696)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !659, file: !20, line: 414, baseType: !43, size: 32, offset: 1728)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !659, file: !20, line: 415, baseType: !43, size: 32, offset: 1760)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !659, file: !20, line: 422, baseType: !516, size: 64, offset: 1792)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !659, file: !20, line: 423, baseType: !516, size: 64, offset: 1856)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !659, file: !20, line: 424, baseType: !698, size: 64, offset: 1920)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !659, file: !20, line: 425, baseType: !700, size: 64, offset: 1984)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 64, elements: !252)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !659, file: !20, line: 427, baseType: !703, size: 64, offset: 2048)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 192, elements: !705)
!705 = !{!657}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !659, file: !20, line: 428, baseType: !516, size: 64, offset: 2112)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !659, file: !20, line: 429, baseType: !521, size: 128, offset: 2176)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !659, file: !20, line: 430, baseType: !521, size: 128, offset: 2304)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !659, file: !20, line: 431, baseType: !530, size: 128, offset: 2432)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !659, file: !20, line: 432, baseType: !711, size: 4096, offset: 2560)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 4096, elements: !712)
!712 = !{!51, !713}
!713 = !DISubrange(count: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !659, file: !20, line: 433, baseType: !516, size: 64, offset: 6656)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !659, file: !20, line: 434, baseType: !516, size: 64, offset: 6720)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !659, file: !20, line: 435, baseType: !717, size: 384, offset: 6784)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 384, elements: !718)
!718 = !{!51, !500}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !659, file: !20, line: 436, baseType: !720, size: 64, offset: 7168)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !659, file: !20, line: 439, baseType: !43, size: 32, offset: 7232)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !659, file: !20, line: 440, baseType: !43, size: 32, offset: 7264)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !659, file: !20, line: 441, baseType: !724, size: 128, offset: 7296)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !659, file: !20, line: 442, baseType: !43, size: 32, offset: 7424)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !659, file: !20, line: 444, baseType: !43, size: 32, offset: 7456)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !659, file: !20, line: 445, baseType: !43, size: 32, offset: 7488)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !659, file: !20, line: 447, baseType: !43, size: 32, offset: 7520)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !659, file: !20, line: 448, baseType: !43, size: 32, offset: 7552)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !659, file: !20, line: 454, baseType: !43, size: 32, offset: 7584)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !659, file: !20, line: 457, baseType: !43, size: 32, offset: 7616)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !659, file: !20, line: 498, baseType: !733, size: 57344, offset: 7680)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !659, file: !20, line: 459, size: 57344, elements: !734)
!734 = !{!735, !739, !743, !745, !746, !749, !753, !754, !757, !758, !759, !762, !763, !764, !765, !766, !767, !770, !772}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !733, file: !20, line: 464, baseType: !736, size: 3072, align: 128)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 3072, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !733, file: !20, line: 465, baseType: !740, size: 6912, align: 128, offset: 3072)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 6912, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 864)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !733, file: !20, line: 468, baseType: !744, size: 2048, align: 128, offset: 9984)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 2048, elements: !298)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !733, file: !20, line: 469, baseType: !744, size: 2048, align: 128, offset: 12032)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !733, file: !20, line: 470, baseType: !747, size: 3072, align: 128, offset: 14080)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 3072, elements: !748)
!748 = !{!500, !138}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !733, file: !20, line: 471, baseType: !750, size: 3840, align: 128, offset: 17152)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 3840, elements: !751)
!751 = !{!752, !131}
!752 = !DISubrange(count: 15)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !733, file: !20, line: 474, baseType: !652, size: 4096, align: 128, offset: 20992)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !733, file: !20, line: 475, baseType: !755, size: 4096, align: 128, offset: 25088)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 4096, elements: !756)
!756 = !{!131, !131}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !733, file: !20, line: 478, baseType: !385, size: 512, offset: 29184)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !733, file: !20, line: 479, baseType: !43, size: 32, offset: 29696)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !733, file: !20, line: 480, baseType: !760, size: 128, offset: 29728)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !761)
!761 = !{!51, !51}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !733, file: !20, line: 481, baseType: !43, size: 32, offset: 29856)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !733, file: !20, line: 484, baseType: !507, size: 192, offset: 29888)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !733, file: !20, line: 486, baseType: !507, size: 192, offset: 30080)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !733, file: !20, line: 489, baseType: !507, size: 192, offset: 30272)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !733, file: !20, line: 492, baseType: !184, size: 64, offset: 30464)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !733, file: !20, line: 493, baseType: !768, size: 24576, offset: 30528)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 24576, elements: !769)
!769 = !{!51, !713, !378}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !733, file: !20, line: 494, baseType: !771, size: 2048, offset: 55104)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 2048, elements: !449)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !733, file: !20, line: 497, baseType: !498, size: 96, offset: 57152)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !659, file: !20, line: 526, baseType: !774, size: 12032, offset: 65024)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !659, file: !20, line: 501, size: 12032, elements: !775)
!775 = !{!776, !778, !780, !783, !786, !787, !788, !789, !790, !791, !792}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !774, file: !20, line: 504, baseType: !777, size: 384)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 384, elements: !612)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !774, file: !20, line: 507, baseType: !779, size: 384, offset: 384)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 384, elements: !612)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !774, file: !20, line: 510, baseType: !781, size: 768, align: 32, offset: 768)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 768, elements: !782)
!782 = !{!51, !613}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !774, file: !20, line: 513, baseType: !784, size: 3072, align: 128, offset: 1536)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 3072, elements: !785)
!785 = !{!51, !613, !51}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !774, file: !20, line: 514, baseType: !784, size: 3072, align: 64, offset: 4608)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !774, file: !20, line: 517, baseType: !777, size: 384, align: 32, offset: 7680)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !774, file: !20, line: 519, baseType: !784, size: 3072, align: 128, offset: 8064)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !774, file: !20, line: 520, baseType: !781, size: 768, align: 32, offset: 11136)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !774, file: !20, line: 521, baseType: !45, size: 32, align: 32, offset: 11904)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !774, file: !20, line: 524, baseType: !43, size: 32, offset: 11936)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !774, file: !20, line: 525, baseType: !43, size: 32, offset: 11968)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !659, file: !20, line: 529, baseType: !43, size: 32, offset: 77056)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !659, file: !20, line: 530, baseType: !43, size: 32, offset: 77088)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !659, file: !20, line: 531, baseType: !43, size: 32, offset: 77120)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !659, file: !20, line: 532, baseType: !43, size: 32, offset: 77152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !659, file: !20, line: 533, baseType: !43, size: 32, offset: 77184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !659, file: !20, line: 534, baseType: !43, size: 32, offset: 77216)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !659, file: !20, line: 535, baseType: !43, size: 32, offset: 77248)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !659, file: !20, line: 536, baseType: !43, size: 32, offset: 77280)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !659, file: !20, line: 539, baseType: !802, size: 512, offset: 77312)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 512, elements: !803)
!803 = !{!131, !51}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !659, file: !20, line: 540, baseType: !805, size: 2048, offset: 77824)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !806)
!806 = !{!713, !65}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !659, file: !20, line: 542, baseType: !808, size: 16, offset: 79872)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 16, elements: !50)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !659, file: !20, line: 543, baseType: !810, size: 128, offset: 79888)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 128, elements: !130)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !78, file: !20, line: 547, baseType: !812, size: 64, offset: 167168)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !20, line: 248, baseType: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !20, line: 248, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !78, file: !20, line: 604, baseType: !816, size: 23936, offset: 167232)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !20, line: 550, size: 23936, elements: !817)
!817 = !{!818, !843, !847, !849, !851, !852, !853, !854, !855, !856, !857, !858, !861, !863, !865, !868, !869}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !816, file: !20, line: 579, baseType: !819, size: 3904)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !20, line: 553, size: 3904, elements: !820)
!820 = !{!821, !822, !823, !824, !826, !827, !828, !829, !830, !832, !835, !836, !837, !838, !839, !841}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !819, file: !20, line: 556, baseType: !43, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !819, file: !20, line: 558, baseType: !43, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !819, file: !20, line: 560, baseType: !43, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !819, file: !20, line: 562, baseType: !825, size: 608, offset: 96)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 608, elements: !638)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !819, file: !20, line: 563, baseType: !43, size: 32, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !819, file: !20, line: 564, baseType: !43, size: 32, offset: 736)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !819, file: !20, line: 565, baseType: !43, size: 32, offset: 768)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !819, file: !20, line: 566, baseType: !184, size: 64, offset: 800)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !819, file: !20, line: 567, baseType: !831, size: 2048, offset: 864)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, elements: !712)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !819, file: !20, line: 568, baseType: !833, size: 544, offset: 2912)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 544, elements: !834)
!834 = !{!525}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !819, file: !20, line: 571, baseType: !43, size: 32, offset: 3456)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !819, file: !20, line: 572, baseType: !43, size: 32, offset: 3488)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !819, file: !20, line: 573, baseType: !43, size: 32, offset: 3520)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !819, file: !20, line: 575, baseType: !184, size: 64, offset: 3552)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !819, file: !20, line: 577, baseType: !840, size: 192, offset: 3648)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 192, elements: !499)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !819, file: !20, line: 578, baseType: !842, size: 64, offset: 3840)
!842 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !816, file: !20, line: 584, baseType: !844, size: 160, offset: 3904)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 5)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !816, file: !20, line: 585, baseType: !848, size: 320, offset: 4096)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 320, elements: !845)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !816, file: !20, line: 586, baseType: !850, size: 320, offset: 4416)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 320, elements: !845)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !816, file: !20, line: 587, baseType: !833, size: 544, offset: 4736)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !816, file: !20, line: 589, baseType: !848, size: 320, offset: 5312)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !816, file: !20, line: 590, baseType: !850, size: 320, offset: 5632)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !816, file: !20, line: 591, baseType: !850, size: 320, offset: 5952)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !816, file: !20, line: 592, baseType: !850, size: 320, offset: 6272)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !816, file: !20, line: 593, baseType: !850, size: 320, offset: 6592)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !816, file: !20, line: 594, baseType: !850, size: 320, offset: 6912)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !816, file: !20, line: 596, baseType: !859, size: 6080, offset: 7232)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 6080, elements: !860)
!860 = !{!846, !639}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !816, file: !20, line: 597, baseType: !862, size: 2176, offset: 13312)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 2176, elements: !524)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !816, file: !20, line: 598, baseType: !864, size: 128, offset: 15488)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !50)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !816, file: !20, line: 599, baseType: !866, size: 8192, offset: 15616)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 8192, elements: !867)
!867 = !{!51, !51, !713}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !816, file: !20, line: 601, baseType: !184, size: 64, offset: 23808)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_frames", scope: !816, file: !20, line: 602, baseType: !184, size: 64, offset: 23872)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "predict_16x16", scope: !78, file: !20, line: 607, baseType: !871, size: 448, offset: 191168)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 448, elements: !877)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict_t", file: !873, line: 27, baseType: !874)
!873 = !DIFile(filename: "./common/predict.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "c7827bfe44f4a550b7080533457a8327")
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !251}
!877 = !{!878}
!878 = !DISubrange(count: 7)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8c", scope: !78, file: !20, line: 608, baseType: !871, size: 448, offset: 191616)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "predict_8x8", scope: !78, file: !20, line: 609, baseType: !881, size: 768, offset: 192064)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 768, elements: !886)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict8x8_t", file: !873, line: 28, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !251, !251}
!886 = !{!887}
