; ModuleID = 'muxers.c'
source_filename = "muxers.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, i32, i32, float, float, float, i32, float, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }
%struct.yuv_input_t = type { ptr, i32, i32, i32 }
%struct.x264_picture_t = type { i32, i32, i64, %struct.x264_image_t }
%struct.x264_image_t = type { i32, i32, [4 x i32], [4 x ptr] }
%struct.y4m_input_t = type { ptr, i32, i32, i32, i32, i32, i32 }
%struct.thread_input_t = type { ptr, ptr, ptr, %struct.x264_picture_t, i64, i32, i32, i32, ptr }
%struct.thread_input_arg_t = type { ptr, ptr, i32, i32 }
%struct.mkv_t = type { ptr, ptr, ptr, i32, i32, i32, i32, i32, i32, i64, i32, i32, i8 }

@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1, !dbg !0

!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 210, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 6)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 7)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 233, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 8)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 9)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !49, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !56, isLocal: true, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 33)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 246, type: !56, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !2, line: 291, type: !34, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !2, line: 293, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 32)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !2, line: 303, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 19)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(scope: null, file: !2, line: 522, type: !19, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(scope: null, file: !2, line: 849, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 5)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(scope: null, file: !2, line: 849, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 16)
!85 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !86, globals: !161, splitDebugInlining: false, nameTableKind: None)
!86 = !{!87, !88, !90, !91, !96, !100, !158}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !89, line: 27, baseType: !87)
!89 = !DIFile(filename: "./muxers.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "ed3d03989a60e06598fb30a2be34ae15")
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !92, line: 27, baseType: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !94, line: 45, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !92, line: 26, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !94, line: 42, baseType: !99)
!99 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !102, line: 7, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!105 = !{!106, !107, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122, !124, !125, !126, !129, !131, !133, !137, !140, !142, !145, !148, !149, !150, !153, !154}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !103, file: !104, line: 51, baseType: !90, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !103, file: !104, line: 54, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !103, file: !104, line: 55, baseType: !108, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !103, file: !104, line: 56, baseType: !108, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !103, file: !104, line: 57, baseType: !108, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !103, file: !104, line: 58, baseType: !108, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !103, file: !104, line: 59, baseType: !108, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !103, file: !104, line: 60, baseType: !108, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !103, file: !104, line: 61, baseType: !108, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !103, file: !104, line: 64, baseType: !108, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !103, file: !104, line: 65, baseType: !108, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !103, file: !104, line: 66, baseType: !108, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !103, file: !104, line: 68, baseType: !120, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !104, line: 36, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !103, file: !104, line: 70, baseType: !123, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !103, file: !104, line: 72, baseType: !90, size: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !103, file: !104, line: 73, baseType: !90, size: 32, offset: 928)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !103, file: !104, line: 74, baseType: !127, size: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !94, line: 152, baseType: !128)
!128 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !103, file: !104, line: 77, baseType: !130, size: 16, offset: 1024)
!130 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !103, file: !104, line: 78, baseType: !132, size: 8, offset: 1040)
!132 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !103, file: !104, line: 79, baseType: !134, size: 8, offset: 1048)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !103, file: !104, line: 81, baseType: !138, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !104, line: 43, baseType: null)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !103, file: !104, line: 89, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !94, line: 153, baseType: !128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !103, file: !104, line: 91, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !104, line: 37, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !103, file: !104, line: 92, baseType: !146, size: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !104, line: 38, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !103, file: !104, line: 93, baseType: !123, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !103, file: !104, line: 94, baseType: !87, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !103, file: !104, line: 95, baseType: !151, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !95)
!152 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !103, file: !104, line: 96, baseType: !90, size: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !103, file: !104, line: 98, baseType: !155, size: 160, offset: 1568)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 20)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !159, line: 27, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !94, line: 44, baseType: !128)
!161 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !54, !59, !61, !63, !68, !73, !75, !80}
!162 = !{i32 7, !"Dwarf Version", i32 5}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{i32 8, !"PIC Level", i32 2}
!166 = !{i32 7, !"PIE Level", i32 2}
!167 = !{i32 7, !"uwtable", i32 2}
!168 = !{!"clang version 16.0.0"}
!169 = distinct !DISubprogram(name: "open_file_yuv", scope: !2, file: !2, line: 63, type: !170, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !318)
!170 = !DISubroutineType(types: !171)
!171 = !{!90, !108, !172, !173}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !175, line: 295, baseType: !176)
!175 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !175, line: 151, size: 4928, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !222, !223, !224, !225, !229, !230, !244, !245, !246, !247, !248, !276, !315, !316, !317}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !176, file: !175, line: 154, baseType: !99, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !176, file: !175, line: 155, baseType: !90, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !176, file: !175, line: 156, baseType: !90, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !176, file: !175, line: 159, baseType: !90, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !176, file: !175, line: 160, baseType: !90, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !176, file: !175, line: 161, baseType: !90, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !176, file: !175, line: 162, baseType: !90, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !176, file: !175, line: 163, baseType: !90, size: 32, offset: 224)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !176, file: !175, line: 180, baseType: !187, size: 288, offset: 256)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !176, file: !175, line: 165, size: 288, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !187, file: !175, line: 168, baseType: !90, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !187, file: !175, line: 169, baseType: !90, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !187, file: !175, line: 171, baseType: !90, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !187, file: !175, line: 174, baseType: !90, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !187, file: !175, line: 175, baseType: !90, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !187, file: !175, line: 176, baseType: !90, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !187, file: !175, line: 177, baseType: !90, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !187, file: !175, line: 178, baseType: !90, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !187, file: !175, line: 179, baseType: !90, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !176, file: !175, line: 182, baseType: !90, size: 32, offset: 544)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !176, file: !175, line: 183, baseType: !90, size: 32, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !176, file: !175, line: 186, baseType: !90, size: 32, offset: 608)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !176, file: !175, line: 187, baseType: !90, size: 32, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !176, file: !175, line: 188, baseType: !90, size: 32, offset: 672)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !176, file: !175, line: 189, baseType: !90, size: 32, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !176, file: !175, line: 190, baseType: !90, size: 32, offset: 736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !176, file: !175, line: 191, baseType: !90, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !176, file: !175, line: 192, baseType: !90, size: 32, offset: 800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !176, file: !175, line: 193, baseType: !90, size: 32, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !176, file: !175, line: 194, baseType: !90, size: 32, offset: 864)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !176, file: !175, line: 196, baseType: !90, size: 32, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !176, file: !175, line: 197, baseType: !90, size: 32, offset: 928)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !176, file: !175, line: 198, baseType: !90, size: 32, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !176, file: !175, line: 200, baseType: !90, size: 32, offset: 992)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !176, file: !175, line: 201, baseType: !90, size: 32, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !176, file: !175, line: 203, baseType: !90, size: 32, offset: 1056)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !176, file: !175, line: 205, baseType: !90, size: 32, offset: 1088)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !176, file: !175, line: 206, baseType: !108, size: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !176, file: !175, line: 207, baseType: !218, size: 128, offset: 1216)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, elements: !83)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !92, line: 24, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !94, line: 38, baseType: !221)
!221 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !176, file: !175, line: 208, baseType: !218, size: 128, offset: 1344)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !176, file: !175, line: 209, baseType: !218, size: 128, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !176, file: !175, line: 210, baseType: !218, size: 128, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !176, file: !175, line: 211, baseType: !226, size: 512, offset: 1728)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 512, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !176, file: !175, line: 212, baseType: !226, size: 512, offset: 2240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !176, file: !175, line: 215, baseType: !231, size: 64, offset: 2752)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !87, !90, !234, !236}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !238)
!238 = !{!239, !241, !242, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !237, file: !240, baseType: !99, size: 32)
!240 = !DIFile(filename: "muxers.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !237, file: !240, baseType: !99, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !237, file: !240, baseType: !87, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !237, file: !240, baseType: !87, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !176, file: !175, line: 216, baseType: !87, size: 64, offset: 2816)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !176, file: !175, line: 217, baseType: !90, size: 32, offset: 2880)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !176, file: !175, line: 218, baseType: !90, size: 32, offset: 2912)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !176, file: !175, line: 219, baseType: !108, size: 64, offset: 2944)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !176, file: !175, line: 252, baseType: !249, size: 768, offset: 3008)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !176, file: !175, line: 222, size: 768, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !271, !272, !274, !275}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !249, file: !175, line: 224, baseType: !99, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !249, file: !175, line: 225, baseType: !99, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !249, file: !175, line: 227, baseType: !90, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !249, file: !175, line: 228, baseType: !90, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !249, file: !175, line: 229, baseType: !90, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !249, file: !175, line: 230, baseType: !90, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !249, file: !175, line: 231, baseType: !90, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !249, file: !175, line: 233, baseType: !90, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !249, file: !175, line: 234, baseType: !90, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !249, file: !175, line: 235, baseType: !90, size: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !249, file: !175, line: 236, baseType: !90, size: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !249, file: !175, line: 237, baseType: !90, size: 32, offset: 352)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !249, file: !175, line: 238, baseType: !90, size: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !249, file: !175, line: 239, baseType: !90, size: 32, offset: 416)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !249, file: !175, line: 240, baseType: !90, size: 32, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !249, file: !175, line: 241, baseType: !90, size: 32, offset: 480)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !249, file: !175, line: 242, baseType: !90, size: 32, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !249, file: !175, line: 243, baseType: !90, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !249, file: !175, line: 244, baseType: !270, size: 32, offset: 576)
!270 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !249, file: !175, line: 245, baseType: !270, size: 32, offset: 608)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !249, file: !175, line: 248, baseType: !273, size: 64, offset: 640)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, elements: !5)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !249, file: !175, line: 250, baseType: !90, size: 32, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !249, file: !175, line: 251, baseType: !90, size: 32, offset: 736)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !176, file: !175, line: 289, baseType: !277, size: 1024, offset: 3776)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !176, file: !175, line: 255, size: 1024, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !313, !314}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !277, file: !175, line: 257, baseType: !90, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !277, file: !175, line: 259, baseType: !90, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !277, file: !175, line: 260, baseType: !90, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !277, file: !175, line: 261, baseType: !90, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !277, file: !175, line: 262, baseType: !90, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !277, file: !175, line: 264, baseType: !90, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !277, file: !175, line: 265, baseType: !270, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !277, file: !175, line: 266, baseType: !270, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !277, file: !175, line: 267, baseType: !90, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !277, file: !175, line: 268, baseType: !90, size: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !277, file: !175, line: 269, baseType: !270, size: 32, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !277, file: !175, line: 270, baseType: !270, size: 32, offset: 352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !277, file: !175, line: 271, baseType: !270, size: 32, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !277, file: !175, line: 273, baseType: !90, size: 32, offset: 416)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !277, file: !175, line: 274, baseType: !270, size: 32, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !277, file: !175, line: 277, baseType: !90, size: 32, offset: 480)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !277, file: !175, line: 278, baseType: !108, size: 64, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !277, file: !175, line: 279, baseType: !90, size: 32, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !277, file: !175, line: 280, baseType: !108, size: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !277, file: !175, line: 283, baseType: !270, size: 32, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !277, file: !175, line: 284, baseType: !270, size: 32, offset: 736)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !277, file: !175, line: 285, baseType: !270, size: 32, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !277, file: !175, line: 286, baseType: !302, size: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !175, line: 149, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !175, line: 142, size: 256, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !304, file: !175, line: 144, baseType: !90, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !304, file: !175, line: 144, baseType: !90, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !304, file: !175, line: 145, baseType: !90, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !304, file: !175, line: 146, baseType: !90, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !304, file: !175, line: 147, baseType: !270, size: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !304, file: !175, line: 148, baseType: !312, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !277, file: !175, line: 287, baseType: !90, size: 32, offset: 896)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !277, file: !175, line: 288, baseType: !108, size: 64, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !176, file: !175, line: 292, baseType: !90, size: 32, offset: 4800)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !176, file: !175, line: 293, baseType: !90, size: 32, offset: 4832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !176, file: !175, line: 294, baseType: !90, size: 32, offset: 4864)
!318 = !{!319, !320, !321, !322}
!319 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !169, file: !2, line: 63, type: !108)
!320 = !DILocalVariable(name: "p_handle", arg: 2, scope: !169, file: !2, line: 63, type: !172)
!321 = !DILocalVariable(name: "p_param", arg: 3, scope: !169, file: !2, line: 63, type: !173)
!322 = !DILocalVariable(name: "h", scope: !169, file: !2, line: 65, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv_input_t", file: !2, line: 60, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 56, size: 192, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !325, file: !2, line: 57, baseType: !100, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !325, file: !2, line: 58, baseType: !90, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !325, file: !2, line: 58, baseType: !90, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !325, file: !2, line: 59, baseType: !90, size: 32, offset: 128)
!331 = !DILocation(line: 0, scope: !169)
!332 = !DILocation(line: 65, column: 22, scope: !169)
!333 = !DILocation(line: 66, column: 25, scope: !169)
!334 = !DILocation(line: 66, column: 8, scope: !169)
!335 = !{!336, !336, i64 0}
!336 = !{!"int", !337, i64 0}
!337 = !{!"omnipotent char", !338, i64 0}
!338 = !{!"Simple C/C++ TBAA"}
!339 = !DILocation(line: 66, column: 14, scope: !169)
!340 = !DILocation(line: 68, column: 8, scope: !169)
!341 = !DILocation(line: 68, column: 19, scope: !169)
!342 = !{!343, !336, i64 16}
!343 = !{!"", !344, i64 0, !336, i64 8, !336, i64 12, !336, i64 16}
!344 = !{!"any pointer", !337, i64 0}
!345 = !DILocation(line: 70, column: 10, scope: !346)
!346 = distinct !DILexicalBlock(scope: !169, file: !2, line: 70, column: 9)
!347 = !DILocation(line: 70, column: 9, scope: !169)
!348 = !DILocation(line: 71, column: 17, scope: !346)
!349 = !{!344, !344, i64 0}
!350 = !DILocation(line: 71, column: 9, scope: !346)
!351 = !DILocation(line: 73, column: 17, scope: !346)
!352 = !DILocation(line: 0, scope: !346)
!353 = !{!343, !344, i64 0}
!354 = !DILocation(line: 74, column: 15, scope: !355)
!355 = distinct !DILexicalBlock(scope: !169, file: !2, line: 74, column: 9)
!356 = !DILocation(line: 74, column: 9, scope: !169)
!357 = !DILocation(line: 77, column: 15, scope: !169)
!358 = !DILocation(line: 78, column: 5, scope: !169)
!359 = !DILocation(line: 79, column: 1, scope: !169)
!360 = !DISubprogram(name: "malloc", scope: !361, file: !361, line: 540, type: !362, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!361 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!362 = !DISubroutineType(types: !363)
!363 = !{!87, !151}
!364 = !{}
!365 = !DISubprogram(name: "strcmp", scope: !366, file: !366, line: 156, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!366 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!367 = !DISubroutineType(types: !368)
!368 = !{!90, !234, !234}
!369 = !DISubprogram(name: "fopen", linkageName: "fopen64", scope: !370, file: !370, line: 270, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!370 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!371 = !DISubroutineType(types: !372)
!372 = !{!100, !373, !373}
!373 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !234)
!374 = distinct !DISubprogram(name: "get_frame_total_yuv", scope: !2, file: !2, line: 81, type: !375, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !377)
!375 = !DISubroutineType(types: !376)
!376 = !{!90, !88}
!377 = !{!378, !379, !380, !381}
!378 = !DILocalVariable(name: "handle", arg: 1, scope: !374, file: !2, line: 81, type: !88)
!379 = !DILocalVariable(name: "h", scope: !374, file: !2, line: 83, type: !323)
!380 = !DILocalVariable(name: "i_frame_total", scope: !374, file: !2, line: 84, type: !90)
!381 = !DILocalVariable(name: "i_size", scope: !382, file: !2, line: 88, type: !91)
!382 = distinct !DILexicalBlock(scope: !383, file: !2, line: 87, column: 5)
!383 = distinct !DILexicalBlock(scope: !374, file: !2, line: 86, column: 9)
!384 = !DILocation(line: 0, scope: !374)
!385 = !DILocation(line: 86, column: 20, scope: !383)
!386 = !DILocation(line: 86, column: 10, scope: !383)
!387 = !DILocation(line: 86, column: 9, scope: !374)
!388 = !DILocation(line: 88, column: 37, scope: !382)
!389 = !DILocation(line: 88, column: 27, scope: !382)
!390 = !DILocation(line: 0, scope: !382)
!391 = !DILocation(line: 89, column: 19, scope: !382)
!392 = !DILocation(line: 89, column: 9, scope: !382)
!393 = !DILocation(line: 90, column: 45, scope: !382)
!394 = !{!343, !336, i64 8}
!395 = !DILocation(line: 90, column: 56, scope: !382)
!396 = !{!343, !336, i64 12}
!397 = !DILocation(line: 90, column: 51, scope: !382)
!398 = !DILocation(line: 90, column: 63, scope: !382)
!399 = !DILocation(line: 90, column: 67, scope: !382)
!400 = !DILocation(line: 90, column: 40, scope: !382)
!401 = !DILocation(line: 90, column: 38, scope: !382)
!402 = !DILocation(line: 90, column: 25, scope: !382)
!403 = !DILocation(line: 91, column: 5, scope: !382)
!404 = !DILocation(line: 93, column: 5, scope: !374)
!405 = !DISubprogram(name: "fseeko", linkageName: "fseeko64", scope: !370, file: !370, line: 744, type: !406, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!406 = !DISubroutineType(types: !407)
!407 = !{!90, !100, !141, !90}
!408 = !DISubprogram(name: "ftello", linkageName: "ftello64", scope: !370, file: !370, line: 747, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!409 = !DISubroutineType(types: !410)
!410 = !{!141, !100}
!411 = distinct !DISubprogram(name: "read_frame_yuv", scope: !2, file: !2, line: 96, type: !412, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !432)
!412 = !DISubroutineType(types: !413)
!413 = !{!90, !414, !88, !90}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !175, line: 354, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !175, line: 342, size: 576, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !416, file: !175, line: 346, baseType: !90, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !416, file: !175, line: 348, baseType: !90, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !416, file: !175, line: 350, baseType: !158, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !416, file: !175, line: 353, baseType: !422, size: 448, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !175, line: 340, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !175, line: 333, size: 448, elements: !424)
!424 = !{!425, !426, !427, !429}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !423, file: !175, line: 335, baseType: !90, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !423, file: !175, line: 337, baseType: !90, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !423, file: !175, line: 338, baseType: !428, size: 128, offset: 64)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !20)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !423, file: !175, line: 339, baseType: !430, size: 256, offset: 192)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 256, elements: !20)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!432 = !{!433, !434, !435, !436}
!433 = !DILocalVariable(name: "p_pic", arg: 1, scope: !411, file: !2, line: 96, type: !414)
!434 = !DILocalVariable(name: "handle", arg: 2, scope: !411, file: !2, line: 96, type: !88)
!435 = !DILocalVariable(name: "i_frame", arg: 3, scope: !411, file: !2, line: 96, type: !90)
!436 = !DILocalVariable(name: "h", scope: !411, file: !2, line: 98, type: !323)
!437 = !DILocation(line: 0, scope: !411)
!438 = !DILocation(line: 100, column: 23, scope: !439)
!439 = distinct !DILexicalBlock(scope: !411, file: !2, line: 100, column: 9)
!440 = !DILocation(line: 100, column: 17, scope: !439)
!441 = !DILocation(line: 100, column: 9, scope: !411)
!442 = !DILocation(line: 101, column: 23, scope: !443)
!443 = distinct !DILexicalBlock(scope: !439, file: !2, line: 101, column: 13)
!444 = !DILocation(line: 101, column: 27, scope: !443)
!445 = !DILocation(line: 101, column: 50, scope: !443)
!446 = !DILocation(line: 101, column: 47, scope: !443)
!447 = !DILocation(line: 101, column: 61, scope: !443)
!448 = !DILocation(line: 101, column: 58, scope: !443)
!449 = !DILocation(line: 101, column: 45, scope: !443)
!450 = !DILocation(line: 101, column: 56, scope: !443)
!451 = !DILocation(line: 101, column: 68, scope: !443)
!452 = !DILocation(line: 101, column: 72, scope: !443)
!453 = !DILocation(line: 101, column: 13, scope: !443)
!454 = !DILocation(line: 101, column: 13, scope: !439)
!455 = !DILocation(line: 104, column: 27, scope: !456)
!456 = distinct !DILexicalBlock(scope: !411, file: !2, line: 104, column: 9)
!457 = !DILocation(line: 104, column: 16, scope: !456)
!458 = !DILocation(line: 104, column: 43, scope: !456)
!459 = !DILocation(line: 104, column: 54, scope: !456)
!460 = !DILocation(line: 104, column: 49, scope: !456)
!461 = !DILocation(line: 104, column: 40, scope: !456)
!462 = !DILocation(line: 104, column: 65, scope: !456)
!463 = !DILocation(line: 104, column: 9, scope: !456)
!464 = !DILocation(line: 104, column: 70, scope: !456)
!465 = !DILocation(line: 105, column: 13, scope: !456)
!466 = !DILocation(line: 105, column: 23, scope: !456)
!467 = !DILocation(line: 105, column: 50, scope: !456)
!468 = !DILocation(line: 105, column: 61, scope: !456)
!469 = !DILocation(line: 105, column: 56, scope: !456)
!470 = !DILocation(line: 105, column: 68, scope: !456)
!471 = !DILocation(line: 105, column: 47, scope: !456)
!472 = !DILocation(line: 105, column: 76, scope: !456)
!473 = !DILocation(line: 105, column: 16, scope: !456)
!474 = !DILocation(line: 105, column: 81, scope: !456)
!475 = !DILocation(line: 106, column: 13, scope: !456)
!476 = !DILocation(line: 106, column: 23, scope: !456)
!477 = !DILocation(line: 106, column: 50, scope: !456)
!478 = !DILocation(line: 106, column: 61, scope: !456)
!479 = !DILocation(line: 106, column: 56, scope: !456)
!480 = !DILocation(line: 106, column: 68, scope: !456)
!481 = !DILocation(line: 106, column: 47, scope: !456)
!482 = !DILocation(line: 106, column: 76, scope: !456)
!483 = !DILocation(line: 106, column: 16, scope: !456)
!484 = !DILocation(line: 106, column: 81, scope: !456)
!485 = !DILocation(line: 104, column: 9, scope: !411)
!486 = !DILocation(line: 109, column: 28, scope: !411)
!487 = !DILocation(line: 109, column: 19, scope: !411)
!488 = !DILocation(line: 111, column: 5, scope: !411)
!489 = !DILocation(line: 112, column: 1, scope: !411)
!490 = !DISubprogram(name: "fread", scope: !370, file: !370, line: 675, type: !491, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!491 = !DISubroutineType(types: !492)
!492 = !{!95, !493, !151, !151, !494}
!493 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!494 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !100)
!495 = distinct !DISubprogram(name: "close_file_yuv", scope: !2, file: !2, line: 114, type: !375, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !496)
!496 = !{!497, !498}
!497 = !DILocalVariable(name: "handle", arg: 1, scope: !495, file: !2, line: 114, type: !88)
!498 = !DILocalVariable(name: "h", scope: !495, file: !2, line: 116, type: !323)
!499 = !DILocation(line: 0, scope: !495)
!500 = !DILocation(line: 117, column: 10, scope: !501)
!501 = distinct !DILexicalBlock(scope: !495, file: !2, line: 117, column: 9)
!502 = !DILocation(line: 117, column: 12, scope: !501)
!503 = !DILocation(line: 117, column: 19, scope: !501)
!504 = !DILocation(line: 117, column: 16, scope: !501)
!505 = !DILocation(line: 117, column: 9, scope: !495)
!506 = !DILocation(line: 119, column: 5, scope: !495)
!507 = !DILocation(line: 120, column: 5, scope: !495)
!508 = !DILocation(line: 121, column: 5, scope: !495)
!509 = !DILocation(line: 122, column: 1, scope: !495)
!510 = !DISubprogram(name: "fclose", scope: !370, file: !370, line: 178, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!511 = !DISubroutineType(types: !512)
!512 = !{!90, !100}
!513 = !DISubprogram(name: "free", scope: !361, file: !361, line: 555, type: !514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !87}
!516 = distinct !DISubprogram(name: "open_file_y4m", scope: !2, file: !2, line: 138, type: !170, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !529, !530, !531, !532}
!518 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !516, file: !2, line: 138, type: !108)
!519 = !DILocalVariable(name: "p_handle", arg: 2, scope: !516, file: !2, line: 138, type: !172)
!520 = !DILocalVariable(name: "p_param", arg: 3, scope: !516, file: !2, line: 138, type: !173)
!521 = !DILocalVariable(name: "i", scope: !516, file: !2, line: 140, type: !90)
!522 = !DILocalVariable(name: "n", scope: !516, file: !2, line: 140, type: !90)
!523 = !DILocalVariable(name: "d", scope: !516, file: !2, line: 140, type: !90)
!524 = !DILocalVariable(name: "interlaced", scope: !516, file: !2, line: 141, type: !90)
!525 = !DILocalVariable(name: "header", scope: !516, file: !2, line: 142, type: !526)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 90)
!529 = !DILocalVariable(name: "tokstart", scope: !516, file: !2, line: 143, type: !108)
!530 = !DILocalVariable(name: "tokend", scope: !516, file: !2, line: 143, type: !108)
!531 = !DILocalVariable(name: "header_end", scope: !516, file: !2, line: 143, type: !108)
!532 = !DILocalVariable(name: "h", scope: !516, file: !2, line: 144, type: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "y4m_input_t", file: !2, line: 131, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 125, size: 256, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !535, file: !2, line: 126, baseType: !100, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !535, file: !2, line: 127, baseType: !90, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !535, file: !2, line: 127, baseType: !90, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !535, file: !2, line: 128, baseType: !90, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "seq_header_len", scope: !535, file: !2, line: 129, baseType: !90, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_header_len", scope: !535, file: !2, line: 129, baseType: !90, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !535, file: !2, line: 130, baseType: !90, size: 32, offset: 224)
!544 = !DILocation(line: 0, scope: !516)
!545 = !DILocation(line: 140, column: 5, scope: !516)
!546 = !DILocation(line: 142, column: 5, scope: !516)
!547 = !DILocation(line: 142, column: 10, scope: !516)
!548 = !DILocation(line: 143, column: 5, scope: !516)
!549 = !DILocation(line: 144, column: 22, scope: !516)
!550 = !DILocation(line: 146, column: 8, scope: !516)
!551 = !DILocation(line: 146, column: 19, scope: !516)
!552 = !{!553, !336, i64 16}
!553 = !{!"", !344, i64 0, !336, i64 8, !336, i64 12, !336, i64 16, !336, i64 20, !336, i64 24, !336, i64 28}
!554 = !DILocation(line: 148, column: 10, scope: !555)
!555 = distinct !DILexicalBlock(scope: !516, file: !2, line: 148, column: 9)
!556 = !DILocation(line: 148, column: 9, scope: !516)
!557 = !DILocation(line: 149, column: 17, scope: !555)
!558 = !DILocation(line: 149, column: 9, scope: !555)
!559 = !DILocation(line: 151, column: 17, scope: !555)
!560 = !DILocation(line: 0, scope: !555)
!561 = !{!553, !344, i64 0}
!562 = !DILocation(line: 152, column: 15, scope: !563)
!563 = distinct !DILexicalBlock(scope: !516, file: !2, line: 152, column: 9)
!564 = !DILocation(line: 152, column: 9, scope: !516)
!565 = !DILocation(line: 155, column: 8, scope: !516)
!566 = !DILocation(line: 155, column: 25, scope: !516)
!567 = !{!553, !336, i64 24}
!568 = !DILocation(line: 158, column: 5, scope: !569)
!569 = distinct !DILexicalBlock(scope: !516, file: !2, line: 158, column: 5)
!570 = !DILocation(line: 160, column: 30, scope: !571)
!571 = distinct !DILexicalBlock(scope: !572, file: !2, line: 159, column: 5)
!572 = distinct !DILexicalBlock(scope: !569, file: !2, line: 158, column: 5)
!573 = !DILocation(line: 160, column: 21, scope: !571)
!574 = !DILocation(line: 160, column: 9, scope: !571)
!575 = !DILocation(line: 160, column: 19, scope: !571)
!576 = !{!337, !337, i64 0}
!577 = !DILocation(line: 161, column: 23, scope: !578)
!578 = distinct !DILexicalBlock(scope: !571, file: !2, line: 161, column: 13)
!579 = !DILocation(line: 0, scope: !572)
!580 = !DILocation(line: 161, column: 13, scope: !571)
!581 = !DILocation(line: 158, column: 16, scope: !572)
!582 = distinct !{!582, !568, !583, !584}
!583 = !DILocation(line: 169, column: 5, scope: !569)
!584 = !{!"llvm.loop.mustprogress"}
!585 = !DILocation(line: 165, column: 13, scope: !586)
!586 = distinct !DILexicalBlock(scope: !578, file: !2, line: 162, column: 9)
!587 = !DILocation(line: 165, column: 25, scope: !586)
!588 = !DILocation(line: 166, column: 21, scope: !586)
!589 = !DILocation(line: 166, column: 13, scope: !586)
!590 = !DILocation(line: 166, column: 25, scope: !586)
!591 = !DILocation(line: 170, column: 33, scope: !592)
!592 = distinct !DILexicalBlock(scope: !516, file: !2, line: 170, column: 9)
!593 = !DILocation(line: 170, column: 9, scope: !516)
!594 = !DILocation(line: 165, column: 21, scope: !586)
!595 = !DILocation(line: 174, column: 27, scope: !516)
!596 = !DILocation(line: 174, column: 19, scope: !516)
!597 = !DILocation(line: 175, column: 8, scope: !516)
!598 = !DILocation(line: 175, column: 23, scope: !516)
!599 = !{!553, !336, i64 20}
!600 = !DILocation(line: 176, column: 60, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !2, line: 176, column: 5)
!602 = distinct !DILexicalBlock(scope: !516, file: !2, line: 176, column: 5)
!603 = !DILocation(line: 176, column: 5, scope: !602)
!604 = !DILocation(line: 176, column: 22, scope: !602)
!605 = !DILocation(line: 178, column: 12, scope: !606)
!606 = distinct !DILexicalBlock(scope: !607, file: !2, line: 178, column: 12)
!607 = distinct !DILexicalBlock(scope: !601, file: !2, line: 177, column: 5)
!608 = !DILocation(line: 178, column: 21, scope: !606)
!609 = !DILocation(line: 178, column: 12, scope: !607)
!610 = !DILocation(line: 179, column: 25, scope: !607)
!611 = !DILocation(line: 179, column: 9, scope: !607)
!612 = !DILocation(line: 182, column: 43, scope: !613)
!613 = distinct !DILexicalBlock(scope: !607, file: !2, line: 180, column: 9)
!614 = !DILocation(line: 182, column: 41, scope: !613)
!615 = !{!616, !336, i64 12}
!616 = !{!"x264_param_t", !336, i64 0, !336, i64 4, !336, i64 8, !336, i64 12, !336, i64 16, !336, i64 20, !336, i64 24, !336, i64 28, !617, i64 32, !336, i64 68, !336, i64 72, !336, i64 76, !336, i64 80, !336, i64 84, !336, i64 88, !336, i64 92, !336, i64 96, !336, i64 100, !336, i64 104, !336, i64 108, !336, i64 112, !336, i64 116, !336, i64 120, !336, i64 124, !336, i64 128, !336, i64 132, !336, i64 136, !344, i64 144, !337, i64 152, !337, i64 168, !337, i64 184, !337, i64 200, !337, i64 216, !337, i64 280, !344, i64 344, !344, i64 352, !336, i64 360, !336, i64 364, !344, i64 368, !618, i64 376, !620, i64 472, !336, i64 600, !336, i64 604, !336, i64 608}
!617 = !{!"", !336, i64 0, !336, i64 4, !336, i64 8, !336, i64 12, !336, i64 16, !336, i64 20, !336, i64 24, !336, i64 28, !336, i64 32}
!618 = !{!"", !336, i64 0, !336, i64 4, !336, i64 8, !336, i64 12, !336, i64 16, !336, i64 20, !336, i64 24, !336, i64 28, !336, i64 32, !336, i64 36, !336, i64 40, !336, i64 44, !336, i64 48, !336, i64 52, !336, i64 56, !336, i64 60, !336, i64 64, !336, i64 68, !619, i64 72, !619, i64 76, !337, i64 80, !336, i64 88, !336, i64 92}
!619 = !{!"float", !337, i64 0}
!620 = !{!"", !336, i64 0, !336, i64 4, !336, i64 8, !336, i64 12, !336, i64 16, !336, i64 20, !619, i64 24, !619, i64 28, !336, i64 32, !336, i64 36, !619, i64 40, !619, i64 44, !619, i64 48, !336, i64 52, !619, i64 56, !336, i64 60, !344, i64 64, !336, i64 72, !344, i64 80, !619, i64 88, !619, i64 92, !619, i64 96, !344, i64 104, !336, i64 112, !344, i64 120}
!621 = !DILocation(line: 182, column: 22, scope: !613)
!622 = !{!553, !336, i64 8}
!623 = !DILocation(line: 183, column: 22, scope: !613)
!624 = !DILocation(line: 184, column: 13, scope: !613)
!625 = !DILocation(line: 186, column: 45, scope: !613)
!626 = !DILocation(line: 186, column: 43, scope: !613)
!627 = !{!616, !336, i64 16}
!628 = !DILocation(line: 186, column: 23, scope: !613)
!629 = !{!553, !336, i64 12}
!630 = !DILocation(line: 187, column: 22, scope: !613)
!631 = !DILocation(line: 188, column: 13, scope: !613)
!632 = !DILocation(line: 190, column: 17, scope: !633)
!633 = distinct !DILexicalBlock(scope: !613, file: !2, line: 190, column: 17)
!634 = !DILocation(line: 190, column: 17, scope: !613)
!635 = !DILocation(line: 192, column: 25, scope: !636)
!636 = distinct !DILexicalBlock(scope: !633, file: !2, line: 191, column: 13)
!637 = !DILocation(line: 192, column: 17, scope: !636)
!638 = !DILocation(line: 193, column: 17, scope: !636)
!639 = !DILocation(line: 195, column: 24, scope: !613)
!640 = !DILocation(line: 196, column: 13, scope: !613)
!641 = !DILocation(line: 198, column: 29, scope: !613)
!642 = !DILocation(line: 198, column: 20, scope: !613)
!643 = !DILocation(line: 198, column: 13, scope: !613)
!644 = !DILocation(line: 206, column: 25, scope: !645)
!645 = distinct !DILexicalBlock(scope: !613, file: !2, line: 199, column: 13)
!646 = !DILocation(line: 206, column: 17, scope: !645)
!647 = !DILocation(line: 207, column: 13, scope: !645)
!648 = !DILocation(line: 210, column: 17, scope: !649)
!649 = distinct !DILexicalBlock(scope: !613, file: !2, line: 210, column: 17)
!650 = !DILocation(line: 210, column: 51, scope: !649)
!651 = !DILocation(line: 210, column: 56, scope: !649)
!652 = !DILocation(line: 212, column: 17, scope: !653)
!653 = distinct !DILexicalBlock(scope: !649, file: !2, line: 211, column: 13)
!654 = !DILocation(line: 213, column: 38, scope: !653)
!655 = !DILocation(line: 213, column: 36, scope: !653)
!656 = !{!616, !336, i64 68}
!657 = !DILocation(line: 214, column: 38, scope: !653)
!658 = !DILocation(line: 214, column: 36, scope: !653)
!659 = !{!616, !336, i64 72}
!660 = !DILocation(line: 215, column: 13, scope: !653)
!661 = !DILocation(line: 216, column: 24, scope: !613)
!662 = !DILocation(line: 217, column: 13, scope: !613)
!663 = !DILocation(line: 220, column: 17, scope: !664)
!664 = distinct !DILexicalBlock(scope: !613, file: !2, line: 220, column: 17)
!665 = !DILocation(line: 220, column: 51, scope: !664)
!666 = !DILocation(line: 220, column: 56, scope: !664)
!667 = !DILocation(line: 220, column: 83, scope: !664)
!668 = !{!616, !336, i64 36}
!669 = !DILocation(line: 220, column: 70, scope: !664)
!670 = !DILocation(line: 220, column: 95, scope: !664)
!671 = !DILocation(line: 220, column: 112, scope: !664)
!672 = !{!616, !336, i64 32}
!673 = !DILocation(line: 220, column: 99, scope: !664)
!674 = !DILocation(line: 220, column: 17, scope: !613)
!675 = !DILocation(line: 222, column: 17, scope: !676)
!676 = distinct !DILexicalBlock(scope: !664, file: !2, line: 221, column: 13)
!677 = !DILocation(line: 223, column: 44, scope: !676)
!678 = !DILocation(line: 223, column: 42, scope: !676)
!679 = !DILocation(line: 224, column: 45, scope: !676)
!680 = !DILocation(line: 224, column: 43, scope: !676)
!681 = !DILocation(line: 225, column: 13, scope: !676)
!682 = !DILocation(line: 226, column: 24, scope: !613)
!683 = !DILocation(line: 227, column: 13, scope: !613)
!684 = !DILocation(line: 229, column: 18, scope: !685)
!685 = distinct !DILexicalBlock(scope: !613, file: !2, line: 229, column: 17)
!686 = !DILocation(line: 229, column: 17, scope: !613)
!687 = !DILocation(line: 232, column: 26, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !2, line: 230, column: 13)
!689 = !DILocation(line: 233, column: 21, scope: !690)
!690 = distinct !DILexicalBlock(scope: !688, file: !2, line: 233, column: 21)
!691 = !DILocation(line: 233, column: 51, scope: !690)
!692 = !DILocation(line: 234, column: 21, scope: !690)
!693 = !DILocation(line: 234, column: 52, scope: !690)
!694 = !DILocation(line: 235, column: 21, scope: !690)
!695 = !DILocation(line: 233, column: 21, scope: !688)
!696 = !DILocation(line: 237, column: 29, scope: !697)
!697 = distinct !DILexicalBlock(scope: !690, file: !2, line: 236, column: 17)
!698 = !DILocation(line: 237, column: 21, scope: !697)
!699 = !DILocation(line: 238, column: 21, scope: !697)
!700 = !DILocation(line: 0, scope: !607)
!701 = !DILocation(line: 241, column: 24, scope: !613)
!702 = !DILocation(line: 242, column: 13, scope: !613)
!703 = !DILocation(line: 0, scope: !602)
!704 = !DILocation(line: 176, column: 82, scope: !601)
!705 = distinct !{!705, !603, !706, !584}
!706 = !DILocation(line: 244, column: 5, scope: !602)
!707 = !DILocation(line: 246, column: 13, scope: !516)
!708 = !DILocation(line: 247, column: 16, scope: !516)
!709 = !DILocation(line: 247, column: 26, scope: !516)
!710 = !DILocation(line: 247, column: 43, scope: !516)
!711 = !DILocation(line: 247, column: 63, scope: !516)
!712 = !DILocation(line: 248, column: 22, scope: !516)
!713 = !DILocation(line: 248, column: 26, scope: !516)
!714 = !DILocation(line: 248, column: 52, scope: !516)
!715 = !DILocation(line: 246, column: 5, scope: !516)
!716 = !DILocation(line: 250, column: 15, scope: !516)
!717 = !DILocation(line: 251, column: 5, scope: !516)
!718 = !DILocation(line: 252, column: 1, scope: !516)
!719 = !DISubprogram(name: "fgetc", scope: !370, file: !370, line: 513, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!720 = !DISubprogram(name: "strncmp", scope: !366, file: !366, line: 159, type: !721, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!721 = !DISubroutineType(types: !722)
!722 = !{!90, !234, !234, !151}
!723 = !DISubprogram(name: "strtol", scope: !361, file: !361, line: 177, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!724 = !DISubroutineType(types: !725)
!725 = !{!128, !373, !726, !90}
!726 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!728 = !DISubprogram(name: "fprintf", scope: !370, file: !370, line: 350, type: !729, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!729 = !DISubroutineType(types: !730)
!730 = !{!90, !494, !373, null}
!731 = !DISubprogram(name: "strchr", scope: !366, file: !366, line: 246, type: !732, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!732 = !DISubroutineType(types: !733)
!733 = !{!108, !234, !90}
!734 = !DISubprogram(name: "sscanf", linkageName: "__isoc99_sscanf", scope: !370, file: !370, line: 439, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!735 = !DISubroutineType(types: !736)
!736 = !{!90, !373, !373, null}
!737 = !DISubprogram(name: "x264_reduce_fraction", scope: !738, file: !738, line: 101, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!738 = !DIFile(filename: "./common/common.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "4880b62cc871dca4002788746fbccb70")
!739 = !DISubroutineType(types: !740)
!740 = !{null, !741, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!742 = distinct !DISubprogram(name: "get_frame_total_y4m", scope: !2, file: !2, line: 255, type: !375, scopeLine: 256, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !743)
!743 = !{!744, !745, !746, !747, !748}
!744 = !DILocalVariable(name: "handle", arg: 1, scope: !742, file: !2, line: 255, type: !88)
!745 = !DILocalVariable(name: "h", scope: !742, file: !2, line: 257, type: !533)
!746 = !DILocalVariable(name: "i_frame_total", scope: !742, file: !2, line: 258, type: !90)
!747 = !DILocalVariable(name: "init_pos", scope: !742, file: !2, line: 259, type: !91)
!748 = !DILocalVariable(name: "i_size", scope: !749, file: !2, line: 263, type: !91)
!749 = distinct !DILexicalBlock(scope: !750, file: !2, line: 262, column: 5)
!750 = distinct !DILexicalBlock(scope: !742, file: !2, line: 261, column: 9)
!751 = !DILocation(line: 0, scope: !742)
!752 = !DILocation(line: 259, column: 43, scope: !742)
!753 = !DILocation(line: 259, column: 34, scope: !742)
!754 = !DILocation(line: 261, column: 20, scope: !750)
!755 = !DILocation(line: 261, column: 10, scope: !750)
!756 = !DILocation(line: 261, column: 9, scope: !742)
!757 = !DILocation(line: 263, column: 37, scope: !749)
!758 = !DILocation(line: 263, column: 27, scope: !749)
!759 = !DILocation(line: 0, scope: !749)
!760 = !DILocation(line: 264, column: 19, scope: !749)
!761 = !DILocation(line: 264, column: 9, scope: !749)
!762 = !DILocation(line: 265, column: 44, scope: !749)
!763 = !DILocation(line: 265, column: 41, scope: !749)
!764 = !DILocation(line: 265, column: 39, scope: !749)
!765 = !DILocation(line: 266, column: 38, scope: !749)
!766 = !DILocation(line: 266, column: 47, scope: !749)
!767 = !DILocation(line: 266, column: 43, scope: !749)
!768 = !DILocation(line: 266, column: 33, scope: !749)
!769 = !DILocation(line: 266, column: 54, scope: !749)
!770 = !DILocation(line: 266, column: 60, scope: !749)
!771 = !DILocation(line: 266, column: 56, scope: !749)
!772 = !DILocation(line: 266, column: 31, scope: !749)
!773 = !DILocation(line: 265, column: 60, scope: !749)
!774 = !DILocation(line: 265, column: 25, scope: !749)
!775 = !DILocation(line: 267, column: 5, scope: !749)
!776 = !DILocation(line: 269, column: 5, scope: !742)
!777 = distinct !DISubprogram(name: "read_frame_y4m", scope: !2, file: !2, line: 272, type: !412, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785}
!779 = !DILocalVariable(name: "p_pic", arg: 1, scope: !777, file: !2, line: 272, type: !414)
!780 = !DILocalVariable(name: "handle", arg: 2, scope: !777, file: !2, line: 272, type: !88)
!781 = !DILocalVariable(name: "i_frame", arg: 3, scope: !777, file: !2, line: 272, type: !90)
!782 = !DILocalVariable(name: "slen", scope: !777, file: !2, line: 274, type: !90)
!783 = !DILocalVariable(name: "i", scope: !777, file: !2, line: 275, type: !90)
!784 = !DILocalVariable(name: "header", scope: !777, file: !2, line: 276, type: !82)
!785 = !DILocalVariable(name: "h", scope: !777, file: !2, line: 277, type: !533)
!786 = !DILocation(line: 0, scope: !777)
!787 = !DILocation(line: 276, column: 5, scope: !777)
!788 = !DILocation(line: 276, column: 18, scope: !777)
!789 = !DILocation(line: 279, column: 23, scope: !790)
!790 = distinct !DILexicalBlock(scope: !777, file: !2, line: 279, column: 9)
!791 = !DILocation(line: 279, column: 17, scope: !790)
!792 = !DILocation(line: 279, column: 9, scope: !777)
!793 = !DILocation(line: 281, column: 22, scope: !794)
!794 = distinct !DILexicalBlock(scope: !795, file: !2, line: 281, column: 13)
!795 = distinct !DILexicalBlock(scope: !790, file: !2, line: 280, column: 5)
!796 = !DILocation(line: 281, column: 26, scope: !794)
!797 = !DILocation(line: 281, column: 51, scope: !794)
!798 = !DILocation(line: 281, column: 60, scope: !794)
!799 = !DILocation(line: 281, column: 56, scope: !794)
!800 = !DILocation(line: 281, column: 46, scope: !794)
!801 = !DILocation(line: 281, column: 67, scope: !794)
!802 = !DILocation(line: 281, column: 73, scope: !794)
!803 = !DILocation(line: 281, column: 69, scope: !794)
!804 = !DILocation(line: 281, column: 44, scope: !794)
!805 = !DILocation(line: 281, column: 43, scope: !794)
!806 = !DILocation(line: 282, column: 24, scope: !794)
!807 = !DILocation(line: 282, column: 21, scope: !794)
!808 = !DILocation(line: 282, column: 19, scope: !794)
!809 = !DILocation(line: 281, column: 13, scope: !794)
!810 = !DILocation(line: 281, column: 13, scope: !795)
!811 = !DILocation(line: 287, column: 35, scope: !812)
!812 = distinct !DILexicalBlock(scope: !777, file: !2, line: 287, column: 9)
!813 = !DILocation(line: 287, column: 9, scope: !812)
!814 = !DILocation(line: 287, column: 39, scope: !812)
!815 = !DILocation(line: 287, column: 9, scope: !777)
!816 = !DILocation(line: 290, column: 5, scope: !777)
!817 = !DILocation(line: 290, column: 18, scope: !777)
!818 = !DILocation(line: 291, column: 9, scope: !819)
!819 = distinct !DILexicalBlock(scope: !777, file: !2, line: 291, column: 9)
!820 = !DILocation(line: 291, column: 9, scope: !777)
!821 = !DILocation(line: 293, column: 17, scope: !822)
!822 = distinct !DILexicalBlock(scope: !819, file: !2, line: 292, column: 5)
!823 = !DILocation(line: 294, column: 17, scope: !822)
!824 = !DILocation(line: 293, column: 9, scope: !822)
!825 = !DILocation(line: 295, column: 9, scope: !822)
!826 = !DILocation(line: 299, column: 43, scope: !777)
!827 = !DILocation(line: 299, column: 34, scope: !777)
!828 = !DILocation(line: 299, column: 47, scope: !777)
!829 = !DILocation(line: 299, column: 5, scope: !777)
!830 = !DILocation(line: 300, column: 10, scope: !777)
!831 = !DILocation(line: 299, column: 13, scope: !777)
!832 = !DILocation(line: 299, column: 31, scope: !777)
!833 = distinct !{!833, !829, !830, !584}
!834 = !DILocation(line: 303, column: 17, scope: !835)
!835 = distinct !DILexicalBlock(scope: !836, file: !2, line: 302, column: 5)
!836 = distinct !DILexicalBlock(scope: !777, file: !2, line: 301, column: 9)
!837 = !DILocation(line: 303, column: 9, scope: !835)
!838 = !DILocation(line: 304, column: 9, scope: !835)
!839 = !DILocation(line: 306, column: 33, scope: !777)
!840 = !DILocation(line: 306, column: 8, scope: !777)
!841 = !DILocation(line: 306, column: 25, scope: !777)
!842 = !DILocation(line: 308, column: 26, scope: !843)
!843 = distinct !DILexicalBlock(scope: !777, file: !2, line: 308, column: 9)
!844 = !DILocation(line: 308, column: 15, scope: !843)
!845 = !DILocation(line: 308, column: 42, scope: !843)
!846 = !DILocation(line: 308, column: 51, scope: !843)
!847 = !DILocation(line: 308, column: 47, scope: !843)
!848 = !DILocation(line: 308, column: 39, scope: !843)
!849 = !DILocation(line: 308, column: 62, scope: !843)
!850 = !DILocation(line: 308, column: 9, scope: !843)
!851 = !DILocation(line: 308, column: 66, scope: !843)
!852 = !DILocation(line: 309, column: 9, scope: !843)
!853 = !DILocation(line: 309, column: 18, scope: !843)
!854 = !DILocation(line: 309, column: 45, scope: !843)
!855 = !DILocation(line: 309, column: 56, scope: !843)
!856 = !DILocation(line: 309, column: 51, scope: !843)
!857 = !DILocation(line: 309, column: 63, scope: !843)
!858 = !DILocation(line: 309, column: 42, scope: !843)
!859 = !DILocation(line: 309, column: 71, scope: !843)
!860 = !DILocation(line: 309, column: 12, scope: !843)
!861 = !DILocation(line: 309, column: 75, scope: !843)
!862 = !DILocation(line: 310, column: 9, scope: !843)
!863 = !DILocation(line: 310, column: 18, scope: !843)
!864 = !DILocation(line: 310, column: 45, scope: !843)
!865 = !DILocation(line: 310, column: 56, scope: !843)
!866 = !DILocation(line: 310, column: 51, scope: !843)
!867 = !DILocation(line: 310, column: 63, scope: !843)
!868 = !DILocation(line: 310, column: 42, scope: !843)
!869 = !DILocation(line: 310, column: 71, scope: !843)
!870 = !DILocation(line: 310, column: 12, scope: !843)
!871 = !DILocation(line: 310, column: 75, scope: !843)
!872 = !DILocation(line: 308, column: 9, scope: !777)
!873 = !DILocation(line: 313, column: 28, scope: !777)
!874 = !DILocation(line: 313, column: 19, scope: !777)
!875 = !DILocation(line: 315, column: 5, scope: !777)
!876 = !DILocation(line: 316, column: 1, scope: !777)
!877 = distinct !DISubprogram(name: "close_file_y4m", scope: !2, file: !2, line: 318, type: !375, scopeLine: 319, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !878)
!878 = !{!879, !880}
!879 = !DILocalVariable(name: "handle", arg: 1, scope: !877, file: !2, line: 318, type: !88)
!880 = !DILocalVariable(name: "h", scope: !877, file: !2, line: 320, type: !533)
!881 = !DILocation(line: 0, scope: !877)
!882 = !DILocation(line: 321, column: 10, scope: !883)
!883 = distinct !DILexicalBlock(scope: !877, file: !2, line: 321, column: 9)
!884 = !DILocation(line: 321, column: 12, scope: !883)
!885 = !DILocation(line: 321, column: 19, scope: !883)
!886 = !DILocation(line: 321, column: 16, scope: !883)
!887 = !DILocation(line: 321, column: 9, scope: !877)
!888 = !DILocation(line: 323, column: 5, scope: !877)
!889 = !DILocation(line: 324, column: 5, scope: !877)
!890 = !DILocation(line: 325, column: 5, scope: !877)
!891 = !DILocation(line: 326, column: 1, scope: !877)
!892 = distinct !DISubprogram(name: "open_file_thread", scope: !2, file: !2, line: 441, type: !170, scopeLine: 442, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !893)
!893 = !{!894, !895, !896, !897}
!894 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !892, file: !2, line: 441, type: !108)
!895 = !DILocalVariable(name: "p_handle", arg: 2, scope: !892, file: !2, line: 441, type: !172)
!896 = !DILocalVariable(name: "p_param", arg: 3, scope: !892, file: !2, line: 441, type: !173)
!897 = !DILocalVariable(name: "h", scope: !892, file: !2, line: 443, type: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_input_t", file: !2, line: 432, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 422, size: 1024, elements: !901)
!901 = !{!902, !904, !906, !907, !908, !911, !912, !913, !914}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "p_read_frame", scope: !900, file: !2, line: 423, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "p_close_infile", scope: !900, file: !2, line: 424, baseType: !905, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "p_handle", scope: !900, file: !2, line: 425, baseType: !88, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !900, file: !2, line: 426, baseType: !415, size: 576, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !900, file: !2, line: 427, baseType: !909, size: 64, offset: 768)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !910, line: 27, baseType: !95)
!910 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!911 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !900, file: !2, line: 428, baseType: !90, size: 32, offset: 832)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "frame_total", scope: !900, file: !2, line: 429, baseType: !90, size: 32, offset: 864)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "in_progress", scope: !900, file: !2, line: 430, baseType: !90, size: 32, offset: 896)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next_args", scope: !900, file: !2, line: 431, baseType: !915, size: 64, offset: 960)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_input_arg_t", file: !2, line: 434, size: 192, elements: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !916, file: !2, line: 435, baseType: !898, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !916, file: !2, line: 436, baseType: !414, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !916, file: !2, line: 437, baseType: !90, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !916, file: !2, line: 438, baseType: !90, size: 32, offset: 160)
!922 = !DILocation(line: 0, scope: !892)
!923 = !DILocation(line: 443, column: 25, scope: !892)
!924 = !DILocation(line: 444, column: 29, scope: !892)
!925 = !DILocation(line: 444, column: 58, scope: !892)
!926 = !DILocation(line: 444, column: 76, scope: !892)
!927 = !DILocation(line: 444, column: 5, scope: !892)
!928 = !DILocation(line: 445, column: 23, scope: !892)
!929 = !DILocation(line: 445, column: 21, scope: !892)
!930 = !{!931, !344, i64 0}
!931 = !{!"", !344, i64 0, !344, i64 8, !344, i64 16, !932, i64 24, !933, i64 96, !336, i64 104, !336, i64 108, !336, i64 112, !344, i64 120}
!932 = !{!"", !336, i64 0, !336, i64 4, !933, i64 8, !934, i64 16}
!933 = !{!"long", !337, i64 0}
!934 = !{!"", !336, i64 0, !336, i64 4, !337, i64 8, !337, i64 24}
!935 = !DILocation(line: 446, column: 25, scope: !892)
!936 = !DILocation(line: 446, column: 8, scope: !892)
!937 = !DILocation(line: 446, column: 23, scope: !892)
!938 = !{!931, !344, i64 8}
!939 = !DILocation(line: 447, column: 19, scope: !892)
!940 = !DILocation(line: 447, column: 8, scope: !892)
!941 = !DILocation(line: 447, column: 17, scope: !892)
!942 = !{!931, !344, i64 16}
!943 = !DILocation(line: 448, column: 8, scope: !892)
!944 = !DILocation(line: 448, column: 20, scope: !892)
!945 = !{!931, !336, i64 112}
!946 = !DILocation(line: 449, column: 8, scope: !892)
!947 = !DILocation(line: 449, column: 19, scope: !892)
!948 = !{!931, !336, i64 104}
!949 = !DILocation(line: 450, column: 20, scope: !892)
!950 = !DILocation(line: 450, column: 8, scope: !892)
!951 = !DILocation(line: 450, column: 18, scope: !892)
!952 = !{!931, !344, i64 120}
!953 = !DILocation(line: 451, column: 21, scope: !892)
!954 = !{!955, !344, i64 0}
!955 = !{!"thread_input_arg_t", !344, i64 0, !344, i64 8, !336, i64 16, !336, i64 20}
!956 = !DILocation(line: 452, column: 19, scope: !892)
!957 = !DILocation(line: 452, column: 26, scope: !892)
!958 = !{!955, !336, i64 20}
!959 = !DILocation(line: 453, column: 22, scope: !892)
!960 = !DILocation(line: 453, column: 8, scope: !892)
!961 = !DILocation(line: 453, column: 20, scope: !892)
!962 = !{!931, !336, i64 108}
!963 = !DILocation(line: 455, column: 15, scope: !892)
!964 = !DILocation(line: 456, column: 5, scope: !892)
!965 = !DISubprogram(name: "x264_picture_alloc", scope: !175, file: !175, line: 358, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !414, !90, !90, !90}
!968 = distinct !DISubprogram(name: "get_frame_total_thread", scope: !2, file: !2, line: 459, type: !375, scopeLine: 460, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !969)
!969 = !{!970, !971}
!970 = !DILocalVariable(name: "handle", arg: 1, scope: !968, file: !2, line: 459, type: !88)
!971 = !DILocalVariable(name: "h", scope: !968, file: !2, line: 461, type: !898)
!972 = !DILocation(line: 0, scope: !968)
!973 = !DILocation(line: 462, column: 15, scope: !968)
!974 = !DILocation(line: 462, column: 5, scope: !968)
!975 = distinct !DISubprogram(name: "read_frame_thread", scope: !2, file: !2, line: 470, type: !412, scopeLine: 471, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !976)
!976 = !{!977, !978, !979, !980, !981, !982, !983}
!977 = !DILocalVariable(name: "p_pic", arg: 1, scope: !975, file: !2, line: 470, type: !414)
!978 = !DILocalVariable(name: "handle", arg: 2, scope: !975, file: !2, line: 470, type: !88)
!979 = !DILocalVariable(name: "i_frame", arg: 3, scope: !975, file: !2, line: 470, type: !90)
!980 = !DILocalVariable(name: "h", scope: !975, file: !2, line: 472, type: !898)
!981 = !DILocalVariable(name: "stuff", scope: !975, file: !2, line: 473, type: !87)
!982 = !DILocalVariable(name: "ret", scope: !975, file: !2, line: 474, type: !90)
!983 = !DILocalVariable(name: "t", scope: !984, file: !2, line: 485, type: !415)
!984 = distinct !DILexicalBlock(scope: !985, file: !2, line: 485, column: 9)
!985 = distinct !DILexicalBlock(scope: !986, file: !2, line: 484, column: 5)
!986 = distinct !DILexicalBlock(scope: !975, file: !2, line: 483, column: 9)
!987 = !DILocation(line: 0, scope: !975)
!988 = !DILocation(line: 473, column: 5, scope: !975)
!989 = !DILocation(line: 476, column: 12, scope: !990)
!990 = distinct !DILexicalBlock(scope: !975, file: !2, line: 476, column: 9)
!991 = !DILocation(line: 476, column: 23, scope: !990)
!992 = !DILocation(line: 476, column: 9, scope: !975)
!993 = !DILocation(line: 478, column: 31, scope: !994)
!994 = distinct !DILexicalBlock(scope: !990, file: !2, line: 477, column: 5)
!995 = !{!931, !933, i64 96}
!996 = !DILocation(line: 478, column: 9, scope: !994)
!997 = !DILocation(line: 479, column: 19, scope: !994)
!998 = !DILocation(line: 479, column: 30, scope: !994)
!999 = !DILocation(line: 480, column: 12, scope: !994)
!1000 = !DILocation(line: 480, column: 24, scope: !994)
!1001 = !DILocation(line: 483, column: 12, scope: !986)
!1002 = !DILocation(line: 481, column: 5, scope: !994)
!1003 = !DILocation(line: 483, column: 23, scope: !986)
!1004 = !DILocation(line: 483, column: 9, scope: !975)
!1005 = !DILocation(line: 485, column: 9, scope: !984)
!1006 = !{i64 0, i64 4, !335, i64 4, i64 4, !335, i64 8, i64 8, !1007, i64 16, i64 4, !335, i64 20, i64 4, !335, i64 24, i64 16, !576, i64 40, i64 32, !576}
!1007 = !{!933, !933, i64 0}
!1008 = !DILocation(line: 485, column: 9, scope: !985)
!1009 = !DILocation(line: 486, column: 5, scope: !985)
!1010 = !DILocation(line: 489, column: 19, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !986, file: !2, line: 488, column: 5)
!1012 = !DILocation(line: 489, column: 43, scope: !1011)
!1013 = !DILocation(line: 489, column: 16, scope: !1011)
!1014 = !DILocation(line: 489, column: 13, scope: !1011)
!1015 = !DILocation(line: 492, column: 13, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !975, file: !2, line: 492, column: 9)
!1017 = !DILocation(line: 492, column: 10, scope: !1016)
!1018 = !DILocation(line: 492, column: 25, scope: !1016)
!1019 = !DILocation(line: 495, column: 12, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1016, file: !2, line: 493, column: 5)
!1021 = !DILocation(line: 495, column: 23, scope: !1020)
!1022 = !DILocation(line: 495, column: 31, scope: !1020)
!1023 = !{!955, !336, i64 16}
!1024 = !DILocation(line: 494, column: 23, scope: !1020)
!1025 = !DILocation(line: 496, column: 33, scope: !1020)
!1026 = !DILocation(line: 496, column: 23, scope: !1020)
!1027 = !DILocation(line: 496, column: 27, scope: !1020)
!1028 = !{!955, !344, i64 8}
!1029 = !DILocation(line: 497, column: 34, scope: !1020)
!1030 = !DILocation(line: 497, column: 9, scope: !1020)
!1031 = !DILocation(line: 498, column: 12, scope: !1020)
!1032 = !DILocation(line: 498, column: 24, scope: !1020)
!1033 = !DILocation(line: 499, column: 5, scope: !1020)
!1034 = !DILocation(line: 501, column: 23, scope: !1016)
!1035 = !DILocation(line: 504, column: 1, scope: !975)
!1036 = !DILocation(line: 503, column: 5, scope: !975)
!1037 = !DISubprogram(name: "pthread_join", scope: !1038, file: !1038, line: 219, type: !1039, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!1038 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "5205981c6f80cc3dc1e81231df63d8ef")
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!90, !909, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!1042 = !DISubprogram(name: "pthread_create", scope: !1038, file: !1038, line: 202, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!90, !1045, !1047, !1058, !493}
!1045 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !910, line: 62, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !910, line: 56, size: 448, elements: !1052)
!1052 = !{!1053, !1057}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !1051, file: !910, line: 58, baseType: !1054, size: 448)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 56)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !1051, file: !910, line: 59, baseType: !128, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!87, !87}
!1061 = distinct !DISubprogram(name: "read_frame_thread_int", scope: !2, file: !2, line: 465, type: !1062, scopeLine: 466, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1066)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_input_arg_t", file: !2, line: 439, baseType: !916)
!1066 = !{!1067}
!1067 = !DILocalVariable(name: "i", arg: 1, scope: !1061, file: !2, line: 465, type: !1064)
!1068 = !DILocation(line: 0, scope: !1061)
!1069 = !DILocation(line: 467, column: 20, scope: !1061)
!1070 = !DILocation(line: 467, column: 23, scope: !1061)
!1071 = !DILocation(line: 467, column: 40, scope: !1061)
!1072 = !DILocation(line: 467, column: 51, scope: !1061)
!1073 = !DILocation(line: 467, column: 64, scope: !1061)
!1074 = !DILocation(line: 467, column: 17, scope: !1061)
!1075 = !DILocation(line: 467, column: 8, scope: !1061)
!1076 = !DILocation(line: 467, column: 15, scope: !1061)
!1077 = !DILocation(line: 468, column: 1, scope: !1061)
!1078 = distinct !DISubprogram(name: "close_file_thread", scope: !2, file: !2, line: 506, type: !375, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1079)
!1079 = !{!1080, !1081}
!1080 = !DILocalVariable(name: "handle", arg: 1, scope: !1078, file: !2, line: 506, type: !88)
!1081 = !DILocalVariable(name: "h", scope: !1078, file: !2, line: 508, type: !898)
!1082 = !DILocation(line: 0, scope: !1078)
!1083 = !DILocation(line: 509, column: 8, scope: !1078)
!1084 = !DILocation(line: 509, column: 27, scope: !1078)
!1085 = !DILocation(line: 509, column: 5, scope: !1078)
!1086 = !DILocation(line: 510, column: 29, scope: !1078)
!1087 = !DILocation(line: 510, column: 5, scope: !1078)
!1088 = !DILocation(line: 511, column: 12, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 511, column: 9)
!1090 = !DILocation(line: 511, column: 9, scope: !1089)
!1091 = !DILocation(line: 511, column: 9, scope: !1078)
!1092 = !DILocation(line: 512, column: 31, scope: !1089)
!1093 = !DILocation(line: 512, column: 9, scope: !1089)
!1094 = !DILocation(line: 513, column: 14, scope: !1078)
!1095 = !DILocation(line: 513, column: 5, scope: !1078)
!1096 = !DILocation(line: 514, column: 5, scope: !1078)
!1097 = !DILocation(line: 515, column: 5, scope: !1078)
!1098 = !DISubprogram(name: "x264_picture_clean", scope: !175, file: !175, line: 363, type: !1099, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{null, !414}
!1101 = distinct !DISubprogram(name: "open_file_bsf", scope: !2, file: !2, line: 520, type: !1102, scopeLine: 521, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1104)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!90, !108, !172}
!1104 = !{!1105, !1106}
!1105 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !1101, file: !2, line: 520, type: !108)
!1106 = !DILocalVariable(name: "p_handle", arg: 2, scope: !1101, file: !2, line: 520, type: !172)
!1107 = !DILocation(line: 0, scope: !1101)
!1108 = !DILocation(line: 522, column: 22, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 522, column: 9)
!1110 = !DILocation(line: 522, column: 20, scope: !1109)
!1111 = !DILocation(line: 522, column: 50, scope: !1109)
!1112 = !DILocation(line: 526, column: 1, scope: !1101)
!1113 = distinct !DISubprogram(name: "set_param_bsf", scope: !2, file: !2, line: 528, type: !1114, scopeLine: 529, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1116)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!90, !88, !173}
!1116 = !{!1117, !1118}
!1117 = !DILocalVariable(name: "handle", arg: 1, scope: !1113, file: !2, line: 528, type: !88)
!1118 = !DILocalVariable(name: "p_param", arg: 2, scope: !1113, file: !2, line: 528, type: !173)
!1119 = !DILocation(line: 0, scope: !1113)
!1120 = !DILocation(line: 530, column: 5, scope: !1113)
!1121 = distinct !DISubprogram(name: "write_nalu_bsf", scope: !2, file: !2, line: 533, type: !1122, scopeLine: 534, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1124)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!90, !88, !431, !90}
!1124 = !{!1125, !1126, !1127}
!1125 = !DILocalVariable(name: "handle", arg: 1, scope: !1121, file: !2, line: 533, type: !88)
!1126 = !DILocalVariable(name: "p_nalu", arg: 2, scope: !1121, file: !2, line: 533, type: !431)
!1127 = !DILocalVariable(name: "i_size", arg: 3, scope: !1121, file: !2, line: 533, type: !90)
!1128 = !DILocation(line: 0, scope: !1121)
!1129 = !DILocation(line: 535, column: 24, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1121, file: !2, line: 535, column: 9)
!1131 = !DILocation(line: 535, column: 9, scope: !1130)
!1132 = !DILocation(line: 535, column: 51, scope: !1130)
!1133 = !DILocation(line: 538, column: 1, scope: !1121)
!1134 = !DISubprogram(name: "fwrite", scope: !370, file: !370, line: 681, type: !1135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!95, !1137, !151, !151, !494}
!1137 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1140 = distinct !DISubprogram(name: "set_eop_bsf", scope: !2, file: !2, line: 540, type: !1141, scopeLine: 541, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1143)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!90, !88, !414}
!1143 = !{!1144, !1145}
!1144 = !DILocalVariable(name: "handle", arg: 1, scope: !1140, file: !2, line: 540, type: !88)
!1145 = !DILocalVariable(name: "p_picture", arg: 2, scope: !1140, file: !2, line: 540, type: !414)
!1146 = !DILocation(line: 0, scope: !1140)
!1147 = !DILocation(line: 542, column: 5, scope: !1140)
!1148 = distinct !DISubprogram(name: "close_file_bsf", scope: !2, file: !2, line: 545, type: !375, scopeLine: 546, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1149)
!1149 = !{!1150}
!1150 = !DILocalVariable(name: "handle", arg: 1, scope: !1148, file: !2, line: 545, type: !88)
!1151 = !DILocation(line: 0, scope: !1148)
!1152 = !DILocation(line: 547, column: 17, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1148, file: !2, line: 547, column: 9)
!1154 = !DILocation(line: 547, column: 26, scope: !1153)
!1155 = !DILocation(line: 550, column: 12, scope: !1148)
!1156 = !DILocation(line: 550, column: 5, scope: !1148)
!1157 = !DILocation(line: 551, column: 1, scope: !1148)
!1158 = distinct !DISubprogram(name: "open_file_mkv", scope: !2, file: !2, line: 861, type: !1102, scopeLine: 862, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !1158, file: !2, line: 861, type: !108)
!1161 = !DILocalVariable(name: "p_handle", arg: 2, scope: !1158, file: !2, line: 861, type: !172)
!1162 = !DILocalVariable(name: "p_mkv", scope: !1158, file: !2, line: 863, type: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "mkv_t", file: !2, line: 813, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 799, size: 576, elements: !1166)
!1166 = !{!1167, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1165, file: !2, line: 801, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_Writer", file: !1170, line: 24, baseType: !1171)
!1170 = !DIFile(filename: "./matroska.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9c5d0a3c9bb78602e48a8524a1154b90")
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "mk_Writer", file: !1170, line: 24, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !1165, file: !2, line: 803, baseType: !431, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !1165, file: !2, line: 803, baseType: !431, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sps_len", scope: !1165, file: !2, line: 804, baseType: !90, size: 32, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pps_len", scope: !1165, file: !2, line: 804, baseType: !90, size: 32, offset: 224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1165, file: !2, line: 806, baseType: !90, size: 32, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1165, file: !2, line: 806, baseType: !90, size: 32, offset: 288)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "d_width", scope: !1165, file: !2, line: 806, baseType: !90, size: 32, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "d_height", scope: !1165, file: !2, line: 806, baseType: !90, size: 32, offset: 352)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "frame_duration", scope: !1165, file: !2, line: 808, baseType: !158, size: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !1165, file: !2, line: 809, baseType: !90, size: 32, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "b_header_written", scope: !1165, file: !2, line: 811, baseType: !90, size: 32, offset: 480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "b_writing_frame", scope: !1165, file: !2, line: 812, baseType: !4, size: 8, offset: 512)
!1184 = !DILocation(line: 0, scope: !1158)
!1185 = !DILocation(line: 865, column: 15, scope: !1158)
!1186 = !DILocation(line: 867, column: 14, scope: !1158)
!1187 = !DILocation(line: 868, column: 15, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1158, file: !2, line: 868, column: 9)
!1189 = !DILocation(line: 868, column: 9, scope: !1158)
!1190 = !DILocation(line: 873, column: 16, scope: !1158)
!1191 = !DILocation(line: 873, column: 14, scope: !1158)
!1192 = !{!1193, !344, i64 0}
!1193 = !{!"", !344, i64 0, !344, i64 8, !344, i64 16, !336, i64 24, !336, i64 28, !336, i64 32, !336, i64 36, !336, i64 40, !336, i64 44, !933, i64 48, !336, i64 56, !336, i64 60, !337, i64 64}
!1194 = !DILocation(line: 874, column: 18, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1158, file: !2, line: 874, column: 9)
!1196 = !DILocation(line: 874, column: 9, scope: !1158)
!1197 = !DILocation(line: 876, column: 9, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 875, column: 5)
!1199 = !DILocation(line: 877, column: 9, scope: !1198)
!1200 = !DILocation(line: 880, column: 15, scope: !1158)
!1201 = !DILocation(line: 882, column: 5, scope: !1158)
!1202 = !DILocation(line: 883, column: 1, scope: !1158)
!1203 = !DISubprogram(name: "mk_createWriter", scope: !1170, file: !1170, line: 26, type: !1204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !364)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!1168, !234}
!1206 = distinct !DISubprogram(name: "set_param_mkv", scope: !2, file: !2, line: 885, type: !1114, scopeLine: 886, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !1207)
!1207 = !{!1208, !1209, !1210, !1211, !1212, !1213}
!1208 = !DILocalVariable(name: "handle", arg: 1, scope: !1206, file: !2, line: 885, type: !88)
!1209 = !DILocalVariable(name: "p_param", arg: 2, scope: !1206, file: !2, line: 885, type: !173)
!1210 = !DILocalVariable(name: "p_mkv", scope: !1206, file: !2, line: 887, type: !1163)
!1211 = !DILocalVariable(name: "dw", scope: !1206, file: !2, line: 888, type: !158)
!1212 = !DILocalVariable(name: "dh", scope: !1206, file: !2, line: 888, type: !158)
!1213 = !DILocalVariable(name: "x", scope: !1214, file: !2, line: 918, type: !158)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !2, line: 917, column: 5)
!1215 = distinct !DILexicalBlock(scope: !1206, file: !2, line: 916, column: 9)
!1216 = !DILocation(line: 0, scope: !1206)
!1217 = !DILocation(line: 890, column: 18, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1206, file: !2, line: 890, column: 9)
!1219 = !DILocation(line: 890, column: 28, scope: !1218)
!1220 = !DILocation(line: 890, column: 9, scope: !1206)
!1221 = !DILocation(line: 892, column: 51, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1218, file: !2, line: 891, column: 5)
!1223 = !DILocation(line: 892, column: 33, scope: !1222)
!1224 = !DILocation(line: 892, column: 61, scope: !1222)
!1225 = !DILocation(line: 893, column: 53, scope: !1222)
!1226 = !DILocation(line: 895, column: 5, scope: !1222)
!1227 = !DILocation(line: 0, scope: !1218)
!1228 = !DILocation(line: 902, column: 29, scope: !1206)
!1229 = !DILocation(line: 902, column: 12, scope: !1206)
!1230 = !DILocation(line: 902, column: 18, scope: !1206)
!1231 = !{!1193, !336, i64 32}
!1232 = !DILocation(line: 903, column: 30, scope: !1206)
!1233 = !DILocation(line: 903, column: 12, scope: !1206)
!1234 = !DILocation(line: 903, column: 19, scope: !1206)
!1235 = !{!1193, !336, i64 36}
!1236 = !DILocation(line: 905, column: 22, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1206, file: !2, line: 905, column: 9)
!1238 = !DILocation(line: 905, column: 9, scope: !1237)
!1239 = !DILocation(line: 905, column: 34, scope: !1237)
!1240 = !DILocation(line: 905, column: 18, scope: !1237)
