; ModuleID = 'common/pixel.c'
source_filename = "common/pixel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_pixel_function_t = type { [7 x ptr], [7 x ptr], [7 x ptr], [7 x ptr], [4 x ptr], [7 x ptr], [7 x ptr], [7 x ptr], [7 x ptr], [7 x ptr], [7 x ptr], [4 x ptr], [4 x ptr], ptr, ptr, [7 x ptr], [7 x ptr], [7 x ptr], [7 x ptr], [7 x ptr], ptr, ptr, ptr, ptr, ptr, ptr }

; Function Attrs: nounwind uwtable
define dso_local i64 @x264_pixel_ssd_wxh(ptr nocapture noundef readonly %0, ptr noundef %1, i32 noundef %2, ptr noundef %3, i32 noundef %4, i32 noundef %5, i32 noundef %6) local_unnamed_addr #0 !dbg !51 {
  call void @llvm.dbg.value(metadata ptr %0, metadata !147, metadata !DIExpression()), !dbg !174
  call void @llvm.dbg.value(metadata ptr %1, metadata !148, metadata !DIExpression()), !dbg !174
  call void @llvm.dbg.value(metadata i32 %2, metadata !149, metadata !DIExpression()), !dbg !174
  call void @llvm.dbg.value(metadata ptr %3, metadata !150, metadata !DIExpression()), !dbg !174
  call void @llvm.dbg.value(metadata i32 %4, metadata !151, metadata !DIExpression()), !dbg !174
  call void @llvm.dbg.value(metadata i32 %5, metadata !152, metadata !DIExpression()), !dbg !174
  call void @llvm.dbg.value(metadata i32 %6, metadata !153, metadata !DIExpression()), !dbg !174
  call void @llvm.dbg.value(metadata i64 0, metadata !154, metadata !DIExpression()), !dbg !174

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !17, globals: !27, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "common/pixel.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "306b49a4a1cd899cadcb583f39b67b9f")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 30, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "common/pixel.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "aba138e44f0e52bc0158be0d182b79c1")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!8 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!9 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!10 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!11 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!12 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!13 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!14 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!15 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!16 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!17 = !{!18, !19, !23, !26}
!18 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 26, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 42, baseType: !5)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !20, line: 27, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !22, line: 45, baseType: !25)
!25 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!27 = !{!28, !42}
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "ssim_c1", scope: !30, file: !1, line: 469, type: !41, isLocal: true, isDefinition: true)
!30 = distinct !DISubprogram(name: "ssim_end1", scope: !1, file: !1, line: 467, type: !31, scopeLine: 468, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !34)
!31 = !DISubroutineType(types: !32)
!32 = !{!26, !33, !33, !33, !33}
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !{!35, !36, !37, !38, !39, !40}
!35 = !DILocalVariable(name: "s1", arg: 1, scope: !30, file: !1, line: 467, type: !33)
!36 = !DILocalVariable(name: "s2", arg: 2, scope: !30, file: !1, line: 467, type: !33)
!37 = !DILocalVariable(name: "ss", arg: 3, scope: !30, file: !1, line: 467, type: !33)
!38 = !DILocalVariable(name: "s12", arg: 4, scope: !30, file: !1, line: 467, type: !33)
!39 = !DILocalVariable(name: "vars", scope: !30, file: !1, line: 471, type: !33)
!40 = !DILocalVariable(name: "covar", scope: !30, file: !1, line: 472, type: !33)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "ssim_c2", scope: !30, file: !1, line: 470, type: !41, isLocal: true, isDefinition: true)
!44 = !{i32 7, !"Dwarf Version", i32 5}
!45 = !{i32 2, !"Debug Info Version", i32 3}
!46 = !{i32 1, !"wchar_size", i32 4}
!47 = !{i32 8, !"PIC Level", i32 2}
!48 = !{i32 7, !"PIE Level", i32 2}
!49 = !{i32 7, !"uwtable", i32 2}
!50 = !{!"clang version 16.0.0"}
!51 = distinct !DISubprogram(name: "x264_pixel_ssd_wxh", scope: !1, file: !1, line: 98, type: !52, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !146)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !57, !67, !33, !67, !33, !33, !33}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !55, line: 27, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !22, line: 44, baseType: !18)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_function_t", file: !4, line: 103, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 8000, elements: !60)
!60 = !{!61, !73, !74, !75, !76, !80, !81, !82, !83, !90, !96, !97, !103, !108, !116, !120, !121, !122, !123, !124, !137, !141, !142, !143, !144, !145}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !59, file: !4, line: 65, baseType: !62, size: 448)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 448, elements: !71)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_t", file: !4, line: 26, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!33, !67, !33, !67, !33}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !20, line: 24, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !22, line: 38, baseType: !70)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !{!72}
!72 = !DISubrange(count: 7)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ssd", scope: !59, file: !4, line: 66, baseType: !62, size: 448, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "satd", scope: !59, file: !4, line: 67, baseType: !62, size: 448, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ssim", scope: !59, file: !4, line: 68, baseType: !62, size: 448, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sa8d", scope: !59, file: !4, line: 69, baseType: !77, size: 256, offset: 1792)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 256, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 4)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "mbcmp", scope: !59, file: !4, line: 70, baseType: !62, size: 448, offset: 2048)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mbcmp_unaligned", scope: !59, file: !4, line: 71, baseType: !62, size: 448, offset: 2496)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp", scope: !59, file: !4, line: 72, baseType: !62, size: 448, offset: 2944)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp_x3", scope: !59, file: !4, line: 73, baseType: !84, size: 448, offset: 3392)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 448, elements: !71)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_x3_t", file: !4, line: 27, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !67, !67, !67, !67, !33, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp_x4", scope: !59, file: !4, line: 74, baseType: !91, size: 448, offset: 3840)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 448, elements: !71)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_x4_t", file: !4, line: 28, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !67, !67, !67, !67, !67, !33, !89}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sad_aligned", scope: !59, file: !4, line: 75, baseType: !62, size: 448, offset: 4288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !59, file: !4, line: 77, baseType: !98, size: 256, offset: 4736)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !78)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!33, !67, !33, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hadamard_ac", scope: !59, file: !4, line: 78, baseType: !104, size: 256, offset: 4992)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 256, elements: !78)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!23, !67, !33}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ssim_4x4x2_core", scope: !59, file: !4, line: 80, baseType: !109, size: 64, offset: 5248)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !112, !33, !112, !33, !114}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !78)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ssim_end4", scope: !59, file: !4, line: 82, baseType: !117, size: 64, offset: 5312)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!26, !114, !114, !33}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sad_x3", scope: !59, file: !4, line: 85, baseType: !84, size: 448, offset: 5376)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "sad_x4", scope: !59, file: !4, line: 86, baseType: !91, size: 448, offset: 5824)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "satd_x3", scope: !59, file: !4, line: 87, baseType: !84, size: 448, offset: 6272)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "satd_x4", scope: !59, file: !4, line: 88, baseType: !91, size: 448, offset: 6720)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !59, file: !4, line: 92, baseType: !125, size: 448, offset: 7168)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 448, elements: !71)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!33, !89, !129, !33, !129, !133, !33, !33}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 25, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !22, line: 40, baseType: !132)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !55, line: 25, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !22, line: 39, baseType: !136)
!136 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_16x16", scope: !59, file: !4, line: 97, baseType: !138, size: 64, offset: 7616)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !67, !67, !89}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_16x16", scope: !59, file: !4, line: 98, baseType: !138, size: 64, offset: 7680)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_16x16", scope: !59, file: !4, line: 99, baseType: !138, size: 64, offset: 7744)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_8x8c", scope: !59, file: !4, line: 100, baseType: !138, size: 64, offset: 7808)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_4x4", scope: !59, file: !4, line: 101, baseType: !138, size: 64, offset: 7872)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sa8d_x3_8x8", scope: !59, file: !4, line: 102, baseType: !138, size: 64, offset: 7936)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !166}
!147 = !DILocalVariable(name: "pf", arg: 1, scope: !51, file: !1, line: 98, type: !57)
!148 = !DILocalVariable(name: "pix1", arg: 2, scope: !51, file: !1, line: 98, type: !67)
!149 = !DILocalVariable(name: "i_pix1", arg: 3, scope: !51, file: !1, line: 98, type: !33)
!150 = !DILocalVariable(name: "pix2", arg: 4, scope: !51, file: !1, line: 98, type: !67)
!151 = !DILocalVariable(name: "i_pix2", arg: 5, scope: !51, file: !1, line: 98, type: !33)
!152 = !DILocalVariable(name: "i_width", arg: 6, scope: !51, file: !1, line: 98, type: !33)
!153 = !DILocalVariable(name: "i_height", arg: 7, scope: !51, file: !1, line: 98, type: !33)
!154 = !DILocalVariable(name: "i_ssd", scope: !51, file: !1, line: 100, type: !54)
!155 = !DILocalVariable(name: "x", scope: !51, file: !1, line: 101, type: !33)
!156 = !DILocalVariable(name: "y", scope: !51, file: !1, line: 101, type: !33)
!157 = !DILocalVariable(name: "align", scope: !51, file: !1, line: 102, type: !33)
!158 = !DILocalVariable(name: "d", scope: !159, file: !1, line: 125, type: !33)
!159 = distinct !DILexicalBlock(scope: !160, file: !1, line: 125, column: 17)
!160 = distinct !DILexicalBlock(scope: !161, file: !1, line: 124, column: 13)
!161 = distinct !DILexicalBlock(scope: !162, file: !1, line: 124, column: 13)
!162 = distinct !DILexicalBlock(scope: !163, file: !1, line: 123, column: 9)
!163 = distinct !DILexicalBlock(scope: !164, file: !1, line: 123, column: 9)
!164 = distinct !DILexicalBlock(scope: !165, file: !1, line: 122, column: 5)
!165 = distinct !DILexicalBlock(scope: !51, file: !1, line: 121, column: 9)
!166 = !DILocalVariable(name: "d", scope: !167, file: !1, line: 131, type: !33)
!167 = distinct !DILexicalBlock(scope: !168, file: !1, line: 131, column: 17)
!168 = distinct !DILexicalBlock(scope: !169, file: !1, line: 130, column: 13)
!169 = distinct !DILexicalBlock(scope: !170, file: !1, line: 130, column: 13)
!170 = distinct !DILexicalBlock(scope: !171, file: !1, line: 129, column: 9)
!171 = distinct !DILexicalBlock(scope: !172, file: !1, line: 129, column: 9)
!172 = distinct !DILexicalBlock(scope: !173, file: !1, line: 128, column: 5)
!173 = distinct !DILexicalBlock(scope: !51, file: !1, line: 127, column: 9)
!174 = !DILocation(line: 0, scope: !51)
!175 = !DILocation(line: 106, column: 19, scope: !176)
!176 = distinct !DILexicalBlock(scope: !177, file: !1, line: 106, column: 5)
!177 = distinct !DILexicalBlock(scope: !51, file: !1, line: 106, column: 5)
!178 = !DILocation(line: 106, column: 5, scope: !177)
!179 = !DILocation(line: 102, column: 46, scope: !51)
!180 = !DILocation(line: 102, column: 20, scope: !51)
!181 = !DILocation(line: 102, column: 31, scope: !51)
!182 = !DILocation(line: 102, column: 33, scope: !51)
!183 = !DILocation(line: 102, column: 44, scope: !51)
!184 = !DILocation(line: 102, column: 55, scope: !51)
!185 = !DILocation(line: 102, column: 53, scope: !51)
!186 = !DILocation(line: 102, column: 63, scope: !51)
!187 = !DILocation(line: 102, column: 17, scope: !51)
!188 = !DILocation(line: 109, column: 13, scope: !189)
!189 = distinct !DILexicalBlock(scope: !176, file: !1, line: 107, column: 5)
!190 = !DILocation(line: 110, column: 13, scope: !191)
!191 = distinct !DILexicalBlock(scope: !192, file: !1, line: 110, column: 13)
!192 = distinct !DILexicalBlock(scope: !189, file: !1, line: 109, column: 13)
!193 = !DILocation(line: 106, column: 36, scope: !176)
!194 = distinct !{!194, !178, !195, !196}
!195 = !DILocation(line: 114, column: 5, scope: !177)
!196 = !{!"llvm.loop.mustprogress"}
!197 = !DILocation(line: 113, column: 13, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !1, line: 112, column: 9)
!199 = distinct !DILexicalBlock(scope: !189, file: !1, line: 112, column: 9)
!200 = !{!201, !201, i64 0}
!201 = !{!"any pointer", !202, i64 0}
