; ModuleID = 'common/quant.c'
source_filename = "common/quant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_quant_function_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, [6 x ptr] }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, i32, i32, float, float, float, i32, float, i32, ptr, i32, ptr, float, float, float, ptr, i32, ptr }

@x264_decimate_table4 = dso_local local_unnamed_addr constant <{ i8, i8, i8, i8, i8, i8, [10 x i8] }> <{ i8 3, i8 2, i8 2, i8 1, i8 1, i8 1, [10 x i8] zeroinitializer }>, align 16, !dbg !0
@x264_decimate_table8 = dso_local local_unnamed_addr constant <{ [24 x i8], [40 x i8] }> <{ [24 x i8] c"\03\03\03\03\02\02\02\02\02\02\02\02\01\01\01\01\01\01\01\01\01\01\01\01", [40 x i8] zeroinitializer }>, align 16, !dbg !26


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "x264_decimate_table4", scope: !2, file: !3, line: 197, type: !35, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "common/quant.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "f0d435667fb18d8bb5bafadbb1e590ae")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cabac_ctx_block_cat_e", file: !6, line: 266, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "common/macroblock.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "0b0c175005b691009f3df3e457cfe9c0")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "DCT_LUMA_DC", value: 0)
!10 = !DIEnumerator(name: "DCT_LUMA_AC", value: 1)
!11 = !DIEnumerator(name: "DCT_LUMA_4x4", value: 2)
!12 = !DIEnumerator(name: "DCT_CHROMA_DC", value: 3)
!13 = !DIEnumerator(name: "DCT_CHROMA_AC", value: 4)
!14 = !DIEnumerator(name: "DCT_LUMA_8x8", value: 5)
!15 = !{!16, !7, !21}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 26, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 42, baseType: !7)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 27, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !20, line: 45, baseType: !24)
!24 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!25 = !{!0, !26}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "x264_decimate_table8", scope: !2, file: !3, line: 199, type: !28, isLocal: false, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !33)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 38, baseType: !32)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34}
!34 = !DISubrange(count: 64)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 16)
!38 = !{i32 7, !"Dwarf Version", i32 5}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{i32 8, !"PIC Level", i32 2}
!42 = !{i32 7, !"PIE Level", i32 2}
!43 = !{i32 7, !"uwtable", i32 2}
!44 = !{!"clang version 16.0.0"}
!45 = distinct !DISubprogram(name: "x264_quant_init", scope: !3, file: !3, line: 276, type: !46, scopeLine: 277, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1138)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !60, !1137}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !50, line: 42, baseType: !51)
!50 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !52, line: 250, size: 206080, elements: !53)
!52 = !DIFile(filename: "common/common.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "4880b62cc871dca4002788746fbccb70")
!53 = !{!54, !199, !203, !206, !207, !208, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !322, !324, !351, !353, !354, !361, !366, !370, !374, !381, !385, !386, !387, !388, !391, !393, !395, !435, !452, !616, !617, !618, !619, !623, !624, !625, !626, !641, !794, !798, !853, !862, !863, !871, !873, !942, !1002, !1054, !1075, !1117}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !51, file: !52, line: 253, baseType: !55, size: 4928)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !50, line: 295, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !50, line: 151, size: 4928, elements: !57)
!57 = !{!58, !59, !61, !62, !63, !64, !65, !66, !67, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !100, !102, !103, !104, !105, !107, !108, !123, !124, !125, !126, !127, !157, !196, !197, !198}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !56, file: !50, line: 154, baseType: !7, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !56, file: !50, line: 155, baseType: !60, size: 32, offset: 32)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !56, file: !50, line: 156, baseType: !60, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !56, file: !50, line: 159, baseType: !60, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !56, file: !50, line: 160, baseType: !60, size: 32, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !56, file: !50, line: 161, baseType: !60, size: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !56, file: !50, line: 162, baseType: !60, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !56, file: !50, line: 163, baseType: !60, size: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !56, file: !50, line: 180, baseType: !68, size: 288, offset: 256)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !50, line: 165, size: 288, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !68, file: !50, line: 168, baseType: !60, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !68, file: !50, line: 169, baseType: !60, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !68, file: !50, line: 171, baseType: !60, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !68, file: !50, line: 174, baseType: !60, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !68, file: !50, line: 175, baseType: !60, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !68, file: !50, line: 176, baseType: !60, size: 32, offset: 160)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !68, file: !50, line: 177, baseType: !60, size: 32, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !68, file: !50, line: 178, baseType: !60, size: 32, offset: 224)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !68, file: !50, line: 179, baseType: !60, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !56, file: !50, line: 182, baseType: !60, size: 32, offset: 544)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !56, file: !50, line: 183, baseType: !60, size: 32, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !56, file: !50, line: 186, baseType: !60, size: 32, offset: 608)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !56, file: !50, line: 187, baseType: !60, size: 32, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !56, file: !50, line: 188, baseType: !60, size: 32, offset: 672)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !56, file: !50, line: 189, baseType: !60, size: 32, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !56, file: !50, line: 190, baseType: !60, size: 32, offset: 736)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !56, file: !50, line: 191, baseType: !60, size: 32, offset: 768)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !56, file: !50, line: 192, baseType: !60, size: 32, offset: 800)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !56, file: !50, line: 193, baseType: !60, size: 32, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !56, file: !50, line: 194, baseType: !60, size: 32, offset: 864)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !56, file: !50, line: 196, baseType: !60, size: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !56, file: !50, line: 197, baseType: !60, size: 32, offset: 928)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !56, file: !50, line: 198, baseType: !60, size: 32, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !56, file: !50, line: 200, baseType: !60, size: 32, offset: 992)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !56, file: !50, line: 201, baseType: !60, size: 32, offset: 1024)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !56, file: !50, line: 203, baseType: !60, size: 32, offset: 1056)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !56, file: !50, line: 205, baseType: !60, size: 32, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !56, file: !50, line: 206, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !56, file: !50, line: 207, baseType: !101, size: 128, offset: 1216)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !36)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !56, file: !50, line: 208, baseType: !101, size: 128, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !56, file: !50, line: 209, baseType: !101, size: 128, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !56, file: !50, line: 210, baseType: !101, size: 128, offset: 1600)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !56, file: !50, line: 211, baseType: !106, size: 512, offset: 1728)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !33)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !56, file: !50, line: 212, baseType: !106, size: 512, offset: 2240)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !56, file: !50, line: 215, baseType: !109, size: 64, offset: 2752)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !112, !60, !113, !115}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !117)
!117 = !{!118, !120, !121, !122}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !116, file: !119, line: 199, baseType: !7, size: 32)
!119 = !DIFile(filename: "common/quant.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !116, file: !119, line: 199, baseType: !7, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !116, file: !119, line: 199, baseType: !112, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !116, file: !119, line: 199, baseType: !112, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !56, file: !50, line: 216, baseType: !112, size: 64, offset: 2816)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !56, file: !50, line: 217, baseType: !60, size: 32, offset: 2880)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !56, file: !50, line: 218, baseType: !60, size: 32, offset: 2912)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !56, file: !50, line: 219, baseType: !98, size: 64, offset: 2944)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !56, file: !50, line: 252, baseType: !128, size: 768, offset: 3008)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !50, line: 222, size: 768, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !150, !151, !155, !156}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !128, file: !50, line: 224, baseType: !7, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !128, file: !50, line: 225, baseType: !7, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !128, file: !50, line: 227, baseType: !60, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !128, file: !50, line: 228, baseType: !60, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !128, file: !50, line: 229, baseType: !60, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !128, file: !50, line: 230, baseType: !60, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !128, file: !50, line: 231, baseType: !60, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !128, file: !50, line: 233, baseType: !60, size: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !128, file: !50, line: 234, baseType: !60, size: 32, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !128, file: !50, line: 235, baseType: !60, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !128, file: !50, line: 236, baseType: !60, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !128, file: !50, line: 237, baseType: !60, size: 32, offset: 352)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !128, file: !50, line: 238, baseType: !60, size: 32, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !128, file: !50, line: 239, baseType: !60, size: 32, offset: 416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !128, file: !50, line: 240, baseType: !60, size: 32, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !128, file: !50, line: 241, baseType: !60, size: 32, offset: 480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !128, file: !50, line: 242, baseType: !60, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !128, file: !50, line: 243, baseType: !60, size: 32, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !128, file: !50, line: 244, baseType: !149, size: 32, offset: 576)
!149 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !128, file: !50, line: 245, baseType: !149, size: 32, offset: 608)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !128, file: !50, line: 248, baseType: !152, size: 64, offset: 640)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 2)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !128, file: !50, line: 250, baseType: !60, size: 32, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !128, file: !50, line: 251, baseType: !60, size: 32, offset: 736)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !56, file: !50, line: 289, baseType: !158, size: 1024, offset: 3776)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !50, line: 255, size: 1024, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !194, !195}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !158, file: !50, line: 257, baseType: !60, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !158, file: !50, line: 259, baseType: !60, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !158, file: !50, line: 260, baseType: !60, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !158, file: !50, line: 261, baseType: !60, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !158, file: !50, line: 262, baseType: !60, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !158, file: !50, line: 264, baseType: !60, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !158, file: !50, line: 265, baseType: !149, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !158, file: !50, line: 266, baseType: !149, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !158, file: !50, line: 267, baseType: !60, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !158, file: !50, line: 268, baseType: !60, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !158, file: !50, line: 269, baseType: !149, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !158, file: !50, line: 270, baseType: !149, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !158, file: !50, line: 271, baseType: !149, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !158, file: !50, line: 273, baseType: !60, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !158, file: !50, line: 274, baseType: !149, size: 32, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !158, file: !50, line: 277, baseType: !60, size: 32, offset: 480)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !158, file: !50, line: 278, baseType: !98, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !158, file: !50, line: 279, baseType: !60, size: 32, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !158, file: !50, line: 280, baseType: !98, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !158, file: !50, line: 283, baseType: !149, size: 32, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !158, file: !50, line: 284, baseType: !149, size: 32, offset: 736)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !158, file: !50, line: 285, baseType: !149, size: 32, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !158, file: !50, line: 286, baseType: !183, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !50, line: 149, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 142, size: 256, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !185, file: !50, line: 144, baseType: !60, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !185, file: !50, line: 144, baseType: !60, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !185, file: !50, line: 145, baseType: !60, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !185, file: !50, line: 146, baseType: !60, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !185, file: !50, line: 147, baseType: !149, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !185, file: !50, line: 148, baseType: !193, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !158, file: !50, line: 287, baseType: !60, size: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !158, file: !50, line: 288, baseType: !98, size: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !56, file: !50, line: 292, baseType: !60, size: 32, offset: 4800)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !56, file: !50, line: 293, baseType: !60, size: 32, offset: 4832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !56, file: !50, line: 294, baseType: !60, size: 32, offset: 4864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !51, file: !52, line: 255, baseType: !200, size: 8192, offset: 4928)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8192, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !51, file: !52, line: 256, baseType: !204, size: 64, offset: 13120)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !205, line: 27, baseType: !24)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !51, file: !52, line: 257, baseType: !60, size: 32, offset: 13184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !51, file: !52, line: 258, baseType: !60, size: 32, offset: 13216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !51, file: !52, line: 269, baseType: !209, size: 2112, offset: 13248)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !52, line: 261, size: 2112, elements: !210)
!210 = !{!211, !212, !224, !225, !226, !240}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !209, file: !52, line: 263, baseType: !60, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !209, file: !52, line: 264, baseType: !213, size: 1536, offset: 64)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1536, elements: !222)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !50, line: 399, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 391, size: 192, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !215, file: !50, line: 393, baseType: !60, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !215, file: !50, line: 394, baseType: !60, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !215, file: !50, line: 397, baseType: !60, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !215, file: !50, line: 398, baseType: !221, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!222 = !{!223}
!223 = !DISubrange(count: 8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !209, file: !52, line: 265, baseType: !60, size: 32, offset: 1600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !209, file: !52, line: 266, baseType: !221, size: 64, offset: 1664)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !209, file: !52, line: 267, baseType: !227, size: 320, offset: 1728)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !228, line: 49, baseType: !229)
!228 = !DIFile(filename: "common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !228, line: 40, size: 320, elements: !230)
!230 = !{!231, !232, !233, !234, !238, !239}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !229, file: !228, line: 42, baseType: !221, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !229, file: !228, line: 43, baseType: !221, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !229, file: !228, line: 44, baseType: !221, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !229, file: !228, line: 46, baseType: !235, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !236, line: 87, baseType: !237)
!236 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!237 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !229, file: !228, line: 47, baseType: !60, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !229, file: !228, line: 48, baseType: !60, size: 32, offset: 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !209, file: !52, line: 268, baseType: !60, size: 32, offset: 2048)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !51, file: !52, line: 274, baseType: !60, size: 32, offset: 15360)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !51, file: !52, line: 276, baseType: !60, size: 32, offset: 15392)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !51, file: !52, line: 277, baseType: !60, size: 32, offset: 15424)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !51, file: !52, line: 278, baseType: !60, size: 32, offset: 15456)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !51, file: !52, line: 279, baseType: !60, size: 32, offset: 15488)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !51, file: !52, line: 280, baseType: !60, size: 32, offset: 15520)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !51, file: !52, line: 282, baseType: !60, size: 32, offset: 15552)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !51, file: !52, line: 283, baseType: !60, size: 32, offset: 15584)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !51, file: !52, line: 284, baseType: !60, size: 32, offset: 15616)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !51, file: !52, line: 287, baseType: !251, size: 9920, offset: 15648)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 9920, elements: !320)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !253, line: 133, baseType: !254)
!253 = !DIFile(filename: "common/set.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "06164d1fd824dd844d17e97dd39e9ac3")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 52, size: 9920, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !273, !274, !275, !276, !277, !278, !279, !280, !281, !288, !289, !319}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !254, file: !253, line: 54, baseType: !60, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !254, file: !253, line: 56, baseType: !60, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !254, file: !253, line: 57, baseType: !60, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !254, file: !253, line: 59, baseType: !60, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !254, file: !253, line: 60, baseType: !60, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !254, file: !253, line: 61, baseType: !60, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !254, file: !253, line: 63, baseType: !60, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !254, file: !253, line: 65, baseType: !60, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !254, file: !253, line: 67, baseType: !60, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !254, file: !253, line: 69, baseType: !60, size: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !254, file: !253, line: 70, baseType: !60, size: 32, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !254, file: !253, line: 71, baseType: !60, size: 32, offset: 352)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !254, file: !253, line: 72, baseType: !60, size: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !254, file: !253, line: 73, baseType: !270, size: 8192, offset: 416)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8192, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !254, file: !253, line: 75, baseType: !60, size: 32, offset: 8608)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !254, file: !253, line: 76, baseType: !60, size: 32, offset: 8640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !254, file: !253, line: 77, baseType: !60, size: 32, offset: 8672)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !254, file: !253, line: 78, baseType: !60, size: 32, offset: 8704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !254, file: !253, line: 79, baseType: !60, size: 32, offset: 8736)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !254, file: !253, line: 80, baseType: !60, size: 32, offset: 8768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !254, file: !253, line: 81, baseType: !60, size: 32, offset: 8800)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !254, file: !253, line: 83, baseType: !60, size: 32, offset: 8832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !254, file: !253, line: 90, baseType: !282, size: 128, offset: 8864)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !253, line: 84, size: 128, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !282, file: !253, line: 86, baseType: !60, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !282, file: !253, line: 87, baseType: !60, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !282, file: !253, line: 88, baseType: !60, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !282, file: !253, line: 89, baseType: !60, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !254, file: !253, line: 92, baseType: !60, size: 32, offset: 8992)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !254, file: !253, line: 129, baseType: !290, size: 864, offset: 9024)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !253, line: 93, size: 864, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !290, file: !253, line: 95, baseType: !60, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !290, file: !253, line: 96, baseType: !60, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !290, file: !253, line: 97, baseType: !60, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !290, file: !253, line: 99, baseType: !60, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !290, file: !253, line: 100, baseType: !60, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !290, file: !253, line: 102, baseType: !60, size: 32, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !290, file: !253, line: 103, baseType: !60, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !290, file: !253, line: 104, baseType: !60, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !290, file: !253, line: 105, baseType: !60, size: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !290, file: !253, line: 106, baseType: !60, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !290, file: !253, line: 107, baseType: !60, size: 32, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !290, file: !253, line: 108, baseType: !60, size: 32, offset: 352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !290, file: !253, line: 110, baseType: !60, size: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !290, file: !253, line: 111, baseType: !60, size: 32, offset: 416)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !290, file: !253, line: 112, baseType: !60, size: 32, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !290, file: !253, line: 114, baseType: !60, size: 32, offset: 480)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !290, file: !253, line: 115, baseType: !60, size: 32, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !290, file: !253, line: 116, baseType: !60, size: 32, offset: 544)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !290, file: !253, line: 117, baseType: !60, size: 32, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !290, file: !253, line: 119, baseType: !60, size: 32, offset: 608)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !290, file: !253, line: 120, baseType: !60, size: 32, offset: 640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !290, file: !253, line: 121, baseType: !60, size: 32, offset: 672)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !290, file: !253, line: 122, baseType: !60, size: 32, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !290, file: !253, line: 123, baseType: !60, size: 32, offset: 736)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !290, file: !253, line: 124, baseType: !60, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !290, file: !253, line: 125, baseType: !60, size: 32, offset: 800)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !290, file: !253, line: 126, baseType: !60, size: 32, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !254, file: !253, line: 131, baseType: !60, size: 32, offset: 9888)
!320 = !{!321}
!321 = !DISubrange(count: 1)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !51, file: !52, line: 288, baseType: !323, size: 64, offset: 25600)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !51, file: !52, line: 289, baseType: !325, size: 960, offset: 25664)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 960, elements: !320)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !253, line: 165, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 135, size: 960, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !327, file: !253, line: 137, baseType: !60, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !327, file: !253, line: 138, baseType: !60, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !327, file: !253, line: 140, baseType: !60, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !327, file: !253, line: 142, baseType: !60, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !327, file: !253, line: 143, baseType: !60, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !327, file: !253, line: 145, baseType: !60, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !327, file: !253, line: 146, baseType: !60, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !327, file: !253, line: 148, baseType: !60, size: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !327, file: !253, line: 149, baseType: !60, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !327, file: !253, line: 151, baseType: !60, size: 32, offset: 288)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !327, file: !253, line: 152, baseType: !60, size: 32, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !327, file: !253, line: 154, baseType: !60, size: 32, offset: 352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !327, file: !253, line: 156, baseType: !60, size: 32, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !327, file: !253, line: 157, baseType: !60, size: 32, offset: 416)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !327, file: !253, line: 158, baseType: !60, size: 32, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !327, file: !253, line: 160, baseType: !60, size: 32, offset: 480)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !327, file: !253, line: 162, baseType: !60, size: 32, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !327, file: !253, line: 163, baseType: !347, size: 384, offset: 576)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 384, elements: !349)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!349 = !{!350}
!350 = !DISubrange(count: 6)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !51, file: !52, line: 290, baseType: !352, size: 64, offset: 26624)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !51, file: !52, line: 291, baseType: !60, size: 32, offset: 26688)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !51, file: !52, line: 294, baseType: !355, size: 256, offset: 26752)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 256, elements: !360)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !358)
!358 = !{!359, !359}
!359 = !DISubrange(count: 4)
!360 = !{!359}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !51, file: !52, line: 295, baseType: !362, size: 128, offset: 27008)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 128, elements: !153)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !365)
!365 = !{!223, !223}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !51, file: !52, line: 297, baseType: !367, size: 256, offset: 27136)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 256, elements: !360)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !36)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !51, file: !52, line: 298, baseType: !371, size: 128, offset: 27392)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, elements: !153)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !33)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !51, file: !52, line: 300, baseType: !375, size: 256, offset: 27520)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 256, elements: !360)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 256, elements: !36)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 25, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 40, baseType: !380)
!380 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !51, file: !52, line: 301, baseType: !382, size: 128, offset: 27776)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 128, elements: !153)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 1024, elements: !33)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !51, file: !52, line: 302, baseType: !375, size: 256, offset: 27904)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !51, file: !52, line: 303, baseType: !382, size: 128, offset: 28160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !51, file: !52, line: 305, baseType: !348, size: 64, offset: 28288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !51, file: !52, line: 307, baseType: !389, size: 4096, align: 128, offset: 28416)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 4096, elements: !390)
!390 = !{!154, !34}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !51, file: !52, line: 308, baseType: !392, size: 2048, align: 128, offset: 32512)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 2048, elements: !390)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !51, file: !52, line: 309, baseType: !394, size: 64, offset: 34560)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !153)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !51, file: !52, line: 312, baseType: !396, size: 3072, offset: 34624)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !52, line: 209, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 159, size: 3072, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !427, !428, !429, !430, !431, !432, !433, !434}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !397, file: !52, line: 161, baseType: !323, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !397, file: !52, line: 162, baseType: !352, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !397, file: !52, line: 164, baseType: !60, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !397, file: !52, line: 165, baseType: !60, size: 32, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !397, file: !52, line: 166, baseType: !60, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !397, file: !52, line: 168, baseType: !60, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !397, file: !52, line: 170, baseType: !60, size: 32, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !397, file: !52, line: 172, baseType: !60, size: 32, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !397, file: !52, line: 173, baseType: !60, size: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !397, file: !52, line: 174, baseType: !60, size: 32, offset: 352)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !397, file: !52, line: 176, baseType: !60, size: 32, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !397, file: !52, line: 178, baseType: !60, size: 32, offset: 416)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !397, file: !52, line: 179, baseType: !60, size: 32, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !397, file: !52, line: 181, baseType: !152, size: 64, offset: 480)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !397, file: !52, line: 182, baseType: !60, size: 32, offset: 544)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !397, file: !52, line: 184, baseType: !60, size: 32, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !397, file: !52, line: 186, baseType: !60, size: 32, offset: 608)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !397, file: !52, line: 187, baseType: !60, size: 32, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !397, file: !52, line: 188, baseType: !60, size: 32, offset: 672)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !397, file: !52, line: 190, baseType: !60, size: 32, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !397, file: !52, line: 191, baseType: !60, size: 32, offset: 736)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !397, file: !52, line: 195, baseType: !421, size: 2048, offset: 768)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 2048, elements: !426)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !52, line: 192, size: 64, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !422, file: !52, line: 193, baseType: !60, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !422, file: !52, line: 194, baseType: !60, size: 32, offset: 32)
!426 = !{!154, !37}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !397, file: !52, line: 197, baseType: !60, size: 32, offset: 2816)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !397, file: !52, line: 199, baseType: !60, size: 32, offset: 2848)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !397, file: !52, line: 200, baseType: !60, size: 32, offset: 2880)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !397, file: !52, line: 201, baseType: !60, size: 32, offset: 2912)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !397, file: !52, line: 202, baseType: !60, size: 32, offset: 2944)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !397, file: !52, line: 205, baseType: !60, size: 32, offset: 2976)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !397, file: !52, line: 206, baseType: !60, size: 32, offset: 3008)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !397, file: !52, line: 207, baseType: !60, size: 32, offset: 3040)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !51, file: !52, line: 315, baseType: !436, size: 4096, offset: 37760)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !437, line: 46, baseType: !438)
!437 = !DIFile(filename: "common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 27, size: 4096, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !438, file: !437, line: 30, baseType: !60, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !438, file: !437, line: 31, baseType: !60, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !438, file: !437, line: 34, baseType: !60, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !438, file: !437, line: 35, baseType: !60, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !438, file: !437, line: 37, baseType: !221, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !438, file: !437, line: 38, baseType: !221, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !438, file: !437, line: 39, baseType: !221, size: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !438, file: !437, line: 42, baseType: !60, size: 32, align: 128, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !438, file: !437, line: 45, baseType: !449, size: 3680, offset: 416)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3680, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 460)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !51, file: !52, line: 340, baseType: !453, size: 31808, offset: 41856)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !52, line: 317, size: 31808, elements: !454)
!454 = !{!455, !601, !602, !606, !607, !609, !610, !611, !612, !613, !614, !615}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !453, file: !52, line: 320, baseType: !456, size: 4288)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 4288, elements: !599)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !459, line: 94, baseType: !460)
!459 = !DIFile(filename: "common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 31, size: 51648, elements: !461)
!461 = !{!462, !463, !464, !465, !469, !470, !471, !472, !473, !474, !475, !479, !480, !481, !482, !483, !484, !486, !488, !489, !491, !492, !493, !498, !505, !509, !512, !514, !515, !517, !518, !522, !523, !524, !527, !529, !530, !531, !532, !534, !535, !536, !537, !538, !539, !567}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !460, file: !459, line: 34, baseType: !60, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !460, file: !459, line: 35, baseType: !60, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !460, file: !459, line: 36, baseType: !60, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !460, file: !459, line: 37, baseType: !466, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !467, line: 27, baseType: !468)
!467 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !20, line: 44, baseType: !237)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !460, file: !459, line: 38, baseType: !60, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !460, file: !459, line: 39, baseType: !60, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !460, file: !459, line: 40, baseType: !60, size: 32, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !460, file: !459, line: 41, baseType: !149, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !460, file: !459, line: 42, baseType: !149, size: 32, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !460, file: !459, line: 45, baseType: !60, size: 32, offset: 352)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !460, file: !459, line: 46, baseType: !476, size: 96, offset: 384)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 96, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 3)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !460, file: !459, line: 47, baseType: !476, size: 96, offset: 480)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !460, file: !459, line: 48, baseType: !476, size: 96, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !460, file: !459, line: 49, baseType: !60, size: 32, offset: 672)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !460, file: !459, line: 50, baseType: !60, size: 32, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !460, file: !459, line: 51, baseType: !60, size: 32, offset: 736)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !460, file: !459, line: 52, baseType: !485, size: 192, offset: 768)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 192, elements: !477)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !460, file: !459, line: 53, baseType: !487, size: 256, offset: 960)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 256, elements: !360)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !460, file: !459, line: 54, baseType: !487, size: 256, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !460, file: !459, line: 55, baseType: !490, size: 64, offset: 1472)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !460, file: !459, line: 59, baseType: !487, size: 256, offset: 1536)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !460, file: !459, line: 60, baseType: !487, size: 256, offset: 1792)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !460, file: !459, line: 63, baseType: !494, size: 64, offset: 2048)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !467, line: 24, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !20, line: 37, baseType: !497)
!497 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !460, file: !459, line: 64, baseType: !499, size: 128, offset: 2112)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 128, elements: !153)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 32, elements: !153)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !467, line: 25, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !20, line: 39, baseType: !504)
!504 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !460, file: !459, line: 65, baseType: !506, size: 2176, offset: 2240)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 2176, elements: !507)
!507 = !{!154, !508}
!508 = !DISubrange(count: 17)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !460, file: !459, line: 66, baseType: !510, size: 2176, offset: 4416)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 2176, elements: !507)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !460, file: !459, line: 67, baseType: !513, size: 128, offset: 6592)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 128, elements: !153)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !460, file: !459, line: 68, baseType: !152, size: 64, offset: 6720)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !460, file: !459, line: 69, baseType: !516, size: 1024, offset: 6784)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 1024, elements: !426)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !460, file: !459, line: 70, baseType: !369, size: 512, offset: 7808)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !460, file: !459, line: 75, baseType: !519, size: 10368, offset: 8320)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 10368, elements: !520)
!520 = !{!521, !521}
!521 = !DISubrange(count: 18)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !460, file: !459, line: 76, baseType: !519, size: 10368, offset: 18688)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !460, file: !459, line: 77, baseType: !60, size: 32, offset: 29056)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !460, file: !459, line: 78, baseType: !525, size: 576, offset: 29088)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 576, elements: !526)
!526 = !{!521}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !460, file: !459, line: 79, baseType: !528, size: 20736, offset: 29696)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 20736, elements: !520)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !460, file: !459, line: 80, baseType: !511, size: 64, offset: 50432)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !460, file: !459, line: 81, baseType: !511, size: 64, offset: 50496)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !460, file: !459, line: 82, baseType: !511, size: 64, offset: 50560)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !460, file: !459, line: 83, baseType: !533, size: 64, offset: 50624)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !460, file: !459, line: 84, baseType: !60, size: 32, offset: 50688)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !460, file: !459, line: 85, baseType: !490, size: 64, offset: 50752)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !460, file: !459, line: 86, baseType: !490, size: 64, offset: 50816)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !460, file: !459, line: 89, baseType: !60, size: 32, offset: 50880)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !460, file: !459, line: 90, baseType: !60, size: 32, offset: 50912)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !460, file: !459, line: 91, baseType: !540, size: 320, offset: 50944)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !205, line: 72, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !205, line: 67, size: 320, elements: !542)
!542 = !{!543, !562, !566}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !541, file: !205, line: 69, baseType: !544, size: 320)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !545, line: 22, size: 320, elements: !546)
!545 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !544, file: !545, line: 24, baseType: !60, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !544, file: !545, line: 25, baseType: !7, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !544, file: !545, line: 26, baseType: !60, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !544, file: !545, line: 28, baseType: !7, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !544, file: !545, line: 32, baseType: !60, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !544, file: !545, line: 34, baseType: !504, size: 16, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !544, file: !545, line: 35, baseType: !504, size: 16, offset: 176)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !544, file: !545, line: 36, baseType: !555, size: 128, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !556, line: 55, baseType: !557)
!556 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !556, line: 51, size: 128, elements: !558)
!558 = !{!559, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !557, file: !556, line: 53, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !557, file: !556, line: 54, baseType: !560, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !541, file: !205, line: 70, baseType: !563, size: 320)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 320, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 40)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !541, file: !205, line: 71, baseType: !237, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !460, file: !459, line: 92, baseType: !568, size: 384, offset: 51264)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !205, line: 80, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !205, line: 75, size: 384, elements: !570)
!570 = !{!571, !593, !597}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !569, file: !205, line: 77, baseType: !572, size: 384)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !556, line: 94, size: 384, elements: !573)
!573 = !{!574, !586, !587, !589, !590, !591, !592}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !572, file: !556, line: 96, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !576, line: 33, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !576, line: 25, size: 64, elements: !578)
!578 = !{!579, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !577, file: !576, line: 27, baseType: !580, size: 64)
!580 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !577, file: !576, line: 32, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !576, line: 28, size: 64, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !582, file: !576, line: 30, baseType: !7, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !582, file: !576, line: 31, baseType: !7, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !572, file: !556, line: 97, baseType: !575, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !572, file: !556, line: 98, baseType: !588, size: 64, offset: 128)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !153)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !572, file: !556, line: 99, baseType: !588, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !572, file: !556, line: 100, baseType: !7, size: 32, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !572, file: !556, line: 101, baseType: !7, size: 32, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !572, file: !556, line: 102, baseType: !588, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !569, file: !205, line: 78, baseType: !594, size: 384)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 384, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 48)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !569, file: !205, line: 79, baseType: !598, size: 64)
!598 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!599 = !{!600}
!600 = !DISubrange(count: 67)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !52, line: 322, baseType: !456, size: 4288, offset: 4288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !453, file: !52, line: 324, baseType: !603, size: 21760, offset: 8576)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 21760, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 340)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !453, file: !52, line: 326, baseType: !457, size: 64, offset: 30336)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !453, file: !52, line: 329, baseType: !608, size: 1152, offset: 30400)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 1152, elements: !526)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !453, file: !52, line: 331, baseType: !60, size: 32, offset: 31552)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !453, file: !52, line: 333, baseType: !60, size: 32, offset: 31584)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !453, file: !52, line: 335, baseType: !60, size: 32, offset: 31616)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !453, file: !52, line: 336, baseType: !60, size: 32, offset: 31648)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !453, file: !52, line: 337, baseType: !60, size: 32, offset: 31680)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !453, file: !52, line: 338, baseType: !60, size: 32, offset: 31712)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !453, file: !52, line: 339, baseType: !60, size: 32, offset: 31744)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !51, file: !52, line: 343, baseType: !457, size: 64, offset: 73664)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !51, file: !52, line: 346, baseType: !457, size: 64, offset: 73728)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !51, file: !52, line: 349, baseType: !60, size: 32, offset: 73792)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !51, file: !52, line: 350, baseType: !620, size: 1216, offset: 73856)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 1216, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 19)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !51, file: !52, line: 351, baseType: !60, size: 32, offset: 75072)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !51, file: !52, line: 352, baseType: !620, size: 1216, offset: 75136)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !51, file: !52, line: 353, baseType: !152, size: 64, offset: 76352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !51, file: !52, line: 365, baseType: !627, size: 10624, offset: 76416)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !52, line: 358, size: 10624, elements: !628)
!628 = !{!629, !631, !634, !637}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !627, file: !52, line: 360, baseType: !630, size: 256, align: 128)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 256, elements: !36)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !627, file: !52, line: 361, baseType: !632, size: 128, align: 128, offset: 256)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 128, elements: !633)
!633 = !{!154, !359}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !627, file: !52, line: 363, baseType: !635, size: 4096, align: 128, offset: 384)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 4096, elements: !636)
!636 = !{!359, !34}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !627, file: !52, line: 364, baseType: !638, size: 6144, align: 128, offset: 4480)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 6144, elements: !639)
!639 = !{!640, !37}
!640 = !DISubrange(count: 24)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !51, file: !52, line: 544, baseType: !642, size: 80128, offset: 87040)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !52, line: 368, size: 80128, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !670, !672, !673, !674, !675, !676, !677, !678, !679, !680, !682, !685, !689, !690, !691, !692, !693, !697, !698, !699, !702, !704, !705, !706, !708, !709, !710, !711, !712, !713, !714, !715, !756, !776, !777, !778, !779, !780, !781, !782, !783, !784, !787, !790, !792}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !642, file: !52, line: 370, baseType: !60, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !642, file: !52, line: 373, baseType: !60, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !642, file: !52, line: 374, baseType: !60, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !642, file: !52, line: 375, baseType: !60, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !642, file: !52, line: 378, baseType: !60, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !642, file: !52, line: 379, baseType: !60, size: 32, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !642, file: !52, line: 380, baseType: !60, size: 32, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !642, file: !52, line: 381, baseType: !60, size: 32, offset: 224)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !642, file: !52, line: 382, baseType: !60, size: 32, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !642, file: !52, line: 385, baseType: !60, size: 32, offset: 288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !642, file: !52, line: 386, baseType: !60, size: 32, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !642, file: !52, line: 387, baseType: !60, size: 32, offset: 352)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !642, file: !52, line: 388, baseType: !60, size: 32, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !642, file: !52, line: 389, baseType: !60, size: 32, offset: 416)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !642, file: !52, line: 390, baseType: !60, size: 32, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !642, file: !52, line: 391, baseType: !60, size: 32, offset: 480)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !642, file: !52, line: 393, baseType: !60, size: 32, offset: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !642, file: !52, line: 396, baseType: !152, size: 64, offset: 544)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !642, file: !52, line: 397, baseType: !152, size: 64, offset: 608)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !642, file: !52, line: 400, baseType: !152, size: 64, offset: 672)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !642, file: !52, line: 401, baseType: !152, size: 64, offset: 736)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !642, file: !52, line: 403, baseType: !152, size: 64, offset: 800)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !642, file: !52, line: 404, baseType: !152, size: 64, offset: 864)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !642, file: !52, line: 407, baseType: !7, size: 32, offset: 928)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !642, file: !52, line: 408, baseType: !669, size: 128, offset: 960)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !360)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !642, file: !52, line: 409, baseType: !671, size: 512, offset: 1088)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !36)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !642, file: !52, line: 410, baseType: !60, size: 32, offset: 1600)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !642, file: !52, line: 411, baseType: !60, size: 32, offset: 1632)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !642, file: !52, line: 412, baseType: !60, size: 32, offset: 1664)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !642, file: !52, line: 413, baseType: !60, size: 32, offset: 1696)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !642, file: !52, line: 414, baseType: !60, size: 32, offset: 1728)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !642, file: !52, line: 415, baseType: !60, size: 32, offset: 1760)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !52, line: 422, baseType: !494, size: 64, offset: 1792)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !642, file: !52, line: 423, baseType: !494, size: 64, offset: 1856)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !642, file: !52, line: 424, baseType: !681, size: 64, offset: 1920)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !642, file: !52, line: 425, baseType: !683, size: 64, offset: 1984)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 64, elements: !222)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !642, file: !52, line: 427, baseType: !686, size: 64, offset: 2048)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 192, elements: !688)
!688 = !{!640}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !642, file: !52, line: 428, baseType: !494, size: 64, offset: 2112)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !642, file: !52, line: 429, baseType: !499, size: 128, offset: 2176)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !642, file: !52, line: 430, baseType: !499, size: 128, offset: 2304)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !642, file: !52, line: 431, baseType: !513, size: 128, offset: 2432)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !642, file: !52, line: 432, baseType: !694, size: 4096, offset: 2560)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 4096, elements: !695)
!695 = !{!154, !696}
!696 = !DISubrange(count: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !642, file: !52, line: 433, baseType: !494, size: 64, offset: 6656)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !642, file: !52, line: 434, baseType: !494, size: 64, offset: 6720)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !642, file: !52, line: 435, baseType: !700, size: 384, offset: 6784)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 384, elements: !701)
!701 = !{!154, !478}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !642, file: !52, line: 436, baseType: !703, size: 64, offset: 7168)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !642, file: !52, line: 439, baseType: !60, size: 32, offset: 7232)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !642, file: !52, line: 440, baseType: !60, size: 32, offset: 7264)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !642, file: !52, line: 441, baseType: !707, size: 128, offset: 7296)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !360)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !642, file: !52, line: 442, baseType: !60, size: 32, offset: 7424)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !642, file: !52, line: 444, baseType: !60, size: 32, offset: 7456)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !642, file: !52, line: 445, baseType: !60, size: 32, offset: 7488)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !642, file: !52, line: 447, baseType: !60, size: 32, offset: 7520)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !642, file: !52, line: 448, baseType: !60, size: 32, offset: 7552)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !642, file: !52, line: 454, baseType: !60, size: 32, offset: 7584)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !642, file: !52, line: 457, baseType: !60, size: 32, offset: 7616)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !642, file: !52, line: 498, baseType: !716, size: 57344, offset: 7680)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !52, line: 459, size: 57344, elements: !717)
!717 = !{!718, !722, !726, !728, !729, !732, !736, !737, !740, !741, !742, !745, !746, !747, !748, !749, !750, !753, !755}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !716, file: !52, line: 464, baseType: !719, size: 3072, align: 128)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3072, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !716, file: !52, line: 465, baseType: !723, size: 6912, align: 128, offset: 3072)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 6912, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 864)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !716, file: !52, line: 468, baseType: !727, size: 2048, align: 128, offset: 9984)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2048, elements: !271)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !716, file: !52, line: 469, baseType: !727, size: 2048, align: 128, offset: 12032)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !716, file: !52, line: 470, baseType: !730, size: 3072, align: 128, offset: 14080)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 3072, elements: !731)
!731 = !{!478, !34}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !716, file: !52, line: 471, baseType: !733, size: 3840, align: 128, offset: 17152)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 3840, elements: !734)
!734 = !{!735, !37}
!735 = !DISubrange(count: 15)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !716, file: !52, line: 474, baseType: !635, size: 4096, align: 128, offset: 20992)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !716, file: !52, line: 475, baseType: !738, size: 4096, align: 128, offset: 25088)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 4096, elements: !739)
!739 = !{!37, !37}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !716, file: !52, line: 478, baseType: !357, size: 512, offset: 29184)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !716, file: !52, line: 479, baseType: !60, size: 32, offset: 29696)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !716, file: !52, line: 480, baseType: !743, size: 128, offset: 29728)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !744)
!744 = !{!154, !154}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !716, file: !52, line: 481, baseType: !60, size: 32, offset: 29856)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !716, file: !52, line: 484, baseType: !485, size: 192, offset: 29888)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !716, file: !52, line: 486, baseType: !485, size: 192, offset: 30080)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !716, file: !52, line: 489, baseType: !485, size: 192, offset: 30272)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !716, file: !52, line: 492, baseType: !152, size: 64, offset: 30464)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !716, file: !52, line: 493, baseType: !751, size: 24576, offset: 30528)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 24576, elements: !752)
!752 = !{!154, !696, !350}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !716, file: !52, line: 494, baseType: !754, size: 2048, offset: 55104)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 2048, elements: !426)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !716, file: !52, line: 497, baseType: !476, size: 96, offset: 57152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !642, file: !52, line: 526, baseType: !757, size: 12032, offset: 65024)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !642, file: !52, line: 501, size: 12032, elements: !758)
!758 = !{!759, !761, !763, !766, !769, !770, !771, !772, !773, !774, !775}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !757, file: !52, line: 504, baseType: !760, size: 384)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 384, elements: !595)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !757, file: !52, line: 507, baseType: !762, size: 384, offset: 384)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 384, elements: !595)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !757, file: !52, line: 510, baseType: !764, size: 768, align: 32, offset: 768)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 768, elements: !765)
!765 = !{!154, !596}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !757, file: !52, line: 513, baseType: !767, size: 3072, align: 128, offset: 1536)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 3072, elements: !768)
!768 = !{!154, !596, !154}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !757, file: !52, line: 514, baseType: !767, size: 3072, align: 64, offset: 4608)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !757, file: !52, line: 517, baseType: !760, size: 384, align: 32, offset: 7680)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !757, file: !52, line: 519, baseType: !767, size: 3072, align: 128, offset: 8064)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "direct_ref", scope: !757, file: !52, line: 520, baseType: !764, size: 768, align: 32, offset: 11136)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pskip_mv", scope: !757, file: !52, line: 521, baseType: !501, size: 32, align: 32, offset: 11904)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_transform_size", scope: !757, file: !52, line: 524, baseType: !60, size: 32, offset: 11936)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_interlaced", scope: !757, file: !52, line: 525, baseType: !60, size: 32, offset: 11968)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !642, file: !52, line: 529, baseType: !60, size: 32, offset: 77056)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp", scope: !642, file: !52, line: 530, baseType: !60, size: 32, offset: 77088)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_qp", scope: !642, file: !52, line: 531, baseType: !60, size: 32, offset: 77120)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_dqp", scope: !642, file: !52, line: 532, baseType: !60, size: 32, offset: 77152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_variable_qp", scope: !642, file: !52, line: 533, baseType: !60, size: 32, offset: 77184)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_lossless", scope: !642, file: !52, line: 534, baseType: !60, size: 32, offset: 77216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_read", scope: !642, file: !52, line: 535, baseType: !60, size: 32, offset: 77248)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_auto_write", scope: !642, file: !52, line: 536, baseType: !60, size: 32, offset: 77280)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dist_scale_factor", scope: !642, file: !52, line: 539, baseType: !785, size: 512, offset: 77312)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 512, elements: !786)
!786 = !{!37, !154}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bipred_weight", scope: !642, file: !52, line: 540, baseType: !788, size: 2048, offset: 77824)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 2048, elements: !789)
!789 = !{!696, !359}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0_buf", scope: !642, file: !52, line: 542, baseType: !791, size: 16, offset: 79872)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 16, elements: !153)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "map_col_to_list0", scope: !642, file: !52, line: 543, baseType: !793, size: 128, offset: 79888)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 128, elements: !36)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !51, file: !52, line: 547, baseType: !795, size: 64, offset: 167168)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_ratecontrol_t", file: !52, line: 248, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "x264_ratecontrol_t", file: !52, line: 248, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !51, file: !52, line: 604, baseType: !799, size: 23936, offset: 167232)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !52, line: 550, size: 23936, elements: !800)
!800 = !{!801, !826, !830, !832, !834, !835, !836, !837, !838, !839, !840, !841, !844, !846, !848, !851, !852}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !799, file: !52, line: 579, baseType: !802, size: 3904)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !799, file: !52, line: 553, size: 3904, elements: !803)
!803 = !{!804, !805, !806, !807, !809, !810, !811, !812, !813, !815, !818, !819, !820, !821, !822, !824}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_bits", scope: !802, file: !52, line: 556, baseType: !60, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !802, file: !52, line: 558, baseType: !60, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_misc_bits", scope: !802, file: !52, line: 560, baseType: !60, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !802, file: !52, line: 562, baseType: !808, size: 608, offset: 96)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 608, elements: !621)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_i", scope: !802, file: !52, line: 563, baseType: !60, size: 32, offset: 704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_p", scope: !802, file: !52, line: 564, baseType: !60, size: 32, offset: 736)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_skip", scope: !802, file: !52, line: 565, baseType: !60, size: 32, offset: 768)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !802, file: !52, line: 566, baseType: !152, size: 64, offset: 800)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !802, file: !52, line: 567, baseType: !814, size: 2048, offset: 864)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !695)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !802, file: !52, line: 568, baseType: !816, size: 544, offset: 2912)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 544, elements: !817)
!817 = !{!508}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !802, file: !52, line: 571, baseType: !60, size: 32, offset: 3456)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_inter_cost", scope: !802, file: !52, line: 572, baseType: !60, size: 32, offset: 3488)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_mbs_analysed", scope: !802, file: !52, line: 573, baseType: !60, size: 32, offset: 3520)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !802, file: !52, line: 575, baseType: !152, size: 64, offset: 3552)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd", scope: !802, file: !52, line: 577, baseType: !823, size: 192, offset: 3648)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 192, elements: !477)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim", scope: !802, file: !52, line: 578, baseType: !825, size: 64, offset: 3840)
!825 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !799, file: !52, line: 584, baseType: !827, size: 160, offset: 3904)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 5)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_size", scope: !799, file: !52, line: 585, baseType: !831, size: 320, offset: 4096)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 320, elements: !828)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "f_slice_qp", scope: !799, file: !52, line: 586, baseType: !833, size: 320, offset: 4416)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 320, elements: !828)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_consecutive_bframes", scope: !799, file: !52, line: 587, baseType: !816, size: 544, offset: 4736)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_ssd_global", scope: !799, file: !52, line: 589, baseType: !831, size: 320, offset: 5312)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_average", scope: !799, file: !52, line: 590, baseType: !833, size: 320, offset: 5632)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_y", scope: !799, file: !52, line: 591, baseType: !833, size: 320, offset: 5952)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_u", scope: !799, file: !52, line: 592, baseType: !833, size: 320, offset: 6272)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "f_psnr_mean_v", scope: !799, file: !52, line: 593, baseType: !833, size: 320, offset: 6592)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "f_ssim_mean_y", scope: !799, file: !52, line: 594, baseType: !833, size: 320, offset: 6912)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !799, file: !52, line: 596, baseType: !842, size: 6080, offset: 7232)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 6080, elements: !843)
!843 = !{!829, !622}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_partition", scope: !799, file: !52, line: 597, baseType: !845, size: 2176, offset: 13312)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 2176, elements: !507)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_8x8dct", scope: !799, file: !52, line: 598, baseType: !847, size: 128, offset: 15488)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 128, elements: !153)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count_ref", scope: !799, file: !52, line: 599, baseType: !849, size: 8192, offset: 15616)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 8192, elements: !850)
!850 = !{!154, !154, !696}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_score", scope: !799, file: !52, line: 601, baseType: !152, size: 64, offset: 23808)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_frames", scope: !799, file: !52, line: 602, baseType: !152, size: 64, offset: 23872)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "predict_16x16", scope: !51, file: !52, line: 607, baseType: !854, size: 448, offset: 191168)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 448, elements: !860)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_predict_t", file: !856, line: 27, baseType: !857)
!856 = !DIFile(filename: "common/predict.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "c7827bfe44f4a550b7080533457a8327")
