; ModuleID = 'encoder/ratecontrol.c'
source_filename = "encoder/ratecontrol.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [128 x ptr], i64, i32, i32, %struct.anon.2, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], ptr, [1 x %struct.x264_pps_t], ptr, i32, [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], [4 x ptr], [2 x ptr], ptr, [8 x i8], [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], %struct.x264_slice_header_t, [8 x i8], %struct.x264_cabac_t, %struct.anon.6, ptr, ptr, i32, [19 x ptr], i32, [19 x ptr], [2 x i32], %struct.anon.8, %struct.anon.9, ptr, %struct.anon.12, [7 x ptr], [7 x ptr], [12 x ptr], [12 x ptr], %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], ptr, ptr, i32, i32, ptr, %struct.anon.0, %struct.anon.1, i32, i32, i32 }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!209 = distinct !DIGlobalVariable(scope: null, file: !2, line: 564, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 13)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !2, line: 566, type: !210, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 568, type: !92, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 20)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 580, type: !198, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 590, type: !188, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1247, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 27)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1366, type: !205, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "slice_type_to_char", scope: !235, file: !238, line: 157, type: !369, isLocal: true, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !236, retainedTypes: !282, globals: !315, splitDebugInlining: false, nameTableKind: None)
!236 = !{!237, !246, !269}
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "slice_type_e", file: !238, line: 148, baseType: !239, size: 32, elements: !240)
!238 = !DIFile(filename: "./common/common.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "4880b62cc871dca4002788746fbccb70")
!239 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!240 = !{!241, !242, !243, !244, !245}
!241 = !DIEnumerator(name: "SLICE_TYPE_P", value: 0)
!242 = !DIEnumerator(name: "SLICE_TYPE_B", value: 1)
!243 = !DIEnumerator(name: "SLICE_TYPE_I", value: 2)
!244 = !DIEnumerator(name: "SLICE_TYPE_SP", value: 3)
!245 = !DIEnumerator(name: "SLICE_TYPE_SI", value: 4)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mb_class_e", file: !247, line: 61, baseType: !239, size: 32, elements: !248)
!247 = !DIFile(filename: "./common/macroblock.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "0b0c175005b691009f3df3e457cfe9c0")
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!249 = !DIEnumerator(name: "I_4x4", value: 0)
!250 = !DIEnumerator(name: "I_8x8", value: 1)
!251 = !DIEnumerator(name: "I_16x16", value: 2)
!252 = !DIEnumerator(name: "I_PCM", value: 3)
!253 = !DIEnumerator(name: "P_L0", value: 4)
!254 = !DIEnumerator(name: "P_8x8", value: 5)
!255 = !DIEnumerator(name: "P_SKIP", value: 6)
!256 = !DIEnumerator(name: "B_DIRECT", value: 7)
!257 = !DIEnumerator(name: "B_L0_L0", value: 8)
!258 = !DIEnumerator(name: "B_L0_L1", value: 9)
!259 = !DIEnumerator(name: "B_L0_BI", value: 10)
!260 = !DIEnumerator(name: "B_L1_L0", value: 11)
!261 = !DIEnumerator(name: "B_L1_L1", value: 12)
!262 = !DIEnumerator(name: "B_L1_BI", value: 13)
!263 = !DIEnumerator(name: "B_BI_L0", value: 14)
!264 = !DIEnumerator(name: "B_BI_L1", value: 15)
!265 = !DIEnumerator(name: "B_BI_BI", value: 16)
!266 = !DIEnumerator(name: "B_8x8", value: 17)
!267 = !DIEnumerator(name: "B_SKIP", value: 18)
!268 = !DIEnumerator(name: "X264_MBTYPE_MAX", value: 19)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !270, line: 30, baseType: !239, size: 32, elements: !271)
!270 = !DIFile(filename: "./common/pixel.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "aba138e44f0e52bc0158be0d182b79c1")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!272 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!273 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!274 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!275 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!276 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!277 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!278 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!279 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!280 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!281 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!282 = !{!283, !284, !285, !310, !311, !302, !296}
!283 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!284 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ratecontrol_entry_t", file: !2, line: 54, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 37, size: 576, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !301, !303, !304, !305, !306, !307, !308, !309}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !2, line: 39, baseType: !283, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "kept_as_ref", scope: !287, file: !2, line: 40, baseType: !283, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !287, file: !2, line: 41, baseType: !284, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !287, file: !2, line: 42, baseType: !283, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tex_bits", scope: !287, file: !2, line: 43, baseType: !283, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !287, file: !2, line: 44, baseType: !283, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "expected_bits", scope: !287, file: !2, line: 45, baseType: !296, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !297, line: 27, baseType: !298)
!297 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !299, line: 45, baseType: !300)
!299 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!300 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "expected_vbv", scope: !287, file: !2, line: 46, baseType: !302, size: 64, offset: 256)
!302 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "new_qscale", scope: !287, file: !2, line: 47, baseType: !284, size: 32, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "new_qp", scope: !287, file: !2, line: 48, baseType: !283, size: 32, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !287, file: !2, line: 49, baseType: !283, size: 32, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !287, file: !2, line: 50, baseType: !283, size: 32, offset: 416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "s_count", scope: !287, file: !2, line: 51, baseType: !283, size: 32, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "blurred_complexity", scope: !287, file: !2, line: 52, baseType: !284, size: 32, offset: 480)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mode", scope: !287, file: !2, line: 53, baseType: !4, size: 8, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !312, line: 27, baseType: !313)
!312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !299, line: 44, baseType: !314)
!314 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!315 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !44, !49, !55, !60, !65, !70, !75, !80, !85, !90, !95, !97, !102, !107, !112, !114, !116, !118, !120, !122, !127, !132, !137, !142, !144, !146, !148, !153, !155, !157, !162, !167, !169, !174, !176, !179, !184, !186, !191, !196, !201, !203, !208, !213, !215, !217, !222, !224, !226, !231, !233, !316, !321, !326, !331, !336, !341, !343, !348, !353, !355, !360, !362, !367}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1755, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 60)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1836, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 15)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1836, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 200, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 25)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1842, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 17)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1870, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 21)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1893, type: !14, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1894, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 58)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1901, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 63)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1903, type: !188, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 67)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1910, type: !171, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1913, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 16)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1724, type: !19, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 40, elements: !105)
!370 = !{i32 7, !"Dwarf Version", i32 5}
!371 = !{i32 2, !"Debug Info Version", i32 3}
!372 = !{i32 1, !"wchar_size", i32 4}
!373 = !{i32 8, !"PIC Level", i32 2}
!374 = !{i32 7, !"PIE Level", i32 2}
!375 = !{i32 7, !"uwtable", i32 2}
!376 = !{!"clang version 16.0.0"}
!377 = distinct !DISubprogram(name: "x264_adaptive_quant_frame", scope: !2, file: !2, line: 194, type: !378, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !1548)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !380, !784}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !382, line: 42, baseType: !383)
!382 = !DIFile(filename: "./x264.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "9fe19a6136ab7ddd44a70d62bce62365")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !238, line: 250, size: 206080, elements: !384)
!384 = !{!385, !528, !532, !535, !536, !537, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !648, !650, !676, !678, !679, !686, !691, !695, !699, !706, !710, !711, !712, !713, !718, !720, !722, !762, !779, !927, !928, !929, !930, !934, !935, !936, !937, !951, !1102, !1221, !1270, !1279, !1280, !1286, !1288, !1357, !1413, !1465, !1486, !1528}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !383, file: !238, line: 253, baseType: !386, size: 4928)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !382, line: 295, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !382, line: 151, size: 4928, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429, !434, !435, !436, !437, !441, !442, !455, !456, !457, !458, !459, !486, !525, !526, !527}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !387, file: !382, line: 154, baseType: !239, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !387, file: !382, line: 155, baseType: !283, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !387, file: !382, line: 156, baseType: !283, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !387, file: !382, line: 159, baseType: !283, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !387, file: !382, line: 160, baseType: !283, size: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !387, file: !382, line: 161, baseType: !283, size: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !387, file: !382, line: 162, baseType: !283, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !387, file: !382, line: 163, baseType: !283, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !387, file: !382, line: 180, baseType: !398, size: 288, offset: 256)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !382, line: 165, size: 288, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !398, file: !382, line: 168, baseType: !283, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !398, file: !382, line: 169, baseType: !283, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !398, file: !382, line: 171, baseType: !283, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !398, file: !382, line: 174, baseType: !283, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !398, file: !382, line: 175, baseType: !283, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !398, file: !382, line: 176, baseType: !283, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !398, file: !382, line: 177, baseType: !283, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !398, file: !382, line: 178, baseType: !283, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !398, file: !382, line: 179, baseType: !283, size: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !387, file: !382, line: 182, baseType: !283, size: 32, offset: 544)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !387, file: !382, line: 183, baseType: !283, size: 32, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !387, file: !382, line: 186, baseType: !283, size: 32, offset: 608)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !387, file: !382, line: 187, baseType: !283, size: 32, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !387, file: !382, line: 188, baseType: !283, size: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !387, file: !382, line: 189, baseType: !283, size: 32, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_pre_scenecut", scope: !387, file: !382, line: 190, baseType: !283, size: 32, offset: 736)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !387, file: !382, line: 191, baseType: !283, size: 32, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !387, file: !382, line: 192, baseType: !283, size: 32, offset: 800)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !387, file: !382, line: 193, baseType: !283, size: 32, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_bframe_pyramid", scope: !387, file: !382, line: 194, baseType: !283, size: 32, offset: 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !387, file: !382, line: 196, baseType: !283, size: 32, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !387, file: !382, line: 197, baseType: !283, size: 32, offset: 928)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !387, file: !382, line: 198, baseType: !283, size: 32, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !387, file: !382, line: 200, baseType: !283, size: 32, offset: 992)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !387, file: !382, line: 201, baseType: !283, size: 32, offset: 1024)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !387, file: !382, line: 203, baseType: !283, size: 32, offset: 1056)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !387, file: !382, line: 205, baseType: !283, size: 32, offset: 1088)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !387, file: !382, line: 206, baseType: !428, size: 64, offset: 1152)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !387, file: !382, line: 207, baseType: !430, size: 128, offset: 1216)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 128, elements: !365)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !297, line: 24, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !299, line: 38, baseType: !433)
!433 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !387, file: !382, line: 208, baseType: !430, size: 128, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !387, file: !382, line: 209, baseType: !430, size: 128, offset: 1472)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !387, file: !382, line: 210, baseType: !430, size: 128, offset: 1600)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !387, file: !382, line: 211, baseType: !438, size: 512, offset: 1728)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 512, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !387, file: !382, line: 212, baseType: !438, size: 512, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !387, file: !382, line: 215, baseType: !443, size: 64, offset: 2752)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !310, !283, !446, !447}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !449)
!449 = !{!450, !452, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !448, file: !451, baseType: !239, size: 32)
!451 = !DIFile(filename: "encoder/ratecontrol.c", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !448, file: !451, baseType: !239, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !448, file: !451, baseType: !310, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !448, file: !451, baseType: !310, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !387, file: !382, line: 216, baseType: !310, size: 64, offset: 2816)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !387, file: !382, line: 217, baseType: !283, size: 32, offset: 2880)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !387, file: !382, line: 218, baseType: !283, size: 32, offset: 2912)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !387, file: !382, line: 219, baseType: !428, size: 64, offset: 2944)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !387, file: !382, line: 252, baseType: !460, size: 768, offset: 3008)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !382, line: 222, size: 768, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !484, !485}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !460, file: !382, line: 224, baseType: !239, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !460, file: !382, line: 225, baseType: !239, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !460, file: !382, line: 227, baseType: !283, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !460, file: !382, line: 228, baseType: !283, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !460, file: !382, line: 229, baseType: !283, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_8x8_inference", scope: !460, file: !382, line: 230, baseType: !283, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !460, file: !382, line: 231, baseType: !283, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !460, file: !382, line: 233, baseType: !283, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !460, file: !382, line: 234, baseType: !283, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !460, file: !382, line: 235, baseType: !283, size: 32, offset: 288)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !460, file: !382, line: 236, baseType: !283, size: 32, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !460, file: !382, line: 237, baseType: !283, size: 32, offset: 352)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !460, file: !382, line: 238, baseType: !283, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !460, file: !382, line: 239, baseType: !283, size: 32, offset: 416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !460, file: !382, line: 240, baseType: !283, size: 32, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !460, file: !382, line: 241, baseType: !283, size: 32, offset: 480)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !460, file: !382, line: 242, baseType: !283, size: 32, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !460, file: !382, line: 243, baseType: !283, size: 32, offset: 544)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !460, file: !382, line: 244, baseType: !284, size: 32, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !460, file: !382, line: 245, baseType: !284, size: 32, offset: 608)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !460, file: !382, line: 248, baseType: !483, size: 64, offset: 640)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 64, elements: !199)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !460, file: !382, line: 250, baseType: !283, size: 32, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !460, file: !382, line: 251, baseType: !283, size: 32, offset: 736)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !387, file: !382, line: 289, baseType: !487, size: 1024, offset: 3776)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !382, line: 255, size: 1024, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !523, !524}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !487, file: !382, line: 257, baseType: !283, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !487, file: !382, line: 259, baseType: !283, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !487, file: !382, line: 260, baseType: !283, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !487, file: !382, line: 261, baseType: !283, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !487, file: !382, line: 262, baseType: !283, size: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !487, file: !382, line: 264, baseType: !283, size: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !487, file: !382, line: 265, baseType: !284, size: 32, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !487, file: !382, line: 266, baseType: !284, size: 32, offset: 224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !487, file: !382, line: 267, baseType: !283, size: 32, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !487, file: !382, line: 268, baseType: !283, size: 32, offset: 288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !487, file: !382, line: 269, baseType: !284, size: 32, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !487, file: !382, line: 270, baseType: !284, size: 32, offset: 352)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !487, file: !382, line: 271, baseType: !284, size: 32, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !487, file: !382, line: 273, baseType: !283, size: 32, offset: 416)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !487, file: !382, line: 274, baseType: !284, size: 32, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !487, file: !382, line: 277, baseType: !283, size: 32, offset: 480)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !487, file: !382, line: 278, baseType: !428, size: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !487, file: !382, line: 279, baseType: !283, size: 32, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !487, file: !382, line: 280, baseType: !428, size: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !487, file: !382, line: 283, baseType: !284, size: 32, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !487, file: !382, line: 284, baseType: !284, size: 32, offset: 736)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !487, file: !382, line: 285, baseType: !284, size: 32, offset: 768)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !487, file: !382, line: 286, baseType: !512, size: 64, offset: 832)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !382, line: 149, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 142, size: 256, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !514, file: !382, line: 144, baseType: !283, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !514, file: !382, line: 144, baseType: !283, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !514, file: !382, line: 145, baseType: !283, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !514, file: !382, line: 146, baseType: !283, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !514, file: !382, line: 147, baseType: !284, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !514, file: !382, line: 148, baseType: !522, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !487, file: !382, line: 287, baseType: !283, size: 32, offset: 896)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !487, file: !382, line: 288, baseType: !428, size: 64, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !387, file: !382, line: 292, baseType: !283, size: 32, offset: 4800)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !387, file: !382, line: 293, baseType: !283, size: 32, offset: 4832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !387, file: !382, line: 294, baseType: !283, size: 32, offset: 4864)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !383, file: !238, line: 255, baseType: !529, size: 8192, offset: 4928)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 8192, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !383, file: !238, line: 256, baseType: !533, size: 64, offset: 13120)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !534, line: 27, baseType: !300)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !383, file: !238, line: 257, baseType: !283, size: 32, offset: 13184)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !383, file: !238, line: 258, baseType: !283, size: 32, offset: 13216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !383, file: !238, line: 269, baseType: !538, size: 2112, offset: 13248)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !238, line: 261, size: 2112, elements: !539)
!539 = !{!540, !541, !551, !552, !553, !566}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !538, file: !238, line: 263, baseType: !283, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !538, file: !238, line: 264, baseType: !542, size: 1536, offset: 64)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 1536, elements: !93)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !382, line: 399, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 391, size: 192, elements: !545)
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !544, file: !382, line: 393, baseType: !283, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !544, file: !382, line: 394, baseType: !283, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !544, file: !382, line: 397, baseType: !283, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !544, file: !382, line: 398, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !538, file: !238, line: 265, baseType: !283, size: 32, offset: 1600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !538, file: !238, line: 266, baseType: !550, size: 64, offset: 1664)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !538, file: !238, line: 267, baseType: !554, size: 320, offset: 1728)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !555, line: 49, baseType: !556)
!555 = !DIFile(filename: "./common/bs.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "2f46b0964798cffcc7898517b4d9922e")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !555, line: 40, size: 320, elements: !557)
!557 = !{!558, !559, !560, !561, !564, !565}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !556, file: !555, line: 42, baseType: !550, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !556, file: !555, line: 43, baseType: !550, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !556, file: !555, line: 44, baseType: !550, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !556, file: !555, line: 46, baseType: !562, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !563, line: 87, baseType: !314)
!563 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !556, file: !555, line: 47, baseType: !283, size: 32, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !556, file: !555, line: 48, baseType: !283, size: 32, offset: 288)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_size", scope: !538, file: !238, line: 268, baseType: !283, size: 32, offset: 2048)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !383, file: !238, line: 274, baseType: !283, size: 32, offset: 15360)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_offset", scope: !383, file: !238, line: 276, baseType: !283, size: 32, offset: 15392)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !383, file: !238, line: 277, baseType: !283, size: 32, offset: 15424)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_msb", scope: !383, file: !238, line: 278, baseType: !283, size: 32, offset: 15456)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !383, file: !238, line: 279, baseType: !283, size: 32, offset: 15488)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !383, file: !238, line: 280, baseType: !283, size: 32, offset: 15520)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_num", scope: !383, file: !238, line: 282, baseType: !283, size: 32, offset: 15552)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !383, file: !238, line: 283, baseType: !283, size: 32, offset: 15584)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !383, file: !238, line: 284, baseType: !283, size: 32, offset: 15616)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !383, file: !238, line: 287, baseType: !577, size: 9920, offset: 15648)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 9920, elements: !646)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !579, line: 133, baseType: !580)
!579 = !DIFile(filename: "./common/set.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "06164d1fd824dd844d17e97dd39e9ac3")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 52, size: 9920, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !599, !600, !601, !602, !603, !604, !605, !606, !607, !614, !615, !645}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !580, file: !579, line: 54, baseType: !283, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !580, file: !579, line: 56, baseType: !283, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !580, file: !579, line: 57, baseType: !283, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !580, file: !579, line: 59, baseType: !283, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !580, file: !579, line: 60, baseType: !283, size: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !580, file: !579, line: 61, baseType: !283, size: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !580, file: !579, line: 63, baseType: !283, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !580, file: !579, line: 65, baseType: !283, size: 32, offset: 224)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !580, file: !579, line: 67, baseType: !283, size: 32, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !580, file: !579, line: 69, baseType: !283, size: 32, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !580, file: !579, line: 70, baseType: !283, size: 32, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !580, file: !579, line: 71, baseType: !283, size: 32, offset: 352)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !580, file: !579, line: 72, baseType: !283, size: 32, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !580, file: !579, line: 73, baseType: !596, size: 8192, offset: 416)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 8192, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !580, file: !579, line: 75, baseType: !283, size: 32, offset: 8608)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !580, file: !579, line: 76, baseType: !283, size: 32, offset: 8640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !580, file: !579, line: 77, baseType: !283, size: 32, offset: 8672)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !580, file: !579, line: 78, baseType: !283, size: 32, offset: 8704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !580, file: !579, line: 79, baseType: !283, size: 32, offset: 8736)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !580, file: !579, line: 80, baseType: !283, size: 32, offset: 8768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !580, file: !579, line: 81, baseType: !283, size: 32, offset: 8800)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !580, file: !579, line: 83, baseType: !283, size: 32, offset: 8832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !580, file: !579, line: 90, baseType: !608, size: 128, offset: 8864)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !580, file: !579, line: 84, size: 128, elements: !609)
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !608, file: !579, line: 86, baseType: !283, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !608, file: !579, line: 87, baseType: !283, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !608, file: !579, line: 88, baseType: !283, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !608, file: !579, line: 89, baseType: !283, size: 32, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !580, file: !579, line: 92, baseType: !283, size: 32, offset: 8992)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !580, file: !579, line: 129, baseType: !616, size: 864, offset: 9024)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !580, file: !579, line: 93, size: 864, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !616, file: !579, line: 95, baseType: !283, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !616, file: !579, line: 96, baseType: !283, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !616, file: !579, line: 97, baseType: !283, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !616, file: !579, line: 99, baseType: !283, size: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !616, file: !579, line: 100, baseType: !283, size: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !616, file: !579, line: 102, baseType: !283, size: 32, offset: 160)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !616, file: !579, line: 103, baseType: !283, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !616, file: !579, line: 104, baseType: !283, size: 32, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !616, file: !579, line: 105, baseType: !283, size: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !616, file: !579, line: 106, baseType: !283, size: 32, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !616, file: !579, line: 107, baseType: !283, size: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !616, file: !579, line: 108, baseType: !283, size: 32, offset: 352)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !616, file: !579, line: 110, baseType: !283, size: 32, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !616, file: !579, line: 111, baseType: !283, size: 32, offset: 416)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !616, file: !579, line: 112, baseType: !283, size: 32, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !616, file: !579, line: 114, baseType: !283, size: 32, offset: 480)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !616, file: !579, line: 115, baseType: !283, size: 32, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !616, file: !579, line: 116, baseType: !283, size: 32, offset: 544)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !616, file: !579, line: 117, baseType: !283, size: 32, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !616, file: !579, line: 119, baseType: !283, size: 32, offset: 608)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !616, file: !579, line: 120, baseType: !283, size: 32, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !616, file: !579, line: 121, baseType: !283, size: 32, offset: 672)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !616, file: !579, line: 122, baseType: !283, size: 32, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !616, file: !579, line: 123, baseType: !283, size: 32, offset: 736)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !616, file: !579, line: 124, baseType: !283, size: 32, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !616, file: !579, line: 125, baseType: !283, size: 32, offset: 800)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !616, file: !579, line: 126, baseType: !283, size: 32, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !580, file: !579, line: 131, baseType: !283, size: 32, offset: 9888)
!646 = !{!647}
!647 = !DISubrange(count: 1)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !383, file: !238, line: 288, baseType: !649, size: 64, offset: 25600)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !383, file: !238, line: 289, baseType: !651, size: 960, offset: 25664)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 960, elements: !646)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !579, line: 165, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 135, size: 960, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !653, file: !579, line: 137, baseType: !283, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !653, file: !579, line: 138, baseType: !283, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !653, file: !579, line: 140, baseType: !283, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !653, file: !579, line: 142, baseType: !283, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !653, file: !579, line: 143, baseType: !283, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !653, file: !579, line: 145, baseType: !283, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !653, file: !579, line: 146, baseType: !283, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !653, file: !579, line: 148, baseType: !283, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !653, file: !579, line: 149, baseType: !283, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !653, file: !579, line: 151, baseType: !283, size: 32, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !653, file: !579, line: 152, baseType: !283, size: 32, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !653, file: !579, line: 154, baseType: !283, size: 32, offset: 352)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !653, file: !579, line: 156, baseType: !283, size: 32, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !653, file: !579, line: 157, baseType: !283, size: 32, offset: 416)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !653, file: !579, line: 158, baseType: !283, size: 32, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !653, file: !579, line: 160, baseType: !283, size: 32, offset: 480)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !653, file: !579, line: 162, baseType: !283, size: 32, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !653, file: !579, line: 163, baseType: !673, size: 384, offset: 576)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 384, elements: !125)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !383, file: !238, line: 290, baseType: !677, size: 64, offset: 26624)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !383, file: !238, line: 291, baseType: !283, size: 32, offset: 26688)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !383, file: !238, line: 294, baseType: !680, size: 256, offset: 26752)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 256, elements: !685)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 512, elements: !683)
!683 = !{!684, !684}
!684 = !DISubrange(count: 4)
!685 = !{!684}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !383, file: !238, line: 295, baseType: !687, size: 128, offset: 27008)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 128, elements: !199)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 2048, elements: !690)
!690 = !{!94, !94}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !383, file: !238, line: 297, baseType: !692, size: 256, offset: 27136)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 256, elements: !685)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 512, elements: !365)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !383, file: !238, line: 298, baseType: !696, size: 128, offset: 27392)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 128, elements: !199)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 2048, elements: !439)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !383, file: !238, line: 300, baseType: !700, size: 256, offset: 27520)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 256, elements: !685)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 256, elements: !365)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !297, line: 25, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !299, line: 40, baseType: !705)
!705 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !383, file: !238, line: 301, baseType: !707, size: 128, offset: 27776)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 128, elements: !199)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 1024, elements: !439)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !383, file: !238, line: 302, baseType: !700, size: 256, offset: 27904)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !383, file: !238, line: 303, baseType: !707, size: 128, offset: 28160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !383, file: !238, line: 305, baseType: !674, size: 64, offset: 28288)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nr_residual_sum", scope: !383, file: !238, line: 307, baseType: !714, size: 4096, align: 128, offset: 28416)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 4096, elements: !717)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !297, line: 26, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !299, line: 42, baseType: !239)
!717 = !{!200, !440}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "nr_offset", scope: !383, file: !238, line: 308, baseType: !719, size: 2048, align: 128, offset: 32512)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 2048, elements: !717)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nr_count", scope: !383, file: !238, line: 309, baseType: !721, size: 64, offset: 34560)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 64, elements: !199)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !383, file: !238, line: 312, baseType: !723, size: 3072, offset: 34624)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !238, line: 209, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 159, size: 3072, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !754, !755, !756, !757, !758, !759, !760, !761}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !724, file: !238, line: 161, baseType: !649, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !724, file: !238, line: 162, baseType: !677, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !724, file: !238, line: 164, baseType: !283, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !724, file: !238, line: 165, baseType: !283, size: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !724, file: !238, line: 166, baseType: !283, size: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !724, file: !238, line: 168, baseType: !283, size: 32, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !724, file: !238, line: 170, baseType: !283, size: 32, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !724, file: !238, line: 172, baseType: !283, size: 32, offset: 288)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !724, file: !238, line: 173, baseType: !283, size: 32, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !724, file: !238, line: 174, baseType: !283, size: 32, offset: 352)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !724, file: !238, line: 176, baseType: !283, size: 32, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_lsb", scope: !724, file: !238, line: 178, baseType: !283, size: 32, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !724, file: !238, line: 179, baseType: !283, size: 32, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !724, file: !238, line: 181, baseType: !483, size: 64, offset: 480)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !724, file: !238, line: 182, baseType: !283, size: 32, offset: 544)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !724, file: !238, line: 184, baseType: !283, size: 32, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !724, file: !238, line: 186, baseType: !283, size: 32, offset: 608)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !724, file: !238, line: 187, baseType: !283, size: 32, offset: 640)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !724, file: !238, line: 188, baseType: !283, size: 32, offset: 672)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !724, file: !238, line: 190, baseType: !283, size: 32, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !724, file: !238, line: 191, baseType: !283, size: 32, offset: 736)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !724, file: !238, line: 195, baseType: !748, size: 2048, offset: 768)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 2048, elements: !753)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !724, file: !238, line: 192, size: 64, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !749, file: !238, line: 193, baseType: !283, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !749, file: !238, line: 194, baseType: !283, size: 32, offset: 32)
!753 = !{!200, !366}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !724, file: !238, line: 197, baseType: !283, size: 32, offset: 2816)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !724, file: !238, line: 199, baseType: !283, size: 32, offset: 2848)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !724, file: !238, line: 200, baseType: !283, size: 32, offset: 2880)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !724, file: !238, line: 201, baseType: !283, size: 32, offset: 2912)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !724, file: !238, line: 202, baseType: !283, size: 32, offset: 2944)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !724, file: !238, line: 205, baseType: !283, size: 32, offset: 2976)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !724, file: !238, line: 206, baseType: !283, size: 32, offset: 3008)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !724, file: !238, line: 207, baseType: !283, size: 32, offset: 3040)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !383, file: !238, line: 315, baseType: !763, size: 4096, offset: 37760)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !764, line: 46, baseType: !765)
!764 = !DIFile(filename: "./common/cabac.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "fed287ee191b19e61654b41f7c57e583")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 27, size: 4096, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !765, file: !764, line: 30, baseType: !283, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !765, file: !764, line: 31, baseType: !283, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !765, file: !764, line: 34, baseType: !283, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !765, file: !764, line: 35, baseType: !283, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !765, file: !764, line: 37, baseType: !550, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !765, file: !764, line: 38, baseType: !550, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !765, file: !764, line: 39, baseType: !550, size: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !765, file: !764, line: 42, baseType: !283, size: 32, align: 128, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !765, file: !764, line: 45, baseType: !776, size: 3680, offset: 416)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 3680, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 460)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !383, file: !238, line: 340, baseType: !780, size: 31808, offset: 41856)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !238, line: 317, size: 31808, elements: !781)
!781 = !{!782, !912, !913, !917, !918, !920, !921, !922, !923, !924, !925, !926}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !780, file: !238, line: 320, baseType: !783, size: 4288)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 4288, elements: !358)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !786, line: 94, baseType: !787)
!786 = !DIFile(filename: "./common/frame.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/x264/src", checksumkind: CSK_MD5, checksum: "3ae200731644fdbac60ac7f8f3f9d2f1")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !786, line: 31, size: 51648, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !801, !802, !803, !804, !805, !806, !808, !810, !811, !813, !814, !815, !820, !827, !830, !833, !835, !836, !838, !839, !842, !843, !844, !846, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !883}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !787, file: !786, line: 34, baseType: !283, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !787, file: !786, line: 35, baseType: !283, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !787, file: !786, line: 36, baseType: !283, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !787, file: !786, line: 37, baseType: !311, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !787, file: !786, line: 38, baseType: !283, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !787, file: !786, line: 39, baseType: !283, size: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !787, file: !786, line: 40, baseType: !283, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !787, file: !786, line: 41, baseType: !284, size: 32, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !787, file: !786, line: 42, baseType: !284, size: 32, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !787, file: !786, line: 45, baseType: !283, size: 32, offset: 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !787, file: !786, line: 46, baseType: !800, size: 96, offset: 384)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 96, elements: !160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !787, file: !786, line: 47, baseType: !800, size: 96, offset: 480)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !787, file: !786, line: 48, baseType: !800, size: 96, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !787, file: !786, line: 49, baseType: !283, size: 32, offset: 672)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !787, file: !786, line: 50, baseType: !283, size: 32, offset: 704)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !787, file: !786, line: 51, baseType: !283, size: 32, offset: 736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !787, file: !786, line: 52, baseType: !807, size: 192, offset: 768)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 192, elements: !160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !787, file: !786, line: 53, baseType: !809, size: 256, offset: 960)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 256, elements: !685)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !787, file: !786, line: 54, baseType: !809, size: 256, offset: 1216)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !787, file: !786, line: 55, baseType: !812, size: 64, offset: 1472)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !787, file: !786, line: 59, baseType: !809, size: 256, offset: 1536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !787, file: !786, line: 60, baseType: !809, size: 256, offset: 1792)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !787, file: !786, line: 63, baseType: !816, size: 64, offset: 2048)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !312, line: 24, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !299, line: 37, baseType: !819)
!819 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !787, file: !786, line: 64, baseType: !821, size: 128, offset: 2112)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 128, elements: !199)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 32, elements: !199)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !312, line: 25, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !299, line: 39, baseType: !826)
!826 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !787, file: !786, line: 65, baseType: !828, size: 2176, offset: 2240)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 2176, elements: !829)
!829 = !{!200, !335}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !787, file: !786, line: 66, baseType: !831, size: 2176, offset: 4416)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 2176, elements: !829)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !787, file: !786, line: 67, baseType: !834, size: 128, offset: 6592)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 128, elements: !199)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !787, file: !786, line: 68, baseType: !483, size: 64, offset: 6720)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !787, file: !786, line: 69, baseType: !837, size: 1024, offset: 6784)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 1024, elements: !753)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !787, file: !786, line: 70, baseType: !694, size: 512, offset: 7808)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !787, file: !786, line: 75, baseType: !840, size: 10368, offset: 8320)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 10368, elements: !841)
!841 = !{!136, !136}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !787, file: !786, line: 76, baseType: !840, size: 10368, offset: 18688)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !787, file: !786, line: 77, baseType: !283, size: 32, offset: 29056)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !787, file: !786, line: 78, baseType: !845, size: 576, offset: 29088)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 576, elements: !135)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !787, file: !786, line: 79, baseType: !847, size: 20736, offset: 29696)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 20736, elements: !841)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !787, file: !786, line: 80, baseType: !832, size: 64, offset: 50432)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !787, file: !786, line: 81, baseType: !832, size: 64, offset: 50496)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_qp", scope: !787, file: !786, line: 82, baseType: !832, size: 64, offset: 50560)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !787, file: !786, line: 83, baseType: !852, size: 64, offset: 50624)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !787, file: !786, line: 84, baseType: !283, size: 32, offset: 50688)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !787, file: !786, line: 85, baseType: !812, size: 64, offset: 50752)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !787, file: !786, line: 86, baseType: !812, size: 64, offset: 50816)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !787, file: !786, line: 89, baseType: !283, size: 32, offset: 50880)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !787, file: !786, line: 90, baseType: !283, size: 32, offset: 50912)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !787, file: !786, line: 91, baseType: !859, size: 320, offset: 50944)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !534, line: 72, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !534, line: 67, size: 320, elements: !861)
!861 = !{!862, !881, !882}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !860, file: !534, line: 69, baseType: !863, size: 320)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !864, line: 22, size: 320, elements: !865)
!864 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !863, file: !864, line: 24, baseType: !283, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !863, file: !864, line: 25, baseType: !239, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !863, file: !864, line: 26, baseType: !283, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !863, file: !864, line: 28, baseType: !239, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !863, file: !864, line: 32, baseType: !283, size: 32, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !863, file: !864, line: 34, baseType: !826, size: 16, offset: 160)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !863, file: !864, line: 35, baseType: !826, size: 16, offset: 176)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !863, file: !864, line: 36, baseType: !874, size: 128, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !875, line: 55, baseType: !876)
!875 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !875, line: 51, size: 128, elements: !877)
!877 = !{!878, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !876, file: !875, line: 53, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !876, file: !875, line: 54, baseType: !879, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !860, file: !534, line: 70, baseType: !29, size: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !860, file: !534, line: 71, baseType: !314, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !787, file: !786, line: 92, baseType: !884, size: 384, offset: 51264)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !534, line: 80, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !534, line: 75, size: 384, elements: !886)
!886 = !{!887, !909, !910}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !885, file: !534, line: 77, baseType: !888, size: 384)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !875, line: 94, size: 384, elements: !889)
!889 = !{!890, !902, !903, !905, !906, !907, !908}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !888, file: !875, line: 96, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !892, line: 33, baseType: !893)
!892 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!893 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !892, line: 25, size: 64, elements: !894)
!894 = !{!895, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !893, file: !892, line: 27, baseType: !896, size: 64)
!896 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !893, file: !892, line: 32, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !893, file: !892, line: 28, size: 64, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !898, file: !892, line: 30, baseType: !239, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !898, file: !892, line: 31, baseType: !239, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !888, file: !875, line: 97, baseType: !891, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !888, file: !875, line: 98, baseType: !904, size: 64, offset: 128)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 64, elements: !199)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !888, file: !875, line: 99, baseType: !904, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !888, file: !875, line: 100, baseType: !239, size: 32, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !888, file: !875, line: 101, baseType: !239, size: 32, offset: 288)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !888, file: !875, line: 102, baseType: !904, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !885, file: !534, line: 78, baseType: !9, size: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !885, file: !534, line: 79, baseType: !911, size: 64)
!911 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !780, file: !238, line: 322, baseType: !783, size: 4288, offset: 4288)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !780, file: !238, line: 324, baseType: !914, size: 21760, offset: 8576)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 21760, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 340)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "last_nonb", scope: !780, file: !238, line: 326, baseType: !784, size: 64, offset: 30336)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !780, file: !238, line: 329, baseType: !919, size: 1152, offset: 30400)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 1152, elements: !135)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_idr", scope: !780, file: !238, line: 331, baseType: !283, size: 32, offset: 31552)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !780, file: !238, line: 333, baseType: !283, size: 32, offset: 31584)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !780, file: !238, line: 335, baseType: !283, size: 32, offset: 31616)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !780, file: !238, line: 336, baseType: !283, size: 32, offset: 31648)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !780, file: !238, line: 337, baseType: !283, size: 32, offset: 31680)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !780, file: !238, line: 338, baseType: !283, size: 32, offset: 31712)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !780, file: !238, line: 339, baseType: !283, size: 32, offset: 31744)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !383, file: !238, line: 343, baseType: !784, size: 64, offset: 73664)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !383, file: !238, line: 346, baseType: !784, size: 64, offset: 73728)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !383, file: !238, line: 349, baseType: !283, size: 32, offset: 73792)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !383, file: !238, line: 350, baseType: !931, size: 1216, offset: 73856)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 1216, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 19)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !383, file: !238, line: 351, baseType: !283, size: 32, offset: 75072)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !383, file: !238, line: 352, baseType: !931, size: 1216, offset: 75136)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !383, file: !238, line: 353, baseType: !483, size: 64, offset: 76352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !383, file: !238, line: 365, baseType: !938, size: 10624, offset: 76416)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !238, line: 358, size: 10624, elements: !939)
!939 = !{!940, !942, !945, !948}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !938, file: !238, line: 360, baseType: !941, size: 256, align: 128)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 256, elements: !365)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !938, file: !238, line: 361, baseType: !943, size: 128, align: 128, offset: 256)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 128, elements: !944)
!944 = !{!200, !684}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !938, file: !238, line: 363, baseType: !946, size: 4096, align: 128, offset: 384)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 4096, elements: !947)
!947 = !{!684, !440}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !938, file: !238, line: 364, baseType: !949, size: 6144, align: 128, offset: 4480)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 6144, elements: !950)
!950 = !{!43, !366}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !383, file: !238, line: 544, baseType: !952, size: 80128, offset: 87040)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !238, line: 368, size: 80128, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !980, !982, !983, !984, !985, !986, !987, !988, !989, !990, !992, !995, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1011, !1013, !1014, !1015, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1064, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1095, !1098, !1100}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !952, file: !238, line: 370, baseType: !283, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !952, file: !238, line: 373, baseType: !283, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !952, file: !238, line: 374, baseType: !283, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !952, file: !238, line: 375, baseType: !283, size: 32, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !952, file: !238, line: 378, baseType: !283, size: 32, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !952, file: !238, line: 379, baseType: !283, size: 32, offset: 160)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !952, file: !238, line: 380, baseType: !283, size: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !952, file: !238, line: 381, baseType: !283, size: 32, offset: 224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !952, file: !238, line: 382, baseType: !283, size: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !952, file: !238, line: 385, baseType: !283, size: 32, offset: 288)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !952, file: !238, line: 386, baseType: !283, size: 32, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !952, file: !238, line: 387, baseType: !283, size: 32, offset: 352)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !952, file: !238, line: 388, baseType: !283, size: 32, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !952, file: !238, line: 389, baseType: !283, size: 32, offset: 416)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !952, file: !238, line: 390, baseType: !283, size: 32, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !952, file: !238, line: 391, baseType: !283, size: 32, offset: 480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !952, file: !238, line: 393, baseType: !283, size: 32, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !952, file: !238, line: 396, baseType: !483, size: 64, offset: 544)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !952, file: !238, line: 397, baseType: !483, size: 64, offset: 608)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !952, file: !238, line: 400, baseType: !483, size: 64, offset: 672)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !952, file: !238, line: 401, baseType: !483, size: 64, offset: 736)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !952, file: !238, line: 403, baseType: !483, size: 64, offset: 800)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !952, file: !238, line: 404, baseType: !483, size: 64, offset: 864)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !952, file: !238, line: 407, baseType: !239, size: 32, offset: 928)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !952, file: !238, line: 408, baseType: !979, size: 128, offset: 960)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 128, elements: !685)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !952, file: !238, line: 409, baseType: !981, size: 512, offset: 1088)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 512, elements: !365)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !952, file: !238, line: 410, baseType: !283, size: 32, offset: 1600)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !952, file: !238, line: 411, baseType: !283, size: 32, offset: 1632)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !952, file: !238, line: 412, baseType: !283, size: 32, offset: 1664)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !952, file: !238, line: 413, baseType: !283, size: 32, offset: 1696)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !952, file: !238, line: 414, baseType: !283, size: 32, offset: 1728)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !952, file: !238, line: 415, baseType: !283, size: 32, offset: 1760)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !952, file: !238, line: 422, baseType: !816, size: 64, offset: 1792)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !952, file: !238, line: 423, baseType: !816, size: 64, offset: 1856)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !952, file: !238, line: 424, baseType: !991, size: 64, offset: 1920)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !952, file: !238, line: 425, baseType: !993, size: 64, offset: 1984)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 64, elements: !93)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !952, file: !238, line: 427, baseType: !996, size: 64, offset: 2048)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 192, elements: !42)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !952, file: !238, line: 428, baseType: !816, size: 64, offset: 2112)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !952, file: !238, line: 429, baseType: !821, size: 128, offset: 2176)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !952, file: !238, line: 430, baseType: !821, size: 128, offset: 2304)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !952, file: !238, line: 431, baseType: !834, size: 128, offset: 2432)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !952, file: !238, line: 432, baseType: !1003, size: 4096, offset: 2560)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 4096, elements: !1004)
!1004 = !{!200, !1005}
!1005 = !DISubrange(count: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !952, file: !238, line: 433, baseType: !816, size: 64, offset: 6656)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !952, file: !238, line: 434, baseType: !816, size: 64, offset: 6720)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "intra_border_backup", scope: !952, file: !238, line: 435, baseType: !1009, size: 384, offset: 6784)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 384, elements: !1010)
!1010 = !{!200, !161}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "nnz_backup", scope: !952, file: !238, line: 436, baseType: !1012, size: 64, offset: 7168)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !952, file: !238, line: 439, baseType: !283, size: 32, offset: 7232)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !952, file: !238, line: 440, baseType: !283, size: 32, offset: 7264)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !952, file: !238, line: 441, baseType: !1016, size: 128, offset: 7296)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 128, elements: !685)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !952, file: !238, line: 442, baseType: !283, size: 32, offset: 7424)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !952, file: !238, line: 444, baseType: !283, size: 32, offset: 7456)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !952, file: !238, line: 445, baseType: !283, size: 32, offset: 7488)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !952, file: !238, line: 447, baseType: !283, size: 32, offset: 7520)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !952, file: !238, line: 448, baseType: !283, size: 32, offset: 7552)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !952, file: !238, line: 454, baseType: !283, size: 32, offset: 7584)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !952, file: !238, line: 457, baseType: !283, size: 32, offset: 7616)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !952, file: !238, line: 498, baseType: !1025, size: 57344, offset: 7680)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !952, file: !238, line: 459, size: 57344, elements: !1026)
!1026 = !{!1027, !1031, !1035, !1037, !1038, !1041, !1044, !1045, !1048, !1049, !1050, !1053, !1054, !1055, !1056, !1057, !1058, !1061, !1063}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !1025, file: !238, line: 464, baseType: !1028, size: 3072, align: 128)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 3072, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !1025, file: !238, line: 465, baseType: !1032, size: 6912, align: 128, offset: 3072)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 6912, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 864)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !1025, file: !238, line: 468, baseType: !1036, size: 2048, align: 128, offset: 9984)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 2048, elements: !597)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !1025, file: !238, line: 469, baseType: !1036, size: 2048, align: 128, offset: 12032)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !1025, file: !238, line: 470, baseType: !1039, size: 3072, align: 128, offset: 14080)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 3072, elements: !1040)
!1040 = !{!161, !440}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !1025, file: !238, line: 471, baseType: !1042, size: 3840, align: 128, offset: 17152)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 3840, elements: !1043)
!1043 = !{!325, !366}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !1025, file: !238, line: 474, baseType: !946, size: 4096, align: 128, offset: 20992)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !1025, file: !238, line: 475, baseType: !1046, size: 4096, align: 128, offset: 25088)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 4096, elements: !1047)
!1047 = !{!366, !366}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd", scope: !1025, file: !238, line: 478, baseType: !682, size: 512, offset: 29184)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_sum", scope: !1025, file: !238, line: 479, baseType: !283, size: 32, offset: 29696)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d", scope: !1025, file: !238, line: 480, baseType: !1051, size: 128, offset: 29728)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 128, elements: !1052)
!1052 = !{!200, !200}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_sa8d_sum", scope: !1025, file: !238, line: 481, baseType: !283, size: 32, offset: 29856)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !1025, file: !238, line: 484, baseType: !807, size: 192, offset: 29888)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !1025, file: !238, line: 486, baseType: !807, size: 192, offset: 30080)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !1025, file: !238, line: 489, baseType: !807, size: 192, offset: 30272)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !1025, file: !238, line: 492, baseType: !483, size: 64, offset: 30464)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !1025, file: !238, line: 493, baseType: !1059, size: 24576, offset: 30528)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 24576, elements: !1060)
!1060 = !{!200, !1005, !126}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !1025, file: !238, line: 494, baseType: !1062, size: 2048, offset: 55104)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 2048, elements: !753)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !1025, file: !238, line: 497, baseType: !800, size: 96, offset: 57152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !952, file: !238, line: 526, baseType: !1065, size: 12032, offset: 65024)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !952, file: !238, line: 501, size: 12032, elements: !1066)
!1066 = !{!1067, !1069, !1071, !1074, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !1065, file: !238, line: 504, baseType: !1068, size: 384)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 384, elements: !10)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !1065, file: !238, line: 507, baseType: !1070, size: 384, offset: 384)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 384, elements: !10)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1065, file: !238, line: 510, baseType: !1072, size: 768, align: 32, offset: 768)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 768, elements: !1073)
!1073 = !{!200, !11}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !1065, file: !238, line: 513, baseType: !1075, size: 3072, align: 128, offset: 1536)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 3072, elements: !1076)
!1076 = !{!200, !11, !200}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !1065, file: !238, line: 514, baseType: !1075, size: 3072, align: 64, offset: 4608)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !1065, file: !238, line: 517, baseType: !1068, size: 384, align: 32, offset: 7680)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mv", scope: !1065, file: !238, line: 519, baseType: !1075, size: 3072, align: 128, offset: 8064)
