; ModuleID = 'tools/mount.cpp'
source_filename = "tools/mount.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }

$_Z13hasCorrectUIDPKc = comdat any

$_Z6hasUIDPKc = comdat any

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [47 x i8] c"Usage: %s <-b|-r> <source path> <target path>\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [24 x i8] c"       %s -u <target>.\0A\00", align 1, !dbg !8
@.str.2 = private unnamed_addr constant [48 x i8] c"       -b bind and mount the source to target.\0A\00", align 1, !dbg !13
@.str.3 = private unnamed_addr constant [60 x i8] c"       -r bind and mount the source to target as readonly.\0A\00", align 1, !dbg !18
@.str.4 = private unnamed_addr constant [34 x i8] c"       -u to unmount the target.\0A\00", align 1, !dbg !23
@.str.5 = private unnamed_addr constant [10 x i8] c"coolmount\00", align 1, !dbg !28
@.str.6 = private unnamed_addr constant [11 x i8] c"Aborting.\0A\00", align 1, !dbg !33
@.str.7 = private unnamed_addr constant [3 x i8] c"-u\00", align 1, !dbg !38

!119 = !DIEnumerator(name: "MS_UNBINDABLE", value: 131072)
!120 = !DIEnumerator(name: "MS_PRIVATE", value: 262144)
!121 = !DIEnumerator(name: "MS_SLAVE", value: 524288)
!122 = !DIEnumerator(name: "MS_SHARED", value: 1048576)
!123 = !DIEnumerator(name: "MS_RELATIME", value: 2097152)
!124 = !DIEnumerator(name: "MS_KERNMOUNT", value: 4194304)
!125 = !DIEnumerator(name: "MS_I_VERSION", value: 8388608)
!126 = !DIEnumerator(name: "MS_STRICTATIME", value: 16777216)
!127 = !DIEnumerator(name: "MS_LAZYTIME", value: 33554432)
!128 = !DIEnumerator(name: "MS_ACTIVE", value: 1073741824)
!129 = !DIEnumerator(name: "MS_NOUSER", value: -2147483648)
!130 = !{!0, !8, !13, !18, !23, !28, !33, !38, !43, !48, !50, !55, !60, !62, !67, !69, !74, !79, !85}
!131 = !{i32 7, !"Dwarf Version", i32 5}
!132 = !{i32 2, !"Debug Info Version", i32 3}
!133 = !{i32 1, !"wchar_size", i32 4}
!134 = !{i32 8, !"PIC Level", i32 2}
!135 = !{i32 7, !"PIE Level", i32 2}
!136 = !{i32 7, !"uwtable", i32 2}
!137 = !{i32 7, !"frame-pointer", i32 2}
!138 = !{!"clang version 16.0.0"}
!139 = distinct !DISubprogram(name: "usage", linkageName: "_Z5usagePKc", scope: !2, file: !2, line: 131, type: !140, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !90, retainedNodes: !143)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!143 = !{}
!144 = !DILocalVariable(name: "program", arg: 1, scope: !139, file: !2, line: 131, type: !142)
!145 = !DILocation(line: 131, column: 24, scope: !139)
!146 = !DILocation(line: 133, column: 13, scope: !139)
!147 = !DILocation(line: 133, column: 72, scope: !139)
!148 = !DILocation(line: 133, column: 5, scope: !139)
!149 = !DILocation(line: 134, column: 13, scope: !139)
!150 = !DILocation(line: 134, column: 49, scope: !139)
!151 = !DILocation(line: 134, column: 5, scope: !139)
!152 = !DILocation(line: 135, column: 13, scope: !139)
!153 = !DILocation(line: 135, column: 5, scope: !139)
!154 = !DILocation(line: 136, column: 13, scope: !139)
!155 = !DILocation(line: 136, column: 5, scope: !139)
!156 = !DILocation(line: 137, column: 13, scope: !139)
!157 = !DILocation(line: 137, column: 5, scope: !139)
!158 = !DILocation(line: 138, column: 1, scope: !139)
!159 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 140, type: !160, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !90, retainedNodes: !143)
!160 = !DISubroutineType(types: !161)
!161 = !{!101, !101, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!164 = !DILocalVariable(name: "argc", arg: 1, scope: !159, file: !2, line: 140, type: !101)
!165 = !DILocation(line: 140, column: 14, scope: !159)
!166 = !DILocalVariable(name: "argv", arg: 2, scope: !159, file: !2, line: 140, type: !162)
!167 = !DILocation(line: 140, column: 27, scope: !159)
!168 = !DILocation(line: 142, column: 10, scope: !169)
!169 = distinct !DILexicalBlock(scope: !159, file: !2, line: 142, column: 9)
!170 = !DILocation(line: 142, column: 9, scope: !159)
!171 = !DILocation(line: 144, column: 17, scope: !172)
!172 = distinct !DILexicalBlock(scope: !169, file: !2, line: 143, column: 5)
!173 = !DILocation(line: 144, column: 9, scope: !172)
!174 = !DILocation(line: 145, column: 9, scope: !172)
!175 = !DILocalVariable(name: "program", scope: !159, file: !2, line: 148, type: !142)
!176 = !DILocation(line: 148, column: 17, scope: !159)
!177 = !DILocation(line: 148, column: 27, scope: !159)
!178 = !DILocation(line: 149, column: 9, scope: !179)
!179 = distinct !DILexicalBlock(scope: !159, file: !2, line: 149, column: 9)
!180 = !DILocation(line: 149, column: 14, scope: !179)
!181 = !DILocation(line: 149, column: 9, scope: !159)
!182 = !DILocation(line: 151, column: 15, scope: !183)
!183 = distinct !DILexicalBlock(scope: !179, file: !2, line: 150, column: 5)
!184 = !DILocation(line: 151, column: 9, scope: !183)
!185 = !DILocation(line: 152, column: 9, scope: !183)
!186 = !DILocalVariable(name: "option", scope: !159, file: !2, line: 155, type: !142)
!187 = !DILocation(line: 155, column: 17, scope: !159)
!188 = !DILocation(line: 155, column: 26, scope: !159)
!189 = !DILocation(line: 156, column: 9, scope: !190)
!190 = distinct !DILexicalBlock(scope: !159, file: !2, line: 156, column: 9)
!191 = !DILocation(line: 156, column: 14, scope: !190)
!192 = !DILocation(line: 156, column: 19, scope: !190)
!193 = !DILocation(line: 156, column: 29, scope: !190)
!194 = !DILocation(line: 156, column: 22, scope: !190)
!195 = !DILocation(line: 156, column: 43, scope: !190)
!196 = !DILocation(line: 156, column: 9, scope: !159)
!197 = !DILocalVariable(name: "target", scope: !198, file: !2, line: 158, type: !142)
!198 = distinct !DILexicalBlock(scope: !190, file: !2, line: 157, column: 5)
!199 = !DILocation(line: 158, column: 21, scope: !198)
!200 = !DILocation(line: 158, column: 30, scope: !198)
!201 = !DILocalVariable(name: "sb", scope: !198, file: !2, line: 160, type: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !203, line: 26, size: 1152, flags: DIFlagTypePassByValue, elements: !204, identifier: "_ZTS4stat")
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!204 = !{!205, !209, !211, !213, !215, !217, !219, !220, !221, !224, !226, !228, !236, !237, !238}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !202, file: !203, line: 31, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !207, line: 145, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!208 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !202, file: !203, line: 36, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !207, line: 148, baseType: !208)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !202, file: !203, line: 44, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !207, line: 151, baseType: !208)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !202, file: !203, line: 45, baseType: !214, size: 32, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !207, line: 150, baseType: !94)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !202, file: !203, line: 47, baseType: !216, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !207, line: 146, baseType: !94)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !202, file: !203, line: 48, baseType: !218, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !207, line: 147, baseType: !94)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !202, file: !203, line: 50, baseType: !101, size: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !202, file: !203, line: 52, baseType: !206, size: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !202, file: !203, line: 57, baseType: !222, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !207, line: 152, baseType: !223)
!223 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !202, file: !203, line: 61, baseType: !225, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !207, line: 175, baseType: !223)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !202, file: !203, line: 63, baseType: !227, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !207, line: 180, baseType: !223)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !202, file: !203, line: 74, baseType: !229, size: 128, offset: 576)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !230, line: 11, size: 128, flags: DIFlagTypePassByValue, elements: !231, identifier: "_ZTS8timespec")
!230 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !229, file: !230, line: 16, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !207, line: 160, baseType: !223)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !229, file: !230, line: 21, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !207, line: 197, baseType: !223)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !202, file: !203, line: 75, baseType: !229, size: 128, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !202, file: !203, line: 76, baseType: !229, size: 128, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !202, file: !203, line: 89, baseType: !239, size: 192, offset: 960)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 192, elements: !41)
!240 = !DILocation(line: 160, column: 21, scope: !198)
!241 = !DILocalVariable(name: "target_exists", scope: !198, file: !2, line: 161, type: !242)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!244 = !DILocation(line: 161, column: 20, scope: !198)
!245 = !DILocation(line: 161, column: 42, scope: !198)
!246 = !DILocation(line: 161, column: 37, scope: !198)
!247 = !DILocation(line: 161, column: 55, scope: !198)
!248 = !DILocation(line: 161, column: 60, scope: !198)
!249 = !DILocation(line: 161, column: 63, scope: !198)
!250 = !DILocation(line: 0, scope: !198)
!251 = !DILocation(line: 164, column: 13, scope: !252)
!252 = distinct !DILexicalBlock(scope: !198, file: !2, line: 164, column: 13)
!253 = !DILocation(line: 164, column: 13, scope: !198)
!254 = !DILocalVariable(name: "retval", scope: !255, file: !2, line: 167, type: !101)
!255 = distinct !DILexicalBlock(scope: !252, file: !2, line: 165, column: 9)
!256 = !DILocation(line: 167, column: 17, scope: !255)
!257 = !DILocation(line: 167, column: 34, scope: !255)
!258 = !DILocation(line: 167, column: 26, scope: !255)
!259 = !DILocation(line: 168, column: 17, scope: !260)
!260 = distinct !DILexicalBlock(scope: !255, file: !2, line: 168, column: 17)
!261 = !DILocation(line: 168, column: 24, scope: !260)
!262 = !DILocation(line: 168, column: 17, scope: !255)
!263 = !DILocation(line: 170, column: 21, scope: !264)
!264 = distinct !DILexicalBlock(scope: !265, file: !2, line: 170, column: 21)
!265 = distinct !DILexicalBlock(scope: !260, file: !2, line: 169, column: 13)
!266 = !DILocation(line: 170, column: 27, scope: !264)
!267 = !DILocation(line: 170, column: 21, scope: !265)
!268 = !DILocation(line: 171, column: 29, scope: !264)
!269 = !DILocation(line: 171, column: 81, scope: !264)
!270 = !DILocation(line: 171, column: 90, scope: !264)
!271 = !DILocation(line: 172, column: 38, scope: !264)
!272 = !DILocation(line: 172, column: 29, scope: !264)
!273 = !DILocation(line: 171, column: 21, scope: !264)
!274 = !DILocation(line: 173, column: 13, scope: !265)
!275 = !DILocation(line: 176, column: 30, scope: !255)
!276 = !DILocation(line: 176, column: 22, scope: !255)
!277 = !DILocation(line: 176, column: 20, scope: !255)
!278 = !DILocation(line: 177, column: 17, scope: !279)
!279 = distinct !DILexicalBlock(scope: !255, file: !2, line: 177, column: 17)
!280 = !DILocation(line: 177, column: 24, scope: !279)
!281 = !DILocation(line: 177, column: 27, scope: !279)
!282 = !DILocation(line: 177, column: 33, scope: !279)
!283 = !DILocation(line: 177, column: 17, scope: !255)
!284 = !DILocation(line: 179, column: 25, scope: !285)
!285 = distinct !DILexicalBlock(scope: !279, file: !2, line: 178, column: 13)
!286 = !DILocation(line: 179, column: 77, scope: !285)
!287 = !DILocation(line: 179, column: 86, scope: !285)
!288 = !DILocation(line: 180, column: 34, scope: !285)
!289 = !DILocation(line: 180, column: 25, scope: !285)
!290 = !DILocation(line: 179, column: 17, scope: !285)
!291 = !DILocation(line: 181, column: 17, scope: !285)
!292 = !DILocation(line: 183, column: 9, scope: !255)
!293 = !DILocation(line: 184, column: 5, scope: !198)
!294 = !DILocation(line: 185, column: 14, scope: !295)
!295 = distinct !DILexicalBlock(scope: !190, file: !2, line: 185, column: 14)
!296 = !DILocation(line: 185, column: 19, scope: !295)
!297 = !DILocation(line: 185, column: 14, scope: !190)
!298 = !DILocalVariable(name: "source", scope: !299, file: !2, line: 187, type: !142)
!299 = distinct !DILexicalBlock(scope: !295, file: !2, line: 186, column: 5)
!300 = !DILocation(line: 187, column: 21, scope: !299)
!301 = !DILocation(line: 187, column: 30, scope: !299)
!302 = !DILocalVariable(name: "sb", scope: !299, file: !2, line: 188, type: !202)
!303 = !DILocation(line: 188, column: 21, scope: !299)
!304 = !DILocation(line: 189, column: 18, scope: !305)
!305 = distinct !DILexicalBlock(scope: !299, file: !2, line: 189, column: 13)
!306 = !DILocation(line: 189, column: 13, scope: !305)
!307 = !DILocation(line: 189, column: 31, scope: !305)
!308 = !DILocation(line: 189, column: 36, scope: !305)
!309 = !DILocation(line: 189, column: 40, scope: !305)
!310 = !DILocation(line: 189, column: 13, scope: !299)
!311 = !DILocation(line: 191, column: 21, scope: !312)
!312 = distinct !DILexicalBlock(scope: !305, file: !2, line: 190, column: 9)
!313 = !DILocation(line: 191, column: 87, scope: !312)
!314 = !DILocation(line: 192, column: 21, scope: !312)
!315 = !DILocation(line: 191, column: 13, scope: !312)
!316 = !DILocation(line: 193, column: 13, scope: !312)
!317 = !DILocalVariable(name: "target", scope: !299, file: !2, line: 196, type: !142)
!318 = !DILocation(line: 196, column: 21, scope: !299)
!319 = !DILocation(line: 196, column: 30, scope: !299)
!320 = !DILocalVariable(name: "target_exists", scope: !299, file: !2, line: 197, type: !242)
!321 = !DILocation(line: 197, column: 20, scope: !299)
!322 = !DILocation(line: 197, column: 42, scope: !299)
!323 = !DILocation(line: 197, column: 37, scope: !299)
!324 = !DILocation(line: 197, column: 55, scope: !299)
!325 = !DILocation(line: 197, column: 60, scope: !299)
!326 = !DILocation(line: 197, column: 63, scope: !299)
!327 = !DILocation(line: 0, scope: !299)
!328 = !DILocation(line: 198, column: 14, scope: !329)
!329 = distinct !DILexicalBlock(scope: !299, file: !2, line: 198, column: 13)
!330 = !DILocation(line: 198, column: 13, scope: !299)
!331 = !DILocation(line: 200, column: 21, scope: !332)
!332 = distinct !DILexicalBlock(scope: !329, file: !2, line: 199, column: 9)
!333 = !DILocation(line: 200, column: 85, scope: !332)
!334 = !DILocation(line: 201, column: 21, scope: !332)
!335 = !DILocation(line: 200, column: 13, scope: !332)
!336 = !DILocation(line: 202, column: 13, scope: !332)
!337 = !DILocation(line: 208, column: 20, scope: !338)
!338 = distinct !DILexicalBlock(scope: !299, file: !2, line: 208, column: 13)
!339 = !DILocation(line: 208, column: 13, scope: !338)
!340 = !DILocation(line: 208, column: 34, scope: !338)
!341 = !DILocation(line: 208, column: 13, scope: !299)
!342 = !DILocalVariable(name: "retval", scope: !343, file: !2, line: 210, type: !344)
!343 = distinct !DILexicalBlock(scope: !338, file: !2, line: 209, column: 9)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!345 = !DILocation(line: 210, column: 23, scope: !343)
!346 = !DILocation(line: 211, column: 25, scope: !343)
!347 = !DILocation(line: 211, column: 33, scope: !343)
!348 = !DILocation(line: 211, column: 19, scope: !343)
!349 = !DILocation(line: 212, column: 17, scope: !350)
!350 = distinct !DILexicalBlock(scope: !343, file: !2, line: 212, column: 17)
!351 = !DILocation(line: 212, column: 17, scope: !343)
!352 = !DILocation(line: 214, column: 25, scope: !353)
!353 = distinct !DILexicalBlock(scope: !350, file: !2, line: 213, column: 13)
!354 = !DILocation(line: 214, column: 81, scope: !353)
!355 = !DILocation(line: 214, column: 90, scope: !353)
!356 = !DILocation(line: 215, column: 25, scope: !353)
!357 = !DILocation(line: 215, column: 42, scope: !353)
!358 = !DILocation(line: 215, column: 33, scope: !353)
!359 = !DILocation(line: 214, column: 17, scope: !353)
!360 = !DILocation(line: 216, column: 17, scope: !353)
!361 = !DILocation(line: 218, column: 9, scope: !343)
!362 = !DILocation(line: 219, column: 25, scope: !363)
!363 = distinct !DILexicalBlock(scope: !338, file: !2, line: 219, column: 18)
!364 = !DILocation(line: 219, column: 18, scope: !363)
!365 = !DILocation(line: 219, column: 39, scope: !363)
!366 = !DILocation(line: 219, column: 18, scope: !338)
!367 = !DILocalVariable(name: "retval", scope: !368, file: !2, line: 222, type: !101)
!368 = distinct !DILexicalBlock(scope: !363, file: !2, line: 220, column: 9)
!369 = !DILocation(line: 222, column: 17, scope: !368)
!370 = !DILocation(line: 222, column: 32, scope: !368)
!371 = !DILocation(line: 222, column: 40, scope: !368)
!372 = !DILocation(line: 222, column: 26, scope: !368)
!373 = !DILocation(line: 226, column: 17, scope: !374)
!374 = distinct !DILexicalBlock(scope: !368, file: !2, line: 226, column: 17)
!375 = !DILocation(line: 226, column: 17, scope: !368)
!376 = !DILocation(line: 228, column: 25, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !2, line: 227, column: 13)
!378 = !DILocation(line: 228, column: 82, scope: !377)
!379 = !DILocation(line: 228, column: 91, scope: !377)
!380 = !DILocation(line: 229, column: 34, scope: !377)
!381 = !DILocation(line: 229, column: 25, scope: !377)
!382 = !DILocation(line: 228, column: 17, scope: !377)
!383 = !DILocation(line: 230, column: 17, scope: !377)
!384 = !DILocation(line: 233, column: 28, scope: !368)
!385 = !DILocation(line: 233, column: 36, scope: !368)
!386 = !DILocation(line: 233, column: 22, scope: !368)
!387 = !DILocation(line: 233, column: 20, scope: !368)
!388 = !DILocation(line: 234, column: 17, scope: !389)
!389 = distinct !DILexicalBlock(scope: !368, file: !2, line: 234, column: 17)
!390 = !DILocation(line: 234, column: 17, scope: !368)
!391 = !DILocation(line: 236, column: 25, scope: !392)
!392 = distinct !DILexicalBlock(scope: !389, file: !2, line: 235, column: 13)
!393 = !DILocation(line: 236, column: 78, scope: !392)
!394 = !DILocation(line: 236, column: 87, scope: !392)
!395 = !DILocation(line: 237, column: 34, scope: !392)
!396 = !DILocation(line: 237, column: 25, scope: !392)
!397 = !DILocation(line: 236, column: 17, scope: !392)
!398 = !DILocation(line: 238, column: 17, scope: !392)
!399 = !DILocation(line: 240, column: 9, scope: !368)
!400 = !DILocation(line: 241, column: 5, scope: !299)
!401 = !DILocation(line: 244, column: 15, scope: !402)
!402 = distinct !DILexicalBlock(scope: !295, file: !2, line: 243, column: 5)
!403 = !DILocation(line: 244, column: 9, scope: !402)
!404 = !DILocation(line: 245, column: 9, scope: !402)
!405 = !DILocation(line: 248, column: 12, scope: !159)
!406 = !DILocation(line: 248, column: 5, scope: !159)
!407 = !DILocation(line: 249, column: 5, scope: !159)
!408 = !DILocation(line: 250, column: 1, scope: !159)
!409 = distinct !DISubprogram(name: "hasCorrectUID", linkageName: "_Z13hasCorrectUIDPKc", scope: !81, file: !81, line: 62, type: !410, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !90, retainedNodes: !143)
!410 = !DISubroutineType(types: !411)
!411 = !{!101, !142}
!412 = !DILocalVariable(name: "appName", arg: 1, scope: !409, file: !81, line: 62, type: !142)
!413 = !DILocation(line: 62, column: 38, scope: !409)
!414 = !DILocation(line: 68, column: 9, scope: !415)
!415 = distinct !DILexicalBlock(scope: !409, file: !81, line: 68, column: 9)
!416 = !DILocation(line: 68, column: 9, scope: !409)
!417 = !DILocation(line: 69, column: 9, scope: !415)
!418 = !DILocation(line: 71, column: 17, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !81, line: 70, column: 10)
!420 = !DILocation(line: 71, column: 94, scope: !419)
!421 = !DILocation(line: 71, column: 9, scope: !419)
!422 = !DILocation(line: 72, column: 9, scope: !419)
!423 = !DILocation(line: 75, column: 1, scope: !409)
!424 = distinct !DISubprogram(name: "hasUID", linkageName: "_Z6hasUIDPKc", scope: !81, file: !81, line: 28, type: !410, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !90, retainedNodes: !143)
!425 = !DILocalVariable(name: "userId", arg: 1, scope: !424, file: !81, line: 28, type: !142)
!426 = !DILocation(line: 28, column: 31, scope: !424)
!427 = !DILocalVariable(name: "pw", scope: !424, file: !81, line: 30, type: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !430, line: 49, size: 384, flags: DIFlagTypePassByValue, elements: !431, identifier: "_ZTS6passwd")
!430 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!431 = !{!432, !433, !434, !435, !436, !437, !438}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !429, file: !430, line: 51, baseType: !163, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !429, file: !430, line: 52, baseType: !163, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !429, file: !430, line: 54, baseType: !216, size: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !429, file: !430, line: 55, baseType: !218, size: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !429, file: !430, line: 56, baseType: !163, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !429, file: !430, line: 57, baseType: !163, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !429, file: !430, line: 58, baseType: !163, size: 64, offset: 320)
!439 = !DILocation(line: 30, column: 20, scope: !424)
!440 = !DILocation(line: 30, column: 34, scope: !424)
!441 = !DILocation(line: 30, column: 25, scope: !424)
!442 = !DILocation(line: 31, column: 9, scope: !443)
!443 = distinct !DILexicalBlock(scope: !424, file: !81, line: 31, column: 9)
!444 = !DILocation(line: 31, column: 12, scope: !443)
!445 = !DILocation(line: 31, column: 15, scope: !443)
!446 = !DILocation(line: 31, column: 19, scope: !443)
!447 = !DILocation(line: 31, column: 27, scope: !443)
!448 = !DILocation(line: 31, column: 38, scope: !443)
!449 = !DILocation(line: 31, column: 42, scope: !443)
!450 = !DILocation(line: 31, column: 51, scope: !443)
!451 = !DILocation(line: 31, column: 31, scope: !443)
!452 = !DILocation(line: 31, column: 9, scope: !424)
!453 = !DILocation(line: 32, column: 9, scope: !443)
!454 = !DILocation(line: 34, column: 5, scope: !424)
!455 = !DILocation(line: 35, column: 1, scope: !424)
