; ModuleID = '/home/raj/coturn/src/client/ns_turn_msg_addr.c'
source_filename = "/home/raj/coturn/src/client/ns_turn_msg_addr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @stun_addr_encode(ptr noundef %0, ptr noundef %1, ptr noundef %2, i32 noundef %3, i32 noundef %4, ptr noundef %5) #0 !dbg !31 {
  %7 = alloca i32, align 4
  %8 = alloca ptr, align 8
  %9 = alloca ptr, align 8
  %10 = alloca ptr, align 8
  %11 = alloca i32, align 4
  %12 = alloca i32, align 4
  %13 = alloca ptr, align 8
  %14 = alloca i32, align 4
  %15 = alloca ptr, align 8
  %16 = alloca ptr, align 8
  %17 = alloca i32, align 4
  store ptr %0, ptr %8, align 8
  call void @llvm.dbg.declare(metadata ptr %8, metadata !95, metadata !DIExpression()), !dbg !96
  store ptr %1, ptr %9, align 8
  call void @llvm.dbg.declare(metadata ptr %9, metadata !97, metadata !DIExpression()), !dbg !98
  store ptr %2, ptr %10, align 8
  call void @llvm.dbg.declare(metadata ptr %10, metadata !99, metadata !DIExpression()), !dbg !100
  store i32 %3, ptr %11, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/raj/coturn/src/client/ns_turn_msg_addr.c", directory: "/home/raj/coturn/build", checksumkind: CSK_MD5, checksum: "04af7583f3b04186f101cbba23b1a404")
!2 = !{!3, !9, !13, !17, !14, !19, !21}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !5, line: 25, baseType: !6)
!5 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !7, line: 40, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!8 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !5, line: 26, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !7, line: 42, baseType: !12)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !5, line: 24, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !7, line: 38, baseType: !16)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!23 = !{i32 7, !"Dwarf Version", i32 5}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 4}
!26 = !{i32 8, !"PIC Level", i32 2}
!27 = !{i32 7, !"PIE Level", i32 2}
!28 = !{i32 7, !"uwtable", i32 2}
!29 = !{i32 7, !"frame-pointer", i32 2}
!30 = !{!"clang version 16.0.0"}
!31 = distinct !DISubprogram(name: "stun_addr_encode", scope: !32, file: !32, line: 35, type: !33, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !94)
!32 = !DIFile(filename: "src/client/ns_turn_msg_addr.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "04af7583f3b04186f101cbba23b1a404")
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !36, !13, !93, !35, !10, !17}
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !39, line: 48, baseType: !40)
!39 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!40 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !39, line: 44, size: 224, elements: !41)
!41 = !{!42, !54, !70}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !40, file: !39, line: 45, baseType: !43, size: 128)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !44, line: 180, size: 128, elements: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!45 = !{!46, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !43, file: !44, line: 182, baseType: !47, size: 16)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !48, line: 28, baseType: !8)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !43, file: !44, line: 183, baseType: !50, size: 112, offset: 16)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 112, elements: !52)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!52 = !{!53}
!53 = !DISubrange(count: 14)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !40, file: !39, line: 46, baseType: !55, size: 128)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !56, line: 245, size: 128, elements: !57)
!56 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!57 = !{!58, !59, !61, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !55, file: !56, line: 247, baseType: !47, size: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !55, file: !56, line: 248, baseType: !60, size: 16, offset: 16)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !56, line: 123, baseType: !4)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !55, file: !56, line: 249, baseType: !62, size: 32, offset: 32)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !56, line: 31, size: 32, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !62, file: !56, line: 33, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !56, line: 30, baseType: !10)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !55, file: !56, line: 252, baseType: !67, size: 64, offset: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !40, file: !39, line: 47, baseType: !71, size: 224)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !56, line: 260, size: 224, elements: !72)
!72 = !{!73, !74, !75, !76, !92}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !71, file: !56, line: 262, baseType: !47, size: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !71, file: !56, line: 263, baseType: !60, size: 16, offset: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !71, file: !56, line: 264, baseType: !10, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !71, file: !56, line: 265, baseType: !77, size: 128, offset: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !56, line: 219, size: 128, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !77, file: !56, line: 226, baseType: !80, size: 128)
!80 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !77, file: !56, line: 221, size: 128, elements: !81)
!81 = !{!82, !86, !88}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !80, file: !56, line: 223, baseType: !83, size: 128)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !80, file: !56, line: 224, baseType: !87, size: 128)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !68)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !80, file: !56, line: 225, baseType: !89, size: 128)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 128, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 4)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !71, file: !56, line: 266, baseType: !10, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!94 = !{}
!95 = !DILocalVariable(name: "ca", arg: 1, scope: !31, file: !32, line: 35, type: !36)
!96 = !DILocation(line: 35, column: 38, scope: !31)
!97 = !DILocalVariable(name: "cfield", arg: 2, scope: !31, file: !32, line: 35, type: !13)
!98 = !DILocation(line: 35, column: 51, scope: !31)
!99 = !DILocalVariable(name: "clen", arg: 3, scope: !31, file: !32, line: 35, type: !93)
!100 = !DILocation(line: 35, column: 64, scope: !31)
!101 = !DILocalVariable(name: "xor_ed", arg: 4, scope: !31, file: !32, line: 35, type: !35)
!102 = !DILocation(line: 35, column: 74, scope: !31)
!103 = !DILocalVariable(name: "mc", arg: 5, scope: !31, file: !32, line: 35, type: !10)
!104 = !DILocation(line: 35, column: 91, scope: !31)
!105 = !DILocalVariable(name: "tsx_id", arg: 6, scope: !31, file: !32, line: 35, type: !17)
!106 = !DILocation(line: 35, column: 110, scope: !31)
!107 = !DILocation(line: 37, column: 7, scope: !108)
!108 = distinct !DILexicalBlock(scope: !31, file: !32, line: 37, column: 6)
!109 = !DILocation(line: 37, column: 14, scope: !108)
!110 = !DILocation(line: 37, column: 18, scope: !108)
!111 = !DILocation(line: 37, column: 23, scope: !108)
!112 = !DILocation(line: 37, column: 27, scope: !108)
!113 = !DILocation(line: 37, column: 30, scope: !108)
!114 = !DILocation(line: 37, column: 34, scope: !108)
!115 = !DILocation(line: 37, column: 6, scope: !31)
!116 = !DILocation(line: 37, column: 42, scope: !108)
!117 = !DILocation(line: 39, column: 7, scope: !118)
!118 = distinct !DILexicalBlock(scope: !31, file: !32, line: 39, column: 7)
!119 = !DILocation(line: 39, column: 14, scope: !118)
!120 = !DILocation(line: 39, column: 24, scope: !118)
!121 = !DILocation(line: 39, column: 35, scope: !118)
!122 = !DILocation(line: 39, column: 38, scope: !118)
!123 = !DILocation(line: 39, column: 45, scope: !118)
!124 = !DILocation(line: 39, column: 54, scope: !118)
!125 = !DILocation(line: 39, column: 7, scope: !31)
!126 = !DILocation(line: 43, column: 6, scope: !127)
!127 = distinct !DILexicalBlock(scope: !118, file: !32, line: 39, column: 59)
!128 = !DILocation(line: 43, column: 10, scope: !127)
!129 = !DILocation(line: 45, column: 5, scope: !127)
!130 = !DILocation(line: 45, column: 14, scope: !127)
!131 = !DILocation(line: 46, column: 5, scope: !127)
!132 = !DILocation(line: 46, column: 14, scope: !127)
!133 = !DILocation(line: 48, column: 9, scope: !134)
!134 = distinct !DILexicalBlock(scope: !127, file: !32, line: 48, column: 9)
!135 = !DILocation(line: 48, column: 9, scope: !127)
!136 = !DILocation(line: 51, column: 33, scope: !137)
!137 = distinct !DILexicalBlock(scope: !134, file: !32, line: 48, column: 17)
!138 = !DILocation(line: 51, column: 40, scope: !137)
!139 = !DILocation(line: 51, column: 32, scope: !137)
!140 = !DILocation(line: 51, column: 52, scope: !137)
!141 = !DILocation(line: 51, column: 50, scope: !137)
!142 = !DILocation(line: 51, column: 19, scope: !137)
!143 = !DILocation(line: 51, column: 7, scope: !137)
!144 = !DILocation(line: 51, column: 30, scope: !137)
!145 = !DILocation(line: 54, column: 33, scope: !137)
!146 = !DILocation(line: 54, column: 40, scope: !137)
!147 = !DILocation(line: 54, column: 49, scope: !137)
!148 = !DILocation(line: 54, column: 59, scope: !137)
!149 = !DILocation(line: 54, column: 57, scope: !137)
!150 = !DILocation(line: 54, column: 19, scope: !137)
!151 = !DILocation(line: 54, column: 7, scope: !137)
!152 = !DILocation(line: 54, column: 30, scope: !137)
!153 = !DILocation(line: 56, column: 5, scope: !137)
!154 = !DILocation(line: 59, column: 30, scope: !155)
!155 = distinct !DILexicalBlock(scope: !134, file: !32, line: 56, column: 12)
!156 = !DILocation(line: 59, column: 37, scope: !155)
!157 = !DILocation(line: 59, column: 19, scope: !155)
!158 = !DILocation(line: 59, column: 7, scope: !155)
