; ModuleID = './src/transports/inproc/binproc.c'
source_filename = "./src/transports/inproc/binproc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_epbase_vfptr = type { ptr, ptr }
%struct.nn_binproc = type { %struct.nn_fsm, i32, %struct.nn_ins_item, %struct.nn_list }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_ins_item = type { %struct.nn_epbase, %struct.nn_list_item, i32, i32 }
%struct.nn_epbase = type { ptr, ptr }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_list = type { ptr, ptr }
%struct.nn_sinproc = type { %struct.nn_fsm, i32, i32, ptr, %struct.nn_pipebase, %struct.nn_msgqueue, %struct.nn_msg, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_list_item }
%struct.nn_pipebase = type { %struct.nn_fsm, ptr, i8, i8, i8, ptr, ptr, %struct.nn_fsm_event, %struct.nn_fsm_event }
%struct.nn_msgqueue = type { %struct.anon, %struct.anon.0, i64, i64, i64, ptr }
%struct.anon = type { ptr, i32 }
%struct.anon.0 = type { ptr, i32 }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }
%struct.nn_cinproc = type { %struct.nn_fsm, i32, %struct.nn_ins_item, %struct.nn_sinproc }

@stderr = external global ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/transports/inproc/binproc.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ae6f1845e304899ab15dc7ce9661c81b")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 34)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "nn_binproc_vfptr", scope: !14, file: !2, line: 43, type: !64, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !15, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !16, globals: !184, splitDebugInlining: false, nameTableKind: None)
!15 = !DIFile(filename: "src/transports/inproc/binproc.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ae6f1845e304899ab15dc7ce9661c81b")
!16 = !{!17, !90, !91, !106}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_binproc", file: !19, line: 36, size: 1152, elements: !20)
!19 = !DIFile(filename: "./src/transports/inproc/binproc.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "219357ea033ab2138672247e5529c0ef")
!20 = !{!21, !53, !54, !85}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !18, file: !19, line: 39, baseType: !22, size: 640)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !23, line: 66, size: 640, elements: !24)
!23 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!24 = !{!25, !33, !34, !35, !36, !37, !40}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !22, file: !23, line: 67, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !23, line: 58, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30, !31, !31, !32}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !22, file: !23, line: 68, baseType: !31, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !22, file: !23, line: 69, baseType: !31, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !22, file: !23, line: 70, baseType: !32, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !22, file: !23, line: 71, baseType: !30, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !22, file: !23, line: 72, baseType: !38, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !23, line: 30, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !22, file: !23, line: 73, baseType: !41, size: 320, offset: 320)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !23, line: 34, size: 320, elements: !42)
!42 = !{!43, !44, !45, !46, !47}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !41, file: !23, line: 35, baseType: !30, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !41, file: !23, line: 36, baseType: !31, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !41, file: !23, line: 37, baseType: !32, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !23, line: 38, baseType: !31, size: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !41, file: !23, line: 39, baseType: !48, size: 64, offset: 256)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !49, line: 33, size: 64, elements: !50)
!49 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!50 = !{!51}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !49, line: 34, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !18, file: !19, line: 40, baseType: !31, size: 32, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !18, file: !19, line: 43, baseType: !55, size: 320, offset: 704)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ins_item", file: !56, line: 32, size: 320, elements: !57)
!56 = !DIFile(filename: "./src/transports/inproc/ins.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "9cbc2b057431ba3dad53f44debf178b0")
!57 = !{!58, !76, !83, !84}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "epbase", scope: !55, file: !56, line: 35, baseType: !59, size: 128)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !60, line: 81, size: 128, elements: !61)
!60 = !DIFile(filename: "./src/transports/inproc/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!61 = !{!62, !73}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !59, file: !60, line: 82, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !60, line: 70, size: 128, elements: !66)
!66 = !{!67, !72}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !65, file: !60, line: 75, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !65, file: !60, line: 78, baseType: !68, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !59, file: !60, line: 83, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !60, line: 83, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !55, file: !56, line: 38, baseType: !77, size: 128, offset: 128)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !78, line: 26, size: 128, elements: !79)
!78 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!79 = !{!80, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !78, line: 27, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !78, line: 28, baseType: !81, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !55, file: !56, line: 42, baseType: !31, size: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "connects", scope: !55, file: !56, line: 46, baseType: !31, size: 32, offset: 288)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sinprocs", scope: !18, file: !19, line: 46, baseType: !86, size: 128, offset: 1024)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !78, line: 31, size: 128, elements: !87)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !86, file: !78, line: 32, baseType: !81, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !86, file: !78, line: 33, baseType: !81, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_cinproc", file: !93, line: 33, size: 5760, elements: !94)
!93 = !DIFile(filename: "./src/transports/inproc/cinproc.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "10e72d97be488bf3eea45ef94cfbac78")
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !92, file: !93, line: 36, baseType: !22, size: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !92, file: !93, line: 37, baseType: !31, size: 32, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !92, file: !93, line: 40, baseType: !55, size: 320, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sinproc", scope: !92, file: !93, line: 43, baseType: !99, size: 4736, offset: 1024)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sinproc", file: !100, line: 46, size: 4736, elements: !101)
!100 = !DIFile(filename: "./src/transports/inproc/sinproc.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "c50de9684b7e0fabb9c8960363a59da6")
!101 = !{!102, !103, !104, !105, !107, !149, !178, !179, !180, !181, !182, !183}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !99, file: !100, line: 49, baseType: !22, size: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !100, line: 50, baseType: !31, size: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !100, line: 53, baseType: !31, size: 32, offset: 672)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !99, file: !100, line: 56, baseType: !106, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !99, file: !100, line: 59, baseType: !108, size: 1536, offset: 768)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase", file: !60, line: 147, size: 1536, elements: !109)
!109 = !{!110, !111, !140, !141, !142, !143, !146, !147, !148}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !108, file: !60, line: 148, baseType: !22, size: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !108, file: !60, line: 149, baseType: !112, size: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase_vfptr", file: !60, line: 134, size: 128, elements: !115)
!115 = !{!116, !139}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !114, file: !60, line: 138, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!31, !120, !121}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !123, line: 30, size: 512, elements: !124)
!123 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!124 = !{!125, !138}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !122, file: !123, line: 33, baseType: !126, size: 256)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !127, line: 39, size: 256, elements: !128)
!127 = !DIFile(filename: "src/aio/../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !126, file: !127, line: 40, baseType: !130, size: 256)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 256, elements: !136)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !132, line: 24, baseType: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !134, line: 38, baseType: !135)
!134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!135 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !{!137}
!137 = !DISubrange(count: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !122, file: !123, line: 36, baseType: !126, size: 256, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !114, file: !60, line: 142, baseType: !117, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !108, file: !60, line: 150, baseType: !131, size: 8, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !108, file: !60, line: 151, baseType: !131, size: 8, offset: 712)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !108, file: !60, line: 152, baseType: !131, size: 8, offset: 720)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !108, file: !60, line: 153, baseType: !144, size: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !60, line: 39, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !60, line: 154, baseType: !32, size: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !108, file: !60, line: 155, baseType: !41, size: 320, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !108, file: !60, line: 156, baseType: !41, size: 320, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "msgqueue", scope: !99, file: !100, line: 63, baseType: !150, size: 512, offset: 2304)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msgqueue", file: !151, line: 40, size: 512, elements: !152)
!151 = !DIFile(filename: "./src/transports/inproc/msgqueue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "03057ddde493a8150c86b1bc38c7f2a4")
!152 = !{!153, !166, !171, !175, !176, !177}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !150, file: !151, line: 47, baseType: !154, size: 128)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !150, file: !151, line: 44, size: 128, elements: !155)
!155 = !{!156, !165}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !154, file: !151, line: 45, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msgqueue_chunk", file: !151, line: 35, size: 64576, elements: !159)
!159 = !{!160, !164}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "msgs", scope: !158, file: !151, line: 36, baseType: !161, size: 64512)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64512, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 126)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !151, line: 37, baseType: !157, size: 64, offset: 64512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !154, file: !151, line: 46, baseType: !31, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !150, file: !151, line: 53, baseType: !167, size: 128, offset: 128)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !150, file: !151, line: 50, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !167, file: !151, line: 51, baseType: !157, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !167, file: !151, line: 52, baseType: !31, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !150, file: !151, line: 56, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 46, baseType: !174)
!173 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!174 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !150, file: !151, line: 59, baseType: !172, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "maxmem", scope: !150, file: !151, line: 62, baseType: !172, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !150, file: !151, line: 66, baseType: !157, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !99, file: !100, line: 68, baseType: !122, size: 512, offset: 2816)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "event_connect", scope: !99, file: !100, line: 71, baseType: !41, size: 320, offset: 3328)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "event_sent", scope: !99, file: !100, line: 74, baseType: !41, size: 320, offset: 3648)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "event_received", scope: !99, file: !100, line: 75, baseType: !41, size: 320, offset: 3968)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "event_disconnect", scope: !99, file: !100, line: 76, baseType: !41, size: 320, offset: 4288)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !99, file: !100, line: 80, baseType: !77, size: 128, offset: 4608)
!184 = !{!0, !7, !12, !185, !190, !195, !200}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 123, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 30)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 123, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 42)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 60)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !{i32 7, !"Dwarf Version", i32 5}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = !{i32 1, !"wchar_size", i32 4}
!208 = !{i32 8, !"PIC Level", i32 2}
!209 = !{i32 7, !"PIE Level", i32 2}
!210 = !{i32 7, !"uwtable", i32 2}
!211 = !{i32 7, !"frame-pointer", i32 2}
!212 = !{!"clang version 16.0.0"}
!213 = distinct !DISubprogram(name: "nn_binproc_create", scope: !2, file: !2, line: 55, type: !214, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !217)
!214 = !DISubroutineType(types: !215)
!215 = !{!31, !32, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!217 = !{}
!218 = !DILocalVariable(name: "hint", arg: 1, scope: !213, file: !2, line: 55, type: !32)
!219 = !DILocation(line: 55, column: 30, scope: !213)
!220 = !DILocalVariable(name: "epbase", arg: 2, scope: !213, file: !2, line: 55, type: !216)
!221 = !DILocation(line: 55, column: 55, scope: !213)
!222 = !DILocalVariable(name: "rc", scope: !213, file: !2, line: 57, type: !31)
!223 = !DILocation(line: 57, column: 9, scope: !213)
!224 = !DILocalVariable(name: "self", scope: !213, file: !2, line: 58, type: !17)
!225 = !DILocation(line: 58, column: 24, scope: !213)
!226 = !DILocation(line: 60, column: 12, scope: !213)
!227 = !DILocation(line: 60, column: 10, scope: !213)
!228 = !DILocation(line: 61, column: 5, scope: !213)
!229 = !DILocation(line: 61, column: 5, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !2, line: 61, column: 5)
!231 = distinct !DILexicalBlock(scope: !213, file: !2, line: 61, column: 5)
!232 = !DILocation(line: 61, column: 5, scope: !231)
!233 = !DILocation(line: 61, column: 5, scope: !234)
!234 = distinct !DILexicalBlock(scope: !230, file: !2, line: 61, column: 5)
!235 = !DILocation(line: 63, column: 24, scope: !213)
!236 = !DILocation(line: 63, column: 30, scope: !213)
!237 = !DILocation(line: 63, column: 55, scope: !213)
!238 = !DILocation(line: 63, column: 5, scope: !213)
!239 = !DILocation(line: 64, column: 24, scope: !213)
!240 = !DILocation(line: 64, column: 30, scope: !213)
!241 = !DILocation(line: 65, column: 28, scope: !213)
!242 = !DILocation(line: 65, column: 34, scope: !213)
!243 = !DILocation(line: 65, column: 39, scope: !213)
!244 = !DILocation(line: 65, column: 9, scope: !213)
!245 = !DILocation(line: 64, column: 5, scope: !213)
!246 = !DILocation(line: 66, column: 5, scope: !213)
!247 = !DILocation(line: 66, column: 11, scope: !213)
!248 = !DILocation(line: 66, column: 17, scope: !213)
!249 = !DILocation(line: 67, column: 20, scope: !213)
