; ModuleID = './src/transports/inproc/ins.c'
source_filename = "./src/transports/inproc/ins.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_ins = type { %struct.nn_mutex, %struct.nn_list, %struct.nn_list }
%struct.nn_mutex = type { %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.nn_list = type { ptr, ptr }
%struct.nn_ins_item = type { %struct.nn_epbase, %struct.nn_list_item, i32, i32 }
%struct.nn_epbase = type { ptr, ptr }
%struct.nn_list_item = type { ptr, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [30 x i8] c"Assertion failed: %s (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"sz == sizeof (self->protocol)\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [30 x i8] c"./src/transports/inproc/ins.c\00", align 1, !dbg !9
@self = internal global %struct.nn_ins zeroinitializer, align 8, !dbg !11
@.str.3 = private unnamed_addr constant [21 x i8] c"citem->connects == 0\00", align 1, !dbg !50

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @nn_ins_item_init(ptr noundef %0, ptr noundef %1, ptr noundef %2) #0 !dbg !107 {
  %4 = alloca ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/transports/inproc/ins.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "647f6c89fef818386564fd19cca23b1f")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 30)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !3, isLocal: true, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !3, isLocal: true, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "self", scope: !13, file: !2, line: 49, type: !55, isLocal: true, isDefinition: true)
!13 = distinct !DICompileUnit(language: DW_LANG_C11, file: !14, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !15, globals: !49, splitDebugInlining: false, nameTableKind: None)
!14 = !DIFile(filename: "src/transports/inproc/ins.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "647f6c89fef818386564fd19cca23b1f")
!15 = !{!16, !48}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ins_item", file: !18, line: 32, size: 320, elements: !19)
!18 = !DIFile(filename: "./src/transports/inproc/ins.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "9cbc2b057431ba3dad53f44debf178b0")
!19 = !{!20, !38, !45, !47}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "epbase", scope: !17, file: !18, line: 35, baseType: !21, size: 128)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !22, line: 81, size: 128, elements: !23)
!22 = !DIFile(filename: "./src/transports/inproc/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!23 = !{!24, !35}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !21, file: !22, line: 82, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !22, line: 70, size: 128, elements: !28)
!28 = !{!29, !34}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !27, file: !22, line: 75, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !27, file: !22, line: 78, baseType: !30, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !21, file: !22, line: 83, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !22, line: 83, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !17, file: !18, line: 38, baseType: !39, size: 128, offset: 128)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !40, line: 26, size: 128, elements: !41)
!40 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!41 = !{!42, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !40, line: 27, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !39, file: !40, line: 28, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !17, file: !18, line: 42, baseType: !46, size: 32, offset: 256)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "connects", scope: !17, file: !18, line: 46, baseType: !46, size: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!49 = !{!0, !7, !9, !50, !11}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !2, line: 120, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 21)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ins", file: !2, line: 33, size: 576, elements: !56)
!56 = !{!57, !93, !98}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !55, file: !2, line: 36, baseType: !58, size: 320)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !59, line: 32, size: 320, elements: !60)
!59 = !DIFile(filename: "./src/transports/inproc/../../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !58, file: !59, line: 36, baseType: !62, size: 320)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !63, line: 72, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !63, line: 67, size: 320, elements: !65)
!65 = !{!66, !87, !91}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !64, file: !63, line: 69, baseType: !67, size: 320)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !68, line: 22, size: 320, elements: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!69 = !{!70, !71, !73, !74, !75, !76, !78, !79}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !67, file: !68, line: 24, baseType: !46, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !67, file: !68, line: 25, baseType: !72, size: 32, offset: 32)
!72 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !67, file: !68, line: 26, baseType: !46, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !67, file: !68, line: 28, baseType: !72, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !67, file: !68, line: 32, baseType: !46, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !67, file: !68, line: 34, baseType: !77, size: 16, offset: 160)
!77 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !67, file: !68, line: 35, baseType: !77, size: 16, offset: 176)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !67, file: !68, line: 36, baseType: !80, size: 128, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !81, line: 55, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !81, line: 51, size: 128, elements: !83)
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !82, file: !81, line: 53, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !82, file: !81, line: 54, baseType: !85, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !64, file: !63, line: 70, baseType: !88, size: 320)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 40)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !64, file: !63, line: 71, baseType: !92, size: 64)
!92 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !55, file: !2, line: 40, baseType: !94, size: 128, offset: 320)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !40, line: 31, size: 128, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !94, file: !40, line: 32, baseType: !43, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !94, file: !40, line: 33, baseType: !43, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !55, file: !2, line: 44, baseType: !94, size: 128, offset: 448)
!99 = !{i32 7, !"Dwarf Version", i32 5}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = !{i32 1, !"wchar_size", i32 4}
!102 = !{i32 8, !"PIC Level", i32 2}
!103 = !{i32 7, !"PIE Level", i32 2}
!104 = !{i32 7, !"uwtable", i32 2}
!105 = !{i32 7, !"frame-pointer", i32 2}
!106 = !{!"clang version 16.0.0"}
!107 = distinct !DISubprogram(name: "nn_ins_item_init", scope: !2, file: !2, line: 51, type: !108, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !111)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !16, !25, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !{}
!112 = !DILocalVariable(name: "self", arg: 1, scope: !107, file: !2, line: 51, type: !16)
!113 = !DILocation(line: 51, column: 44, scope: !107)
!114 = !DILocalVariable(name: "vfptr", arg: 2, scope: !107, file: !2, line: 52, type: !25)
!115 = !DILocation(line: 52, column: 35, scope: !107)
!116 = !DILocalVariable(name: "hint", arg: 3, scope: !107, file: !2, line: 52, type: !110)
!117 = !DILocation(line: 52, column: 48, scope: !107)
!118 = !DILocalVariable(name: "sz", scope: !107, file: !2, line: 54, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 46, baseType: !121)
!120 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!121 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!122 = !DILocation(line: 54, column: 12, scope: !107)
!123 = !DILocation(line: 56, column: 22, scope: !107)
!124 = !DILocation(line: 56, column: 28, scope: !107)
!125 = !DILocation(line: 56, column: 36, scope: !107)
!126 = !DILocation(line: 56, column: 43, scope: !107)
!127 = !DILocation(line: 56, column: 5, scope: !107)
!128 = !DILocation(line: 57, column: 25, scope: !107)
!129 = !DILocation(line: 57, column: 31, scope: !107)
!130 = !DILocation(line: 57, column: 5, scope: !107)
!131 = !DILocation(line: 58, column: 8, scope: !107)
!132 = !DILocation(line: 59, column: 24, scope: !107)
!133 = !DILocation(line: 59, column: 30, scope: !107)
!134 = !DILocation(line: 60, column: 10, scope: !107)
!135 = !DILocation(line: 60, column: 16, scope: !107)
!136 = !DILocation(line: 59, column: 5, scope: !107)
!137 = !DILocation(line: 61, column: 5, scope: !107)
!138 = !DILocation(line: 61, column: 5, scope: !139)
!139 = distinct !DILexicalBlock(scope: !140, file: !2, line: 61, column: 5)
!140 = distinct !DILexicalBlock(scope: !107, file: !2, line: 61, column: 5)
!141 = !DILocation(line: 61, column: 5, scope: !140)
!142 = !DILocation(line: 61, column: 5, scope: !143)
!143 = distinct !DILexicalBlock(scope: !139, file: !2, line: 61, column: 5)
!144 = !DILocation(line: 62, column: 5, scope: !107)
!145 = !DILocation(line: 62, column: 11, scope: !107)
!146 = !DILocation(line: 62, column: 20, scope: !107)
!147 = !DILocation(line: 63, column: 1, scope: !107)
!148 = distinct !DISubprogram(name: "nn_ins_item_term", scope: !2, file: !2, line: 65, type: !149, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !111)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !16}
!151 = !DILocalVariable(name: "self", arg: 1, scope: !148, file: !2, line: 65, type: !16)
!152 = !DILocation(line: 65, column: 44, scope: !148)
!153 = !DILocation(line: 67, column: 25, scope: !148)
!154 = !DILocation(line: 67, column: 31, scope: !148)
!155 = !DILocation(line: 67, column: 5, scope: !148)
!156 = !DILocation(line: 68, column: 22, scope: !148)
!157 = !DILocation(line: 68, column: 28, scope: !148)
!158 = !DILocation(line: 68, column: 5, scope: !148)
!159 = !DILocation(line: 69, column: 1, scope: !148)
