; ModuleID = './src/transports/inproc/msgqueue.c'
source_filename = "./src/transports/inproc/msgqueue.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_msgqueue = type { %struct.anon, %struct.anon.0, i64, i64, i64, ptr }
%struct.anon = type { ptr, i32 }
%struct.anon.0 = type { ptr, i32 }
%struct.nn_msgqueue_chunk = type { [126 x %struct.nn_msg], ptr }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"./src/transports/inproc/msgqueue.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [17 x i8] c"%s [%d] (%s:%d)\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [30 x i8] c"Assertion failed: %s (%s:%d)\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [34 x i8] c"self->in.chunk == self->out.chunk\00", align 1, !dbg !22

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @nn_msgqueue_init(ptr noundef %0, i64 noundef %1) #0 !dbg !40 {
  %3 = alloca ptr, align 8
  %4 = alloca i64, align 8
  %5 = alloca ptr, align 8
  store ptr %0, ptr %3, align 8
  call void @llvm.dbg.declare(metadata ptr %3, metadata !90, metadata !DIExpression()), !dbg !91
  store i64 %1, ptr %4, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/transports/inproc/msgqueue.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bfbcf82e25c77ed70db15c70b3e8efd6")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 35)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 17)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 30)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 34)
!27 = distinct !DICompileUnit(language: DW_LANG_C11, file: !28, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !31, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "src/transports/inproc/msgqueue.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bfbcf82e25c77ed70db15c70b3e8efd6")
!29 = !{!30}
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !{!0, !7, !12, !17, !22}
!32 = !{i32 7, !"Dwarf Version", i32 5}
!33 = !{i32 2, !"Debug Info Version", i32 3}
!34 = !{i32 1, !"wchar_size", i32 4}
!35 = !{i32 8, !"PIC Level", i32 2}
!36 = !{i32 7, !"PIE Level", i32 2}
!37 = !{i32 7, !"uwtable", i32 2}
!38 = !{i32 7, !"frame-pointer", i32 2}
!39 = !{!"clang version 16.0.0"}
!40 = distinct !DISubprogram(name: "nn_msgqueue_init", scope: !2, file: !2, line: 31, type: !41, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !27, retainedNodes: !89)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43, !83}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msgqueue", file: !45, line: 40, size: 512, elements: !46)
!45 = !DIFile(filename: "./src/transports/inproc/msgqueue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "03057ddde493a8150c86b1bc38c7f2a4")
!46 = !{!47, !77, !82, !86, !87, !88}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !44, file: !45, line: 47, baseType: !48, size: 128)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !45, line: 44, size: 128, elements: !49)
!49 = !{!50, !76}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !48, file: !45, line: 45, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msgqueue_chunk", file: !45, line: 35, size: 64576, elements: !53)
!53 = !{!54, !75}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "msgs", scope: !52, file: !45, line: 36, baseType: !55, size: 64512)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64512, elements: !73)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !57, line: 30, size: 512, elements: !58)
!57 = !DIFile(filename: "./src/transports/inproc/../../utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!58 = !{!59, !72}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !56, file: !57, line: 33, baseType: !60, size: 256)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !61, line: 39, size: 256, elements: !62)
!61 = !DIFile(filename: "./src/transports/inproc/../../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !60, file: !61, line: 40, baseType: !64, size: 256)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 256, elements: !70)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !66, line: 24, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !68, line: 38, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!69 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !{!71}
!71 = !DISubrange(count: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !56, file: !57, line: 36, baseType: !60, size: 256, offset: 256)
!73 = !{!74}
!74 = !DISubrange(count: 126)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !45, line: 37, baseType: !51, size: 64, offset: 64512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !48, file: !45, line: 46, baseType: !30, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !44, file: !45, line: 53, baseType: !78, size: 128, offset: 128)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !45, line: 50, size: 128, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !78, file: !45, line: 51, baseType: !51, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !78, file: !45, line: 52, baseType: !30, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !44, file: !45, line: 56, baseType: !83, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 46, baseType: !85)
!84 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!85 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !44, file: !45, line: 59, baseType: !83, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "maxmem", scope: !44, file: !45, line: 62, baseType: !83, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !44, file: !45, line: 66, baseType: !51, size: 64, offset: 448)
!89 = !{}
!90 = !DILocalVariable(name: "self", arg: 1, scope: !40, file: !2, line: 31, type: !43)
!91 = !DILocation(line: 31, column: 44, scope: !40)
!92 = !DILocalVariable(name: "maxmem", arg: 2, scope: !40, file: !2, line: 31, type: !83)
!93 = !DILocation(line: 31, column: 57, scope: !40)
!94 = !DILocalVariable(name: "chunk", scope: !40, file: !2, line: 33, type: !51)
!95 = !DILocation(line: 33, column: 31, scope: !40)
!96 = !DILocation(line: 35, column: 5, scope: !40)
!97 = !DILocation(line: 35, column: 11, scope: !40)
!98 = !DILocation(line: 35, column: 17, scope: !40)
!99 = !DILocation(line: 36, column: 5, scope: !40)
!100 = !DILocation(line: 36, column: 11, scope: !40)
!101 = !DILocation(line: 36, column: 15, scope: !40)
!102 = !DILocation(line: 37, column: 20, scope: !40)
!103 = !DILocation(line: 37, column: 5, scope: !40)
!104 = !DILocation(line: 37, column: 11, scope: !40)
!105 = !DILocation(line: 37, column: 18, scope: !40)
!106 = !DILocation(line: 39, column: 13, scope: !40)
!107 = !DILocation(line: 39, column: 11, scope: !40)
!108 = !DILocation(line: 40, column: 5, scope: !40)
!109 = !DILocation(line: 40, column: 5, scope: !110)
!110 = distinct !DILexicalBlock(scope: !111, file: !2, line: 40, column: 5)
!111 = distinct !DILexicalBlock(scope: !40, file: !2, line: 40, column: 5)
!112 = !DILocation(line: 40, column: 5, scope: !111)
!113 = !DILocation(line: 40, column: 5, scope: !114)
!114 = distinct !DILexicalBlock(scope: !110, file: !2, line: 40, column: 5)
!115 = !DILocation(line: 41, column: 5, scope: !40)
!116 = !DILocation(line: 41, column: 12, scope: !40)
!117 = !DILocation(line: 41, column: 17, scope: !40)
!118 = !DILocation(line: 43, column: 23, scope: !40)
!119 = !DILocation(line: 43, column: 5, scope: !40)
!120 = !DILocation(line: 43, column: 11, scope: !40)
!121 = !DILocation(line: 43, column: 15, scope: !40)
!122 = !DILocation(line: 43, column: 21, scope: !40)
!123 = !DILocation(line: 44, column: 5, scope: !40)
!124 = !DILocation(line: 44, column: 11, scope: !40)
!125 = !DILocation(line: 44, column: 15, scope: !40)
!126 = !DILocation(line: 44, column: 19, scope: !40)
!127 = !DILocation(line: 45, column: 22, scope: !40)
!128 = !DILocation(line: 45, column: 5, scope: !40)
!129 = !DILocation(line: 45, column: 11, scope: !40)
!130 = !DILocation(line: 45, column: 14, scope: !40)
!131 = !DILocation(line: 45, column: 20, scope: !40)
!132 = !DILocation(line: 46, column: 5, scope: !40)
!133 = !DILocation(line: 46, column: 11, scope: !40)
!134 = !DILocation(line: 46, column: 14, scope: !40)
!135 = !DILocation(line: 46, column: 18, scope: !40)
!136 = !DILocation(line: 48, column: 5, scope: !40)
!137 = !DILocation(line: 48, column: 11, scope: !40)
!138 = !DILocation(line: 48, column: 17, scope: !40)
!139 = !DILocation(line: 49, column: 1, scope: !40)
!140 = distinct !DISubprogram(name: "nn_msgqueue_term", scope: !2, file: !2, line: 51, type: !141, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !27, retainedNodes: !89)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !43}
!143 = !DILocalVariable(name: "self", arg: 1, scope: !140, file: !2, line: 51, type: !43)
!144 = !DILocation(line: 51, column: 44, scope: !140)
!145 = !DILocalVariable(name: "rc", scope: !140, file: !2, line: 53, type: !30)
!146 = !DILocation(line: 53, column: 9, scope: !140)
!147 = !DILocalVariable(name: "msg", scope: !140, file: !2, line: 54, type: !56)
!148 = !DILocation(line: 54, column: 19, scope: !140)
!149 = !DILocation(line: 57, column: 5, scope: !140)
!150 = !DILocation(line: 58, column: 32, scope: !151)
!151 = distinct !DILexicalBlock(scope: !140, file: !2, line: 57, column: 15)
!152 = !DILocation(line: 58, column: 14, scope: !151)
!153 = !DILocation(line: 58, column: 12, scope: !151)
!154 = !DILocation(line: 59, column: 13, scope: !155)
