; ModuleID = './src/transports/inproc/sinproc.c'
source_filename = "./src/transports/inproc/sinproc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_pipebase_vfptr = type { ptr, ptr }
%struct.nn_sinproc = type { %struct.nn_fsm, i32, i32, ptr, %struct.nn_pipebase, %struct.nn_msgqueue, %struct.nn_msg, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_list_item }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_pipebase = type { %struct.nn_fsm, ptr, i8, i8, i8, ptr, ptr, %struct.nn_fsm_event, %struct.nn_fsm_event }
%struct.nn_msgqueue = type { %struct.anon, %struct.anon.0, i64, i64, i64, ptr }
%struct.anon = type { ptr, i32 }
%struct.anon.0 = type { ptr, i32 }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_list_item = type { ptr, ptr }

@nn_sinproc_pipebase_vfptr = dso_local constant %struct.nn_pipebase_vfptr { ptr @nn_sinproc_send, ptr @nn_sinproc_recv }, align 8, !dbg !0
@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [30 x i8] c"Assertion failed: %s (%s:%d)\0A\00", align 1, !dbg !131
@.str.1 = private unnamed_addr constant [22 x i8] c"sz == sizeof (rcvbuf)\00", align 1, !dbg !137

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_sinproc_pipebase_vfptr", scope: !2, file: !133, line: 53, type: !51, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !130, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/transports/inproc/sinproc.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7b7455b4f64136fe0d541473a74e0de8")
!4 = !{!5, !128, !19}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sinproc", file: !7, line: 46, size: 4736, elements: !8)
!7 = !DIFile(filename: "./src/transports/inproc/sinproc.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "c50de9684b7e0fabb9c8960363a59da6")
!8 = !{!9, !41, !42, !43, !44, !87, !116, !117, !118, !119, !120, !121}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !6, file: !7, line: 49, baseType: !10, size: 640)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !11, line: 66, size: 640, elements: !12)
!11 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!12 = !{!13, !21, !22, !23, !24, !25, !28}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !10, file: !11, line: 67, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !11, line: 58, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !19, !19, !20}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !10, file: !11, line: 68, baseType: !19, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !10, file: !11, line: 69, baseType: !19, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !10, file: !11, line: 70, baseType: !20, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !10, file: !11, line: 71, baseType: !18, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !10, file: !11, line: 72, baseType: !26, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !11, line: 30, flags: DIFlagFwdDecl)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !10, file: !11, line: 73, baseType: !29, size: 320, offset: 320)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !11, line: 34, size: 320, elements: !30)
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !29, file: !11, line: 35, baseType: !18, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !29, file: !11, line: 36, baseType: !19, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !29, file: !11, line: 37, baseType: !20, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !11, line: 38, baseType: !19, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !29, file: !11, line: 39, baseType: !36, size: 64, offset: 256)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !37, line: 33, size: 64, elements: !38)
!37 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !37, line: 34, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !6, file: !7, line: 50, baseType: !19, size: 32, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !6, file: !7, line: 53, baseType: !19, size: 32, offset: 672)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !6, file: !7, line: 56, baseType: !5, size: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !6, file: !7, line: 59, baseType: !45, size: 1536, offset: 768)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase", file: !46, line: 147, size: 1536, elements: !47)
!46 = !DIFile(filename: "./src/transports/inproc/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!47 = !{!48, !49, !78, !79, !80, !81, !84, !85, !86}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !45, file: !46, line: 148, baseType: !10, size: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !45, file: !46, line: 149, baseType: !50, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase_vfptr", file: !46, line: 134, size: 128, elements: !53)
!53 = !{!54, !77}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !52, file: !46, line: 138, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!19, !58, !59}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !61, line: 30, size: 512, elements: !62)
!61 = !DIFile(filename: "./src/transports/inproc/../../utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!62 = !{!63, !76}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !60, file: !61, line: 33, baseType: !64, size: 256)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !65, line: 39, size: 256, elements: !66)
!65 = !DIFile(filename: "./src/transports/inproc/../../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !64, file: !65, line: 40, baseType: !68, size: 256)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !74)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !70, line: 24, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !72, line: 38, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!73 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !{!75}
!75 = !DISubrange(count: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !60, file: !61, line: 36, baseType: !64, size: 256, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !52, file: !46, line: 142, baseType: !55, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !45, file: !46, line: 150, baseType: !69, size: 8, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !45, file: !46, line: 151, baseType: !69, size: 8, offset: 712)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !45, file: !46, line: 152, baseType: !69, size: 8, offset: 720)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !45, file: !46, line: 153, baseType: !82, size: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !46, line: 39, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !46, line: 154, baseType: !20, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !45, file: !46, line: 155, baseType: !29, size: 320, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !45, file: !46, line: 156, baseType: !29, size: 320, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "msgqueue", scope: !6, file: !7, line: 63, baseType: !88, size: 512, offset: 2304)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msgqueue", file: !89, line: 40, size: 512, elements: !90)
!89 = !DIFile(filename: "./src/transports/inproc/msgqueue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "03057ddde493a8150c86b1bc38c7f2a4")
!90 = !{!91, !104, !109, !113, !114, !115}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !88, file: !89, line: 47, baseType: !92, size: 128)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !89, line: 44, size: 128, elements: !93)
!93 = !{!94, !103}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !92, file: !89, line: 45, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msgqueue_chunk", file: !89, line: 35, size: 64576, elements: !97)
!97 = !{!98, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "msgs", scope: !96, file: !89, line: 36, baseType: !99, size: 64512)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64512, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 126)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !89, line: 37, baseType: !95, size: 64, offset: 64512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !92, file: !89, line: 46, baseType: !19, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !88, file: !89, line: 53, baseType: !105, size: 128, offset: 128)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !89, line: 50, size: 128, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !105, file: !89, line: 51, baseType: !95, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !105, file: !89, line: 52, baseType: !19, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !88, file: !89, line: 56, baseType: !110, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!112 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !88, file: !89, line: 59, baseType: !110, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "maxmem", scope: !88, file: !89, line: 62, baseType: !110, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !88, file: !89, line: 66, baseType: !95, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !6, file: !7, line: 68, baseType: !60, size: 512, offset: 2816)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "event_connect", scope: !6, file: !7, line: 71, baseType: !29, size: 320, offset: 3328)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "event_sent", scope: !6, file: !7, line: 74, baseType: !29, size: 320, offset: 3648)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "event_received", scope: !6, file: !7, line: 75, baseType: !29, size: 320, offset: 3968)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "event_disconnect", scope: !6, file: !7, line: 76, baseType: !29, size: 320, offset: 4288)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !6, file: !7, line: 80, baseType: !122, size: 128, offset: 4608)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !123, line: 26, size: 128, elements: !124)
!123 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !123, line: 27, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !123, line: 28, baseType: !126, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!130 = !{!0, !131, !137, !142, !147, !152, !157, !162, !167, !172, !177, !182, !187}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !133, line: 71, type: !134, isLocal: true, isDefinition: true)
!133 = !DIFile(filename: "./src/transports/inproc/sinproc.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7b7455b4f64136fe0d541473a74e0de8")
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 240, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 30)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !133, line: 71, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 176, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 22)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !133, line: 71, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 272, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 34)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !133, line: 110, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 96, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 12)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !133, line: 139, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 336, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 42)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !133, line: 140, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 352, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 44)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !133, line: 163, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 744, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 93)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !133, line: 168, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 136, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 17)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !133, line: 175, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 200, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 25)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !133, line: 217, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 456, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 57)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !133, line: 238, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 16, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !133, line: 311, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 328, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 41)
!192 = !{i32 7, !"Dwarf Version", i32 5}
!193 = !{i32 2, !"Debug Info Version", i32 3}
!194 = !{i32 1, !"wchar_size", i32 4}
!195 = !{i32 8, !"PIC Level", i32 2}
!196 = !{i32 7, !"PIE Level", i32 2}
!197 = !{i32 7, !"uwtable", i32 2}
!198 = !{i32 7, !"frame-pointer", i32 2}
!199 = !{!"clang version 16.0.0"}
!200 = distinct !DISubprogram(name: "nn_sinproc_send", scope: !133, file: !133, line: 127, type: !56, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !201)
!201 = !{}
!202 = !DILocalVariable(name: "self", arg: 1, scope: !200, file: !133, line: 127, type: !58)
!203 = !DILocation(line: 127, column: 49, scope: !200)
!204 = !DILocalVariable(name: "msg", arg: 2, scope: !200, file: !133, line: 127, type: !59)
!205 = !DILocation(line: 127, column: 70, scope: !200)
!206 = !DILocalVariable(name: "sinproc", scope: !200, file: !133, line: 129, type: !5)
!207 = !DILocation(line: 129, column: 24, scope: !200)
!208 = !DILocation(line: 131, column: 15, scope: !200)
!209 = !DILocation(line: 131, column: 13, scope: !200)
!210 = !DILocation(line: 135, column: 9, scope: !211)
!211 = distinct !DILexicalBlock(scope: !200, file: !133, line: 135, column: 9)
!212 = !DILocation(line: 135, column: 18, scope: !211)
!213 = !DILocation(line: 135, column: 24, scope: !211)
!214 = !DILocation(line: 135, column: 9, scope: !200)
!215 = !DILocation(line: 136, column: 9, scope: !211)
!216 = !DILocation(line: 139, column: 5, scope: !200)
!217 = !DILocation(line: 139, column: 5, scope: !218)
!218 = distinct !DILexicalBlock(scope: !219, file: !133, line: 139, column: 5)
!219 = distinct !DILexicalBlock(scope: !200, file: !133, line: 139, column: 5)
!220 = !DILocation(line: 139, column: 5, scope: !219)
!221 = !DILocation(line: 139, column: 5, scope: !222)
!222 = distinct !DILexicalBlock(scope: !218, file: !133, line: 139, column: 5)
!223 = !DILocation(line: 140, column: 5, scope: !200)
!224 = !DILocation(line: 140, column: 5, scope: !225)
!225 = distinct !DILexicalBlock(scope: !226, file: !133, line: 140, column: 5)
!226 = distinct !DILexicalBlock(scope: !200, file: !133, line: 140, column: 5)
!227 = !DILocation(line: 140, column: 5, scope: !226)
!228 = !DILocation(line: 140, column: 5, scope: !229)
!229 = distinct !DILexicalBlock(scope: !225, file: !133, line: 140, column: 5)
!230 = !DILocation(line: 143, column: 19, scope: !200)
!231 = !DILocation(line: 143, column: 28, scope: !200)
!232 = !DILocation(line: 143, column: 5, scope: !200)
!233 = !DILocation(line: 144, column: 17, scope: !200)
!234 = !DILocation(line: 144, column: 26, scope: !200)
!235 = !DILocation(line: 144, column: 31, scope: !200)
!236 = !DILocation(line: 144, column: 5, scope: !200)
!237 = !DILocation(line: 147, column: 5, scope: !200)
!238 = !DILocation(line: 147, column: 14, scope: !200)
!239 = !DILocation(line: 147, column: 20, scope: !200)
!240 = !DILocation(line: 148, column: 22, scope: !200)
!241 = !DILocation(line: 148, column: 31, scope: !200)
!242 = !DILocation(line: 148, column: 37, scope: !200)
!243 = !DILocation(line: 148, column: 46, scope: !200)
!244 = !DILocation(line: 148, column: 52, scope: !200)
!245 = !DILocation(line: 149, column: 10, scope: !200)
!246 = !DILocation(line: 149, column: 19, scope: !200)
!247 = !DILocation(line: 149, column: 25, scope: !200)
!248 = !DILocation(line: 150, column: 26, scope: !200)
!249 = !DILocation(line: 148, column: 5, scope: !200)
!250 = !DILocation(line: 152, column: 5, scope: !200)
!251 = !DILocation(line: 153, column: 1, scope: !200)
!252 = distinct !DISubprogram(name: "nn_sinproc_recv", scope: !133, file: !133, line: 155, type: !56, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !201)
!253 = !DILocalVariable(name: "self", arg: 1, scope: !252, file: !133, line: 155, type: !58)
!254 = !DILocation(line: 155, column: 49, scope: !252)
!255 = !DILocalVariable(name: "msg", arg: 2, scope: !252, file: !133, line: 155, type: !59)
!256 = !DILocation(line: 155, column: 70, scope: !252)
!257 = !DILocalVariable(name: "rc", scope: !252, file: !133, line: 157, type: !19)
!258 = !DILocation(line: 157, column: 9, scope: !252)
!259 = !DILocalVariable(name: "sinproc", scope: !252, file: !133, line: 158, type: !5)
!260 = !DILocation(line: 158, column: 24, scope: !252)
!261 = !DILocation(line: 160, column: 15, scope: !252)
!262 = !DILocation(line: 160, column: 13, scope: !252)
!263 = !DILocation(line: 163, column: 5, scope: !252)
!264 = !DILocation(line: 163, column: 5, scope: !265)
!265 = distinct !DILexicalBlock(scope: !266, file: !133, line: 163, column: 5)
!266 = distinct !DILexicalBlock(scope: !252, file: !133, line: 163, column: 5)
!267 = !DILocation(line: 163, column: 5, scope: !266)
!268 = !DILocation(line: 163, column: 5, scope: !269)
!269 = distinct !DILexicalBlock(scope: !265, file: !133, line: 163, column: 5)
!270 = !DILocation(line: 167, column: 29, scope: !252)
!271 = !DILocation(line: 167, column: 38, scope: !252)
!272 = !DILocation(line: 167, column: 48, scope: !252)
!273 = !DILocation(line: 167, column: 10, scope: !252)
!274 = !DILocation(line: 167, column: 8, scope: !252)
!275 = !DILocation(line: 168, column: 5, scope: !252)
!276 = !DILocation(line: 168, column: 5, scope: !277)
!277 = distinct !DILexicalBlock(scope: !278, file: !133, line: 168, column: 5)
!278 = distinct !DILexicalBlock(scope: !252, file: !133, line: 168, column: 5)
!279 = !DILocation(line: 168, column: 5, scope: !278)
!280 = !DILocation(line: 168, column: 5, scope: !281)
!281 = distinct !DILexicalBlock(scope: !277, file: !133, line: 168, column: 5)
!282 = !DILocation(line: 172, column: 9, scope: !283)
!283 = distinct !DILexicalBlock(scope: !252, file: !133, line: 172, column: 9)
!284 = !DILocation(line: 172, column: 18, scope: !283)
!285 = !DILocation(line: 172, column: 24, scope: !283)
!286 = !DILocation(line: 172, column: 9, scope: !252)
!287 = !DILocation(line: 173, column: 13, scope: !288)
!288 = distinct !DILexicalBlock(scope: !289, file: !133, line: 173, column: 13)
!289 = distinct !DILexicalBlock(scope: !283, file: !133, line: 172, column: 58)
!290 = !DILocation(line: 173, column: 13, scope: !289)
!291 = !DILocation(line: 174, column: 37, scope: !292)
!292 = distinct !DILexicalBlock(scope: !288, file: !133, line: 173, column: 67)
!293 = !DILocation(line: 174, column: 46, scope: !292)
!294 = !DILocation(line: 174, column: 57, scope: !292)
!295 = !DILocation(line: 174, column: 66, scope: !292)
!296 = !DILocation(line: 174, column: 72, scope: !292)
!297 = !DILocation(line: 174, column: 18, scope: !292)
!298 = !DILocation(line: 174, column: 16, scope: !292)
!299 = !DILocation(line: 175, column: 13, scope: !292)
!300 = !DILocation(line: 175, column: 13, scope: !301)
!301 = distinct !DILexicalBlock(scope: !302, file: !133, line: 175, column: 13)
!302 = distinct !DILexicalBlock(scope: !292, file: !133, line: 175, column: 13)
!303 = !DILocation(line: 175, column: 13, scope: !302)
!304 = !DILocation(line: 175, column: 13, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !133, line: 175, column: 13)
!306 = !DILocation(line: 176, column: 17, scope: !307)
!307 = distinct !DILexicalBlock(scope: !292, file: !133, line: 176, column: 17)
!308 = !DILocation(line: 176, column: 20, scope: !307)
!309 = !DILocation(line: 176, column: 17, scope: !292)
!310 = !DILocation(line: 177, column: 17, scope: !311)
!311 = distinct !DILexicalBlock(scope: !307, file: !133, line: 176, column: 26)
!312 = !DILocation(line: 177, column: 17, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !133, line: 177, column: 17)
!314 = distinct !DILexicalBlock(scope: !311, file: !133, line: 177, column: 17)
!315 = !DILocation(line: 177, column: 17, scope: !314)
!316 = !DILocation(line: 177, column: 17, scope: !317)
!317 = distinct !DILexicalBlock(scope: !313, file: !133, line: 177, column: 17)
!318 = !DILocation(line: 178, column: 31, scope: !311)
!319 = !DILocation(line: 178, column: 40, scope: !311)
!320 = !DILocation(line: 178, column: 46, scope: !311)
!321 = !DILocation(line: 178, column: 17, scope: !311)
!322 = !DILocation(line: 179, column: 34, scope: !311)
!323 = !DILocation(line: 179, column: 43, scope: !311)
!324 = !DILocation(line: 179, column: 49, scope: !311)
!325 = !DILocation(line: 179, column: 58, scope: !311)
!326 = !DILocation(line: 179, column: 64, scope: !311)
!327 = !DILocation(line: 180, column: 22, scope: !311)
!328 = !DILocation(line: 180, column: 31, scope: !311)
!329 = !DILocation(line: 180, column: 37, scope: !311)
!330 = !DILocation(line: 181, column: 42, scope: !311)
!331 = !DILocation(line: 179, column: 17, scope: !311)
!332 = !DILocation(line: 182, column: 17, scope: !311)
!333 = !DILocation(line: 182, column: 26, scope: !311)
!334 = !DILocation(line: 182, column: 32, scope: !311)
!335 = !DILocation(line: 183, column: 13, scope: !311)
!336 = !DILocation(line: 184, column: 9, scope: !292)
!337 = !DILocation(line: 185, column: 5, scope: !289)
!338 = !DILocation(line: 187, column: 30, scope: !339)
!339 = distinct !DILexicalBlock(scope: !252, file: !133, line: 187, column: 9)
!340 = !DILocation(line: 187, column: 39, scope: !339)
!341 = !DILocation(line: 187, column: 10, scope: !339)
!342 = !DILocation(line: 187, column: 9, scope: !252)
!343 = !DILocation(line: 188, column: 31, scope: !339)
!344 = !DILocation(line: 188, column: 40, scope: !339)
!345 = !DILocation(line: 188, column: 8, scope: !339)
!346 = !DILocation(line: 190, column: 5, scope: !252)
!347 = distinct !DISubprogram(name: "nn_sinproc_init", scope: !133, file: !133, line: 58, type: !348, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !201)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !5, !19, !350, !18}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !46, line: 81, size: 128, elements: !352)
!352 = !{!353, !363}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !351, file: !46, line: 82, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !46, line: 70, size: 128, elements: !357)
!357 = !{!358, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !356, file: !46, line: 75, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !350}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !356, file: !46, line: 78, baseType: !359, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !351, file: !46, line: 83, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !46, line: 83, flags: DIFlagFwdDecl)
!366 = !DILocalVariable(name: "self", arg: 1, scope: !347, file: !133, line: 58, type: !5)
!367 = !DILocation(line: 58, column: 42, scope: !347)
!368 = !DILocalVariable(name: "src", arg: 2, scope: !347, file: !133, line: 58, type: !19)
!369 = !DILocation(line: 58, column: 52, scope: !347)
!370 = !DILocalVariable(name: "epbase", arg: 3, scope: !347, file: !133, line: 59, type: !350)
!371 = !DILocation(line: 59, column: 23, scope: !347)
!372 = !DILocalVariable(name: "owner", arg: 4, scope: !347, file: !133, line: 59, type: !18)
!373 = !DILocation(line: 59, column: 46, scope: !347)
!374 = !DILocalVariable(name: "rcvbuf", scope: !347, file: !133, line: 61, type: !19)
!375 = !DILocation(line: 61, column: 9, scope: !347)
!376 = !DILocalVariable(name: "sz", scope: !347, file: !133, line: 62, type: !110)
!377 = !DILocation(line: 62, column: 12, scope: !347)
!378 = !DILocation(line: 64, column: 19, scope: !347)
!379 = !DILocation(line: 64, column: 25, scope: !347)
!380 = !DILocation(line: 64, column: 50, scope: !347)
!381 = !DILocation(line: 64, column: 55, scope: !347)
!382 = !DILocation(line: 64, column: 61, scope: !347)
!383 = !DILocation(line: 64, column: 5, scope: !347)
!384 = !DILocation(line: 65, column: 5, scope: !347)
!385 = !DILocation(line: 65, column: 11, scope: !347)
!386 = !DILocation(line: 65, column: 17, scope: !347)
!387 = !DILocation(line: 66, column: 5, scope: !347)
!388 = !DILocation(line: 66, column: 11, scope: !347)
!389 = !DILocation(line: 66, column: 17, scope: !347)
!390 = !DILocation(line: 67, column: 5, scope: !347)
!391 = !DILocation(line: 67, column: 11, scope: !347)
!392 = !DILocation(line: 67, column: 16, scope: !347)
!393 = !DILocation(line: 68, column: 24, scope: !347)
!394 = !DILocation(line: 68, column: 30, scope: !347)
!395 = !DILocation(line: 68, column: 68, scope: !347)
!396 = !DILocation(line: 68, column: 5, scope: !347)
!397 = !DILocation(line: 69, column: 8, scope: !347)
!398 = !DILocation(line: 70, column: 23, scope: !347)
!399 = !DILocation(line: 70, column: 5, scope: !347)
!400 = !DILocation(line: 71, column: 5, scope: !347)
!401 = !DILocation(line: 71, column: 5, scope: !402)
!402 = distinct !DILexicalBlock(scope: !403, file: !133, line: 71, column: 5)
!403 = distinct !DILexicalBlock(scope: !347, file: !133, line: 71, column: 5)
!404 = !DILocation(line: 71, column: 5, scope: !403)
!405 = !DILocation(line: 71, column: 5, scope: !406)
!406 = distinct !DILexicalBlock(scope: !402, file: !133, line: 71, column: 5)
!407 = !DILocation(line: 72, column: 24, scope: !347)
!408 = !DILocation(line: 72, column: 30, scope: !347)
!409 = !DILocation(line: 72, column: 40, scope: !347)
!410 = !DILocation(line: 72, column: 5, scope: !347)
!411 = !DILocation(line: 73, column: 19, scope: !347)
!412 = !DILocation(line: 73, column: 25, scope: !347)
!413 = !DILocation(line: 73, column: 5, scope: !347)
!414 = !DILocation(line: 74, column: 25, scope: !347)
!415 = !DILocation(line: 74, column: 31, scope: !347)
!416 = !DILocation(line: 74, column: 5, scope: !347)
!417 = !DILocation(line: 75, column: 25, scope: !347)
!418 = !DILocation(line: 75, column: 31, scope: !347)
!419 = !DILocation(line: 75, column: 5, scope: !347)
!420 = !DILocation(line: 76, column: 25, scope: !347)
!421 = !DILocation(line: 76, column: 31, scope: !347)
!422 = !DILocation(line: 76, column: 5, scope: !347)
!423 = !DILocation(line: 77, column: 25, scope: !347)
!424 = !DILocation(line: 77, column: 31, scope: !347)
!425 = !DILocation(line: 77, column: 5, scope: !347)
!426 = !DILocation(line: 78, column: 25, scope: !347)
!427 = !DILocation(line: 78, column: 31, scope: !347)
!428 = !DILocation(line: 78, column: 5, scope: !347)
