; ModuleID = './src/utils/chunk.c'
source_filename = "./src/utils/chunk.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_chunk = type { %struct.nn_atomic, i64, ptr }
%struct.nn_atomic = type { %struct.nn_mutex, i32 }
%struct.nn_mutex = type { %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [20 x i8] c"./src/utils/chunk.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [30 x i8] c"Assertion failed: %s (%s:%d)\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [26 x i8] c"n >= 0 && n <= self->size\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [59 x i8] c"nn_getl ((uint8_t*) p - sizeof (uint32_t)) == NN_CHUNK_TAG\00", align 1, !dbg !22

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @nn_chunk_alloc(i64 noundef %0, i32 noundef %1) #0 !dbg !104 {
  %3 = alloca ptr, align 8
  %4 = alloca i64, align 8
  %5 = alloca i32, align 4
  %6 = alloca i64, align 8
  %7 = alloca ptr, align 8
  store i64 %0, ptr %4, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/utils/chunk.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "03636f14a6e64917cc8f3ad60c0316a4")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 20)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 30)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 26)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 151, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 59)
!27 = distinct !DICompileUnit(language: DW_LANG_C11, file: !28, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !95, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "src/utils/chunk.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "03636f14a6e64917cc8f3ad60c0316a4")
!29 = !{!30, !31, !37, !41}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !33, line: 24, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !35, line: 38, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !33, line: 26, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !35, line: 42, baseType: !40)
!40 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunk", file: !2, line: 38, size: 512, elements: !43)
!43 = !{!44, !86, !90}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !42, file: !2, line: 41, baseType: !45, size: 384)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_atomic", file: !46, line: 38, size: 384, elements: !47)
!46 = !DIFile(filename: "./src/utils/atomic.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "05feb58b704f2e12cda95c62b9cebb8d")
!47 = !{!48, !84}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !45, file: !46, line: 40, baseType: !49, size: 320)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !50, line: 32, size: 320, elements: !51)
!50 = !DIFile(filename: "./src/utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !49, file: !50, line: 36, baseType: !53, size: 320)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !54, line: 72, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!55 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !54, line: 67, size: 320, elements: !56)
!56 = !{!57, !78, !82}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !55, file: !54, line: 69, baseType: !58, size: 320)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !59, line: 22, size: 320, elements: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!60 = !{!61, !63, !64, !65, !66, !67, !69, !70}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !58, file: !59, line: 24, baseType: !62, size: 32)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !58, file: !59, line: 25, baseType: !40, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !58, file: !59, line: 26, baseType: !62, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !58, file: !59, line: 28, baseType: !40, size: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !58, file: !59, line: 32, baseType: !62, size: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !58, file: !59, line: 34, baseType: !68, size: 16, offset: 160)
!68 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !58, file: !59, line: 35, baseType: !68, size: 16, offset: 176)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !58, file: !59, line: 36, baseType: !71, size: 128, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !72, line: 55, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !72, line: 51, size: 128, elements: !74)
!74 = !{!75, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !73, file: !72, line: 53, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !73, file: !72, line: 54, baseType: !76, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !55, file: !54, line: 70, baseType: !79, size: 320)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 40)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !55, file: !54, line: 71, baseType: !83, size: 64)
!83 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !45, file: !46, line: 42, baseType: !85, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !42, file: !2, line: 44, baseType: !87, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!89 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ffn", scope: !42, file: !2, line: 47, baseType: !91, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_chunk_free_fn", file: !2, line: 36, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !30}
!95 = !{!0, !7, !12, !17, !22}
!96 = !{i32 7, !"Dwarf Version", i32 5}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = !{i32 1, !"wchar_size", i32 4}
!99 = !{i32 8, !"PIC Level", i32 2}
!100 = !{i32 7, !"PIE Level", i32 2}
!101 = !{i32 7, !"uwtable", i32 2}
!102 = !{i32 7, !"frame-pointer", i32 2}
!103 = !{!"clang version 16.0.0"}
!104 = distinct !DISubprogram(name: "nn_chunk_alloc", scope: !2, file: !2, line: 58, type: !105, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !27, retainedNodes: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{!30, !87, !62}
!107 = !{}
!108 = !DILocalVariable(name: "size", arg: 1, scope: !104, file: !2, line: 58, type: !87)
!109 = !DILocation(line: 58, column: 30, scope: !104)
!110 = !DILocalVariable(name: "type", arg: 2, scope: !104, file: !2, line: 58, type: !62)
!111 = !DILocation(line: 58, column: 40, scope: !104)
!112 = !DILocalVariable(name: "sz", scope: !104, file: !2, line: 60, type: !87)
!113 = !DILocation(line: 60, column: 12, scope: !104)
!114 = !DILocalVariable(name: "self", scope: !104, file: !2, line: 61, type: !41)
!115 = !DILocation(line: 61, column: 22, scope: !104)
!116 = !DILocation(line: 64, column: 61, scope: !104)
!117 = !DILocation(line: 64, column: 59, scope: !104)
!118 = !DILocation(line: 64, column: 8, scope: !104)
!119 = !DILocation(line: 65, column: 13, scope: !104)
!120 = !DILocation(line: 65, column: 5, scope: !104)
!121 = !DILocation(line: 67, column: 16, scope: !122)
!122 = distinct !DILexicalBlock(scope: !104, file: !2, line: 65, column: 19)
!123 = !DILocation(line: 67, column: 14, scope: !122)
!124 = !DILocation(line: 68, column: 9, scope: !122)
!125 = !DILocation(line: 70, column: 9, scope: !122)
!126 = !DILocation(line: 72, column: 5, scope: !104)
!127 = !DILocation(line: 72, column: 5, scope: !128)
!128 = distinct !DILexicalBlock(scope: !129, file: !2, line: 72, column: 5)
!129 = distinct !DILexicalBlock(scope: !104, file: !2, line: 72, column: 5)
!130 = !DILocation(line: 72, column: 5, scope: !129)
!131 = !DILocation(line: 72, column: 5, scope: !132)
!132 = distinct !DILexicalBlock(scope: !128, file: !2, line: 72, column: 5)
!133 = !DILocation(line: 75, column: 22, scope: !104)
!134 = !DILocation(line: 75, column: 28, scope: !104)
!135 = !DILocation(line: 75, column: 5, scope: !104)
!136 = !DILocation(line: 76, column: 18, scope: !104)
!137 = !DILocation(line: 76, column: 5, scope: !104)
!138 = !DILocation(line: 76, column: 11, scope: !104)
!139 = !DILocation(line: 76, column: 16, scope: !104)
!140 = !DILocation(line: 77, column: 5, scope: !104)
!141 = !DILocation(line: 77, column: 11, scope: !104)
!142 = !DILocation(line: 77, column: 15, scope: !104)
!143 = !DILocation(line: 81, column: 39, scope: !104)
!144 = !DILocation(line: 81, column: 44, scope: !104)
!145 = !DILocation(line: 81, column: 5, scope: !104)
!146 = !DILocation(line: 84, column: 41, scope: !104)
!147 = !DILocation(line: 84, column: 46, scope: !104)
!148 = !DILocation(line: 84, column: 53, scope: !104)
!149 = !DILocation(line: 84, column: 5, scope: !104)
!150 = !DILocation(line: 86, column: 25, scope: !104)
!151 = !DILocation(line: 86, column: 30, scope: !104)
!152 = !DILocation(line: 86, column: 36, scope: !104)
!153 = !DILocation(line: 86, column: 5, scope: !104)
!154 = !DILocation(line: 87, column: 1, scope: !104)
!155 = distinct !DISubprogram(name: "nn_chunk_default_free", scope: !2, file: !2, line: 158, type: !93, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !107)
!156 = !DILocalVariable(name: "p", arg: 1, scope: !155, file: !2, line: 158, type: !30)
