; ModuleID = './src/protocols/survey/respondent.c'
source_filename = "./src/protocols/survey/respondent.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_respondent = type { %struct.nn_xrespondent, i32, i32 }
%struct.nn_xrespondent = type { %struct.nn_sockbase, %struct.nn_excl }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_excl = type { ptr, ptr, ptr }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@nn_respondent_socktype_struct = internal global %struct.nn_socktype { i32 1, i32 97, i32 0, ptr @nn_respondent_create, ptr @nn_xrespondent_ispeer, %struct.nn_list_item { ptr inttoptr (i64 -1 to ptr), ptr inttoptr (i64 -1 to ptr) } }, align 8, !dbg !0
@nn_respondent_socktype = dso_local global ptr @nn_respondent_socktype_struct, align 8, !dbg !101
@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !125
@.str.1 = private unnamed_addr constant [36 x i8] c"./src/protocols/survey/respondent.c\00", align 1, !dbg !130

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_respondent_socktype_struct", scope: !2, file: !7, line: 178, type: !104, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !100, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/protocols/survey/respondent.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "27feeff3b062c3d661b537a9e99d88dd")
!4 = !{!5, !98, !32}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_respondent", file: !7, line: 41, size: 384, elements: !8)
!7 = !DIFile(filename: "./src/protocols/survey/respondent.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "27feeff3b062c3d661b537a9e99d88dd")
!8 = !{!9, !93, !97}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "xrespondent", scope: !6, file: !7, line: 42, baseType: !10, size: 320)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xrespondent", file: !11, line: 32, size: 320, elements: !12)
!11 = !DIFile(filename: "./src/protocols/survey/xrespondent.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "5c624dc14d3da1cc6b44dc29a5bcdc99")
!12 = !{!13, !86}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !10, file: !11, line: 33, baseType: !14, size: 128)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !15, line: 123, size: 128, elements: !16)
!15 = !DIFile(filename: "./src/protocols/survey/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!16 = !{!17, !83}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !14, file: !15, line: 124, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !15, line: 84, size: 704, elements: !21)
!21 = !{!22, !27, !28, !35, !39, !40, !41, !45, !67, !68, !77}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !20, file: !15, line: 87, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !20, file: !15, line: 90, baseType: !23, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !20, file: !15, line: 97, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !26, !33}
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !15, line: 56, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !20, file: !15, line: 98, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !26, !33}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !20, file: !15, line: 99, baseType: !36, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !20, file: !15, line: 100, baseType: !36, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !20, file: !15, line: 104, baseType: !42, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!32, !26}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !20, file: !15, line: 108, baseType: !46, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!32, !26, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !51, line: 30, size: 512, elements: !52)
!51 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!52 = !{!53, !66}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !50, file: !51, line: 33, baseType: !54, size: 256)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !55, line: 39, size: 256, elements: !56)
!55 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !54, file: !55, line: 40, baseType: !58, size: 256)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !60, line: 24, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !62, line: 38, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !50, file: !51, line: 36, baseType: !54, size: 256, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !20, file: !15, line: 112, baseType: !46, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !20, file: !15, line: 115, baseType: !69, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!32, !26, !32, !32, !72, !74}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!76 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !20, file: !15, line: 119, baseType: !78, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!32, !26, !32, !32, !81, !82}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !14, file: !15, line: 125, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !15, line: 125, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !10, file: !11, line: 34, baseType: !87, size: 192, offset: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_excl", file: !88, line: 33, size: 192, elements: !89)
!88 = !DIFile(filename: "./src/protocols/survey/../utils/excl.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f0be91890d61f5b1f69020e9c0441656")
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !87, file: !88, line: 37, baseType: !33, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "inpipe", scope: !87, file: !88, line: 40, baseType: !33, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "outpipe", scope: !87, file: !88, line: 43, baseType: !33, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "surveyid", scope: !6, file: !7, line: 43, baseType: !94, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !60, line: 26, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 42, baseType: !96)
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !6, file: !7, line: 44, baseType: !94, size: 32, offset: 352)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!100 = !{!101, !0, !125, !130, !135, !137, !142, !147, !152}
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "nn_respondent_socktype", scope: !2, file: !7, line: 187, type: !103, isLocal: false, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !15, line: 160, size: 384, elements: !105)
!105 = !{!106, !107, !108, !109, !114, !118}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !104, file: !15, line: 163, baseType: !32, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !104, file: !15, line: 164, baseType: !32, size: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !15, line: 167, baseType: !32, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !104, file: !15, line: 173, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!32, !81, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !104, file: !15, line: 179, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!32, !32}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !104, file: !15, line: 183, baseType: !119, size: 128, offset: 256)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !120, line: 26, size: 128, elements: !121)
!120 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !120, line: 27, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !120, line: 28, baseType: !123, size: 64, offset: 64)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !7, line: 171, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 184, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 23)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !7, line: 171, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 288, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 36)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "nn_respondent_sockbase_vfptr", scope: !2, file: !7, line: 57, type: !19, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !7, line: 118, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 240, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 30)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !7, line: 118, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 272, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 34)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !7, line: 130, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 136, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 17)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !7, line: 155, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 400, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 50)
!157 = !{i32 7, !"Dwarf Version", i32 5}
!158 = !{i32 2, !"Debug Info Version", i32 3}
!159 = !{i32 1, !"wchar_size", i32 4}
!160 = !{i32 8, !"PIC Level", i32 2}
!161 = !{i32 7, !"PIE Level", i32 2}
!162 = !{i32 7, !"uwtable", i32 2}
!163 = !{i32 7, !"frame-pointer", i32 2}
!164 = !{!"clang version 16.0.0"}
!165 = distinct !DISubprogram(name: "nn_respondent_create", scope: !7, file: !7, line: 166, type: !111, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !166)
!166 = !{}
!167 = !DILocalVariable(name: "hint", arg: 1, scope: !165, file: !7, line: 166, type: !81)
!168 = !DILocation(line: 166, column: 40, scope: !165)
!169 = !DILocalVariable(name: "sockbase", arg: 2, scope: !165, file: !7, line: 166, type: !113)
!170 = !DILocation(line: 166, column: 67, scope: !165)
!171 = !DILocalVariable(name: "self", scope: !165, file: !7, line: 168, type: !5)
!172 = !DILocation(line: 168, column: 27, scope: !165)
!173 = !DILocation(line: 170, column: 12, scope: !165)
!174 = !DILocation(line: 170, column: 10, scope: !165)
!175 = !DILocation(line: 171, column: 5, scope: !165)
!176 = !DILocation(line: 171, column: 5, scope: !177)
!177 = distinct !DILexicalBlock(scope: !178, file: !7, line: 171, column: 5)
!178 = distinct !DILexicalBlock(scope: !165, file: !7, line: 171, column: 5)
!179 = !DILocation(line: 171, column: 5, scope: !178)
!180 = !DILocation(line: 171, column: 5, scope: !181)
!181 = distinct !DILexicalBlock(scope: !177, file: !7, line: 171, column: 5)
!182 = !DILocation(line: 172, column: 25, scope: !165)
!183 = !DILocation(line: 172, column: 62, scope: !165)
!184 = !DILocation(line: 172, column: 5, scope: !165)
!185 = !DILocation(line: 173, column: 18, scope: !165)
