; ModuleID = './src/protocols/survey/surveyor.c'
source_filename = "./src/protocols/survey/surveyor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_surveyor = type { %struct.nn_xsurveyor, %struct.nn_fsm, i32, i32, %struct.nn_timer, %struct.nn_msg, i32 }
%struct.nn_xsurveyor = type { %struct.nn_sockbase, %struct.nn_dist, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_dist = type { i64, %struct.nn_list }
%struct.nn_list = type { ptr, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_timer = type { %struct.nn_fsm, i32, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_timer, %struct.nn_fsm_event, ptr, i32 }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }
%struct.nn_worker_timer = type { ptr, %struct.nn_timerset_hndl }
%struct.nn_timerset_hndl = type { %struct.nn_list_item, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_surveyor_socktype_struct", scope: !2, file: !7, line: 477, type: !299, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !295, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/protocols/survey/surveyor.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8e03d99de80aebdd81e5a71ba2ee1941")
!4 = !{!5, !293, !32, !294}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_surveyor", file: !7, line: 57, size: 6400, elements: !8)
!7 = !DIFile(filename: "./src/protocols/survey/surveyor.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8e03d99de80aebdd81e5a71ba2ee1941")
!8 = !{!9, !125, !155, !156, !160, !291, !292}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "xsurveyor", scope: !6, file: !7, line: 60, baseType: !10, size: 3456)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xsurveyor", file: !11, line: 39, size: 3456, elements: !12)
!11 = !DIFile(filename: "./src/protocols/survey/xsurveyor.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "39d817f0e27772e0ca18c7c7ec6f6c26")
!12 = !{!13, !86, !102}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !10, file: !11, line: 42, baseType: !14, size: 128)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !15, line: 123, size: 128, elements: !16)
!15 = !DIFile(filename: "./src/protocols/survey/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!16 = !{!17, !83}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !14, file: !15, line: 124, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !15, line: 84, size: 704, elements: !21)
!21 = !{!22, !27, !28, !35, !39, !40, !41, !45, !67, !68, !77}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !20, file: !15, line: 87, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !20, file: !15, line: 90, baseType: !23, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !20, file: !15, line: 97, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !26, !33}
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !15, line: 56, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !20, file: !15, line: 98, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !26, !33}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !20, file: !15, line: 99, baseType: !36, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !20, file: !15, line: 100, baseType: !36, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !20, file: !15, line: 104, baseType: !42, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!32, !26}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !20, file: !15, line: 108, baseType: !46, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!32, !26, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !51, line: 30, size: 512, elements: !52)
!51 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!52 = !{!53, !66}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !50, file: !51, line: 33, baseType: !54, size: 256)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !55, line: 39, size: 256, elements: !56)
!55 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !54, file: !55, line: 40, baseType: !58, size: 256)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !60, line: 24, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !62, line: 38, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !50, file: !51, line: 36, baseType: !54, size: 256, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !20, file: !15, line: 112, baseType: !46, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !20, file: !15, line: 115, baseType: !69, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!32, !26, !32, !32, !72, !74}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!76 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !20, file: !15, line: 119, baseType: !78, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!32, !26, !32, !32, !81, !82}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !14, file: !15, line: 125, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !15, line: 125, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "outpipes", scope: !10, file: !11, line: 45, baseType: !87, size: 192, offset: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_dist", file: !88, line: 37, size: 192, elements: !89)
!88 = !DIFile(filename: "./src/protocols/survey/../utils/dist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8b675b0838905739d217dd53d5a3b3af")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !87, file: !88, line: 38, baseType: !74, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !87, file: !88, line: 39, baseType: !92, size: 128, offset: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !93, line: 31, size: 128, elements: !94)
!93 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!94 = !{!95, !101}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !92, file: !93, line: 32, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !93, line: 26, size: 128, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !93, line: 27, baseType: !96, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !97, file: !93, line: 28, baseType: !96, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !92, file: !93, line: 33, baseType: !96, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "inpipes", scope: !10, file: !11, line: 48, baseType: !103, size: 3136, offset: 320)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !104, line: 37, size: 3136, elements: !105)
!104 = !DIFile(filename: "./src/protocols/survey/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !103, file: !104, line: 38, baseType: !107, size: 3136)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !108, line: 45, size: 3136, elements: !109)
!108 = !DIFile(filename: "./src/protocols/survey/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!109 = !{!110, !124}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !107, file: !108, line: 46, baseType: !111, size: 3072)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 3072, elements: !122)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !108, line: 40, size: 192, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !112, file: !108, line: 41, baseType: !92, size: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !112, file: !108, line: 42, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !108, line: 34, size: 256, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !117, file: !108, line: 35, baseType: !33, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !117, file: !108, line: 36, baseType: !32, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !117, file: !108, line: 37, baseType: !97, size: 128, offset: 128)
!122 = !{!123}
!123 = !DISubrange(count: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !107, file: !108, line: 47, baseType: !32, size: 32, offset: 3072)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !6, file: !7, line: 63, baseType: !126, size: 640, offset: 3456)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !127, line: 66, size: 640, elements: !128)
!127 = !DIFile(filename: "./src/protocols/survey/../../aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!128 = !{!129, !135, !136, !137, !138, !139, !142}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !126, file: !127, line: 67, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !127, line: 58, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !32, !32, !81}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !126, file: !127, line: 68, baseType: !32, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !126, file: !127, line: 69, baseType: !32, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !126, file: !127, line: 70, baseType: !81, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !126, file: !127, line: 71, baseType: !134, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !126, file: !127, line: 72, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !15, line: 32, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !126, file: !127, line: 73, baseType: !143, size: 320, offset: 320)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !127, line: 34, size: 320, elements: !144)
!144 = !{!145, !146, !147, !148, !149}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !143, file: !127, line: 35, baseType: !134, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !143, file: !127, line: 36, baseType: !32, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !143, file: !127, line: 37, baseType: !81, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !127, line: 38, baseType: !32, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !143, file: !127, line: 39, baseType: !150, size: 64, offset: 256)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !151, line: 33, size: 64, elements: !152)
!151 = !DIFile(filename: "./src/protocols/survey/../../aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !151, line: 34, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !6, file: !7, line: 64, baseType: !32, size: 32, offset: 4096)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "surveyid", scope: !6, file: !7, line: 67, baseType: !157, size: 32, offset: 4128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !60, line: 26, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 42, baseType: !159)
!159 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !6, file: !7, line: 70, baseType: !161, size: 1664, offset: 4160)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timer", file: !162, line: 32, size: 1664, elements: !163)
!162 = !DIFile(filename: "./src/protocols/survey/../../aio/timer.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "36b8c8892aa99fc49b85b12a9caf893a")
!163 = !{!164, !165, !166, !172, !173, !186, !187, !290}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !161, file: !162, line: 33, baseType: !126, size: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !161, file: !162, line: 34, baseType: !32, size: 32, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "start_task", scope: !161, file: !162, line: 35, baseType: !167, size: 128, offset: 704)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !168, line: 48, size: 128, elements: !169)
!168 = !DIFile(filename: "./src/protocols/survey/../../aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !167, file: !168, line: 49, baseType: !134, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !167, file: !168, line: 50, baseType: !150, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "stop_task", scope: !161, file: !162, line: 36, baseType: !167, size: 128, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "wtimer", scope: !161, file: !162, line: 37, baseType: !174, size: 256, offset: 960)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !175, line: 37, size: 256, elements: !176)
!175 = !DIFile(filename: "./src/protocols/survey/../../aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !174, file: !175, line: 38, baseType: !134, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !174, file: !175, line: 39, baseType: !179, size: 192, offset: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !180, line: 32, size: 192, elements: !181)
!180 = !DIFile(filename: "./src/protocols/survey/../../aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !179, file: !180, line: 33, baseType: !97, size: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !179, file: !180, line: 34, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !60, line: 27, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !62, line: 45, baseType: !76)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !161, file: !162, line: 38, baseType: !143, size: 320, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !161, file: !162, line: 39, baseType: !188, size: 64, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !168, line: 53, size: 1408, elements: !190)
!190 = !{!191, !227, !232, !233, !239, !266, !267, !277}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !189, file: !168, line: 54, baseType: !192, size: 320)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !193, line: 32, size: 320, elements: !194)
!193 = !DIFile(filename: "./src/protocols/survey/../../aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !192, file: !193, line: 36, baseType: !196, size: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !197, line: 72, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !197, line: 67, size: 320, elements: !199)
!199 = !{!200, !220, !225}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !198, file: !197, line: 69, baseType: !201, size: 320)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !202, line: 22, size: 320, elements: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!203 = !{!204, !205, !206, !207, !208, !209, !211, !212}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !201, file: !202, line: 24, baseType: !32, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !201, file: !202, line: 25, baseType: !159, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !201, file: !202, line: 26, baseType: !32, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !201, file: !202, line: 28, baseType: !159, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !201, file: !202, line: 32, baseType: !32, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !201, file: !202, line: 34, baseType: !210, size: 16, offset: 160)
!210 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !201, file: !202, line: 35, baseType: !210, size: 16, offset: 176)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !201, file: !202, line: 36, baseType: !213, size: 128, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !214, line: 55, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !214, line: 51, size: 128, elements: !216)
!216 = !{!217, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !215, file: !214, line: 53, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !215, file: !214, line: 54, baseType: !218, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !198, file: !197, line: 70, baseType: !221, size: 320)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 320, elements: !223)
!222 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!223 = !{!224}
!224 = !DISubrange(count: 40)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !198, file: !197, line: 71, baseType: !226, size: 64)
!226 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !189, file: !168, line: 55, baseType: !228, size: 128, offset: 320)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !151, line: 37, size: 128, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !228, file: !151, line: 38, baseType: !154, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !228, file: !151, line: 39, baseType: !154, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !189, file: !168, line: 56, baseType: !150, size: 64, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !189, file: !168, line: 57, baseType: !234, size: 64, offset: 512)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !235, line: 25, size: 64, elements: !236)
!235 = !DIFile(filename: "src/utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !234, file: !235, line: 26, baseType: !32, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !234, file: !235, line: 27, baseType: !32, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !189, file: !168, line: 58, baseType: !240, size: 320, offset: 576)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !241, line: 31, size: 320, elements: !242)
!241 = !DIFile(filename: "./src/protocols/survey/../../aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!242 = !{!243, !244, !245, !246, !254, !265}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !240, file: !241, line: 34, baseType: !32, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !240, file: !241, line: 37, baseType: !32, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !240, file: !241, line: 40, baseType: !32, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !240, file: !241, line: 43, baseType: !247, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !249, line: 36, size: 64, elements: !250)
!249 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!250 = !{!251, !252, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !248, file: !249, line: 38, baseType: !32, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !248, file: !249, line: 39, baseType: !210, size: 16, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !248, file: !249, line: 40, baseType: !210, size: 16, offset: 48)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !240, file: !241, line: 52, baseType: !255, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !241, line: 48, size: 128, elements: !257)
!257 = !{!258, !263, !264}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !256, file: !241, line: 49, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !241, line: 27, size: 32, elements: !261)
!261 = !{!262}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !260, file: !241, line: 28, baseType: !32, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !256, file: !241, line: 50, baseType: !32, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !241, line: 51, baseType: !32, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !240, file: !241, line: 55, baseType: !32, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !189, file: !168, line: 59, baseType: !260, size: 32, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !189, file: !168, line: 60, baseType: !268, size: 256, offset: 960)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !180, line: 37, size: 256, elements: !269)
!269 = !{!270, !276}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !268, file: !180, line: 38, baseType: !271, size: 128)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !272, line: 31, size: 128, elements: !273)
!272 = !DIFile(filename: "./src/protocols/survey/../../aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !271, file: !272, line: 33, baseType: !184, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !271, file: !272, line: 34, baseType: !184, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !268, file: !180, line: 39, baseType: !92, size: 128, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !189, file: !168, line: 61, baseType: !278, size: 192, offset: 1216)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !279, line: 25, size: 192, elements: !280)
!279 = !DIFile(filename: "src/utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!280 = !{!281, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !278, file: !279, line: 27, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !284, line: 28, baseType: !285)
!284 = !DIFile(filename: "./src/protocols/survey/../../aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!285 = !DISubroutineType(types: !286)
!286 = !{null, !81}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !278, file: !279, line: 28, baseType: !81, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !278, file: !279, line: 29, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !197, line: 27, baseType: !76)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !161, file: !162, line: 40, baseType: !32, size: 32, offset: 1600)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tosend", scope: !6, file: !7, line: 73, baseType: !50, size: 512, offset: 5824)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !6, file: !7, line: 76, baseType: !32, size: 32, offset: 6336)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!295 = !{!296, !0, !314, !319, !324, !329, !334, !339, !341}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "nn_surveyor_socktype", scope: !2, file: !7, line: 486, type: !298, isLocal: false, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !15, line: 160, size: 384, elements: !300)
!300 = !{!301, !302, !303, !304, !309, !313}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !299, file: !15, line: 163, baseType: !32, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !299, file: !15, line: 164, baseType: !32, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !15, line: 167, baseType: !32, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !299, file: !15, line: 173, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!32, !81, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !299, file: !15, line: 179, baseType: !310, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!32, !32}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !299, file: !15, line: 183, baseType: !97, size: 128, offset: 256)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !7, line: 470, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 184, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 23)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !7, line: 470, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 272, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 34)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !7, line: 341, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 240, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 30)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !7, line: 341, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 16, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 2)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !7, line: 360, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 136, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 17)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "nn_surveyor_sockbase_vfptr", scope: !2, file: !7, line: 97, type: !19, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !7, line: 194, type: !321, isLocal: true, isDefinition: true)
!343 = !{i32 7, !"Dwarf Version", i32 5}
!344 = !{i32 2, !"Debug Info Version", i32 3}
!345 = !{i32 1, !"wchar_size", i32 4}
!346 = !{i32 8, !"PIC Level", i32 2}
!347 = !{i32 7, !"PIE Level", i32 2}
!348 = !{i32 7, !"uwtable", i32 2}
!349 = !{i32 7, !"frame-pointer", i32 2}
!350 = !{!"clang version 16.0.0"}
!351 = distinct !DISubprogram(name: "nn_surveyor_create", scope: !7, file: !7, line: 465, type: !306, scopeLine: 466, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !352)
!352 = !{}
!353 = !DILocalVariable(name: "hint", arg: 1, scope: !351, file: !7, line: 465, type: !81)
!354 = !DILocation(line: 465, column: 38, scope: !351)
!355 = !DILocalVariable(name: "sockbase", arg: 2, scope: !351, file: !7, line: 465, type: !308)
!356 = !DILocation(line: 465, column: 65, scope: !351)
!357 = !DILocalVariable(name: "self", scope: !351, file: !7, line: 467, type: !5)
!358 = !DILocation(line: 467, column: 25, scope: !351)
!359 = !DILocation(line: 469, column: 12, scope: !351)
!360 = !DILocation(line: 469, column: 10, scope: !351)
!361 = !DILocation(line: 470, column: 5, scope: !351)
!362 = !DILocation(line: 470, column: 5, scope: !363)
!363 = distinct !DILexicalBlock(scope: !364, file: !7, line: 470, column: 5)
!364 = distinct !DILexicalBlock(scope: !351, file: !7, line: 470, column: 5)
!365 = !DILocation(line: 470, column: 5, scope: !364)
!366 = !DILocation(line: 470, column: 5, scope: !367)
!367 = distinct !DILexicalBlock(scope: !363, file: !7, line: 470, column: 5)
!368 = !DILocation(line: 471, column: 23, scope: !351)
!369 = !DILocation(line: 471, column: 58, scope: !351)
!370 = !DILocation(line: 471, column: 5, scope: !351)
!371 = !DILocation(line: 472, column: 18, scope: !351)
!372 = !DILocation(line: 472, column: 24, scope: !351)
!373 = !DILocation(line: 472, column: 34, scope: !351)
