; ModuleID = './src/protocols/survey/xrespondent.c'
source_filename = "./src/protocols/survey/xrespondent.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_xrespondent = type { %struct.nn_sockbase, %struct.nn_excl }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_excl = type { ptr, ptr, ptr }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [17 x i8] c"%s [%d] (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [37 x i8] c"./src/protocols/survey/xrespondent.c\00", align 1, !dbg !7
@nn_xrespondent_socktype_struct = internal global %struct.nn_socktype { i32 2, i32 97, i32 0, ptr @nn_xrespondent_create, ptr @nn_xrespondent_ispeer, %struct.nn_list_item { ptr inttoptr (i64 -1 to ptr), ptr inttoptr (i64 -1 to ptr) } }, align 8, !dbg !12
@nn_xrespondent_socktype = dso_local global ptr @nn_xrespondent_socktype_struct, align 8, !dbg !103
@.str.2 = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !127

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/protocols/survey/xrespondent.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "07f9c4263d2177bfd0666169506e39bf")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 17)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 37)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "nn_xrespondent_socktype_struct", scope: !14, file: !2, line: 178, type: !106, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !15, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !16, globals: !102, splitDebugInlining: false, nameTableKind: None)
!15 = !DIFile(filename: "src/protocols/survey/xrespondent.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "07f9c4263d2177bfd0666169506e39bf")
!16 = !{!17, !101, !40}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xrespondent", file: !19, line: 32, size: 320, elements: !20)
!19 = !DIFile(filename: "./src/protocols/survey/xrespondent.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "5c624dc14d3da1cc6b44dc29a5bcdc99")
!20 = !{!21, !94}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !18, file: !19, line: 33, baseType: !22, size: 128)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !23, line: 123, size: 128, elements: !24)
!23 = !DIFile(filename: "./src/protocols/survey/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!24 = !{!25, !91}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !22, file: !23, line: 124, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !23, line: 84, size: 704, elements: !29)
!29 = !{!30, !35, !36, !43, !47, !48, !49, !53, !75, !76, !85}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !28, file: !23, line: 87, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !28, file: !23, line: 90, baseType: !31, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !28, file: !23, line: 97, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !34, !41}
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !23, line: 56, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !28, file: !23, line: 98, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !34, !41}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !28, file: !23, line: 99, baseType: !44, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !28, file: !23, line: 100, baseType: !44, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !28, file: !23, line: 104, baseType: !50, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!40, !34}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !28, file: !23, line: 108, baseType: !54, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!40, !34, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !59, line: 30, size: 512, elements: !60)
!59 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!60 = !{!61, !74}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !58, file: !59, line: 33, baseType: !62, size: 256)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !63, line: 39, size: 256, elements: !64)
!63 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !62, file: !63, line: 40, baseType: !66, size: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, elements: !72)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !68, line: 24, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !70, line: 38, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !58, file: !59, line: 36, baseType: !62, size: 256, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !28, file: !23, line: 112, baseType: !54, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !28, file: !23, line: 115, baseType: !77, size: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!40, !34, !40, !40, !80, !82}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!84 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !28, file: !23, line: 119, baseType: !86, size: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!40, !34, !40, !40, !89, !90}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !22, file: !23, line: 125, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !23, line: 125, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !18, file: !19, line: 34, baseType: !95, size: 192, offset: 128)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_excl", file: !96, line: 33, size: 192, elements: !97)
!96 = !DIFile(filename: "./src/protocols/survey/../utils/excl.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f0be91890d61f5b1f69020e9c0441656")
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !95, file: !96, line: 37, baseType: !41, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "inpipe", scope: !95, file: !96, line: 40, baseType: !41, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "outpipe", scope: !95, file: !96, line: 43, baseType: !41, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!102 = !{!0, !7, !103, !12, !127, !132}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "nn_xrespondent_socktype", scope: !14, file: !2, line: 187, type: !105, isLocal: false, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !23, line: 160, size: 384, elements: !107)
!107 = !{!108, !109, !110, !111, !116, !120}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !106, file: !23, line: 163, baseType: !40, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !106, file: !23, line: 164, baseType: !40, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !106, file: !23, line: 167, baseType: !40, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !106, file: !23, line: 173, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!40, !89, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !106, file: !23, line: 179, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!40, !40}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !106, file: !23, line: 183, baseType: !121, size: 128, offset: 256)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !122, line: 26, size: 128, elements: !123)
!122 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !122, line: 27, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !122, line: 28, baseType: !125, size: 64, offset: 64)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 23)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "nn_xrespondent_sockbase_vfptr", scope: !14, file: !2, line: 38, type: !27, isLocal: true, isDefinition: true)
!134 = !{i32 7, !"Dwarf Version", i32 5}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = !{i32 1, !"wchar_size", i32 4}
!137 = !{i32 8, !"PIC Level", i32 2}
!138 = !{i32 7, !"PIE Level", i32 2}
!139 = !{i32 7, !"uwtable", i32 2}
!140 = !{i32 7, !"frame-pointer", i32 2}
!141 = !{!"clang version 16.0.0"}
!142 = distinct !DISubprogram(name: "nn_xrespondent_init", scope: !2, file: !2, line: 52, type: !143, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !17, !26, !89}
!145 = !{}
!146 = !DILocalVariable(name: "self", arg: 1, scope: !142, file: !2, line: 52, type: !17)
!147 = !DILocation(line: 52, column: 50, scope: !142)
!148 = !DILocalVariable(name: "vfptr", arg: 2, scope: !142, file: !2, line: 53, type: !26)
!149 = !DILocation(line: 53, column: 37, scope: !142)
!150 = !DILocalVariable(name: "hint", arg: 3, scope: !142, file: !2, line: 53, type: !89)
!151 = !DILocation(line: 53, column: 50, scope: !142)
!152 = !DILocation(line: 55, column: 24, scope: !142)
!153 = !DILocation(line: 55, column: 30, scope: !142)
!154 = !DILocation(line: 55, column: 40, scope: !142)
!155 = !DILocation(line: 55, column: 47, scope: !142)
!156 = !DILocation(line: 55, column: 5, scope: !142)
!157 = !DILocation(line: 56, column: 20, scope: !142)
!158 = !DILocation(line: 56, column: 26, scope: !142)
!159 = !DILocation(line: 56, column: 5, scope: !142)
!160 = !DILocation(line: 57, column: 1, scope: !142)
!161 = distinct !DISubprogram(name: "nn_xrespondent_term", scope: !2, file: !2, line: 59, type: !162, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !145)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !17}
!164 = !DILocalVariable(name: "self", arg: 1, scope: !161, file: !2, line: 59, type: !17)
!165 = !DILocation(line: 59, column: 50, scope: !161)
!166 = !DILocation(line: 61, column: 20, scope: !161)
!167 = !DILocation(line: 61, column: 26, scope: !161)
!168 = !DILocation(line: 61, column: 5, scope: !161)
!169 = !DILocation(line: 62, column: 24, scope: !161)
!170 = !DILocation(line: 62, column: 30, scope: !161)
!171 = !DILocation(line: 62, column: 5, scope: !161)
!172 = !DILocation(line: 63, column: 1, scope: !161)
!173 = distinct !DISubprogram(name: "nn_xrespondent_add", scope: !2, file: !2, line: 75, type: !38, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !145)
!174 = !DILocalVariable(name: "self", arg: 1, scope: !173, file: !2, line: 75, type: !34)
!175 = !DILocation(line: 75, column: 45, scope: !173)
!176 = !DILocalVariable(name: "pipe", arg: 2, scope: !173, file: !2, line: 75, type: !41)
!177 = !DILocation(line: 75, column: 67, scope: !173)
!178 = !DILocation(line: 77, column: 26, scope: !173)
!179 = !DILocation(line: 77, column: 75, scope: !173)
!180 = !DILocation(line: 78, column: 9, scope: !173)
!181 = !DILocation(line: 77, column: 12, scope: !173)
!182 = !DILocation(line: 77, column: 5, scope: !173)
!183 = distinct !DISubprogram(name: "nn_xrespondent_rm", scope: !2, file: !2, line: 81, type: !45, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !145)
!184 = !DILocalVariable(name: "self", arg: 1, scope: !183, file: !2, line: 81, type: !34)
