; ModuleID = './src/protocols/survey/xsurveyor.c'
source_filename = "./src/protocols/survey/xsurveyor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_xsurveyor = type { %struct.nn_sockbase, %struct.nn_dist, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_dist = type { i64, %struct.nn_list }
%struct.nn_list = type { ptr, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_xsurveyor_data = type { ptr, %struct.nn_dist_data, %struct.nn_fq_data }
%struct.nn_dist_data = type { %struct.nn_list_item, ptr }
%struct.nn_fq_data = type { %struct.nn_priolist_data }
%struct.nn_priolist_data = type { ptr, i32, %struct.nn_list_item }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"./src/protocols/survey/xsurveyor.c\00", align 1, !dbg !7

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/protocols/survey/xsurveyor.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "baff0fe1d6c1434c60b4d9b59ad945d3")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 35)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 30)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 34)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "nn_xsurveyor_socktype_struct", scope: !24, file: !2, line: 210, type: !148, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C11, file: !25, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !26, globals: !144, splitDebugInlining: false, nameTableKind: None)
!25 = !DIFile(filename: "src/protocols/survey/xsurveyor.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "baff0fe1d6c1434c60b4d9b59ad945d3")
!26 = !{!27, !143}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xsurveyor", file: !29, line: 39, size: 3456, elements: !30)
!29 = !DIFile(filename: "./src/protocols/survey/xsurveyor.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "39d817f0e27772e0ca18c7c7ec6f6c26")
!30 = !{!31, !104, !120}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !28, file: !29, line: 42, baseType: !32, size: 128)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !33, line: 123, size: 128, elements: !34)
!33 = !DIFile(filename: "./src/protocols/survey/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!34 = !{!35, !101}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !32, file: !33, line: 124, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !33, line: 84, size: 704, elements: !39)
!39 = !{!40, !45, !46, !53, !57, !58, !59, !63, !85, !86, !95}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !38, file: !33, line: 87, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !38, file: !33, line: 90, baseType: !41, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !38, file: !33, line: 97, baseType: !47, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !44, !51}
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !33, line: 56, flags: DIFlagFwdDecl)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !38, file: !33, line: 98, baseType: !54, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !44, !51}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !38, file: !33, line: 99, baseType: !54, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !38, file: !33, line: 100, baseType: !54, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !38, file: !33, line: 104, baseType: !60, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!50, !44}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !38, file: !33, line: 108, baseType: !64, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!50, !44, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !69, line: 30, size: 512, elements: !70)
!69 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!70 = !{!71, !84}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !68, file: !69, line: 33, baseType: !72, size: 256)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !73, line: 39, size: 256, elements: !74)
!73 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !72, file: !73, line: 40, baseType: !76, size: 256)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, elements: !82)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !78, line: 24, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !80, line: 38, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !{!83}
!83 = !DISubrange(count: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !68, file: !69, line: 36, baseType: !72, size: 256, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !38, file: !33, line: 112, baseType: !64, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !38, file: !33, line: 115, baseType: !87, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!50, !44, !50, !50, !90, !92}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 46, baseType: !94)
!93 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!94 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !38, file: !33, line: 119, baseType: !96, size: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!50, !44, !50, !50, !99, !100}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !32, file: !33, line: 125, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !33, line: 125, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "outpipes", scope: !28, file: !29, line: 45, baseType: !105, size: 192, offset: 128)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_dist", file: !106, line: 37, size: 192, elements: !107)
!106 = !DIFile(filename: "./src/protocols/survey/../utils/dist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8b675b0838905739d217dd53d5a3b3af")
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !105, file: !106, line: 38, baseType: !92, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !105, file: !106, line: 39, baseType: !110, size: 128, offset: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !111, line: 31, size: 128, elements: !112)
!111 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!112 = !{!113, !119}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !110, file: !111, line: 32, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !111, line: 26, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !111, line: 27, baseType: !114, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !111, line: 28, baseType: !114, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !110, file: !111, line: 33, baseType: !114, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "inpipes", scope: !28, file: !29, line: 48, baseType: !121, size: 3136, offset: 320)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !122, line: 37, size: 3136, elements: !123)
!122 = !DIFile(filename: "./src/protocols/survey/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !121, file: !122, line: 38, baseType: !125, size: 3136)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !126, line: 45, size: 3136, elements: !127)
!126 = !DIFile(filename: "./src/protocols/survey/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!127 = !{!128, !142}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !125, file: !126, line: 46, baseType: !129, size: 3072)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 3072, elements: !140)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !126, line: 40, size: 192, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !130, file: !126, line: 41, baseType: !110, size: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !130, file: !126, line: 42, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !126, line: 34, size: 256, elements: !136)
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !135, file: !126, line: 35, baseType: !51, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !135, file: !126, line: 36, baseType: !50, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !135, file: !126, line: 37, baseType: !115, size: 128, offset: 128)
!140 = !{!141}
!141 = !DISubrange(count: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !125, file: !126, line: 47, baseType: !50, size: 32, offset: 3072)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!144 = !{!0, !7, !12, !17, !145, !22, !163}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "nn_xsurveyor_socktype", scope: !24, file: !2, line: 219, type: !147, isLocal: false, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !33, line: 160, size: 384, elements: !149)
!149 = !{!150, !151, !152, !153, !158, !162}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !148, file: !33, line: 163, baseType: !50, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !148, file: !33, line: 164, baseType: !50, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !33, line: 167, baseType: !50, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !148, file: !33, line: 173, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!50, !99, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !148, file: !33, line: 179, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!50, !50}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !148, file: !33, line: 183, baseType: !115, size: 128, offset: 256)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "nn_xsurveyor_sockbase_vfptr", scope: !24, file: !2, line: 41, type: !37, isLocal: true, isDefinition: true)
!165 = !{i32 7, !"Dwarf Version", i32 5}
!166 = !{i32 2, !"Debug Info Version", i32 3}
!167 = !{i32 1, !"wchar_size", i32 4}
!168 = !{i32 8, !"PIC Level", i32 2}
!169 = !{i32 7, !"PIE Level", i32 2}
!170 = !{i32 7, !"uwtable", i32 2}
!171 = !{i32 7, !"frame-pointer", i32 2}
!172 = !{!"clang version 16.0.0"}
!173 = distinct !DISubprogram(name: "nn_xsurveyor_init", scope: !2, file: !2, line: 55, type: !174, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !176)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !27, !36, !99}
!176 = !{}
!177 = !DILocalVariable(name: "self", arg: 1, scope: !173, file: !2, line: 55, type: !27)
!178 = !DILocation(line: 55, column: 46, scope: !173)
!179 = !DILocalVariable(name: "vfptr", arg: 2, scope: !173, file: !2, line: 56, type: !36)
!180 = !DILocation(line: 56, column: 37, scope: !173)
!181 = !DILocalVariable(name: "hint", arg: 3, scope: !173, file: !2, line: 56, type: !99)
!182 = !DILocation(line: 56, column: 50, scope: !173)
!183 = !DILocation(line: 58, column: 24, scope: !173)
!184 = !DILocation(line: 58, column: 30, scope: !173)
!185 = !DILocation(line: 58, column: 40, scope: !173)
!186 = !DILocation(line: 58, column: 47, scope: !173)
!187 = !DILocation(line: 58, column: 5, scope: !173)
!188 = !DILocation(line: 59, column: 20, scope: !173)
!189 = !DILocation(line: 59, column: 26, scope: !173)
!190 = !DILocation(line: 59, column: 5, scope: !173)
!191 = !DILocation(line: 60, column: 18, scope: !173)
!192 = !DILocation(line: 60, column: 24, scope: !173)
!193 = !DILocation(line: 60, column: 5, scope: !173)
!194 = !DILocation(line: 61, column: 1, scope: !173)
!195 = distinct !DISubprogram(name: "nn_xsurveyor_term", scope: !2, file: !2, line: 63, type: !196, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !176)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !27}
!198 = !DILocalVariable(name: "self", arg: 1, scope: !195, file: !2, line: 63, type: !27)
!199 = !DILocation(line: 63, column: 46, scope: !195)
!200 = !DILocation(line: 65, column: 18, scope: !195)
!201 = !DILocation(line: 65, column: 24, scope: !195)
!202 = !DILocation(line: 65, column: 5, scope: !195)
!203 = !DILocation(line: 66, column: 20, scope: !195)
!204 = !DILocation(line: 66, column: 26, scope: !195)
!205 = !DILocation(line: 66, column: 5, scope: !195)
!206 = !DILocation(line: 67, column: 24, scope: !195)
!207 = !DILocation(line: 67, column: 30, scope: !195)
!208 = !DILocation(line: 67, column: 5, scope: !195)
!209 = !DILocation(line: 68, column: 1, scope: !195)
!210 = distinct !DISubprogram(name: "nn_xsurveyor_add", scope: !2, file: !2, line: 80, type: !48, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !176)
!211 = !DILocalVariable(name: "self", arg: 1, scope: !210, file: !2, line: 80, type: !44)
!212 = !DILocation(line: 80, column: 43, scope: !210)
!213 = !DILocalVariable(name: "pipe", arg: 2, scope: !210, file: !2, line: 80, type: !51)
!214 = !DILocation(line: 80, column: 65, scope: !210)
!215 = !DILocalVariable(name: "xsurveyor", scope: !210, file: !2, line: 82, type: !27)
!216 = !DILocation(line: 82, column: 26, scope: !210)
!217 = !DILocalVariable(name: "data", scope: !210, file: !2, line: 83, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xsurveyor_data", file: !29, line: 33, size: 512, elements: !220)
!220 = !{!221, !222, !227}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !219, file: !29, line: 34, baseType: !51, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "outitem", scope: !219, file: !29, line: 35, baseType: !223, size: 192, offset: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_dist_data", file: !106, line: 32, size: 192, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !223, file: !106, line: 33, baseType: !115, size: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !223, file: !106, line: 34, baseType: !51, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "initem", scope: !219, file: !29, line: 36, baseType: !228, size: 256, offset: 256)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq_data", file: !122, line: 33, size: 256, elements: !229)
!229 = !{!230}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !228, file: !122, line: 34, baseType: !135, size: 256)
!231 = !DILocation(line: 83, column: 31, scope: !210)
!232 = !DILocation(line: 85, column: 17, scope: !210)
!233 = !DILocation(line: 85, column: 15, scope: !210)
!234 = !DILocation(line: 87, column: 12, scope: !210)
!235 = !DILocation(line: 87, column: 10, scope: !210)
!236 = !DILocation(line: 89, column: 5, scope: !210)
!237 = !DILocation(line: 89, column: 5, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !2, line: 89, column: 5)
!239 = distinct !DILexicalBlock(scope: !210, file: !2, line: 89, column: 5)
!240 = !DILocation(line: 89, column: 5, scope: !239)
!241 = !DILocation(line: 89, column: 5, scope: !242)
!242 = distinct !DILexicalBlock(scope: !238, file: !2, line: 89, column: 5)
!243 = !DILocation(line: 90, column: 18, scope: !210)
!244 = !DILocation(line: 90, column: 5, scope: !210)
!245 = !DILocation(line: 90, column: 11, scope: !210)
!246 = !DILocation(line: 90, column: 16, scope: !210)
!247 = !DILocation(line: 91, column: 17, scope: !210)
!248 = !DILocation(line: 91, column: 28, scope: !210)
!249 = !DILocation(line: 91, column: 37, scope: !210)
!250 = !DILocation(line: 91, column: 44, scope: !210)
!251 = !DILocation(line: 91, column: 50, scope: !210)
!252 = !DILocation(line: 91, column: 5, scope: !210)
!253 = !DILocation(line: 92, column: 19, scope: !210)
!254 = !DILocation(line: 92, column: 30, scope: !210)
!255 = !DILocation(line: 92, column: 40, scope: !210)
!256 = !DILocation(line: 92, column: 47, scope: !210)
!257 = !DILocation(line: 92, column: 53, scope: !210)
!258 = !DILocation(line: 92, column: 5, scope: !210)
!259 = !DILocation(line: 93, column: 22, scope: !210)
!260 = !DILocation(line: 93, column: 28, scope: !210)
!261 = !DILocation(line: 93, column: 5, scope: !210)
!262 = !DILocation(line: 95, column: 5, scope: !210)
!263 = distinct !DISubprogram(name: "nn_xsurveyor_rm", scope: !2, file: !2, line: 98, type: !55, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !176)
!264 = !DILocalVariable(name: "self", arg: 1, scope: !263, file: !2, line: 98, type: !44)
!265 = !DILocation(line: 98, column: 43, scope: !263)
!266 = !DILocalVariable(name: "pipe", arg: 2, scope: !263, file: !2, line: 98, type: !51)
!267 = !DILocation(line: 98, column: 65, scope: !263)
!268 = !DILocalVariable(name: "xsurveyor", scope: !263, file: !2, line: 100, type: !27)
!269 = !DILocation(line: 100, column: 26, scope: !263)
!270 = !DILocalVariable(name: "data", scope: !263, file: !2, line: 101, type: !218)
!271 = !DILocation(line: 101, column: 31, scope: !263)
!272 = !DILocation(line: 103, column: 17, scope: !263)
!273 = !DILocation(line: 103, column: 15, scope: !263)
!274 = !DILocation(line: 104, column: 29, scope: !263)
!275 = !DILocation(line: 104, column: 12, scope: !263)
!276 = !DILocation(line: 104, column: 10, scope: !263)
!277 = !DILocation(line: 106, column: 16, scope: !263)
!278 = !DILocation(line: 106, column: 27, scope: !263)
!279 = !DILocation(line: 106, column: 36, scope: !263)
!280 = !DILocation(line: 106, column: 43, scope: !263)
!281 = !DILocation(line: 106, column: 49, scope: !263)
!282 = !DILocation(line: 106, column: 5, scope: !263)
!283 = !DILocation(line: 107, column: 18, scope: !263)
!284 = !DILocation(line: 107, column: 29, scope: !263)
!285 = !DILocation(line: 107, column: 39, scope: !263)
!286 = !DILocation(line: 107, column: 46, scope: !263)
!287 = !DILocation(line: 107, column: 52, scope: !263)
!288 = !DILocation(line: 107, column: 5, scope: !263)
!289 = !DILocation(line: 109, column: 14, scope: !263)
!290 = !DILocation(line: 109, column: 5, scope: !263)
