; ModuleID = '../TrackingBenchmark/threads/Condition.cpp'
source_filename = "../TrackingBenchmark/threads/Condition.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.threads::Condition" = type { ptr, i32, i32, %union.pthread_cond_t }
%union.pthread_cond_t = type { %struct.__pthread_cond_s }
%struct.__pthread_cond_s = type { %union.__atomic_wide_counter, %union.__atomic_wide_counter, [2 x i32], [2 x i32], i32, i32, [2 x i32] }
%union.__atomic_wide_counter = type { i64 }
%"class.threads::Mutex" = type { %"class.threads::LockType", %union.pthread_mutex_t }
%"class.threads::LockType" = type { ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

$_ZN7threads21CondResourceExceptionC2Ev = comdat any

$_ZN7threads21CondResourceExceptionD2Ev = comdat any

$_ZN7threads17CondInitExceptionC2Ev = comdat any

$_ZN7threads17CondInitExceptionD2Ev = comdat any

$_ZN7threads20CondUnknownExceptionC2Ev = comdat any

$_ZN7threads20CondUnknownExceptionD2Ev = comdat any

$_ZN7threads20CondDestroyExceptionC2Ev = comdat any

$_ZN7threads20CondDestroyExceptionD2Ev = comdat any

$__clang_call_terminate = comdat any

$_ZN7threads13CondExceptionC2Ev = comdat any

$_ZN7threads13CondExceptionD2Ev = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "../TrackingBenchmark/threads/Condition.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "5c461aeffe3d0cacdbc53bc337eec88a")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !6)
!4 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{!7}
!7 = !DISubrange(count: 28)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(scope: null, file: !2, line: 137, type: !10, isLocal: true, isDefinition: true)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !11)
!11 = !{!12}
!12 = !DISubrange(count: 23)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(scope: null, file: !2, line: 127, type: !15, isLocal: true, isDefinition: true)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !16)
!16 = !{!17}
!17 = !DISubrange(count: 38)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(scope: null, file: !2, line: 142, type: !20, isLocal: true, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 14)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 36)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !30, line: 37, type: !31, isLocal: true, isDefinition: true)
!30 = !DIFile(filename: "../TrackingBenchmark/threads/Mutex.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "f0ed03367cbf8cde9f14e92e6c75d4c7")
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 24)
!34 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !35, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !36, globals: !96, imports: !97, splitDebugInlining: false, nameTableKind: None)
!35 = !DIFile(filename: "../TrackingBenchmark/threads/Condition.cpp", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "aa48de9d4b328caa73c3dd33ecaffadb")
!36 = !{!37}
!37 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Condition", scope: !38, file: !2, line: 146, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !39, identifier: "_ZTSN7threads9ConditionE")
!38 = !DINamespace(name: "threads", scope: null)
!39 = !{!40, !43, !45, !46, !83, !88, !91, !94, !95}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !37, file: !2, line: 156, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_class_type, name: "Mutex", scope: !38, file: !30, line: 85, size: 384, flags: DIFlagFwdDecl | DIFlagNonTrivial)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "nWaiting", scope: !37, file: !2, line: 157, baseType: !44, size: 32, offset: 64)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nWakeupTickets", scope: !37, file: !2, line: 158, baseType: !44, size: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !37, file: !2, line: 159, baseType: !47, size: 384, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !48, line: 80, baseType: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !48, line: 75, size: 384, flags: DIFlagTypePassByValue, elements: !50, identifier: "_ZTS14pthread_cond_t")
!50 = !{!51, !77, !81}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !49, file: !48, line: 77, baseType: !52, size: 384)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !53, line: 94, size: 384, flags: DIFlagTypePassByValue, elements: !54, identifier: "_ZTS16__pthread_cond_s")
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!54 = !{!55, !68, !69, !73, !74, !75, !76}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !52, file: !53, line: 96, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !57, line: 33, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!58 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !57, line: 25, size: 64, flags: DIFlagTypePassByValue, elements: !59, identifier: "_ZTS21__atomic_wide_counter")
!59 = !{!60, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !58, file: !57, line: 27, baseType: !61, size: 64)
!61 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !58, file: !57, line: 32, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !58, file: !57, line: 28, size: 64, flags: DIFlagTypePassByValue, elements: !64, identifier: "_ZTSN21__atomic_wide_counterUt_E")
!64 = !{!65, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !63, file: !57, line: 30, baseType: !66, size: 32)
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !63, file: !57, line: 31, baseType: !66, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !52, file: !53, line: 97, baseType: !56, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !52, file: !53, line: 98, baseType: !70, size: 64, offset: 128)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 2)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !52, file: !53, line: 99, baseType: !70, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !52, file: !53, line: 100, baseType: !66, size: 32, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !52, file: !53, line: 101, baseType: !66, size: 32, offset: 288)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !52, file: !53, line: 102, baseType: !70, size: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !49, file: !48, line: 78, baseType: !78, size: 384)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 384, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 48)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !49, file: !48, line: 79, baseType: !82, size: 64)
!82 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!83 = !DISubprogram(name: "Condition", scope: !37, file: !2, line: 148, type: !84, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !87}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!87 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !42, size: 64)
!88 = !DISubprogram(name: "~Condition", scope: !37, file: !2, line: 149, type: !89, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !86}
!91 = !DISubprogram(name: "NotifyOne", linkageName: "_ZN7threads9Condition9NotifyOneEv", scope: !37, file: !2, line: 151, type: !92, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!92 = !DISubroutineType(types: !93)
!93 = !{!44, !86}
!94 = !DISubprogram(name: "NotifyAll", linkageName: "_ZN7threads9Condition9NotifyAllEv", scope: !37, file: !2, line: 152, type: !92, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!95 = !DISubprogram(name: "Wait", linkageName: "_ZN7threads9Condition4WaitEv", scope: !37, file: !2, line: 153, type: !89, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!96 = !{!0, !8, !13, !18, !23, !28}
!97 = !{!98, !103}
!98 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !99, entity: !100, file: !101, line: 68)
!99 = !DINamespace(name: "std", scope: null)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !102, file: !101, line: 90, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!101 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "ed433011c81450fc2dabd9aa8a29a038")
!102 = !DINamespace(name: "__exception_ptr", scope: !99)
!103 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !102, entity: !104, file: !101, line: 84)
!104 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !99, file: !101, line: 80, type: !105, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !100}
!107 = !{i32 7, !"Dwarf Version", i32 5}
!108 = !{i32 2, !"Debug Info Version", i32 3}
!109 = !{i32 1, !"wchar_size", i32 4}
!110 = !{i32 8, !"PIC Level", i32 2}
!111 = !{i32 7, !"PIE Level", i32 2}
!112 = !{i32 7, !"uwtable", i32 2}
!113 = !{i32 7, !"frame-pointer", i32 2}
!114 = !{!"clang version 16.0.0"}
!115 = distinct !DISubprogram(name: "Condition", linkageName: "_ZN7threads9ConditionC2ERNS_5MutexE", scope: !37, file: !35, line: 284, type: !84, scopeLine: 284, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !34, declaration: !83, retainedNodes: !116)
!116 = !{}
!117 = !DILocalVariable(name: "this", arg: 1, scope: !115, type: !118, flags: DIFlagArtificial | DIFlagObjectPointer)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!119 = !DILocation(line: 0, scope: !115)
!120 = !DILocalVariable(name: "_M", arg: 2, scope: !115, file: !35, line: 284, type: !87)
!121 = !DILocation(line: 284, column: 29, scope: !115)
!122 = !DILocation(line: 284, column: 12, scope: !115)
!123 = !DILocation(line: 285, column: 10, scope: !124)
