; ModuleID = '../TrackingBenchmark/threads/Mutex.cpp'
source_filename = "../TrackingBenchmark/threads/Mutex.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.threads::MutexResourceException" = type { %"class.threads::MutexException" }
%"class.threads::MutexException" = type { %"class.std::exception" }
%"class.std::exception" = type { ptr }
%"class.threads::MutexInitException" = type { %"class.threads::MutexException" }
%"class.threads::MutexUnknownException" = type { %"class.threads::MutexException" }
%"class.threads::Mutex" = type { %"class.threads::LockType", %union.pthread_mutex_t }
%"class.threads::LockType" = type { ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%"class.threads::MutexDestroyException" = type { %"class.threads::MutexException" }
%"class.threads::MutexLockingException" = type { %"class.threads::MutexException" }
%"class.threads::MutexDeadlockException" = type { %"class.threads::MutexLockingException" }

$_ZN7threads8LockTypeC2Ev = comdat any

$_ZN7threads22MutexResourceExceptionC2Ev = comdat any

$_ZN7threads22MutexResourceExceptionC2EOS0_ = comdat any

$_ZN7threads22MutexResourceExceptionD2Ev = comdat any

$_ZN7threads18MutexInitExceptionC2Ev = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 37, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "../TrackingBenchmark/threads/Mutex.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "f0ed03367cbf8cde9f14e92e6c75d4c7")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !6)
!4 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{!7}
!7 = !DISubrange(count: 24)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(scope: null, file: !2, line: 45, type: !10, isLocal: true, isDefinition: true)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !11)
!11 = !{!12}
!12 = !DISubrange(count: 14)
!13 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !14, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !15, imports: !16, splitDebugInlining: false, nameTableKind: None)
!14 = !DIFile(filename: "../TrackingBenchmark/threads/Mutex.cpp", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "a2323352177b3122677ee75487e42939")
!15 = !{!0, !8}
!16 = !{!17, !22}
!17 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !18, entity: !19, file: !20, line: 68)
!18 = !DINamespace(name: "std", scope: null)
!19 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !21, file: !20, line: 90, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!20 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "ed433011c81450fc2dabd9aa8a29a038")
!21 = !DINamespace(name: "__exception_ptr", scope: !18)
!22 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !21, entity: !23, file: !20, line: 84)
!23 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !18, file: !20, line: 80, type: !24, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !19}
!26 = !{i32 7, !"Dwarf Version", i32 5}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{i32 1, !"wchar_size", i32 4}
!29 = !{i32 8, !"PIC Level", i32 2}
!30 = !{i32 7, !"PIE Level", i32 2}
!31 = !{i32 7, !"uwtable", i32 2}
!32 = !{i32 7, !"frame-pointer", i32 2}
!33 = !{!"clang version 16.0.0"}
!34 = distinct !DISubprogram(name: "Mutex", linkageName: "_ZN7threads5MutexC2Ev", scope: !35, file: !14, line: 27, type: !91, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, declaration: !90, retainedNodes: !100)
!35 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Mutex", scope: !36, file: !2, line: 85, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !37, vtableHolder: !39)
!36 = !DINamespace(name: "threads", scope: null)
!37 = !{!38, !58, !90, !94, !95, !96, !97}
!38 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !35, baseType: !39, flags: DIFlagPublic, extraData: i32 0)
!39 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "LockType", scope: !36, file: !40, line: 20, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !41, vtableHolder: !39, identifier: "_ZTSN7threads8LockTypeE")
!40 = !DIFile(filename: "../TrackingBenchmark/threads/LockTypes.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "0ca0f04436c9d86d1b79d0c43fe7dd57")
!41 = !{!42, !48, !52, !53, !54}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$LockType", scope: !40, file: !40, baseType: !43, size: 64, flags: DIFlagArtificial)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47}
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DISubprogram(name: "~LockType", scope: !39, file: !40, line: 22, type: !49, scopeLine: 22, containingType: !39, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!52 = !DISubprogram(name: "Lock", linkageName: "_ZN7threads8LockType4LockEv", scope: !39, file: !40, line: 25, type: !49, scopeLine: 25, containingType: !39, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!53 = !DISubprogram(name: "Unlock", linkageName: "_ZN7threads8LockType6UnlockEv", scope: !39, file: !40, line: 27, type: !49, scopeLine: 27, containingType: !39, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!54 = !DISubprogram(name: "TryLock", linkageName: "_ZN7threads8LockType7TryLockEv", scope: !39, file: !40, line: 29, type: !55, scopeLine: 29, containingType: !39, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !51}
!57 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !35, file: !2, line: 102, baseType: !59, size: 320, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !60, line: 72, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!61 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !60, line: 67, size: 320, flags: DIFlagTypePassByValue, elements: !62, identifier: "_ZTS15pthread_mutex_t")
!62 = !{!63, !84, !88}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !61, file: !60, line: 69, baseType: !64, size: 320)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !65, line: 22, size: 320, flags: DIFlagTypePassByValue, elements: !66, identifier: "_ZTS17__pthread_mutex_s")
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!66 = !{!67, !68, !70, !71, !72, !73, !75, !76}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !64, file: !65, line: 24, baseType: !47, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !64, file: !65, line: 25, baseType: !69, size: 32, offset: 32)
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !64, file: !65, line: 26, baseType: !47, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !64, file: !65, line: 28, baseType: !69, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !64, file: !65, line: 32, baseType: !47, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !64, file: !65, line: 34, baseType: !74, size: 16, offset: 160)
!74 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !64, file: !65, line: 35, baseType: !74, size: 16, offset: 176)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !64, file: !65, line: 36, baseType: !77, size: 128, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !78, line: 55, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !78, line: 51, size: 128, flags: DIFlagTypePassByValue, elements: !80, identifier: "_ZTS23__pthread_internal_list")
!80 = !{!81, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !79, file: !78, line: 53, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !79, file: !78, line: 54, baseType: !82, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !61, file: !60, line: 70, baseType: !85, size: 320)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 40)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !61, file: !60, line: 71, baseType: !89, size: 64)
!89 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!90 = !DISubprogram(name: "Mutex", scope: !35, file: !2, line: 90, type: !91, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!94 = !DISubprogram(name: "~Mutex", scope: !35, file: !2, line: 91, type: !91, scopeLine: 91, containingType: !35, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!95 = !DISubprogram(name: "Lock", linkageName: "_ZN7threads5Mutex4LockEv", scope: !35, file: !2, line: 94, type: !91, scopeLine: 94, containingType: !35, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!96 = !DISubprogram(name: "Unlock", linkageName: "_ZN7threads5Mutex6UnlockEv", scope: !35, file: !2, line: 96, type: !91, scopeLine: 96, containingType: !35, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!97 = !DISubprogram(name: "TryLock", linkageName: "_ZN7threads5Mutex7TryLockEv", scope: !35, file: !2, line: 98, type: !98, scopeLine: 98, containingType: !35, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!98 = !DISubroutineType(types: !99)
!99 = !{!57, !93}
!100 = !{}
!101 = !DILocalVariable(name: "this", arg: 1, scope: !34, type: !102, flags: DIFlagArtificial | DIFlagObjectPointer)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!103 = !DILocation(line: 0, scope: !34)
!104 = !DILocation(line: 27, column: 8, scope: !34)
!105 = !DILocation(line: 27, column: 15, scope: !34)
!106 = !DILocalVariable(name: "rv", scope: !107, file: !14, line: 29, type: !47)
!107 = distinct !DILexicalBlock(scope: !34, file: !14, line: 27, column: 15)
!108 = !DILocation(line: 29, column: 7, scope: !107)
!109 = !DILocation(line: 31, column: 28, scope: !107)
!110 = !DILocation(line: 31, column: 8, scope: !107)
!111 = !DILocation(line: 31, column: 6, scope: !107)
!112 = !DILocation(line: 33, column: 10, scope: !107)
!113 = !DILocation(line: 33, column: 3, scope: !107)
!114 = !DILocation(line: 35, column: 7, scope: !115)
!115 = distinct !DILexicalBlock(scope: !107, file: !14, line: 33, column: 14)
!116 = !DILocalVariable(name: "e", scope: !117, file: !14, line: 39, type: !118)
!117 = distinct !DILexicalBlock(scope: !115, file: !14, line: 38, column: 5)
!118 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "MutexResourceException", scope: !36, file: !2, line: 56, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !119, vtableHolder: !124, identifier: "_ZTSN7threads22MutexResourceExceptionE")
!119 = !{!120, !132}
!120 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !118, baseType: !121, flags: DIFlagPublic, extraData: i32 0)
!121 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "MutexException", scope: !36, file: !2, line: 35, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !122, vtableHolder: !124, identifier: "_ZTSN7threads14MutexExceptionE")
!122 = !{!123, !126}
!123 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !121, baseType: !124, flags: DIFlagPublic, extraData: i32 0)
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "exception", scope: !18, file: !125, line: 61, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial)
