; ModuleID = '../TrackingBenchmark/threads/RWLock.cpp'
source_filename = "../TrackingBenchmark/threads/RWLock.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.threads::RWLock" = type { %union.pthread_rwlock_t }
%union.pthread_rwlock_t = type { %struct.__pthread_rwlock_arch_t }
%struct.__pthread_rwlock_arch_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i8, [7 x i8], i64, i32 }

$_ZN7threads19RWLockInitExceptionC2Ev = comdat any

$_ZN7threads19RWLockInitExceptionD2Ev = comdat any

$_ZN7threads22RWLockLockingExceptionC2Ev = comdat any

$_ZN7threads22RWLockLockingExceptionD2Ev = comdat any

$_ZN7threads15RWLockExceptionC2Ev = comdat any

$_ZN7threads19RWLockInitExceptionD0Ev = comdat any

$_ZNK7threads19RWLockInitException4whatEv = comdat any

$_ZNSt9exceptionC2Ev = comdat any

$_ZN7threads15RWLockExceptionD2Ev = comdat any

$_ZN7threads15RWLockExceptionD0Ev = comdat any

$_ZNK7threads15RWLockException4whatEv = comdat any

$_ZN7threads22RWLockLockingExceptionD0Ev = comdat any

$_ZNK7threads22RWLockLockingException4whatEv = comdat any

$_ZTSN7threads19RWLockInitExceptionE = comdat any

$_ZTSN7threads15RWLockExceptionE = comdat any

$_ZTIN7threads15RWLockExceptionE = comdat any

$_ZTIN7threads19RWLockInitExceptionE = comdat any

$_ZTSN7threads22RWLockLockingExceptionE = comdat any

$_ZTIN7threads22RWLockLockingExceptionE = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "../TrackingBenchmark/threads/RWLock.h", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "659232cbc8127e409698769fb117675d")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !6)
!4 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{!7}
!7 = !DISubrange(count: 13)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !10, isLocal: true, isDefinition: true)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !11)
!11 = !{!12}
!12 = !DISubrange(count: 28)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !15, isLocal: true, isDefinition: true)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !16)
!16 = !{!17}
!17 = !DISubrange(count: 32)
!18 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !19, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !20, globals: !67, imports: !68, splitDebugInlining: false, nameTableKind: None)
!19 = !DIFile(filename: "../TrackingBenchmark/threads/RWLock.cpp", directory: "/home/raj/SVF_PAPER_BENCHMARKS/parsec-3.0/pkgs/apps/bodytrack/src/build", checksumkind: CSK_MD5, checksum: "e6248b9028b17058d556e368954da3d5")
!20 = !{!21}
!21 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RWLock", scope: !22, file: !2, line: 204, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !23, identifier: "_ZTSN7threads6RWLockE")
!22 = !DINamespace(name: "threads", scope: null)
!23 = !{!24, !59, !63, !64, !65, !66}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock", scope: !21, file: !2, line: 214, baseType: !25, size: 448)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !26, line: 91, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!27 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !26, line: 86, size: 448, flags: DIFlagTypePassByValue, elements: !28, identifier: "_ZTS16pthread_rwlock_t")
!28 = !{!29, !53, !57}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !27, file: !26, line: 88, baseType: !30, size: 448)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !31, line: 23, size: 448, flags: DIFlagTypePassByValue, elements: !32, identifier: "_ZTS23__pthread_rwlock_arch_t")
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_rwlock.h", directory: "", checksumkind: CSK_MD5, checksum: "2034038f4a99ff6cb7b9de3a3e8c2a8e")
!32 = !{!33, !35, !36, !37, !38, !39, !40, !42, !43, !45, !50, !52}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !30, file: !31, line: 25, baseType: !34, size: 32)
!34 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !30, file: !31, line: 26, baseType: !34, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !30, file: !31, line: 27, baseType: !34, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !30, file: !31, line: 28, baseType: !34, size: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !30, file: !31, line: 29, baseType: !34, size: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !30, file: !31, line: 30, baseType: !34, size: 32, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !30, file: !31, line: 32, baseType: !41, size: 32, offset: 192)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !30, file: !31, line: 33, baseType: !41, size: 32, offset: 224)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !30, file: !31, line: 34, baseType: !44, size: 8, offset: 256)
!44 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !30, file: !31, line: 39, baseType: !46, size: 56, offset: 264)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 56, elements: !48)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !{!49}
!49 = !DISubrange(count: 7)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !30, file: !31, line: 42, baseType: !51, size: 64, offset: 320)
!51 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !30, file: !31, line: 45, baseType: !34, size: 32, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !27, file: !26, line: 89, baseType: !54, size: 448)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 448, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 56)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !27, file: !26, line: 90, baseType: !58, size: 64)
!58 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!59 = !DISubprogram(name: "RWLock", scope: !21, file: !2, line: 206, type: !60, scopeLine: 206, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!63 = !DISubprogram(name: "~RWLock", scope: !21, file: !2, line: 207, type: !60, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!64 = !DISubprogram(name: "LockRead", linkageName: "_ZN7threads6RWLock8LockReadEv", scope: !21, file: !2, line: 209, type: !60, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!65 = !DISubprogram(name: "LockWrite", linkageName: "_ZN7threads6RWLock9LockWriteEv", scope: !21, file: !2, line: 210, type: !60, scopeLine: 210, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!66 = !DISubprogram(name: "Unlock", linkageName: "_ZN7threads6RWLock6UnlockEv", scope: !21, file: !2, line: 211, type: !60, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!67 = !{!0, !8, !13}
!68 = !{!69, !74}
!69 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !70, entity: !71, file: !72, line: 68)
!70 = !DINamespace(name: "std", scope: null)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !73, file: !72, line: 90, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!72 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/11/../../../../include/c++/11/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "ed433011c81450fc2dabd9aa8a29a038")
!73 = !DINamespace(name: "__exception_ptr", scope: !70)
!74 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !73, entity: !75, file: !72, line: 84)
!75 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !70, file: !72, line: 80, type: !76, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !71}
!78 = !{i32 7, !"Dwarf Version", i32 5}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{i32 1, !"wchar_size", i32 4}
!81 = !{i32 8, !"PIC Level", i32 2}
!82 = !{i32 7, !"PIE Level", i32 2}
!83 = !{i32 7, !"uwtable", i32 2}
!84 = !{i32 7, !"frame-pointer", i32 2}
!85 = !{!"clang version 16.0.0"}
!86 = distinct !DISubprogram(name: "RWLock", linkageName: "_ZN7threads6RWLockC2Ev", scope: !21, file: !19, line: 238, type: !60, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, declaration: !59, retainedNodes: !87)
!87 = !{}
!88 = !DILocalVariable(name: "this", arg: 1, scope: !86, type: !89, flags: DIFlagArtificial | DIFlagObjectPointer)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!90 = !DILocation(line: 0, scope: !86)
!91 = !DILocation(line: 238, column: 9, scope: !86)
!92 = !DILocation(line: 239, column: 30, scope: !93)
!93 = distinct !DILexicalBlock(scope: !94, file: !19, line: 239, column: 9)
!94 = distinct !DILexicalBlock(scope: !86, file: !19, line: 238, column: 18)
!95 = !DILocation(line: 239, column: 9, scope: !93)
!96 = !DILocation(line: 239, column: 47, scope: !93)
!97 = !DILocation(line: 239, column: 9, scope: !94)
!98 = !DILocation(line: 240, column: 9, scope: !99)
!99 = distinct !DILexicalBlock(scope: !93, file: !19, line: 239, column: 53)
!100 = !DILocation(line: 240, column: 15, scope: !99)
