; ModuleID = 'command_put.c'
source_filename = "command_put.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.snappy_env = type { ptr, ptr, ptr }
%struct.tcp_thread_s = type { i64, ptr, i32, i32, ptr, ptr }
%struct.writer_msg_s = type { i32, ptr, %struct.ybin_s, %struct.ybin_s, i32 }
%struct.ybin_s = type { ptr, i64 }
%struct.finedb_s = type { i32, ptr, i32, i32, i64, ptr, i16 }

@.str = private unnamed_addr constant [14 x i8] c"command_put.c\00", align 1, !dbg !0
@__FUNCTION__.command_put = private unnamed_addr constant [12 x i8] c"command_put\00", align 1, !dbg !7
@.str.1 = private unnamed_addr constant [12 x i8] c"PUT command\00", align 1, !dbg !13
@.str.2 = private unnamed_addr constant [13 x i8] c"NAME : '%s'.\00", align 1, !dbg !16
@.str.3 = private unnamed_addr constant [13 x i8] c"DATA : '%s'.\00", align 1, !dbg !21
@.str.4 = private unnamed_addr constant [37 x i8] c"Unable to create Snappy environment.\00", align 1, !dbg !23
@.str.5 = private unnamed_addr constant [27 x i8] c"Unable to allocate memory.\00", align 1, !dbg !28
@.str.6 = private unnamed_addr constant [25 x i8] c"Unable to compress data.\00", align 1, !dbg !33
@.str.7 = private unnamed_addr constant [41 x i8] c"Unable to send message to writer thread.\00", align 1, !dbg !38
@.str.12 = private unnamed_addr constant [26 x i8] c"Data written to database.\00", align 1, !dbg !43

!80 = !DIEnumerator(name: "YTRUE", value: 1)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "writer_action_e", file: !82, line: 13, baseType: !77, size: 32, elements: !83)
!82 = !DIFile(filename: "./writer_thread.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "3a724ae2321376421ad42c1087f049ab")
!83 = !{!84, !85, !86}
!84 = !DIEnumerator(name: "WRITE_PUT", value: 0)
!85 = !DIEnumerator(name: "WRITE_DEL", value: 1)
!86 = !DIEnumerator(name: "WRITE_DROP", value: 2)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ylog_priority_e", file: !88, line: 267, baseType: !77, size: 32, elements: !89)
!88 = !DIFile(filename: "../../lib/ylib/ylog.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "0a4bfecb6867d4cb83bdff3f2b1d4b13")
!89 = !{!90, !91, !92, !93, !94, !95}
!90 = !DIEnumerator(name: "YLOG_DEBUG", value: 0)
!91 = !DIEnumerator(name: "YLOG_INFO", value: 1)
!92 = !DIEnumerator(name: "YLOG_NOTE", value: 2)
!93 = !DIEnumerator(name: "YLOG_WARN", value: 3)
!94 = !DIEnumerator(name: "YLOG_ERR", value: 4)
!95 = !DIEnumerator(name: "YLOG_CRIT", value: 5)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol_response_e", file: !97, line: 108, baseType: !77, size: 32, elements: !98)
!97 = !DIFile(filename: "./protocol.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "90e12b9ba2bd5e3d7e691fccfd080d02")
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106}
!99 = !DIEnumerator(name: "RESP_ERR_UNDEFINED", value: 0)
!100 = !DIEnumerator(name: "RESP_OK", value: 1)
!101 = !DIEnumerator(name: "RESP_ERR_PROTOCOL", value: 2)
!102 = !DIEnumerator(name: "RESP_ERR_SERVER", value: 3)
!103 = !DIEnumerator(name: "RESP_ERR_FULL_DB", value: 4)
!104 = !DIEnumerator(name: "RESP_ERR_TOO_MANY_DB", value: 5)
!105 = !DIEnumerator(name: "RESP_ERR_BAD_NAME", value: 6)
!106 = !DIEnumerator(name: "RESP_ERR_TRANSACTION", value: 7)
!107 = !{!108, !109, !112}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!111 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !113, line: 40, baseType: !114)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!114 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!115 = !{!0, !7, !13, !16, !21, !23, !28, !33, !38, !116, !118, !123, !128, !43, !48, !130, !53, !58, !63, !68}
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !18, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 28)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 19)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !35, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 134, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 30)
!135 = !{i32 7, !"Dwarf Version", i32 5}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{i32 8, !"PIC Level", i32 2}
!139 = !{i32 7, !"PIE Level", i32 2}
!140 = !{i32 7, !"uwtable", i32 2}
!141 = !{!"clang version 16.0.0"}
!142 = distinct !DISubprogram(name: "command_put", scope: !2, file: !2, line: 12, type: !143, scopeLine: 12, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !194)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !148, !163, !163, !163, !185}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "yerr_t", file: !146, line: 23, baseType: !147)
!146 = !DIFile(filename: "../../lib/ylib/yerror.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "4851c124a64e017d0b9d8820f73f7100")
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_thread_t", file: !150, line: 30, baseType: !151)
!150 = !DIFile(filename: "./connection_thread.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "285f9cd07088f6d468faef64cb1dc74b")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_thread_s", file: !150, line: 23, size: 320, elements: !152)
!152 = !{!153, !156, !177, !178, !179, !181}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !151, file: !150, line: 24, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !155, line: 27, baseType: !111)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "finedb", scope: !151, file: !150, line: 25, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_t", file: !159, line: 49, baseType: !160)
!159 = !DIFile(filename: "./finedb.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "349d81e48e8fe143f3d7a471f97edb42")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_s", file: !159, line: 41, size: 384, elements: !161)
!161 = !{!162, !164, !169, !170, !171, !172, !176}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !160, file: !159, line: 42, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybool_t", file: !76, line: 52, baseType: !75)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !160, file: !159, line: 43, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_env", file: !167, line: 197, baseType: !168)
!167 = !DIFile(filename: "../../lib/lmdb/lmdb.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "9ff9d4834608bdc966449cf81c779c6a")
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_env", file: !167, line: 197, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !160, file: !159, line: 44, baseType: !147, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "threads_socket", scope: !160, file: !159, line: 45, baseType: !147, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "writer_tid", scope: !160, file: !159, line: 46, baseType: !154, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_threads", scope: !160, file: !159, line: 47, baseType: !173, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "yvect_t", file: !174, line: 56, baseType: !175)
!174 = !DIFile(filename: "../../lib/ylib/yvect.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "73ac1eb655eaae5d93c48c36880d9ca2")
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !160, file: !159, line: 48, baseType: !114, size: 16, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !151, file: !150, line: 26, baseType: !147, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "write_sock", scope: !151, file: !150, line: 27, baseType: !147, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !151, file: !150, line: 28, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !151, file: !150, line: 29, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_txn", file: !167, line: 204, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_txn", file: !167, line: 204, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ydynabin_t", file: !187, line: 45, baseType: !188)
!187 = !DIFile(filename: "../../lib/ylib/ydynabin.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "e9b56a3dd8293288d1beb69b8bafd958")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ydynabin_s", file: !187, line: 37, size: 256, elements: !189)
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !187, line: 38, baseType: !108, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !188, file: !187, line: 39, baseType: !109, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !188, file: !187, line: 40, baseType: !109, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !188, file: !187, line: 41, baseType: !109, size: 64, offset: 192)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !206, !207, !211, !212, !213, !214, !215, !232, !233, !234, !235, !243, !244, !247, !248, !249}
!195 = !DILocalVariable(name: "thread", arg: 1, scope: !142, file: !2, line: 12, type: !148)
!196 = !DILocalVariable(name: "sync", arg: 2, scope: !142, file: !2, line: 12, type: !163)
!197 = !DILocalVariable(name: "compress", arg: 3, scope: !142, file: !2, line: 12, type: !163)
!198 = !DILocalVariable(name: "serialized", arg: 4, scope: !142, file: !2, line: 12, type: !163)
!199 = !DILocalVariable(name: "buff", arg: 5, scope: !142, file: !2, line: 12, type: !185)
!200 = !DILocalVariable(name: "create_only", scope: !142, file: !2, line: 13, type: !163)
!201 = !DILocalVariable(name: "update_only", scope: !142, file: !2, line: 13, type: !163)
!202 = !DILocalVariable(name: "pname_len", scope: !142, file: !2, line: 15, type: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !205, line: 25, baseType: !112)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!206 = !DILocalVariable(name: "name_len", scope: !142, file: !2, line: 15, type: !204)
!207 = !DILocalVariable(name: "pdata_len", scope: !142, file: !2, line: 16, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !205, line: 26, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !113, line: 42, baseType: !77)
!211 = !DILocalVariable(name: "data_len", scope: !142, file: !2, line: 16, type: !209)
!212 = !DILocalVariable(name: "ptr", scope: !142, file: !2, line: 17, type: !108)
!213 = !DILocalVariable(name: "name", scope: !142, file: !2, line: 17, type: !108)
!214 = !DILocalVariable(name: "data", scope: !142, file: !2, line: 17, type: !108)
!215 = !DILocalVariable(name: "msg", scope: !142, file: !2, line: 18, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "writer_msg_t", file: !82, line: 34, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "writer_msg_s", file: !82, line: 28, size: 448, elements: !219)
!219 = !{!220, !222, !223, !230, !231}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !218, file: !82, line: 29, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "writer_action_t", file: !82, line: 17, baseType: !81)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !218, file: !82, line: 30, baseType: !180, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !82, line: 31, baseType: !224, size: 128, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybin_t", file: !225, line: 33, baseType: !226)
!225 = !DIFile(filename: "../../lib/ylib/ybin.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "7abd7d5e6afd31e8416cab6f0a6bf3b3")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ybin_s", file: !225, line: 27, size: 128, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !225, line: 28, baseType: !108, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !226, file: !225, line: 29, baseType: !109, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !218, file: !82, line: 32, baseType: !224, size: 128, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "create_only", scope: !218, file: !82, line: 33, baseType: !163, size: 32, offset: 384)
!232 = !DILocalVariable(name: "answer", scope: !142, file: !2, line: 19, type: !4)
!233 = !DILocalVariable(name: "zip_len", scope: !142, file: !2, line: 20, type: !109)
!234 = !DILocalVariable(name: "zip_data", scope: !142, file: !2, line: 21, type: !180)
!235 = !DILocalVariable(name: "zip_env", scope: !142, file: !2, line: 22, type: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snappy_env", file: !237, line: 8, size: 192, elements: !238)
!237 = !DIFile(filename: "../../lib/snappy-c/snappy.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "cfb9bcda4cc85171bf9848efd16b1ae4")
!238 = !{!239, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "hash_table", scope: !236, file: !237, line: 9, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "scratch", scope: !236, file: !237, line: 10, baseType: !108, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_output", scope: !236, file: !237, line: 11, baseType: !108, size: 64, offset: 128)
!243 = !DILocalVariable(name: "txn", scope: !142, file: !2, line: 23, type: !182)
!244 = !DILocalVariable(name: "data", scope: !245, file: !2, line: 102, type: !224)
!245 = distinct !DILexicalBlock(scope: !246, file: !2, line: 100, column: 19)
!246 = distinct !DILexicalBlock(scope: !142, file: !2, line: 100, column: 6)
!247 = !DILocalVariable(name: "rc", scope: !245, file: !2, line: 103, type: !147)
!248 = !DILabel(scope: !142, name: "end_of_process", file: !2, line: 137)
!249 = !DILabel(scope: !142, name: "error", file: !2, line: 141)
!250 = !DILocation(line: 0, scope: !142)
!251 = !DILocation(line: 18, column: 2, scope: !142)
!252 = !DILocation(line: 18, column: 16, scope: !142)
!253 = !{!254, !254, i64 0}
!254 = !{!"any pointer", !255, i64 0}
!255 = !{!"omnipotent char", !256, i64 0}
!256 = !{!"Simple C/C++ TBAA"}
!257 = !DILocation(line: 20, column: 2, scope: !142)
!258 = !DILocation(line: 22, column: 2, scope: !142)
!259 = !DILocation(line: 22, column: 20, scope: !142)
!260 = !DILocation(line: 23, column: 25, scope: !142)
!261 = !{!262, !254, i64 32}
!262 = !{!"tcp_thread_s", !263, i64 0, !254, i64 8, !264, i64 16, !264, i64 20, !254, i64 24, !254, i64 32}
!263 = !{!"long", !255, i64 0}
!264 = !{!"int", !255, i64 0}
!265 = !DILocation(line: 25, column: 2, scope: !142)
!266 = !DILocation(line: 29, column: 6, scope: !267)
!267 = distinct !DILexicalBlock(scope: !142, file: !2, line: 29, column: 6)
!268 = !DILocation(line: 29, column: 59, scope: !267)
!269 = !DILocation(line: 29, column: 6, scope: !142)
!270 = !DILocation(line: 31, column: 14, scope: !142)
!271 = !DILocation(line: 32, column: 13, scope: !142)
!272 = !{!273, !273, i64 0}
!273 = !{!"short", !255, i64 0}
!274 = !DILocation(line: 34, column: 41, scope: !275)
!275 = distinct !DILexicalBlock(scope: !142, file: !2, line: 34, column: 6)
!276 = !DILocation(line: 34, column: 6, scope: !275)
!277 = !DILocation(line: 34, column: 59, scope: !275)
!278 = !DILocation(line: 34, column: 6, scope: !142)
!279 = !DILocation(line: 36, column: 8, scope: !142)
!280 = !DILocation(line: 37, column: 14, scope: !281)
!281 = distinct !DILexicalBlock(scope: !142, file: !2, line: 37, column: 6)
!282 = !DILocation(line: 37, column: 41, scope: !281)
!283 = !DILocation(line: 37, column: 6, scope: !142)
!284 = !DILocation(line: 39, column: 2, scope: !142)
!285 = !DILocation(line: 40, column: 2, scope: !142)
!286 = !DILocation(line: 42, column: 6, scope: !287)
!287 = distinct !DILexicalBlock(scope: !142, file: !2, line: 42, column: 6)
!288 = !DILocation(line: 42, column: 59, scope: !287)
!289 = !DILocation(line: 42, column: 6, scope: !142)
!290 = !DILocation(line: 44, column: 14, scope: !142)
!291 = !DILocation(line: 45, column: 13, scope: !142)
!292 = !{!264, !264, i64 0}
!293 = !DILocalVariable(name: "__bsx", arg: 1, scope: !294, file: !295, line: 49, type: !210)
!294 = distinct !DISubprogram(name: "__bswap_32", scope: !295, file: !295, line: 49, type: !296, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !73, retainedNodes: !298)
!295 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/byteswap.h", directory: "", checksumkind: CSK_MD5, checksum: "98f83253ffd9c64e7486789204e9fa05")
!296 = !DISubroutineType(types: !297)
!297 = !{!210, !210}
!298 = !{!293}
!299 = !DILocation(line: 0, scope: !294, inlinedAt: !300)
!300 = distinct !DILocation(line: 45, column: 13, scope: !142)
!301 = !DILocation(line: 54, column: 10, scope: !294, inlinedAt: !300)
!302 = !DILocation(line: 47, column: 15, scope: !303)
!303 = distinct !DILexicalBlock(scope: !142, file: !2, line: 47, column: 6)
!304 = !DILocation(line: 47, column: 6, scope: !142)
!305 = !DILocation(line: 48, column: 42, scope: !306)
!306 = distinct !DILexicalBlock(scope: !307, file: !2, line: 48, column: 7)
