; ModuleID = 'finedb.c'
source_filename = "finedb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.finedb_s = type { i32, ptr, i32, i32, i64, ptr, i16 }

@.str = private unnamed_addr constant [6 x i8] c"%s/%s\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [16 x i8] c"../var/database\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [9 x i8] c"finedb.c\00", align 1, !dbg !12
@__FUNCTION__.finedb_init = private unnamed_addr constant [12 x i8] c"finedb_init\00", align 1, !dbg !17
@.str.3 = private unnamed_addr constant [25 x i8] c"Unable to open database.\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [24 x i8] c"inproc://threads_socket\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [33 x i8] c"Unable to create threads socket.\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [32 x i8] c"Unable to create writer thread.\00", align 1, !dbg !38
@.str.7 = private unnamed_addr constant [10 x i8] c"Aborting.\00", align 1, !dbg !43

; Function Attrs: nounwind uwtable
define dso_local ptr @finedb_init(ptr noundef %0, i16 noundef zeroext %1, i16 noundef zeroext %2, i64 noundef %3, i32 noundef %4, i16 noundef zeroext %5) local_unnamed_addr #0 !dbg !84 {
  call void @llvm.dbg.value(metadata ptr %0, metadata !115, metadata !DIExpression()), !dbg !145

!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 33, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 16)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 38, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 9)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 38, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !21)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!21 = !{!22}
!22 = !DISubrange(count: 12)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 38, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 25)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 24)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 33)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 32)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !45, isLocal: true, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 10)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !74, globals: !76, splitDebugInlining: false, nameTableKind: None)
!49 = !{!50, !56, !65}
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ybool_e", file: !51, line: 45, baseType: !52, size: 32, elements: !53)
!51 = !DIFile(filename: "../../lib/ylib/ydefs.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "d3a2b1768a8684c59dbd5861ab8c9350")
!52 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!53 = !{!54, !55}
!54 = !DIEnumerator(name: "YFALSE", value: 0)
!55 = !DIEnumerator(name: "YTRUE", value: 1)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yv_size_e", file: !57, line: 31, baseType: !52, size: 32, elements: !58)
!57 = !DIFile(filename: "../../lib/ylib/yvect.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "73ac1eb655eaae5d93c48c36880d9ca2")
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIEnumerator(name: "YVECT_SIZE_NANO", value: 4)
!60 = !DIEnumerator(name: "YVECT_SIZE_MINI", value: 32)
!61 = !DIEnumerator(name: "YVECT_SIZE_MEDIUM", value: 256)
!62 = !DIEnumerator(name: "YVECT_SIZE_DEFAULT", value: 4096)
!63 = !DIEnumerator(name: "YVECT_SIZE_BIG", value: 65536)
!64 = !DIEnumerator(name: "YVECT_SIZE_HUGE", value: 1048576)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ylog_priority_e", file: !66, line: 267, baseType: !52, size: 32, elements: !67)
!66 = !DIFile(filename: "../../lib/ylib/ylog.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "0a4bfecb6867d4cb83bdff3f2b1d4b13")
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIEnumerator(name: "YLOG_DEBUG", value: 0)
!69 = !DIEnumerator(name: "YLOG_INFO", value: 1)
!70 = !DIEnumerator(name: "YLOG_NOTE", value: 2)
!71 = !DIEnumerator(name: "YLOG_WARN", value: 3)
!72 = !DIEnumerator(name: "YLOG_ERR", value: 4)
!73 = !DIEnumerator(name: "YLOG_CRIT", value: 5)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !{!0, !7, !12, !17, !23, !28, !33, !38, !43}
!77 = !{i32 7, !"Dwarf Version", i32 5}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 8, !"PIC Level", i32 2}
!81 = !{i32 7, !"PIE Level", i32 2}
!82 = !{i32 7, !"uwtable", i32 2}
!83 = !{!"clang version 16.0.0"}
!84 = distinct !DISubprogram(name: "finedb_init", scope: !2, file: !2, line: 13, type: !85, scopeLine: 15, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !48, retainedNodes: !114)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !111, !110, !110, !112, !52, !110}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_t", file: !89, line: 49, baseType: !90)
!89 = !DIFile(filename: "./finedb.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "349d81e48e8fe143f3d7a471f97edb42")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_s", file: !89, line: 41, size: 384, elements: !91)
!91 = !{!92, !94, !99, !101, !102, !106, !109}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !90, file: !89, line: 42, baseType: !93, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybool_t", file: !51, line: 52, baseType: !50)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !90, file: !89, line: 43, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_env", file: !97, line: 197, baseType: !98)
!97 = !DIFile(filename: "../../lib/lmdb/lmdb.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "9ff9d4834608bdc966449cf81c779c6a")
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_env", file: !97, line: 197, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !90, file: !89, line: 44, baseType: !100, size: 32, offset: 128)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "threads_socket", scope: !90, file: !89, line: 45, baseType: !100, size: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "writer_tid", scope: !90, file: !89, line: 46, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !104, line: 27, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!105 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_threads", scope: !90, file: !89, line: 47, baseType: !107, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "yvect_t", file: !57, line: 56, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !90, file: !89, line: 48, baseType: !110, size: 16, offset: 320)
!110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 46, baseType: !105)
!113 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !127}
!115 = !DILocalVariable(name: "db_path", arg: 1, scope: !84, file: !2, line: 13, type: !111)
!116 = !DILocalVariable(name: "port", arg: 2, scope: !84, file: !2, line: 13, type: !110)
!117 = !DILocalVariable(name: "nbr_threads", arg: 3, scope: !84, file: !2, line: 14, type: !110)
!118 = !DILocalVariable(name: "mapsize", arg: 4, scope: !84, file: !2, line: 14, type: !112)
!119 = !DILocalVariable(name: "nbr_dbs", arg: 5, scope: !84, file: !2, line: 15, type: !52)
!120 = !DILocalVariable(name: "timeout", arg: 6, scope: !84, file: !2, line: 15, type: !110)
!121 = !DILocalVariable(name: "finedb", scope: !84, file: !2, line: 16, type: !87)
!122 = !DILocalVariable(name: "i", scope: !84, file: !2, line: 17, type: !110)
!123 = !DILocalVariable(name: "base_path", scope: !124, file: !2, line: 31, type: !126)
!124 = distinct !DILexicalBlock(scope: !125, file: !2, line: 30, column: 23)
!125 = distinct !DILexicalBlock(scope: !84, file: !2, line: 30, column: 6)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!127 = !DILocalVariable(name: "thread", scope: !128, file: !2, line: 56, type: !131)
!128 = distinct !DILexicalBlock(scope: !129, file: !2, line: 55, column: 36)
!129 = distinct !DILexicalBlock(scope: !130, file: !2, line: 55, column: 2)
!130 = distinct !DILexicalBlock(scope: !84, file: !2, line: 55, column: 2)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_thread_t", file: !133, line: 30, baseType: !134)
!133 = !DIFile(filename: "./connection_thread.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "285f9cd07088f6d468faef64cb1dc74b")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_thread_s", file: !133, line: 23, size: 320, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !134, file: !133, line: 24, baseType: !103, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "finedb", scope: !134, file: !133, line: 25, baseType: !87, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !134, file: !133, line: 26, baseType: !100, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "write_sock", scope: !134, file: !133, line: 27, baseType: !100, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !134, file: !133, line: 28, baseType: !111, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !134, file: !133, line: 29, baseType: !142, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_txn", file: !97, line: 204, baseType: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_txn", file: !97, line: 204, flags: DIFlagFwdDecl)
!145 = !DILocation(line: 0, scope: !84)
!146 = !DILocation(line: 20, column: 11, scope: !84)
!147 = !DILocation(line: 21, column: 14, scope: !84)
!148 = !{!149, !150, i64 0}
!149 = !{!"finedb_s", !150, i64 0, !152, i64 8, !153, i64 16, !153, i64 20, !154, i64 24, !152, i64 32, !155, i64 40}
!150 = !{!"omnipotent char", !151, i64 0}
!151 = !{!"Simple C/C++ TBAA"}
!152 = !{!"any pointer", !150, i64 0}
!153 = !{!"int", !150, i64 0}
!154 = !{!"long", !150, i64 0}
!155 = !{!"short", !150, i64 0}
!156 = !DILocation(line: 23, column: 10, scope: !84)
!157 = !DILocation(line: 23, column: 17, scope: !84)
!158 = !{!149, !153, i64 16}
!159 = !DILocation(line: 24, column: 10, scope: !84)
!160 = !DILocation(line: 26, column: 24, scope: !84)
!161 = !DILocation(line: 26, column: 10, scope: !84)
!162 = !DILocation(line: 26, column: 22, scope: !84)
!163 = !{!149, !152, i64 32}
!164 = !DILocation(line: 27, column: 10, scope: !84)
!165 = !DILocation(line: 27, column: 18, scope: !84)
!166 = !{!149, !155, i64 40}
!167 = !DILocation(line: 30, column: 14, scope: !125)
!168 = !DILocation(line: 30, column: 6, scope: !84)
!169 = !DILocation(line: 31, column: 27, scope: !124)
!170 = !DILocation(line: 0, scope: !124)
!171 = !DILocation(line: 32, column: 13, scope: !124)
!172 = !DILocation(line: 33, column: 3, scope: !124)
!173 = !DILocation(line: 34, column: 2, scope: !124)
!174 = !DILocation(line: 36, column: 53, scope: !84)
!175 = !DILocation(line: 36, column: 21, scope: !84)
!176 = !DILocation(line: 36, column: 10, scope: !84)
!177 = !DILocation(line: 36, column: 19, scope: !84)
!178 = !{!149, !152, i64 8}
!179 = !DILocation(line: 37, column: 23, scope: !180)
!180 = distinct !DILexicalBlock(scope: !84, file: !2, line: 37, column: 6)
!181 = !DILocation(line: 37, column: 6, scope: !84)
!182 = !DILocation(line: 38, column: 3, scope: !183)
!183 = distinct !DILexicalBlock(scope: !180, file: !2, line: 37, column: 32)
!184 = !DILocation(line: 39, column: 3, scope: !183)
!185 = !DILocation(line: 42, column: 32, scope: !186)
!186 = distinct !DILexicalBlock(scope: !84, file: !2, line: 42, column: 6)
!187 = !DILocation(line: 42, column: 30, scope: !186)
!188 = !{!149, !153, i64 20}
!189 = !DILocation(line: 42, column: 59, scope: !186)
!190 = !DILocation(line: 42, column: 63, scope: !186)
!191 = !DILocation(line: 43, column: 6, scope: !186)
!192 = !DILocation(line: 43, column: 63, scope: !186)
!193 = !DILocation(line: 42, column: 6, scope: !84)
!194 = !DILocation(line: 44, column: 3, scope: !195)
!195 = distinct !DILexicalBlock(scope: !186, file: !2, line: 43, column: 68)
!196 = !DILocation(line: 45, column: 3, scope: !195)
!197 = !DILocation(line: 46, column: 3, scope: !195)
!198 = !DILocation(line: 49, column: 30, scope: !199)
!199 = distinct !DILexicalBlock(scope: !84, file: !2, line: 49, column: 6)
!200 = !DILocation(line: 49, column: 6, scope: !199)
!201 = !DILocation(line: 49, column: 6, scope: !84)
!202 = !DILocation(line: 55, column: 16, scope: !129)
!203 = !DILocation(line: 55, column: 2, scope: !130)
!204 = !DILocation(line: 50, column: 3, scope: !205)
!205 = distinct !DILexicalBlock(scope: !199, file: !2, line: 49, column: 70)
!206 = !DILocation(line: 51, column: 26, scope: !205)
!207 = !DILocation(line: 51, column: 3, scope: !205)
!208 = !DILocation(line: 52, column: 3, scope: !205)
!209 = !DILocation(line: 58, column: 17, scope: !210)
!210 = distinct !DILexicalBlock(scope: !128, file: !2, line: 58, column: 7)
!211 = !DILocation(line: 0, scope: !128)
!212 = !DILocation(line: 58, column: 48, scope: !210)
!213 = !DILocation(line: 58, column: 7, scope: !128)
