; ModuleID = './src/aio/poller.c'
source_filename = "./src/aio/poller.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_poller = type { i32, i32, i32, ptr, ptr, i32 }
%struct.pollfd = type { i32, i16, i16 }
%struct.nn_poller_hndl = type { i32 }
%struct.nn_hndls_item = type { ptr, i32, i32 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [26 x i8] c"./src/aio/poller_poll.inc\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [17 x i8] c"%s [%d] (%s:%d)\0A\00", align 1, !dbg !12

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @nn_poller_init(ptr noundef %0) #0 !dbg !30 {
  %2 = alloca ptr, align 8
  store ptr %0, ptr %2, align 8
  call void @llvm.dbg.declare(metadata ptr %2, metadata !62, metadata !DIExpression()), !dbg !63
  %3 = load ptr, ptr %2, align 8, !dbg !64
  %4 = getelementptr inbounds %struct.nn_poller, ptr %3, i32 0, i32 0, !dbg !65
  store i32 0, ptr %4, align 8, !dbg !66
  %5 = load ptr, ptr %2, align 8, !dbg !67
  %6 = getelementptr inbounds %struct.nn_poller, ptr %5, i32 0, i32 1, !dbg !68
  store i32 0, ptr %6, align 4, !dbg !69
  %7 = load ptr, ptr %2, align 8, !dbg !70
  %8 = getelementptr inbounds %struct.nn_poller, ptr %7, i32 0, i32 2, !dbg !71
  store i32 16, ptr %8, align 8, !dbg !72

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/aio/poller_poll.inc", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "26e8075eb17704b0c72eaadc1d79728d")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 26)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 17)
!17 = distinct !DICompileUnit(language: DW_LANG_C11, file: !18, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !19, globals: !21, splitDebugInlining: false, nameTableKind: None)
!18 = !DIFile(filename: "src/aio/poller.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fb6604aa1a312dbbb3945cff2e88aecc")
!19 = !{!20}
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !{!0, !7, !12}
!22 = !{i32 7, !"Dwarf Version", i32 5}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{i32 8, !"PIC Level", i32 2}
!26 = !{i32 7, !"PIE Level", i32 2}
!27 = !{i32 7, !"uwtable", i32 2}
!28 = !{i32 7, !"frame-pointer", i32 2}
!29 = !{!"clang version 16.0.0"}
!30 = distinct !DISubprogram(name: "nn_poller_init", scope: !2, file: !2, line: 28, type: !31, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !61)
!31 = !DISubroutineType(types: !32)
!32 = !{!20, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !35, line: 31, size: 320, elements: !36)
!35 = !DIFile(filename: "./src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!36 = !{!37, !38, !39, !40, !49, !60}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !34, file: !35, line: 34, baseType: !20, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !34, file: !35, line: 37, baseType: !20, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !34, file: !35, line: 40, baseType: !20, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !34, file: !35, line: 43, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !43, line: 36, size: 64, elements: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!44 = !{!45, !46, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !42, file: !43, line: 38, baseType: !20, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !42, file: !43, line: 39, baseType: !47, size: 16, offset: 32)
!47 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !42, file: !43, line: 40, baseType: !47, size: 16, offset: 48)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !34, file: !35, line: 52, baseType: !50, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !35, line: 48, size: 128, elements: !52)
!52 = !{!53, !58, !59}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !51, file: !35, line: 49, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !35, line: 27, size: 32, elements: !56)
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !55, file: !35, line: 28, baseType: !20, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !51, file: !35, line: 50, baseType: !20, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !35, line: 51, baseType: !20, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !34, file: !35, line: 55, baseType: !20, size: 32, offset: 256)
!61 = !{}
!62 = !DILocalVariable(name: "self", arg: 1, scope: !30, file: !2, line: 28, type: !33)
!63 = !DILocation(line: 28, column: 39, scope: !30)
!64 = !DILocation(line: 30, column: 5, scope: !30)
!65 = !DILocation(line: 30, column: 11, scope: !30)
!66 = !DILocation(line: 30, column: 16, scope: !30)
!67 = !DILocation(line: 31, column: 5, scope: !30)
!68 = !DILocation(line: 31, column: 11, scope: !30)
!69 = !DILocation(line: 31, column: 17, scope: !30)
!70 = !DILocation(line: 32, column: 5, scope: !30)
!71 = !DILocation(line: 32, column: 11, scope: !30)
!72 = !DILocation(line: 32, column: 20, scope: !30)
!73 = !DILocation(line: 34, column: 9, scope: !30)
!74 = !DILocation(line: 33, column: 5, scope: !30)
!75 = !DILocation(line: 33, column: 11, scope: !30)
!76 = !DILocation(line: 33, column: 19, scope: !30)
!77 = !DILocation(line: 36, column: 5, scope: !30)
!78 = !DILocation(line: 36, column: 5, scope: !79)
!79 = distinct !DILexicalBlock(scope: !80, file: !2, line: 36, column: 5)
!80 = distinct !DILexicalBlock(scope: !30, file: !2, line: 36, column: 5)
!81 = !DILocation(line: 36, column: 5, scope: !80)
!82 = !DILocation(line: 36, column: 5, scope: !83)
!83 = distinct !DILexicalBlock(scope: !79, file: !2, line: 36, column: 5)
!84 = !DILocation(line: 38, column: 9, scope: !30)
!85 = !DILocation(line: 37, column: 5, scope: !30)
!86 = !DILocation(line: 37, column: 11, scope: !30)
!87 = !DILocation(line: 37, column: 17, scope: !30)
!88 = !DILocation(line: 40, column: 5, scope: !30)
!89 = !DILocation(line: 40, column: 5, scope: !90)
!90 = distinct !DILexicalBlock(scope: !91, file: !2, line: 40, column: 5)
!91 = distinct !DILexicalBlock(scope: !30, file: !2, line: 40, column: 5)
!92 = !DILocation(line: 40, column: 5, scope: !91)
!93 = !DILocation(line: 40, column: 5, scope: !94)
!94 = distinct !DILexicalBlock(scope: !90, file: !2, line: 40, column: 5)
!95 = !DILocation(line: 41, column: 5, scope: !30)
!96 = !DILocation(line: 41, column: 11, scope: !30)
!97 = !DILocation(line: 41, column: 19, scope: !30)
!98 = !DILocation(line: 43, column: 5, scope: !30)
!99 = distinct !DISubprogram(name: "nn_poller_term", scope: !2, file: !2, line: 46, type: !100, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !61)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !33}
!102 = !DILocalVariable(name: "self", arg: 1, scope: !99, file: !2, line: 46, type: !33)
!103 = !DILocation(line: 46, column: 40, scope: !99)
!104 = !DILocation(line: 48, column: 14, scope: !99)
!105 = !DILocation(line: 48, column: 20, scope: !99)
!106 = !DILocation(line: 48, column: 5, scope: !99)
!107 = !DILocation(line: 49, column: 14, scope: !99)
!108 = !DILocation(line: 49, column: 20, scope: !99)
!109 = !DILocation(line: 49, column: 5, scope: !99)
!110 = !DILocation(line: 50, column: 1, scope: !99)
!111 = distinct !DISubprogram(name: "nn_poller_add", scope: !2, file: !2, line: 52, type: !112, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !61)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !33, !20, !54}
!114 = !DILocalVariable(name: "self", arg: 1, scope: !111, file: !2, line: 52, type: !33)
!115 = !DILocation(line: 52, column: 39, scope: !111)
!116 = !DILocalVariable(name: "fd", arg: 2, scope: !111, file: !2, line: 52, type: !20)
!117 = !DILocation(line: 52, column: 49, scope: !111)
!118 = !DILocalVariable(name: "hndl", arg: 3, scope: !111, file: !2, line: 53, type: !54)
!119 = !DILocation(line: 53, column: 28, scope: !111)
!120 = !DILocalVariable(name: "rc", scope: !111, file: !2, line: 55, type: !20)
!121 = !DILocation(line: 55, column: 9, scope: !111)
!122 = !DILocation(line: 58, column: 9, scope: !123)
!123 = distinct !DILexicalBlock(scope: !111, file: !2, line: 58, column: 9)
!124 = !DILocation(line: 58, column: 9, scope: !111)
