; ModuleID = './src/aio/timer.c'
source_filename = "./src/aio/timer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_timer = type { %struct.nn_fsm, i32, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_timer, %struct.nn_fsm_event, ptr, i32 }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_worker_timer = type { ptr, %struct.nn_timerset_hndl }
%struct.nn_timerset_hndl = type { %struct.nn_list_item, i64 }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [30 x i8] c"Assertion failed: %s (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"self->state == NN_TIMER_STATE_IDLE\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [18 x i8] c"./src/aio/timer.c\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [13 x i8] c"timeout >= 0\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [31 x i8] c"type == NN_WORKER_TASK_EXECUTE\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [2 x i8] c"0\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [20 x i8] c"timer->timeout >= 0\00", align 1, !dbg !32

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/aio/timer.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "0fff62ba15d7b4e8f550695c2dd68708")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 30)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 35)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 18)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 13)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 31)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 2)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 20)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 21)
!42 = distinct !DICompileUnit(language: DW_LANG_C11, file: !43, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !44, globals: !221, splitDebugInlining: false, nameTableKind: None)
!43 = !DIFile(filename: "src/aio/timer.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "0fff62ba15d7b4e8f550695c2dd68708")
!44 = !{!45, !220, !60}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timer", file: !47, line: 32, size: 1664, elements: !48)
!47 = !DIFile(filename: "./src/aio/timer.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "36b8c8892aa99fc49b85b12a9caf893a")
!48 = !{!49, !81, !82, !88, !89, !111, !112, !219}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !46, file: !47, line: 33, baseType: !50, size: 640)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !51, line: 66, size: 640, elements: !52)
!51 = !DIFile(filename: "./src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!52 = !{!53, !61, !62, !63, !64, !65, !68}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !50, file: !51, line: 67, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !51, line: 58, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !59, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !50, file: !51, line: 68, baseType: !59, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !50, file: !51, line: 69, baseType: !59, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !50, file: !51, line: 70, baseType: !60, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !50, file: !51, line: 71, baseType: !58, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !50, file: !51, line: 72, baseType: !66, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !51, line: 30, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !50, file: !51, line: 73, baseType: !69, size: 320, offset: 320)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !51, line: 34, size: 320, elements: !70)
!70 = !{!71, !72, !73, !74, !75}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !69, file: !51, line: 35, baseType: !58, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !69, file: !51, line: 36, baseType: !59, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !69, file: !51, line: 37, baseType: !60, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !51, line: 38, baseType: !59, size: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !69, file: !51, line: 39, baseType: !76, size: 64, offset: 256)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !77, line: 33, size: 64, elements: !78)
!77 = !DIFile(filename: "./src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !77, line: 34, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !46, file: !47, line: 34, baseType: !59, size: 32, offset: 640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "start_task", scope: !46, file: !47, line: 35, baseType: !83, size: 128, offset: 704)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !84, line: 48, size: 128, elements: !85)
!84 = !DIFile(filename: "./src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !83, file: !84, line: 49, baseType: !58, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !83, file: !84, line: 50, baseType: !76, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "stop_task", scope: !46, file: !47, line: 36, baseType: !83, size: 128, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "wtimer", scope: !46, file: !47, line: 37, baseType: !90, size: 256, offset: 960)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !91, line: 37, size: 256, elements: !92)
!91 = !DIFile(filename: "./src/aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !90, file: !91, line: 38, baseType: !58, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !90, file: !91, line: 39, baseType: !95, size: 192, offset: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !96, line: 32, size: 192, elements: !97)
!96 = !DIFile(filename: "./src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!97 = !{!98, !105}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !95, file: !96, line: 33, baseType: !99, size: 128)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !100, line: 26, size: 128, elements: !101)
!100 = !DIFile(filename: "./src/aio/../utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !99, file: !100, line: 27, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !99, file: !100, line: 28, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !95, file: !96, line: 34, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !107, line: 27, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !109, line: 45, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!110 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !46, file: !47, line: 38, baseType: !69, size: 320, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !46, file: !47, line: 39, baseType: !113, size: 64, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !84, line: 53, size: 1408, elements: !115)
!115 = !{!116, !152, !157, !158, !164, !191, !192, !206}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !114, file: !84, line: 54, baseType: !117, size: 320)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !118, line: 32, size: 320, elements: !119)
!118 = !DIFile(filename: "./src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !117, file: !118, line: 36, baseType: !121, size: 320)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !122, line: 72, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !122, line: 67, size: 320, elements: !124)
!124 = !{!125, !146, !150}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !123, file: !122, line: 69, baseType: !126, size: 320)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !127, line: 22, size: 320, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!128 = !{!129, !130, !132, !133, !134, !135, !137, !138}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !126, file: !127, line: 24, baseType: !59, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !126, file: !127, line: 25, baseType: !131, size: 32, offset: 32)
!131 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !126, file: !127, line: 26, baseType: !59, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !126, file: !127, line: 28, baseType: !131, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !126, file: !127, line: 32, baseType: !59, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !126, file: !127, line: 34, baseType: !136, size: 16, offset: 160)
!136 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !126, file: !127, line: 35, baseType: !136, size: 16, offset: 176)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !126, file: !127, line: 36, baseType: !139, size: 128, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !140, line: 55, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !140, line: 51, size: 128, elements: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !141, file: !140, line: 53, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !141, file: !140, line: 54, baseType: !144, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !123, file: !122, line: 70, baseType: !147, size: 320)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 40)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !123, file: !122, line: 71, baseType: !151, size: 64)
!151 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !114, file: !84, line: 55, baseType: !153, size: 128, offset: 320)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !77, line: 37, size: 128, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !153, file: !77, line: 38, baseType: !80, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !153, file: !77, line: 39, baseType: !80, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !114, file: !84, line: 56, baseType: !76, size: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !114, file: !84, line: 57, baseType: !159, size: 64, offset: 512)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !160, line: 25, size: 64, elements: !161)
!160 = !DIFile(filename: "./src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !159, file: !160, line: 26, baseType: !59, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !159, file: !160, line: 27, baseType: !59, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !114, file: !84, line: 58, baseType: !165, size: 320, offset: 576)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !166, line: 31, size: 320, elements: !167)
!166 = !DIFile(filename: "./src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!167 = !{!168, !169, !170, !171, !179, !190}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !165, file: !166, line: 34, baseType: !59, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !165, file: !166, line: 37, baseType: !59, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !165, file: !166, line: 40, baseType: !59, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !165, file: !166, line: 43, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !174, line: 36, size: 64, elements: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!175 = !{!176, !177, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !173, file: !174, line: 38, baseType: !59, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !173, file: !174, line: 39, baseType: !136, size: 16, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !173, file: !174, line: 40, baseType: !136, size: 16, offset: 48)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !165, file: !166, line: 52, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !166, line: 48, size: 128, elements: !182)
!182 = !{!183, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !181, file: !166, line: 49, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !166, line: 27, size: 32, elements: !186)
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !185, file: !166, line: 28, baseType: !59, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !166, line: 50, baseType: !59, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !166, line: 51, baseType: !59, size: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !165, file: !166, line: 55, baseType: !59, size: 32, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !114, file: !84, line: 59, baseType: !185, size: 32, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !114, file: !84, line: 60, baseType: !193, size: 256, offset: 960)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !96, line: 37, size: 256, elements: !194)
!194 = !{!195, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !193, file: !96, line: 38, baseType: !196, size: 128)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !197, line: 31, size: 128, elements: !198)
!197 = !DIFile(filename: "./src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !196, file: !197, line: 33, baseType: !106, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !196, file: !197, line: 34, baseType: !106, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !193, file: !96, line: 39, baseType: !202, size: 128, offset: 128)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !100, line: 31, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !202, file: !100, line: 32, baseType: !103, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !202, file: !100, line: 33, baseType: !103, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !114, file: !84, line: 61, baseType: !207, size: 192, offset: 1216)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !208, line: 25, size: 192, elements: !209)
!208 = !DIFile(filename: "./src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!209 = !{!210, !216, !217}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !207, file: !208, line: 27, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !213, line: 28, baseType: !214)
!213 = !DIFile(filename: "./src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!214 = !DISubroutineType(types: !215)
!215 = !{null, !60}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !207, file: !208, line: 28, baseType: !60, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !207, file: !208, line: 29, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !122, line: 27, baseType: !110)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !46, file: !47, line: 40, baseType: !59, size: 32, offset: 1600)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!221 = !{!0, !7, !12, !17, !22, !27, !32, !37}
!222 = !{i32 7, !"Dwarf Version", i32 5}
!223 = !{i32 2, !"Debug Info Version", i32 3}
!224 = !{i32 1, !"wchar_size", i32 4}
!225 = !{i32 8, !"PIC Level", i32 2}
!226 = !{i32 7, !"PIE Level", i32 2}
!227 = !{i32 7, !"uwtable", i32 2}
!228 = !{i32 7, !"frame-pointer", i32 2}
!229 = !{!"clang version 16.0.0"}
!230 = distinct !DISubprogram(name: "nn_timer_init", scope: !2, file: !2, line: 39, type: !231, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !42, retainedNodes: !233)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !45, !59, !58}
!233 = !{}
!234 = !DILocalVariable(name: "self", arg: 1, scope: !230, file: !2, line: 39, type: !45)
!235 = !DILocation(line: 39, column: 38, scope: !230)
!236 = !DILocalVariable(name: "src", arg: 2, scope: !230, file: !2, line: 39, type: !59)
!237 = !DILocation(line: 39, column: 48, scope: !230)
!238 = !DILocalVariable(name: "owner", arg: 3, scope: !230, file: !2, line: 39, type: !58)
!239 = !DILocation(line: 39, column: 68, scope: !230)
!240 = !DILocation(line: 41, column: 19, scope: !230)
!241 = !DILocation(line: 41, column: 25, scope: !230)
!242 = !DILocation(line: 41, column: 48, scope: !230)
!243 = !DILocation(line: 41, column: 53, scope: !230)
!244 = !DILocation(line: 41, column: 59, scope: !230)
!245 = !DILocation(line: 41, column: 5, scope: !230)
!246 = !DILocation(line: 42, column: 5, scope: !230)
!247 = !DILocation(line: 42, column: 11, scope: !230)
!248 = !DILocation(line: 42, column: 17, scope: !230)
!249 = !DILocation(line: 43, column: 27, scope: !230)
!250 = !DILocation(line: 43, column: 33, scope: !230)
!251 = !DILocation(line: 43, column: 46, scope: !230)
!252 = !DILocation(line: 43, column: 52, scope: !230)
!253 = !DILocation(line: 43, column: 5, scope: !230)
!254 = !DILocation(line: 44, column: 27, scope: !230)
!255 = !DILocation(line: 44, column: 33, scope: !230)
!256 = !DILocation(line: 44, column: 45, scope: !230)
!257 = !DILocation(line: 44, column: 51, scope: !230)
!258 = !DILocation(line: 44, column: 5, scope: !230)
!259 = !DILocation(line: 45, column: 28, scope: !230)
!260 = !DILocation(line: 45, column: 34, scope: !230)
!261 = !DILocation(line: 45, column: 43, scope: !230)
!262 = !DILocation(line: 45, column: 49, scope: !230)
!263 = !DILocation(line: 45, column: 5, scope: !230)
!264 = !DILocation(line: 46, column: 25, scope: !230)
!265 = !DILocation(line: 46, column: 31, scope: !230)
!266 = !DILocation(line: 46, column: 5, scope: !230)
!267 = !DILocation(line: 47, column: 43, scope: !230)
!268 = !DILocation(line: 47, column: 49, scope: !230)
!269 = !DILocation(line: 47, column: 20, scope: !230)
!270 = !DILocation(line: 47, column: 5, scope: !230)
!271 = !DILocation(line: 47, column: 11, scope: !230)
!272 = !DILocation(line: 47, column: 18, scope: !230)
!273 = !DILocation(line: 48, column: 5, scope: !230)
!274 = !DILocation(line: 48, column: 11, scope: !230)
!275 = !DILocation(line: 48, column: 19, scope: !230)
!276 = !DILocation(line: 49, column: 1, scope: !230)
!277 = distinct !DISubprogram(name: "nn_timer_handler", scope: !2, file: !2, line: 81, type: !56, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !233)
!278 = !DILocalVariable(name: "self", arg: 1, scope: !277, file: !2, line: 81, type: !58)
!279 = !DILocation(line: 81, column: 46, scope: !277)
!280 = !DILocalVariable(name: "src", arg: 2, scope: !277, file: !2, line: 81, type: !59)
!281 = !DILocation(line: 81, column: 56, scope: !277)
!282 = !DILocalVariable(name: "type", arg: 3, scope: !277, file: !2, line: 81, type: !59)
!283 = !DILocation(line: 81, column: 65, scope: !277)
!284 = !DILocalVariable(name: "srcptr", arg: 4, scope: !277, file: !2, line: 82, type: !60)
