; ModuleID = './src/aio/worker.c'
source_filename = "./src/aio/worker.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_worker_fd = type { ptr, %struct.nn_poller_hndl }
%struct.nn_poller_hndl = type { i32 }
%struct.nn_worker = type { %struct.nn_mutex, %struct.nn_queue, %struct.nn_queue_item, %struct.nn_efd, %struct.nn_poller, %struct.nn_poller_hndl, %struct.nn_timerset, %struct.nn_thread }
%struct.nn_mutex = type { %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.nn_queue = type { ptr, ptr }
%struct.nn_queue_item = type { ptr }
%struct.nn_efd = type { i32, i32 }
%struct.nn_poller = type { i32, i32, i32, ptr, ptr, i32 }
%struct.nn_timerset = type { %struct.nn_clock, %struct.nn_list }
%struct.nn_clock = type { i64, i64 }
%struct.nn_list = type { ptr, ptr }
%struct.nn_thread = type { ptr, ptr, i64 }
%struct.nn_worker_timer = type { ptr, %struct.nn_timerset_hndl }
%struct.nn_timerset_hndl = type { %struct.nn_list_item, i64 }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/aio/worker_posix.inc", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3272be1afd51c361b5aa7a9ceff9f1cb")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 17)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 27)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 30)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 23)
!22 = distinct !DICompileUnit(language: DW_LANG_C11, file: !23, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !24, globals: !212, splitDebugInlining: false, nameTableKind: None)
!23 = !DIFile(filename: "src/aio/worker.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b3d7b7ad6824c5e0d3bb4bc5ac4c8c06")
!24 = !{!25, !43, !151, !201, !202, !207}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !27, line: 53, size: 1408, elements: !28)
!27 = !DIFile(filename: "./src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!28 = !{!29, !66, !76, !77, !83, !110, !111, !137}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !26, file: !27, line: 54, baseType: !30, size: 320)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !31, line: 32, size: 320, elements: !32)
!31 = !DIFile(filename: "./src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !30, file: !31, line: 36, baseType: !34, size: 320)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !35, line: 72, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!36 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !35, line: 67, size: 320, elements: !37)
!37 = !{!38, !60, !64}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !36, file: !35, line: 69, baseType: !39, size: 320)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !40, line: 22, size: 320, elements: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!41 = !{!42, !44, !46, !47, !48, !49, !51, !52}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !39, file: !40, line: 24, baseType: !43, size: 32)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !39, file: !40, line: 25, baseType: !45, size: 32, offset: 32)
!45 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !39, file: !40, line: 26, baseType: !43, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !39, file: !40, line: 28, baseType: !45, size: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !39, file: !40, line: 32, baseType: !43, size: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !39, file: !40, line: 34, baseType: !50, size: 16, offset: 160)
!50 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !39, file: !40, line: 35, baseType: !50, size: 16, offset: 176)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !39, file: !40, line: 36, baseType: !53, size: 128, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !54, line: 55, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !54, line: 51, size: 128, elements: !56)
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !55, file: !54, line: 53, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !55, file: !54, line: 54, baseType: !58, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !36, file: !35, line: 70, baseType: !61, size: 320)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 40)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !36, file: !35, line: 71, baseType: !65, size: 64)
!65 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !26, file: !27, line: 55, baseType: !67, size: 128, offset: 320)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !68, line: 37, size: 128, elements: !69)
!68 = !DIFile(filename: "./src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!69 = !{!70, !75}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !67, file: !68, line: 38, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !68, line: 33, size: 64, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !68, line: 34, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !67, file: !68, line: 39, baseType: !71, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !26, file: !27, line: 56, baseType: !72, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !26, file: !27, line: 57, baseType: !78, size: 64, offset: 512)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !79, line: 25, size: 64, elements: !80)
!79 = !DIFile(filename: "./src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !78, file: !79, line: 26, baseType: !43, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !78, file: !79, line: 27, baseType: !43, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !26, file: !27, line: 58, baseType: !84, size: 320, offset: 576)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !85, line: 31, size: 320, elements: !86)
!85 = !DIFile(filename: "./src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!86 = !{!87, !88, !89, !90, !98, !109}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !85, line: 34, baseType: !43, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !84, file: !85, line: 37, baseType: !43, size: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !84, file: !85, line: 40, baseType: !43, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !84, file: !85, line: 43, baseType: !91, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !93, line: 36, size: 64, elements: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!94 = !{!95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !92, file: !93, line: 38, baseType: !43, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !92, file: !93, line: 39, baseType: !50, size: 16, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !92, file: !93, line: 40, baseType: !50, size: 16, offset: 48)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !84, file: !85, line: 52, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !85, line: 48, size: 128, elements: !101)
!101 = !{!102, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !100, file: !85, line: 49, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !85, line: 27, size: 32, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !104, file: !85, line: 28, baseType: !43, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !85, line: 50, baseType: !43, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !85, line: 51, baseType: !43, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !84, file: !85, line: 55, baseType: !43, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !26, file: !27, line: 59, baseType: !104, size: 32, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !26, file: !27, line: 60, baseType: !112, size: 256, offset: 960)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !113, line: 37, size: 256, elements: !114)
!113 = !DIFile(filename: "./src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!114 = !{!115, !126}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !112, file: !113, line: 38, baseType: !116, size: 128)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !117, line: 31, size: 128, elements: !118)
!117 = !DIFile(filename: "./src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!118 = !{!119, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !116, file: !117, line: 33, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !121, line: 27, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !123, line: 45, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!124 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !116, file: !117, line: 34, baseType: !120, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !112, file: !113, line: 39, baseType: !127, size: 128, offset: 128)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !128, line: 31, size: 128, elements: !129)
!128 = !DIFile(filename: "./src/aio/../utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !127, file: !128, line: 32, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !128, line: 26, size: 128, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !128, line: 27, baseType: !131, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !128, line: 28, baseType: !131, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !127, file: !128, line: 33, baseType: !131, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !26, file: !27, line: 61, baseType: !138, size: 192, offset: 1216)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !139, line: 25, size: 192, elements: !140)
!139 = !DIFile(filename: "./src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!140 = !{!141, !148, !149}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !138, file: !139, line: 27, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !144, line: 28, baseType: !145)
!144 = !DIFile(filename: "./src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!145 = !DISubroutineType(types: !146)
!146 = !{null, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !138, file: !139, line: 28, baseType: !147, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !138, file: !139, line: 29, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !35, line: 27, baseType: !124)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !153, line: 37, size: 256, elements: !154)
!153 = !DIFile(filename: "./src/aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!154 = !{!155, !196}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !152, file: !153, line: 38, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !158, line: 66, size: 640, elements: !159)
!158 = !DIFile(filename: "./src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!159 = !{!160, !165, !166, !167, !168, !169, !188}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !157, file: !158, line: 67, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !158, line: 58, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !156, !43, !43, !147}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !157, file: !158, line: 68, baseType: !43, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !157, file: !158, line: 69, baseType: !43, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !157, file: !158, line: 70, baseType: !147, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !157, file: !158, line: 71, baseType: !156, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !157, file: !158, line: 72, baseType: !170, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !172, line: 37, size: 704, elements: !173)
!172 = !DIFile(filename: "./src/aio/ctx.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "02553d3500c8d7bb20cd89fa252fe2c2")
!173 = !{!174, !175, !181, !182, !183}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !171, file: !172, line: 38, baseType: !30, size: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !171, file: !172, line: 39, baseType: !176, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pool", file: !178, line: 30, size: 1408, elements: !179)
!178 = !DIFile(filename: "./src/aio/pool.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a87eb417ecad65fee67523e01b3df661")
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !177, file: !178, line: 31, baseType: !26, size: 1408)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !171, file: !172, line: 40, baseType: !67, size: 128, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "eventsto", scope: !171, file: !172, line: 41, baseType: !67, size: 128, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "onleave", scope: !171, file: !172, line: 42, baseType: !184, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_ctx_onleave", file: !172, line: 35, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !170}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !157, file: !158, line: 73, baseType: !189, size: 320, offset: 320)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !158, line: 34, size: 320, elements: !190)
!190 = !{!191, !192, !193, !194, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !189, file: !158, line: 35, baseType: !156, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !189, file: !158, line: 36, baseType: !43, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !189, file: !158, line: 37, baseType: !147, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !158, line: 38, baseType: !43, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !189, file: !158, line: 39, baseType: !72, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !152, file: !153, line: 39, baseType: !197, size: 192, offset: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !113, line: 32, size: 192, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !197, file: !113, line: 33, baseType: !132, size: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !197, file: !113, line: 34, baseType: !120, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !27, line: 48, size: 128, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !203, file: !27, line: 49, baseType: !156, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !203, file: !27, line: 50, baseType: !72, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_fd", file: !27, line: 40, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !208, file: !27, line: 41, baseType: !156, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !208, file: !27, line: 42, baseType: !104, size: 32, offset: 64)
!212 = !{!0, !7, !12, !17}
!213 = !{i32 7, !"Dwarf Version", i32 5}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{i32 1, !"wchar_size", i32 4}
!216 = !{i32 8, !"PIC Level", i32 2}
!217 = !{i32 7, !"PIE Level", i32 2}
!218 = !{i32 7, !"uwtable", i32 2}
!219 = !{i32 7, !"frame-pointer", i32 2}
!220 = !{!"clang version 16.0.0"}
!221 = distinct !DISubprogram(name: "nn_worker_fd_init", scope: !2, file: !2, line: 32, type: !222, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !22, retainedNodes: !224)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !207, !156}
!224 = !{}
!225 = !DILocalVariable(name: "self", arg: 1, scope: !221, file: !2, line: 32, type: !207)
!226 = !DILocation(line: 32, column: 46, scope: !221)
!227 = !DILocalVariable(name: "owner", arg: 2, scope: !221, file: !2, line: 32, type: !156)
!228 = !DILocation(line: 32, column: 67, scope: !221)
!229 = !DILocation(line: 34, column: 19, scope: !221)
!230 = !DILocation(line: 34, column: 5, scope: !221)
!231 = !DILocation(line: 34, column: 11, scope: !221)
!232 = !DILocation(line: 34, column: 17, scope: !221)
!233 = !DILocation(line: 35, column: 1, scope: !221)
!234 = distinct !DISubprogram(name: "nn_worker_fd_term", scope: !2, file: !2, line: 37, type: !235, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !22, retainedNodes: !224)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !207}
!237 = !DILocalVariable(name: "self", arg: 1, scope: !234, file: !2, line: 37, type: !207)
!238 = !DILocation(line: 37, column: 46, scope: !234)
!239 = !DILocation(line: 39, column: 1, scope: !234)
!240 = distinct !DISubprogram(name: "nn_worker_add_fd", scope: !2, file: !2, line: 41, type: !241, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !22, retainedNodes: !224)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !25, !43, !207}
!243 = !DILocalVariable(name: "self", arg: 1, scope: !240, file: !2, line: 41, type: !25)
!244 = !DILocation(line: 41, column: 42, scope: !240)
!245 = !DILocalVariable(name: "s", arg: 2, scope: !240, file: !2, line: 41, type: !43)
!246 = !DILocation(line: 41, column: 52, scope: !240)
!247 = !DILocalVariable(name: "fd", arg: 3, scope: !240, file: !2, line: 41, type: !207)
!248 = !DILocation(line: 41, column: 76, scope: !240)
!249 = !DILocation(line: 43, column: 42, scope: !240)
!250 = !DILocation(line: 43, column: 49, scope: !240)
!251 = !DILocation(line: 43, column: 57, scope: !240)
!252 = !DILocation(line: 43, column: 61, scope: !240)
!253 = !DILocation(line: 43, column: 65, scope: !240)
!254 = !DILocation(line: 43, column: 5, scope: !240)
!255 = !DILocation(line: 44, column: 1, scope: !240)
!256 = distinct !DISubprogram(name: "nn_worker_rm_fd", scope: !2, file: !2, line: 46, type: !257, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !22, retainedNodes: !224)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !25, !207}
!259 = !DILocalVariable(name: "self", arg: 1, scope: !256, file: !2, line: 46, type: !25)
!260 = !DILocation(line: 46, column: 41, scope: !256)
!261 = !DILocalVariable(name: "fd", arg: 2, scope: !256, file: !2, line: 46, type: !207)
!262 = !DILocation(line: 46, column: 68, scope: !256)
!263 = !DILocation(line: 48, column: 41, scope: !256)
!264 = !DILocation(line: 48, column: 48, scope: !256)
!265 = !DILocation(line: 48, column: 57, scope: !256)
!266 = !DILocation(line: 48, column: 61, scope: !256)
!267 = !DILocation(line: 48, column: 5, scope: !256)
!268 = !DILocation(line: 49, column: 1, scope: !256)
!269 = distinct !DISubprogram(name: "nn_worker_set_in", scope: !2, file: !2, line: 51, type: !257, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !22, retainedNodes: !224)
!270 = !DILocalVariable(name: "self", arg: 1, scope: !269, file: !2, line: 51, type: !25)
