; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.6 = type { ptr, ptr, ptr }
%struct.bpf_config = type { i64, i64, i8, i8, i8, i8, i32 }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.parsing_context = type { ptr, ptr, %struct.hdr_cursor, i32, i32, i8 }
%struct.hdr_cursor = type { ptr }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %struct.hdr_cursor, i64, i32, i32, %struct.hdr_cursor, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.flow_event = type { i64, i64, %struct.network_tuple, i8, i8, i8, i8 }
%struct.network_tuple = type { %struct.flow_address, %struct.flow_address, i16, i8, i8 }
%struct.flow_address = type { %struct.in6_addr, i16, i16 }
%struct.in6_addr = type { %union.anon.4 }
%union.anon.4 = type { [4 x i32] }
%struct.rtt_event = type { i64, i64, %struct.network_tuple, i32, i64, i64, i64, i64, i64, i64, i8, [7 x i8] }
%struct.map_full_event = type { i64, i64, %struct.network_tuple, i8, [3 x i8] }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.19, %union.anon.4, %union.anon.4, i16, i16, [6 x i8], [6 x i8] }
%union.anon.19 = type { i32 }
%struct.flow_state = type { i64, i64, i64, i64, i64, i64, i64, i32, i8, i8, i16 }

!57 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!58 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!59 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!60 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 397, baseType: !7, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "BPF_ANY", value: 0)
!64 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!65 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!66 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pping_map", file: !15, line: 41, baseType: !16, size: 8, elements: !68)
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "PPING_MAP_FLOWSTATE", value: 0)
!70 = !DIEnumerator(name: "PPING_MAP_PACKETTS", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4063, baseType: !72, size: 64, elements: !73)
!72 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!73 = !{!74, !75, !76}
!74 = !DIEnumerator(name: "BPF_F_INDEX_MASK", value: 4294967295, isUnsigned: true)
!75 = !DIEnumerator(name: "BPF_F_CURRENT_CPU", value: 4294967295, isUnsigned: true)
!76 = !DIEnumerator(name: "BPF_F_CTXLEN_MASK", value: 4503595332403200, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4955, baseType: !7, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87}
!79 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_SUCCESS", value: 0)
!80 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_BLACKHOLE", value: 1)
!81 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNREACHABLE", value: 2)
!82 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_PROHIBIT", value: 3)
!83 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NOT_FWDED", value: 4)
!84 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FWD_DISABLED", value: 5)
!85 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNSUPP_LWT", value: 6)
!86 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NO_NEIGH", value: 7)
!87 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FRAG_NEEDED", value: 8)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "flow_event_source", file: !15, line: 35, baseType: !16, size: 8, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "EVENT_SOURCE_PKT_SRC", value: 0)
!91 = !DIEnumerator(name: "EVENT_SOURCE_PKT_DEST", value: 1)
!92 = !DIEnumerator(name: "EVENT_SOURCE_USERSPACE", value: 2)
!93 = !{!94, !95, !96, !99, !101, !103, !105, !127, !124, !104}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!95 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !97, line: 24, baseType: !98)
!97 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !97, line: 21, baseType: !16)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !97, line: 27, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !107, line: 33, size: 128, elements: !108)
!107 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !106, file: !107, line: 40, baseType: !110, size: 128)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !107, line: 34, size: 128, elements: !111)
!111 = !{!112, !116, !122}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !110, file: !107, line: 35, baseType: !113, size: 128)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !110, file: !107, line: 37, baseType: !117, size: 128)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, elements: !120)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !119, line: 25, baseType: !96)
!119 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!120 = !{!121}
!121 = !DISubrange(count: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !110, file: !107, line: 38, baseType: !123, size: 128)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !125)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !119, line: 27, baseType: !104)
!125 = !{!126}
!126 = !DISubrange(count: 4)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!128 = !{!0, !129, !166, !190, !199, !205, !219, !226, !231, !237, !242, !280}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "packet_ts", scope: !2, file: !3, line: 93, type: !131, isLocal: false, isDefinition: true)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 88, size: 256, elements: !132)
!132 = !{!133, !139, !157, !161}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !3, line: 89, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !137)
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !131, file: !3, line: 90, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id", file: !15, line: 96, size: 384, elements: !142)
!142 = !{!143, !156}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !141, file: !15, line: 97, baseType: !144, size: 352)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network_tuple", file: !15, line: 74, size: 352, elements: !145)
!145 = !{!146, !152, !153, !154, !155}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !144, file: !15, line: 75, baseType: !147, size: 160)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_address", file: !15, line: 61, size: 160, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !147, file: !15, line: 62, baseType: !106, size: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !147, file: !15, line: 63, baseType: !96, size: 16, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !147, file: !15, line: 64, baseType: !96, size: 16, offset: 144)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !144, file: !15, line: 76, baseType: !147, size: 160, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !144, file: !15, line: 77, baseType: !96, size: 16, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ipv", scope: !144, file: !15, line: 78, baseType: !102, size: 8, offset: 336)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !144, file: !15, line: 79, baseType: !102, size: 8, offset: 344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !141, file: !15, line: 98, baseType: !104, size: 32, offset: 352)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !3, line: 91, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !97, line: 31, baseType: !160)
!160 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !131, file: !3, line: 92, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 524288, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 16384)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "flow_state", scope: !2, file: !3, line: 100, type: !168, isLocal: false, isDefinition: true)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 95, size: 256, elements: !169)
!169 = !{!170, !171, !173, !189}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !3, line: 96, baseType: !134, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !168, file: !3, line: 97, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !168, file: !3, line: 98, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_state", file: !15, line: 82, size: 512, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "min_rtt", scope: !175, file: !15, line: 83, baseType: !159, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "srtt", scope: !175, file: !15, line: 84, baseType: !159, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !175, file: !15, line: 85, baseType: !159, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sent_pkts", scope: !175, file: !15, line: 86, baseType: !159, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !175, file: !15, line: 87, baseType: !159, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rec_pkts", scope: !175, file: !15, line: 88, baseType: !159, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rec_bytes", scope: !175, file: !15, line: 89, baseType: !159, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !175, file: !15, line: 90, baseType: !104, size: 32, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "has_opened", scope: !175, file: !15, line: 91, baseType: !186, size: 8, offset: 480)
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "opening_reason", scope: !175, file: !15, line: 92, baseType: !14, size: 8, offset: 488)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !175, file: !15, line: 93, baseType: !96, size: 16, offset: 496)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !168, file: !3, line: 99, baseType: !162, size: 64, offset: 192)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "events", scope: !2, file: !3, line: 106, type: !192, isLocal: false, isDefinition: true)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 102, size: 192, elements: !193)
!193 = !{!194, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !3, line: 103, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !125)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !192, file: !3, line: 104, baseType: !195, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !192, file: !3, line: 105, baseType: !195, size: 64, offset: 128)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !201, line: 109, type: !202, isLocal: true, isDefinition: true)
!201 = !DIFile(filename: "../lib/libbpf-install/usr/include/bpf/bpf_helper_defs.h", directory: "/home/raj/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "52f02fca464a4053efa2721be82f1a3e")
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!159}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 83, type: !207, isLocal: true, isDefinition: true)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_config", file: !15, line: 46, size: 192, elements: !210)
!210 = !{!211, !212, !214, !215, !216, !217, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rate_limit", scope: !209, file: !15, line: 47, baseType: !159, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_rate", scope: !209, file: !15, line: 48, baseType: !213, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixpoint64", file: !15, line: 9, baseType: !159)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "use_srtt", scope: !209, file: !15, line: 49, baseType: !186, size: 8, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "track_tcp", scope: !209, file: !15, line: 50, baseType: !186, size: 8, offset: 136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "track_icmp", scope: !209, file: !15, line: 51, baseType: !186, size: 8, offset: 144)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "localfilt", scope: !209, file: !15, line: 52, baseType: !186, size: 8, offset: 152)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !209, file: !15, line: 53, baseType: !104, size: 32, offset: 160)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !201, line: 51, type: !221, isLocal: true, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!94, !94, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !201, line: 73, type: !228, isLocal: true, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!95, !94, !224, !224, !159}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "last_warn_time", scope: !2, file: !3, line: 84, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 128, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!235 = !{!236}
!236 = !DISubrange(count: 2)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "bpf_perf_event_output", scope: !2, file: !201, line: 686, type: !239, isLocal: true, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!95, !94, !94, !159, !94, !159}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !201, line: 1816, type: !244, isLocal: true, isDefinition: true)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!95, !94, !247, !136, !104}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 4967, size: 512, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !262, !268, !273, !274, !275, !279}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !248, file: !6, line: 4971, baseType: !102, size: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !248, file: !6, line: 4974, baseType: !102, size: 8, offset: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !248, file: !6, line: 4975, baseType: !118, size: 16, offset: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !248, file: !6, line: 4976, baseType: !118, size: 16, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !248, file: !6, line: 4979, baseType: !96, size: 16, offset: 48)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !248, file: !6, line: 4984, baseType: !104, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !6, line: 4986, baseType: !257, size: 32, offset: 96)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !6, line: 4986, size: 32, elements: !258)
!258 = !{!259, !260, !261}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !257, file: !6, line: 4988, baseType: !102, size: 8)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !257, file: !6, line: 4989, baseType: !124, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !257, file: !6, line: 4992, baseType: !104, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !6, line: 4995, baseType: !263, size: 128, offset: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !6, line: 4995, size: 128, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !263, file: !6, line: 4996, baseType: !124, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !263, file: !6, line: 4997, baseType: !267, size: 128)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !125)
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !6, line: 5004, baseType: !269, size: 128, offset: 256)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !6, line: 5004, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !269, file: !6, line: 5005, baseType: !124, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !269, file: !6, line: 5006, baseType: !267, size: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !248, file: !6, line: 5010, baseType: !118, size: 16, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !248, file: !6, line: 5011, baseType: !118, size: 16, offset: 400)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !248, file: !6, line: 5012, baseType: !276, size: 48, offset: 416)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 48, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 6)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !248, file: !6, line: 5013, baseType: !276, size: 48, offset: 464)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !201, line: 83, type: !282, isLocal: true, isDefinition: true)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!95, !94, !224}
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 32, elements: !125)
!286 = !{!"clang version 16.0.0"}
!287 = !{i32 7, !"Dwarf Version", i32 5}
!288 = !{i32 2, !"Debug Info Version", i32 3}
!289 = !{i32 1, !"wchar_size", i32 4}
!290 = !{i32 7, !"frame-pointer", i32 2}
!291 = !{i32 8, !"PIC Level", i32 0}
!292 = !{i32 7, !"PIE Level", i32 2}
!293 = !{i32 7, !"uwtable", i32 2}
!294 = distinct !DISubprogram(name: "pping_tc_egress", scope: !3, file: !3, line: 714, type: !295, scopeLine: 715, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !387)
!295 = !DISubroutineType(types: !296)
!296 = !{!136, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !6, line: 4183, size: 1472, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !361, !362, !363, !364, !386}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !298, file: !6, line: 4184, baseType: !104, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !298, file: !6, line: 4185, baseType: !104, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !298, file: !6, line: 4186, baseType: !104, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !298, file: !6, line: 4187, baseType: !104, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !298, file: !6, line: 4188, baseType: !104, size: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !298, file: !6, line: 4189, baseType: !104, size: 32, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !298, file: !6, line: 4190, baseType: !104, size: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !298, file: !6, line: 4191, baseType: !104, size: 32, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !298, file: !6, line: 4192, baseType: !104, size: 32, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !298, file: !6, line: 4193, baseType: !104, size: 32, offset: 288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !298, file: !6, line: 4194, baseType: !104, size: 32, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !298, file: !6, line: 4195, baseType: !104, size: 32, offset: 352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !298, file: !6, line: 4196, baseType: !313, size: 160, offset: 384)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 160, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 5)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !298, file: !6, line: 4197, baseType: !104, size: 32, offset: 544)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !298, file: !6, line: 4198, baseType: !104, size: 32, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !6, line: 4199, baseType: !104, size: 32, offset: 608)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !298, file: !6, line: 4200, baseType: !104, size: 32, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !298, file: !6, line: 4201, baseType: !104, size: 32, offset: 672)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !298, file: !6, line: 4204, baseType: !104, size: 32, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !298, file: !6, line: 4205, baseType: !104, size: 32, offset: 736)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !298, file: !6, line: 4206, baseType: !104, size: 32, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !298, file: !6, line: 4207, baseType: !267, size: 128, offset: 800)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !298, file: !6, line: 4208, baseType: !267, size: 128, offset: 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !298, file: !6, line: 4209, baseType: !104, size: 32, offset: 1056)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !298, file: !6, line: 4210, baseType: !104, size: 32, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !298, file: !6, line: 4213, baseType: !104, size: 32, offset: 1120)
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !6, line: 4214, baseType: !330, size: 64, align: 64, offset: 1152)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !6, line: 4214, size: 64, align: 64, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !330, file: !6, line: 4214, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !6, line: 5041, size: 448, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !359, !360}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !334, file: !6, line: 5042, baseType: !96, size: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !334, file: !6, line: 5043, baseType: !96, size: 16, offset: 16)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !334, file: !6, line: 5044, baseType: !96, size: 16, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !334, file: !6, line: 5045, baseType: !102, size: 8, offset: 48)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !334, file: !6, line: 5046, baseType: !102, size: 8, offset: 56)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !334, file: !6, line: 5047, baseType: !102, size: 8, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !334, file: !6, line: 5048, baseType: !102, size: 8, offset: 72)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !334, file: !6, line: 5049, baseType: !118, size: 16, offset: 80)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !334, file: !6, line: 5050, baseType: !118, size: 16, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !334, file: !6, line: 5051, baseType: !118, size: 16, offset: 112)
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !6, line: 5052, baseType: !347, size: 256, offset: 128)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !6, line: 5052, size: 256, elements: !348)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !6, line: 5053, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !6, line: 5053, size: 64, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !350, file: !6, line: 5054, baseType: !124, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !350, file: !6, line: 5055, baseType: !124, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !6, line: 5057, baseType: !355, size: 256)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !6, line: 5057, size: 256, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !355, file: !6, line: 5058, baseType: !267, size: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !355, file: !6, line: 5059, baseType: !267, size: 128, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !6, line: 5062, baseType: !104, size: 32, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !334, file: !6, line: 5063, baseType: !124, size: 32, offset: 416)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !298, file: !6, line: 4215, baseType: !159, size: 64, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !298, file: !6, line: 4216, baseType: !104, size: 32, offset: 1280)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !298, file: !6, line: 4217, baseType: !104, size: 32, offset: 1312)
!364 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !6, line: 4218, baseType: !365, size: 64, align: 64, offset: 1344)
!365 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !6, line: 4218, size: 64, align: 64, elements: !366)
!366 = !{!367}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !365, file: !6, line: 4218, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 4272, size: 640, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !369, file: !6, line: 4273, baseType: !104, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !369, file: !6, line: 4274, baseType: !104, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !6, line: 4275, baseType: !104, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !369, file: !6, line: 4276, baseType: !104, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !369, file: !6, line: 4277, baseType: !104, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !369, file: !6, line: 4278, baseType: !104, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !369, file: !6, line: 4280, baseType: !104, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !369, file: !6, line: 4281, baseType: !267, size: 128, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !369, file: !6, line: 4282, baseType: !104, size: 32, offset: 352)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !369, file: !6, line: 4283, baseType: !104, size: 32, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !369, file: !6, line: 4284, baseType: !104, size: 32, offset: 416)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !369, file: !6, line: 4285, baseType: !267, size: 128, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !6, line: 4286, baseType: !104, size: 32, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !369, file: !6, line: 4287, baseType: !385, size: 32, offset: 608)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !97, line: 26, baseType: !136)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !298, file: !6, line: 4219, baseType: !104, size: 32, offset: 1408)
!387 = !{!388, !389}
!388 = !DILocalVariable(name: "skb", arg: 1, scope: !294, file: !3, line: 714, type: !297)
!389 = !DILocalVariable(name: "pctx", scope: !294, file: !3, line: 716, type: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsing_context", file: !3, line: 41, size: 320, elements: !391)
!391 = !{!392, !393, !394, !399, !400, !401}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !390, file: !3, line: 42, baseType: !94, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !390, file: !3, line: 43, baseType: !94, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nh", scope: !390, file: !3, line: 44, baseType: !395, size: 64, offset: 128)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !396, line: 35, size: 64, elements: !397)
!396 = !DIFile(filename: "../lib/../include/xdp/parsing_helpers.h", directory: "/home/raj/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "e41ee3c44bb7300a1b081f0ef073eeff")
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !395, file: !396, line: 36, baseType: !94, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_len", scope: !390, file: !3, line: 45, baseType: !104, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !390, file: !3, line: 46, baseType: !104, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "is_egress", scope: !390, file: !3, line: 47, baseType: !186, size: 8, offset: 256)
!402 = !DILocation(line: 0, scope: !294)
!403 = !DILocation(line: 716, column: 2, scope: !294)
!404 = !DILocation(line: 716, column: 25, scope: !294)
!405 = !DILocation(line: 717, column: 30, scope: !294)
!406 = !{!407, !408, i64 76}
!407 = !{!"__sk_buff", !408, i64 0, !408, i64 4, !408, i64 8, !408, i64 12, !408, i64 16, !408, i64 20, !408, i64 24, !408, i64 28, !408, i64 32, !408, i64 36, !408, i64 40, !408, i64 44, !409, i64 48, !408, i64 68, !408, i64 72, !408, i64 76, !408, i64 80, !408, i64 84, !408, i64 88, !408, i64 92, !408, i64 96, !409, i64 100, !409, i64 116, !408, i64 132, !408, i64 136, !408, i64 140, !409, i64 144, !411, i64 152, !408, i64 160, !408, i64 164, !409, i64 168, !408, i64 176}
!408 = !{!"int", !409, i64 0}
!409 = !{!"omnipotent char", !410, i64 0}
!410 = !{!"Simple C/C++ TBAA"}
!411 = !{!"long long", !409, i64 0}
!412 = !DILocation(line: 717, column: 19, scope: !294)
!413 = !DILocation(line: 717, column: 11, scope: !294)
!414 = !DILocation(line: 716, column: 32, scope: !294)
!415 = !{!416, !417, i64 0}
!416 = !{!"parsing_context", !417, i64 0, !417, i64 8, !418, i64 16, !408, i64 24, !408, i64 28, !419, i64 32}
!417 = !{!"any pointer", !409, i64 0}
!418 = !{!"hdr_cursor", !417, i64 0}
!419 = !{!"_Bool", !409, i64 0}
!420 = !DILocation(line: 718, column: 34, scope: !294)
!421 = !{!407, !408, i64 80}
!422 = !DILocation(line: 718, column: 23, scope: !294)
!423 = !DILocation(line: 718, column: 15, scope: !294)
!424 = !{!416, !417, i64 8}
!425 = !DILocation(line: 720, column: 9, scope: !294)
!426 = !{!418, !417, i64 0}
!427 = !DILocation(line: 719, column: 19, scope: !294)
!428 = !{!407, !408, i64 0}
!429 = !{!416, !408, i64 24}
!430 = !{!416, !408, i64 28}
!431 = !{!416, !419, i64 32}
!432 = !DILocation(line: 724, column: 2, scope: !294)
!433 = !DILocation(line: 727, column: 1, scope: !294)
!434 = !DILocation(line: 726, column: 2, scope: !294)
!435 = distinct !DISubprogram(name: "pping_tc_ingress", scope: !3, file: !3, line: 731, type: !295, scopeLine: 732, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !436)
!436 = !{!437, !438}
!437 = !DILocalVariable(name: "skb", arg: 1, scope: !435, file: !3, line: 731, type: !297)
!438 = !DILocalVariable(name: "pctx", scope: !435, file: !3, line: 733, type: !390)
!439 = !DILocation(line: 0, scope: !435)
!440 = !DILocation(line: 733, column: 2, scope: !435)
!441 = !DILocation(line: 733, column: 25, scope: !435)
!442 = !DILocation(line: 734, column: 30, scope: !435)
!443 = !DILocation(line: 734, column: 19, scope: !435)
!444 = !DILocation(line: 734, column: 11, scope: !435)
!445 = !DILocation(line: 733, column: 32, scope: !435)
!446 = !DILocation(line: 735, column: 34, scope: !435)
!447 = !DILocation(line: 735, column: 23, scope: !435)
!448 = !DILocation(line: 735, column: 15, scope: !435)
!449 = !DILocation(line: 737, column: 9, scope: !435)
!450 = !DILocation(line: 736, column: 19, scope: !435)
!451 = !DILocation(line: 738, column: 27, scope: !435)
!452 = !{!407, !408, i64 36}
!453 = !DILocation(line: 742, column: 2, scope: !435)
!454 = !DILocation(line: 745, column: 1, scope: !435)
!455 = !DILocation(line: 744, column: 2, scope: !435)
!456 = distinct !DISubprogram(name: "pping_xdp_ingress", scope: !3, file: !3, line: 749, type: !457, scopeLine: 750, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !468)
!457 = !DISubroutineType(types: !458)
!458 = !{!136, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 4374, size: 192, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !6, line: 4375, baseType: !104, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !460, file: !6, line: 4376, baseType: !104, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !460, file: !6, line: 4377, baseType: !104, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !460, file: !6, line: 4379, baseType: !104, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !460, file: !6, line: 4380, baseType: !104, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !460, file: !6, line: 4382, baseType: !104, size: 32, offset: 160)
!468 = !{!469, !470}
!469 = !DILocalVariable(name: "ctx", arg: 1, scope: !456, file: !3, line: 749, type: !459)
!470 = !DILocalVariable(name: "pctx", scope: !456, file: !3, line: 751, type: !390)
!471 = !DILocation(line: 0, scope: !456)
!472 = !DILocation(line: 751, column: 2, scope: !456)
!473 = !DILocation(line: 751, column: 25, scope: !456)
!474 = !DILocation(line: 752, column: 30, scope: !456)
!475 = !{!476, !408, i64 0}
!476 = !{!"xdp_md", !408, i64 0, !408, i64 4, !408, i64 8, !408, i64 12, !408, i64 16, !408, i64 20}
!477 = !DILocation(line: 752, column: 19, scope: !456)
!478 = !DILocation(line: 752, column: 11, scope: !456)
!479 = !DILocation(line: 751, column: 32, scope: !456)
!480 = !DILocation(line: 753, column: 34, scope: !456)
!481 = !{!476, !408, i64 4}
!482 = !DILocation(line: 753, column: 23, scope: !456)
!483 = !DILocation(line: 753, column: 15, scope: !456)
!484 = !DILocation(line: 755, column: 9, scope: !456)
!485 = !DILocation(line: 754, column: 14, scope: !456)
!486 = !DILocation(line: 756, column: 27, scope: !456)
!487 = !{!476, !408, i64 12}
!488 = !DILocation(line: 760, column: 2, scope: !456)
!489 = !DILocation(line: 763, column: 1, scope: !456)
!490 = !DILocation(line: 762, column: 2, scope: !456)
!491 = distinct !DISubprogram(name: "pping", scope: !3, file: !3, line: 691, type: !492, scopeLine: 692, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !495)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !94, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!495 = !{!496, !497, !498, !655, !656, !657}
!496 = !DILocalVariable(name: "ctx", arg: 1, scope: !491, file: !3, line: 691, type: !94)
!497 = !DILocalVariable(name: "pctx", arg: 2, scope: !491, file: !3, line: 691, type: !494)
!498 = !DILocalVariable(name: "p_info", scope: !491, file: !3, line: 693, type: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_info", file: !3, line: 61, size: 1024, elements: !500)
!500 = !{!501, !559, !647, !648, !649, !650, !651, !652, !653, !654}
!501 = !DIDerivedType(tag: DW_TAG_member, scope: !499, file: !3, line: 62, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !499, file: !3, line: 62, size: 64, elements: !503)
!503 = !{!504, !532}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "iph", scope: !502, file: !3, line: 63, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !507, line: 87, size: 160, elements: !508)
!507 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !519}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !506, file: !507, line: 89, baseType: !102, size: 4, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !506, file: !507, line: 90, baseType: !102, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !506, file: !507, line: 97, baseType: !102, size: 8, offset: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !506, file: !507, line: 98, baseType: !118, size: 16, offset: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !506, file: !507, line: 99, baseType: !118, size: 16, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !506, file: !507, line: 100, baseType: !118, size: 16, offset: 48)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !506, file: !507, line: 101, baseType: !102, size: 8, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !506, file: !507, line: 102, baseType: !102, size: 8, offset: 72)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !506, file: !507, line: 103, baseType: !518, size: 16, offset: 80)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !119, line: 31, baseType: !96)
!519 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !507, line: 104, baseType: !520, size: 64, offset: 96)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !507, line: 104, size: 64, elements: !521)
!521 = !{!522, !527}
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !520, file: !507, line: 104, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !507, line: 104, size: 64, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !523, file: !507, line: 104, baseType: !124, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !523, file: !507, line: 104, baseType: !124, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !520, file: !507, line: 104, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !507, line: 104, size: 64, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !528, file: !507, line: 104, baseType: !124, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !528, file: !507, line: 104, baseType: !124, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ip6h", scope: !502, file: !3, line: 64, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !535, line: 118, size: 320, elements: !536)
!535 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "9926d49458ea1e0cc4651362e733e03e")
!536 = !{!537, !538, !539, !543, !544, !545, !546}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !534, file: !535, line: 120, baseType: !102, size: 4, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !534, file: !535, line: 121, baseType: !102, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !534, file: !535, line: 128, baseType: !540, size: 24, offset: 8)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 24, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 3)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !534, file: !535, line: 130, baseType: !118, size: 16, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !534, file: !535, line: 131, baseType: !102, size: 8, offset: 48)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !534, file: !535, line: 132, baseType: !102, size: 8, offset: 56)
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !534, file: !535, line: 134, baseType: !547, size: 256, offset: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !535, line: 134, size: 256, elements: !548)
!548 = !{!549, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, scope: !547, file: !535, line: 134, baseType: !550, size: 256)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !535, line: 134, size: 256, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !550, file: !535, line: 134, baseType: !106, size: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !550, file: !535, line: 134, baseType: !106, size: 128, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !547, file: !535, line: 134, baseType: !555, size: 256)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !535, line: 134, size: 256, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !555, file: !535, line: 134, baseType: !106, size: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !555, file: !535, line: 134, baseType: !106, size: 128, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !499, file: !3, line: 66, baseType: !560, size: 64, offset: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !499, file: !3, line: 66, size: 64, elements: !561)
!561 = !{!562, !586, !625}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "icmph", scope: !560, file: !3, line: 67, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !565, line: 89, size: 64, elements: !566)
!565 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !564, file: !565, line: 90, baseType: !102, size: 8)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !564, file: !565, line: 91, baseType: !102, size: 8, offset: 8)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !564, file: !565, line: 92, baseType: !518, size: 16, offset: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !564, file: !565, line: 104, baseType: !571, size: 32, offset: 32)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !564, file: !565, line: 93, size: 32, elements: !572)
!572 = !{!573, !578, !579, !584}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !571, file: !565, line: 97, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !565, line: 94, size: 32, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !574, file: !565, line: 95, baseType: !118, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !574, file: !565, line: 96, baseType: !118, size: 16, offset: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !571, file: !565, line: 98, baseType: !124, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !571, file: !565, line: 102, baseType: !580, size: 32)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !565, line: 99, size: 32, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !580, file: !565, line: 100, baseType: !118, size: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !580, file: !565, line: 101, baseType: !118, size: 16, offset: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !571, file: !565, line: 103, baseType: !585, size: 32)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 32, elements: !125)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6h", scope: !560, file: !3, line: 68, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !589, line: 8, size: 64, elements: !590)
!589 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!590 = !{!591, !592, !593, !594}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !588, file: !589, line: 10, baseType: !102, size: 8)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !588, file: !589, line: 11, baseType: !102, size: 8, offset: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !588, file: !589, line: 12, baseType: !518, size: 16, offset: 16)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !588, file: !589, line: 63, baseType: !595, size: 32, offset: 32)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !588, file: !589, line: 15, size: 32, elements: !596)
!596 = !{!597, !599, !601, !602, !607, !615}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !595, file: !589, line: 16, baseType: !598, size: 32)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !137)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !595, file: !589, line: 17, baseType: !600, size: 32)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, elements: !235)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !595, file: !589, line: 18, baseType: !585, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !595, file: !589, line: 23, baseType: !603, size: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !589, line: 20, size: 32, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !603, file: !589, line: 21, baseType: !118, size: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !603, file: !589, line: 22, baseType: !118, size: 16, offset: 16)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !595, file: !589, line: 40, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !589, line: 25, size: 32, elements: !609)
!609 = !{!610, !611, !612, !613, !614}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !608, file: !589, line: 27, baseType: !104, size: 5, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !608, file: !589, line: 28, baseType: !104, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !608, file: !589, line: 29, baseType: !104, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !608, file: !589, line: 30, baseType: !104, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !608, file: !589, line: 31, baseType: !104, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !595, file: !589, line: 61, baseType: !616, size: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !589, line: 42, size: 32, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !616, file: !589, line: 43, baseType: !102, size: 8)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !616, file: !589, line: 45, baseType: !102, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !616, file: !589, line: 46, baseType: !102, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !616, file: !589, line: 47, baseType: !102, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !616, file: !589, line: 48, baseType: !102, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !616, file: !589, line: 49, baseType: !102, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !616, file: !589, line: 60, baseType: !118, size: 16, offset: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tcph", scope: !560, file: !3, line: 69, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !628, line: 25, size: 160, elements: !629)
!628 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !627, file: !628, line: 26, baseType: !118, size: 16)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !627, file: !628, line: 27, baseType: !118, size: 16, offset: 16)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !627, file: !628, line: 28, baseType: !124, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !627, file: !628, line: 29, baseType: !124, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !627, file: !628, line: 31, baseType: !96, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !627, file: !628, line: 32, baseType: !96, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !627, file: !628, line: 33, baseType: !96, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !627, file: !628, line: 34, baseType: !96, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !627, file: !628, line: 35, baseType: !96, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !627, file: !628, line: 36, baseType: !96, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !627, file: !628, line: 37, baseType: !96, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !627, file: !628, line: 38, baseType: !96, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !627, file: !628, line: 39, baseType: !96, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !627, file: !628, line: 40, baseType: !96, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !627, file: !628, line: 55, baseType: !118, size: 16, offset: 112)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !627, file: !628, line: 56, baseType: !518, size: 16, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !627, file: !628, line: 57, baseType: !118, size: 16, offset: 144)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !499, file: !3, line: 71, baseType: !159, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !499, file: !3, line: 72, baseType: !104, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !499, file: !3, line: 73, baseType: !141, size: 384, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid", scope: !499, file: !3, line: 74, baseType: !141, size: 384, offset: 608)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pid_valid", scope: !499, file: !3, line: 75, baseType: !186, size: 8, offset: 992)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid_valid", scope: !499, file: !3, line: 76, baseType: !186, size: 8, offset: 1000)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !499, file: !3, line: 77, baseType: !24, size: 8, offset: 1008)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "event_reason", scope: !499, file: !3, line: 78, baseType: !14, size: 8, offset: 1016)
!655 = !DILocalVariable(name: "flow", scope: !491, file: !3, line: 694, type: !174)
!656 = !DILocalVariable(name: "rev_flow", scope: !491, file: !3, line: 694, type: !174)
!657 = !DILocalVariable(name: "new_flow", scope: !491, file: !3, line: 695, type: !186)
!658 = !DILocation(line: 0, scope: !491)
!659 = !DILocation(line: 693, column: 2, scope: !491)
!660 = !DILocation(line: 693, column: 21, scope: !491)
!661 = !DILocalVariable(name: "pctx", arg: 1, scope: !662, file: !3, line: 317, type: !494)
!662 = distinct !DISubprogram(name: "parse_packet_identifier", scope: !3, file: !3, line: 317, type: !663, scopeLine: 319, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !666)
!663 = !DISubroutineType(types: !664)
!664 = !{!136, !494, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!666 = !{!661, !667, !668, !669, !670}
!667 = !DILocalVariable(name: "p_info", arg: 2, scope: !662, file: !3, line: 318, type: !665)
!668 = !DILocalVariable(name: "proto", scope: !662, file: !3, line: 320, type: !136)
!669 = !DILocalVariable(name: "err", scope: !662, file: !3, line: 320, type: !136)
!670 = !DILocalVariable(name: "eth", scope: !662, file: !3, line: 321, type: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !673, line: 168, size: 112, elements: !674)
!673 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!674 = !{!675, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !672, file: !673, line: 169, baseType: !676, size: 48)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 48, elements: !277)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !672, file: !673, line: 170, baseType: !676, size: 48, offset: 48)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !672, file: !673, line: 171, baseType: !118, size: 16, offset: 96)
!679 = !DILocation(line: 0, scope: !662, inlinedAt: !680)
!680 = distinct !DILocation(line: 697, column: 7, scope: !681)
!681 = distinct !DILexicalBlock(scope: !491, file: !3, line: 697, column: 7)
!682 = !DILocation(line: 323, column: 17, scope: !662, inlinedAt: !680)
!683 = !DILocation(line: 323, column: 10, scope: !662, inlinedAt: !680)
!684 = !DILocation(line: 323, column: 15, scope: !662, inlinedAt: !680)
!685 = !{!686, !411, i64 16}
!686 = !{!"packet_info", !409, i64 0, !409, i64 8, !411, i64 16, !408, i64 24, !687, i64 28, !687, i64 76, !419, i64 124, !419, i64 125, !409, i64 126, !409, i64 127}
!687 = !{!"packet_id", !688, i64 0, !408, i64 44}
!688 = !{!"network_tuple", !689, i64 0, !689, i64 20, !691, i64 40, !409, i64 42, !409, i64 43}
!689 = !{!"flow_address", !690, i64 0, !691, i64 16, !691, i64 18}
!690 = !{!"in6_addr", !409, i64 0}
!691 = !{!"short", !409, i64 0}
!692 = !DILocation(line: 324, column: 30, scope: !662, inlinedAt: !680)
!693 = !DILocation(line: 324, column: 40, scope: !662, inlinedAt: !680)
!694 = !DILocalVariable(name: "nh", arg: 1, scope: !695, file: !396, line: 131, type: !698)
!695 = distinct !DISubprogram(name: "parse_ethhdr", scope: !396, file: !396, line: 131, type: !696, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !700)
!696 = !DISubroutineType(types: !697)
!697 = !{!136, !698, !94, !699}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!700 = !{!694, !701, !702}
!701 = !DILocalVariable(name: "data_end", arg: 2, scope: !695, file: !396, line: 132, type: !94)
!702 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !695, file: !396, line: 133, type: !699)
!703 = !DILocation(line: 0, scope: !695, inlinedAt: !704)
!704 = distinct !DILocation(line: 324, column: 10, scope: !662, inlinedAt: !680)
!705 = !DILocalVariable(name: "nh", arg: 1, scope: !706, file: !396, line: 86, type: !698)
!706 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !396, file: !396, line: 86, type: !707, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!707 = !DISubroutineType(types: !708)
!708 = !{!136, !698, !94, !699, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !396, line: 71, size: 32, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !710, file: !396, line: 72, baseType: !713, size: 32)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, elements: !235)
!714 = !{!705, !715, !716, !717, !718, !719, !720, !726, !727}
!715 = !DILocalVariable(name: "data_end", arg: 2, scope: !706, file: !396, line: 87, type: !94)
!716 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !706, file: !396, line: 88, type: !699)
!717 = !DILocalVariable(name: "vlans", arg: 4, scope: !706, file: !396, line: 89, type: !709)
!718 = !DILocalVariable(name: "eth", scope: !706, file: !396, line: 91, type: !671)
!719 = !DILocalVariable(name: "hdrsize", scope: !706, file: !396, line: 92, type: !136)
!720 = !DILocalVariable(name: "vlh", scope: !706, file: !396, line: 93, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !396, line: 44, size: 32, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !722, file: !396, line: 45, baseType: !118, size: 16)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !722, file: !396, line: 46, baseType: !118, size: 16, offset: 16)
!726 = !DILocalVariable(name: "h_proto", scope: !706, file: !396, line: 94, type: !96)
!727 = !DILocalVariable(name: "i", scope: !706, file: !396, line: 95, type: !136)
!728 = !DILocation(line: 0, scope: !706, inlinedAt: !729)
!729 = distinct !DILocation(line: 136, column: 9, scope: !695, inlinedAt: !704)
!730 = !DILocation(line: 91, column: 27, scope: !706, inlinedAt: !729)
!731 = !DILocation(line: 100, column: 14, scope: !732, inlinedAt: !729)
!732 = distinct !DILexicalBlock(scope: !706, file: !396, line: 100, column: 6)
!733 = !DILocation(line: 100, column: 24, scope: !732, inlinedAt: !729)
!734 = !DILocation(line: 100, column: 6, scope: !706, inlinedAt: !729)
!735 = !DILocation(line: 106, column: 17, scope: !706, inlinedAt: !729)
!736 = !{!691, !691, i64 0}
!737 = !DILocalVariable(name: "h_proto", arg: 1, scope: !738, file: !396, line: 75, type: !96)
!738 = distinct !DISubprogram(name: "proto_is_vlan", scope: !396, file: !396, line: 75, type: !739, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!136, !96}
!741 = !{!737}
!742 = !DILocation(line: 0, scope: !738, inlinedAt: !743)
!743 = distinct !DILocation(line: 113, column: 8, scope: !744, inlinedAt: !729)
!744 = distinct !DILexicalBlock(scope: !745, file: !396, line: 113, column: 7)
!745 = distinct !DILexicalBlock(scope: !746, file: !396, line: 112, column: 39)
!746 = distinct !DILexicalBlock(scope: !747, file: !396, line: 112, column: 2)
!747 = distinct !DILexicalBlock(scope: !706, file: !396, line: 112, column: 2)
!748 = !DILocation(line: 77, column: 20, scope: !738, inlinedAt: !743)
!749 = !DILocation(line: 77, column: 46, scope: !738, inlinedAt: !743)
!750 = !DILocation(line: 113, column: 7, scope: !745, inlinedAt: !729)
!751 = !DILocation(line: 119, column: 18, scope: !745, inlinedAt: !729)
!752 = !DILocation(line: 127, column: 10, scope: !706, inlinedAt: !729)
!753 = !DILocation(line: 327, column: 6, scope: !662, inlinedAt: !680)
!754 = !DILocation(line: 328, column: 20, scope: !755, inlinedAt: !680)
!755 = distinct !DILexicalBlock(scope: !756, file: !3, line: 327, column: 36)
!756 = distinct !DILexicalBlock(scope: !662, file: !3, line: 327, column: 6)
!757 = !DILocation(line: 328, column: 24, scope: !755, inlinedAt: !680)
!758 = !{!686, !409, i64 70}
!759 = !DILocalVariable(name: "nh", arg: 1, scope: !760, file: !396, line: 196, type: !698)
!760 = distinct !DISubprogram(name: "parse_iphdr", scope: !396, file: !396, line: 196, type: !761, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !764)
!761 = !DISubroutineType(types: !762)
!762 = !{!136, !698, !94, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!764 = !{!759, !765, !766, !767, !768}
!765 = !DILocalVariable(name: "data_end", arg: 2, scope: !760, file: !396, line: 197, type: !94)
!766 = !DILocalVariable(name: "iphdr", arg: 3, scope: !760, file: !396, line: 198, type: !763)
!767 = !DILocalVariable(name: "iph", scope: !760, file: !396, line: 200, type: !505)
!768 = !DILocalVariable(name: "hdrsize", scope: !760, file: !396, line: 201, type: !136)
!769 = !DILocation(line: 0, scope: !760, inlinedAt: !770)
!770 = distinct !DILocation(line: 330, column: 4, scope: !755, inlinedAt: !680)
!771 = !DILocation(line: 203, column: 10, scope: !772, inlinedAt: !770)
!772 = distinct !DILexicalBlock(scope: !760, file: !396, line: 203, column: 6)
!773 = !DILocation(line: 203, column: 14, scope: !772, inlinedAt: !770)
!774 = !DILocation(line: 203, column: 6, scope: !760, inlinedAt: !770)
!775 = !DILocation(line: 206, column: 11, scope: !776, inlinedAt: !770)
!776 = distinct !DILexicalBlock(scope: !760, file: !396, line: 206, column: 6)
!777 = !DILocation(line: 206, column: 19, scope: !776, inlinedAt: !770)
!778 = !DILocation(line: 206, column: 6, scope: !760, inlinedAt: !770)
!779 = !DILocation(line: 209, column: 21, scope: !760, inlinedAt: !770)
!780 = !DILocation(line: 211, column: 13, scope: !781, inlinedAt: !770)
!781 = distinct !DILexicalBlock(scope: !760, file: !396, line: 211, column: 5)
!782 = !DILocation(line: 211, column: 5, scope: !760, inlinedAt: !770)
!783 = !DILocation(line: 215, column: 14, scope: !784, inlinedAt: !770)
!784 = distinct !DILexicalBlock(scope: !760, file: !396, line: 215, column: 6)
!785 = !DILocation(line: 215, column: 24, scope: !784, inlinedAt: !770)
!786 = !DILocation(line: 215, column: 6, scope: !760, inlinedAt: !770)
!787 = !DILocation(line: 218, column: 10, scope: !760, inlinedAt: !770)
!788 = !DILocation(line: 219, column: 9, scope: !760, inlinedAt: !770)
!789 = !{!417, !417, i64 0}
!790 = !DILocation(line: 221, column: 14, scope: !760, inlinedAt: !770)
!791 = !{!792, !409, i64 9}
!792 = !{!"iphdr", !409, i64 0, !409, i64 0, !409, i64 1, !691, i64 2, !691, i64 4, !691, i64 6, !409, i64 8, !409, i64 9, !691, i64 10, !409, i64 12}
!793 = !DILocation(line: 221, column: 2, scope: !760, inlinedAt: !770)
!794 = !DILocation(line: 332, column: 20, scope: !795, inlinedAt: !680)
!795 = distinct !DILexicalBlock(scope: !796, file: !3, line: 331, column: 45)
!796 = distinct !DILexicalBlock(scope: !756, file: !3, line: 331, column: 13)
!797 = !DILocation(line: 332, column: 24, scope: !795, inlinedAt: !680)
!798 = !DILocalVariable(name: "nh", arg: 1, scope: !799, file: !396, line: 174, type: !698)
!799 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !396, file: !396, line: 174, type: !800, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !803)
!800 = !DISubroutineType(types: !801)
!801 = !{!136, !698, !94, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!803 = !{!798, !804, !805, !806}
!804 = !DILocalVariable(name: "data_end", arg: 2, scope: !799, file: !396, line: 175, type: !94)
!805 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !799, file: !396, line: 176, type: !802)
!806 = !DILocalVariable(name: "ip6h", scope: !799, file: !396, line: 178, type: !533)
!807 = !DILocation(line: 0, scope: !799, inlinedAt: !808)
!808 = distinct !DILocation(line: 334, column: 4, scope: !795, inlinedAt: !680)
!809 = !DILocation(line: 184, column: 11, scope: !810, inlinedAt: !808)
!810 = distinct !DILexicalBlock(scope: !799, file: !396, line: 184, column: 6)
!811 = !DILocation(line: 184, column: 15, scope: !810, inlinedAt: !808)
!812 = !DILocation(line: 184, column: 6, scope: !799, inlinedAt: !808)
!813 = !DILocation(line: 187, column: 12, scope: !814, inlinedAt: !808)
!814 = distinct !DILexicalBlock(scope: !799, file: !396, line: 187, column: 6)
!815 = !DILocation(line: 187, column: 20, scope: !814, inlinedAt: !808)
!816 = !DILocation(line: 187, column: 6, scope: !799, inlinedAt: !808)
!817 = !DILocation(line: 190, column: 10, scope: !799, inlinedAt: !808)
!818 = !DILocation(line: 191, column: 10, scope: !799, inlinedAt: !808)
!819 = !DILocalVariable(name: "nh", arg: 1, scope: !820, file: !396, line: 139, type: !698)
!820 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !396, file: !396, line: 139, type: !821, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{!136, !698, !94, !102}
!823 = !{!819, !824, !825, !826, !828}
!824 = !DILocalVariable(name: "data_end", arg: 2, scope: !820, file: !396, line: 140, type: !94)
!825 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !820, file: !396, line: 141, type: !102)
!826 = !DILocalVariable(name: "i", scope: !827, file: !396, line: 143, type: !136)
!827 = distinct !DILexicalBlock(scope: !820, file: !396, line: 143, column: 2)
!828 = !DILocalVariable(name: "hdr", scope: !829, file: !396, line: 144, type: !831)
!829 = distinct !DILexicalBlock(scope: !830, file: !396, line: 143, column: 47)
!830 = distinct !DILexicalBlock(scope: !827, file: !396, line: 143, column: 2)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !535, line: 63, size: 16, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !832, file: !535, line: 64, baseType: !102, size: 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !832, file: !535, line: 65, baseType: !102, size: 8, offset: 8)
!836 = !DILocation(line: 0, scope: !820, inlinedAt: !837)
!837 = distinct !DILocation(line: 193, column: 9, scope: !799, inlinedAt: !808)
!838 = !DILocation(line: 0, scope: !827, inlinedAt: !837)
!839 = !DILocation(line: 0, scope: !829, inlinedAt: !837)
!840 = !DILocation(line: 146, column: 11, scope: !841, inlinedAt: !837)
!841 = distinct !DILexicalBlock(scope: !829, file: !396, line: 146, column: 7)
!842 = !DILocation(line: 146, column: 15, scope: !841, inlinedAt: !837)
!843 = !DILocation(line: 146, column: 7, scope: !829, inlinedAt: !837)
!844 = !DILocation(line: 193, column: 44, scope: !799, inlinedAt: !808)
!845 = !{!846, !409, i64 6}
!846 = !{!"ipv6hdr", !409, i64 0, !409, i64 0, !409, i64 1, !691, i64 4, !409, i64 6, !409, i64 7, !409, i64 8}
!847 = !DILocation(line: 149, column: 3, scope: !829, inlinedAt: !837)
!848 = !DILocation(line: 160, column: 4, scope: !849, inlinedAt: !837)
!849 = distinct !DILexicalBlock(scope: !829, file: !396, line: 149, column: 26)
!850 = !DILocation(line: 0, scope: !849, inlinedAt: !837)
!851 = !{!852, !409, i64 1}
!852 = !{!"ipv6_opt_hdr", !409, i64 0, !409, i64 1}
!853 = !{!852, !409, i64 0}
!854 = !DILocation(line: 156, column: 4, scope: !849, inlinedAt: !837)
!855 = !DILocation(line: 340, column: 13, scope: !856, inlinedAt: !680)
!856 = distinct !DILexicalBlock(scope: !662, file: !3, line: 340, column: 6)
!857 = !{!858, !419, i64 17}
!858 = !{!"bpf_config", !411, i64 0, !411, i64 8, !419, i64 16, !419, i64 17, !419, i64 18, !419, i64 19, !408, i64 20}
!859 = !{i8 0, i8 2}
!860 = !{}
!861 = !DILocation(line: 342, column: 18, scope: !862, inlinedAt: !680)
!862 = distinct !DILexicalBlock(scope: !856, file: !3, line: 342, column: 11)
!863 = !{!858, !419, i64 18}
!864 = !DILocation(line: 346, column: 18, scope: !865, inlinedAt: !680)
!865 = distinct !DILexicalBlock(scope: !862, file: !3, line: 346, column: 11)
!866 = !DILocation(line: 346, column: 29, scope: !865, inlinedAt: !680)
!867 = !DILocation(line: 0, scope: !756, inlinedAt: !680)
!868 = !{!686, !691, i64 68}
!869 = !DILocation(line: 340, column: 23, scope: !856, inlinedAt: !680)
!870 = !DILocalVariable(name: "pctx", arg: 1, scope: !871, file: !3, line: 197, type: !494)
!871 = distinct !DISubprogram(name: "parse_tcp_identifier", scope: !3, file: !3, line: 197, type: !663, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !872)
!872 = !{!870, !873}
!873 = !DILocalVariable(name: "p_info", arg: 2, scope: !871, file: !3, line: 198, type: !665)
!874 = !DILocation(line: 0, scope: !871, inlinedAt: !875)
!875 = distinct !DILocation(line: 341, column: 9, scope: !856, inlinedAt: !680)
!876 = !DILocation(line: 200, column: 55, scope: !877, inlinedAt: !875)
!877 = distinct !DILexicalBlock(scope: !871, file: !3, line: 200, column: 6)
!878 = !DILocalVariable(name: "nh", arg: 1, scope: !879, file: !396, line: 295, type: !698)
!879 = distinct !DISubprogram(name: "parse_tcphdr", scope: !396, file: !396, line: 295, type: !880, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !883)
!880 = !DISubroutineType(types: !881)
!881 = !{!136, !698, !94, !882}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!883 = !{!878, !884, !885, !886, !887}
!884 = !DILocalVariable(name: "data_end", arg: 2, scope: !879, file: !396, line: 296, type: !94)
!885 = !DILocalVariable(name: "tcphdr", arg: 3, scope: !879, file: !396, line: 297, type: !882)
!886 = !DILocalVariable(name: "len", scope: !879, file: !396, line: 299, type: !136)
!887 = !DILocalVariable(name: "h", scope: !879, file: !396, line: 300, type: !626)
!888 = !DILocation(line: 0, scope: !879, inlinedAt: !889)
!889 = distinct !DILocation(line: 200, column: 6, scope: !877, inlinedAt: !875)
!890 = !DILocation(line: 302, column: 8, scope: !891, inlinedAt: !889)
!891 = distinct !DILexicalBlock(scope: !879, file: !396, line: 302, column: 6)
!892 = !DILocation(line: 302, column: 12, scope: !891, inlinedAt: !889)
!893 = !DILocation(line: 302, column: 6, scope: !879, inlinedAt: !889)
!894 = !DILocation(line: 305, column: 11, scope: !879, inlinedAt: !889)
!895 = !DILocation(line: 305, column: 16, scope: !879, inlinedAt: !889)
!896 = !DILocation(line: 307, column: 9, scope: !897, inlinedAt: !889)
!897 = distinct !DILexicalBlock(scope: !879, file: !396, line: 307, column: 5)
!898 = !DILocation(line: 307, column: 5, scope: !879, inlinedAt: !889)
!899 = !DILocation(line: 311, column: 14, scope: !900, inlinedAt: !889)
!900 = distinct !DILexicalBlock(scope: !879, file: !396, line: 311, column: 6)
!901 = !DILocation(line: 311, column: 20, scope: !900, inlinedAt: !889)
!902 = !DILocation(line: 311, column: 6, scope: !879, inlinedAt: !889)
!903 = !DILocation(line: 314, column: 10, scope: !879, inlinedAt: !889)
!904 = !DILocation(line: 315, column: 10, scope: !879, inlinedAt: !889)
!905 = !DILocation(line: 203, column: 62, scope: !906, inlinedAt: !875)
!906 = distinct !DILexicalBlock(scope: !871, file: !3, line: 203, column: 6)
!907 = !DILocation(line: 204, column: 24, scope: !906, inlinedAt: !875)
!908 = !DILocalVariable(name: "tcph", arg: 1, scope: !909, file: !3, line: 137, type: !626)
!909 = distinct !DISubprogram(name: "parse_tcp_ts", scope: !3, file: !3, line: 137, type: !910, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{!136, !626, !94, !103, !103}
!912 = !{!908, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!913 = !DILocalVariable(name: "data_end", arg: 2, scope: !909, file: !3, line: 137, type: !94)
!914 = !DILocalVariable(name: "tsval", arg: 3, scope: !909, file: !3, line: 137, type: !103)
!915 = !DILocalVariable(name: "tsecr", arg: 4, scope: !909, file: !3, line: 138, type: !103)
!916 = !DILocalVariable(name: "len", scope: !909, file: !3, line: 140, type: !136)
!917 = !DILocalVariable(name: "opt_end", scope: !909, file: !3, line: 141, type: !94)
!918 = !DILocalVariable(name: "pos", scope: !909, file: !3, line: 142, type: !101)
!919 = !DILocalVariable(name: "i", scope: !909, file: !3, line: 143, type: !102)
!920 = !DILocalVariable(name: "opt", scope: !909, file: !3, line: 143, type: !102)
!921 = !DILocalVariable(name: "opt_size", scope: !909, file: !3, line: 145, type: !922)
!922 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!923 = !DILocation(line: 0, scope: !909, inlinedAt: !924)
!924 = distinct !DILocation(line: 203, column: 6, scope: !906, inlinedAt: !875)
!925 = !DILocation(line: 140, column: 18, scope: !909, inlinedAt: !924)
!926 = !DILocation(line: 140, column: 23, scope: !909, inlinedAt: !924)
!927 = !DILocation(line: 141, column: 31, scope: !909, inlinedAt: !924)
!928 = !DILocation(line: 144, column: 2, scope: !909, inlinedAt: !924)
!929 = !DILocation(line: 145, column: 3, scope: !909, inlinedAt: !924)
!930 = !DILocation(line: 147, column: 26, scope: !931, inlinedAt: !924)
!931 = distinct !DILexicalBlock(scope: !909, file: !3, line: 147, column: 6)
!932 = !DILocation(line: 151, column: 11, scope: !933, inlinedAt: !924)
!933 = distinct !DILexicalBlock(scope: !934, file: !3, line: 151, column: 7)
!934 = distinct !DILexicalBlock(scope: !935, file: !3, line: 150, column: 40)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 150, column: 2)
!936 = distinct !DILexicalBlock(scope: !909, file: !3, line: 150, column: 2)
!937 = !DILocation(line: 151, column: 15, scope: !933, inlinedAt: !924)
!938 = !DILocation(line: 151, column: 25, scope: !933, inlinedAt: !924)
!939 = !DILocation(line: 154, column: 9, scope: !934, inlinedAt: !924)
!940 = !{!409, !409, i64 0}
!941 = !DILocation(line: 155, column: 7, scope: !934, inlinedAt: !924)
!942 = !DILocation(line: 164, column: 11, scope: !943, inlinedAt: !924)
!943 = distinct !DILexicalBlock(scope: !934, file: !3, line: 164, column: 7)
!944 = !DILocation(line: 164, column: 15, scope: !943, inlinedAt: !924)
!945 = !DILocation(line: 164, column: 25, scope: !943, inlinedAt: !924)
!946 = !DILocation(line: 166, column: 14, scope: !934, inlinedAt: !924)
!947 = !DILocation(line: 166, column: 12, scope: !934, inlinedAt: !924)
!948 = !DILocation(line: 167, column: 7, scope: !949, inlinedAt: !924)
!949 = distinct !DILexicalBlock(scope: !934, file: !3, line: 167, column: 7)
!950 = !DILocation(line: 167, column: 16, scope: !949, inlinedAt: !924)
!951 = !DILocation(line: 167, column: 7, scope: !934, inlinedAt: !924)
!952 = !DILocation(line: 171, column: 11, scope: !953, inlinedAt: !924)
!953 = distinct !DILexicalBlock(scope: !934, file: !3, line: 171, column: 7)
!954 = !DILocation(line: 171, column: 16, scope: !953, inlinedAt: !924)
!955 = !DILocation(line: 171, column: 19, scope: !953, inlinedAt: !924)
!956 = !DILocation(line: 171, column: 28, scope: !953, inlinedAt: !924)
!957 = !DILocation(line: 171, column: 7, scope: !934, inlinedAt: !924)
!958 = !DILocation(line: 172, column: 12, scope: !959, inlinedAt: !924)
!959 = distinct !DILexicalBlock(scope: !960, file: !3, line: 172, column: 8)
!960 = distinct !DILexicalBlock(scope: !953, file: !3, line: 171, column: 35)
!961 = !DILocation(line: 172, column: 17, scope: !959, inlinedAt: !924)
!962 = !DILocation(line: 172, column: 27, scope: !959, inlinedAt: !924)
!963 = !DILocation(line: 180, column: 10, scope: !934, inlinedAt: !924)
!964 = !DILocation(line: 180, column: 7, scope: !934, inlinedAt: !924)
!965 = !DILocation(line: 181, column: 2, scope: !934, inlinedAt: !924)
!966 = !DILocation(line: 0, scope: !934, inlinedAt: !924)
!967 = !DILocation(line: 183, column: 1, scope: !909, inlinedAt: !924)
!968 = !DILocation(line: 203, column: 6, scope: !871, inlinedAt: !875)
!969 = !DILocation(line: 174, column: 13, scope: !960, inlinedAt: !924)
!970 = !{!408, !408, i64 0}
!971 = !DILocation(line: 174, column: 11, scope: !960, inlinedAt: !924)
!972 = !DILocation(line: 175, column: 28, scope: !960, inlinedAt: !924)
!973 = !DILocation(line: 175, column: 13, scope: !960, inlinedAt: !924)
!974 = !DILocation(line: 175, column: 11, scope: !960, inlinedAt: !924)
!975 = !DILocation(line: 207, column: 46, scope: !871, inlinedAt: !875)
!976 = !{!977, !691, i64 0}
!977 = !{!"tcphdr", !691, i64 0, !691, i64 2, !408, i64 4, !408, i64 8, !691, i64 12, !691, i64 12, !691, i64 13, !691, i64 13, !691, i64 13, !691, i64 13, !691, i64 13, !691, i64 13, !691, i64 13, !691, i64 13, !691, i64 14, !691, i64 16, !691, i64 18}
!978 = !DILocation(line: 207, column: 25, scope: !871, inlinedAt: !875)
!979 = !DILocation(line: 207, column: 30, scope: !871, inlinedAt: !875)
!980 = !{!686, !691, i64 44}
!981 = !DILocation(line: 208, column: 46, scope: !871, inlinedAt: !875)
!982 = !{!977, !691, i64 2}
!983 = !DILocation(line: 208, column: 25, scope: !871, inlinedAt: !875)
!984 = !DILocation(line: 208, column: 30, scope: !871, inlinedAt: !875)
!985 = !{!686, !691, i64 64}
!986 = !DILocation(line: 212, column: 24, scope: !871, inlinedAt: !875)
!987 = !DILocation(line: 212, column: 16, scope: !871, inlinedAt: !875)
!988 = !DILocation(line: 212, column: 37, scope: !871, inlinedAt: !875)
!989 = !DILocation(line: 212, column: 31, scope: !871, inlinedAt: !875)
!990 = !DILocation(line: 212, column: 29, scope: !871, inlinedAt: !875)
!991 = !DILocation(line: 212, column: 45, scope: !871, inlinedAt: !875)
!992 = !DILocation(line: 212, column: 62, scope: !871, inlinedAt: !875)
!993 = !DILocation(line: 211, column: 10, scope: !871, inlinedAt: !875)
!994 = !DILocation(line: 211, column: 20, scope: !871, inlinedAt: !875)
!995 = !{!686, !419, i64 124}
!996 = !DILocation(line: 215, column: 42, scope: !871, inlinedAt: !875)
!997 = !DILocation(line: 215, column: 10, scope: !871, inlinedAt: !875)
!998 = !DILocation(line: 215, column: 26, scope: !871, inlinedAt: !875)
!999 = !{!686, !419, i64 125}
!1000 = !DILocation(line: 218, column: 20, scope: !1001, inlinedAt: !875)
!1001 = distinct !DILexicalBlock(scope: !871, file: !3, line: 218, column: 6)
!1002 = !DILocation(line: 218, column: 6, scope: !1001, inlinedAt: !875)
!1003 = !DILocation(line: 218, column: 6, scope: !871, inlinedAt: !875)
!1004 = !DILocation(line: 221, column: 13, scope: !1005, inlinedAt: !875)
!1005 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 221, column: 13)
!1006 = !DILocation(line: 221, column: 13, scope: !1001, inlinedAt: !875)
!1007 = !DILocation(line: 222, column: 11, scope: !1008, inlinedAt: !875)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 221, column: 32)
!1009 = !DILocation(line: 222, column: 22, scope: !1008, inlinedAt: !875)
!1010 = !{!686, !409, i64 126}
!1011 = !DILocation(line: 223, column: 11, scope: !1008, inlinedAt: !875)
!1012 = !DILocation(line: 223, column: 24, scope: !1008, inlinedAt: !875)
!1013 = !{!686, !409, i64 127}
!1014 = !DILocation(line: 355, column: 14, scope: !1015, inlinedAt: !680)
!1015 = distinct !DILexicalBlock(scope: !662, file: !3, line: 355, column: 6)
!1016 = !DILocation(line: 355, column: 6, scope: !662, inlinedAt: !680)
!1017 = !DILocation(line: 224, column: 13, scope: !1018, inlinedAt: !875)
!1018 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 224, column: 13)
!1019 = !DILocation(line: 0, scope: !1018, inlinedAt: !875)
!1020 = !DILocation(line: 224, column: 13, scope: !1005, inlinedAt: !875)
!1021 = !DILocation(line: 225, column: 22, scope: !1022, inlinedAt: !875)
!1022 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 224, column: 32)
!1023 = !DILocation(line: 226, column: 40, scope: !1022, inlinedAt: !875)
!1024 = !DILocation(line: 226, column: 26, scope: !1022, inlinedAt: !875)
!1025 = !DILocation(line: 226, column: 11, scope: !1022, inlinedAt: !875)
!1026 = !DILocation(line: 226, column: 24, scope: !1022, inlinedAt: !875)
!1027 = !DILocation(line: 230, column: 22, scope: !1028, inlinedAt: !875)
!1028 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 229, column: 9)
!1029 = !DILocation(line: 342, column: 29, scope: !862, inlinedAt: !680)
!1030 = !DILocalVariable(name: "pctx", arg: 1, scope: !1031, file: !3, line: 252, type: !494)
!1031 = distinct !DISubprogram(name: "parse_icmp6_identifier", scope: !3, file: !3, line: 252, type: !663, scopeLine: 254, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1032)
!1032 = !{!1030, !1033}
!1033 = !DILocalVariable(name: "p_info", arg: 2, scope: !1031, file: !3, line: 253, type: !665)
!1034 = !DILocation(line: 0, scope: !1031, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 345, column: 9, scope: !862, inlinedAt: !680)
!1036 = !DILocalVariable(name: "nh", arg: 1, scope: !1037, file: !396, line: 224, type: !698)
!1037 = distinct !DISubprogram(name: "parse_icmp6hdr", scope: !396, file: !396, line: 224, type: !1038, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1041)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!136, !698, !94, !1040}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!1041 = !{!1036, !1042, !1043, !1044}
!1042 = !DILocalVariable(name: "data_end", arg: 2, scope: !1037, file: !396, line: 225, type: !94)
!1043 = !DILocalVariable(name: "icmp6hdr", arg: 3, scope: !1037, file: !396, line: 226, type: !1040)
!1044 = !DILocalVariable(name: "icmp6h", scope: !1037, file: !396, line: 228, type: !587)
!1045 = !DILocation(line: 0, scope: !1037, inlinedAt: !1046)
!1046 = distinct !DILocation(line: 255, column: 6, scope: !1047, inlinedAt: !1035)
!1047 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 255, column: 6)
!1048 = !DILocation(line: 230, column: 13, scope: !1049, inlinedAt: !1046)
!1049 = distinct !DILexicalBlock(scope: !1037, file: !396, line: 230, column: 6)
!1050 = !DILocation(line: 230, column: 17, scope: !1049, inlinedAt: !1046)
!1051 = !DILocation(line: 230, column: 6, scope: !1037, inlinedAt: !1046)
!1052 = !DILocation(line: 255, column: 57, scope: !1047, inlinedAt: !1035)
!1053 = !DILocation(line: 233, column: 12, scope: !1037, inlinedAt: !1046)
!1054 = !DILocation(line: 234, column: 12, scope: !1037, inlinedAt: !1046)
!1055 = !DILocation(line: 258, column: 22, scope: !1056, inlinedAt: !1035)
!1056 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 258, column: 6)
!1057 = !{!1058, !409, i64 1}
!1058 = !{!"icmp6hdr", !409, i64 0, !409, i64 1, !691, i64 2, !409, i64 4}
!1059 = !DILocation(line: 258, column: 33, scope: !1056, inlinedAt: !1035)
!1060 = !DILocation(line: 258, column: 6, scope: !1031, inlinedAt: !1035)
!1061 = !DILocation(line: 261, column: 22, scope: !1062, inlinedAt: !1035)
!1062 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 261, column: 6)
!1063 = !{!1058, !409, i64 0}
!1064 = !DILocation(line: 261, column: 6, scope: !1031, inlinedAt: !1035)
!1065 = !DILocation(line: 262, column: 44, scope: !1066, inlinedAt: !1035)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 261, column: 57)
!1067 = !DILocation(line: 262, column: 28, scope: !1066, inlinedAt: !1035)
!1068 = !DILocation(line: 262, column: 15, scope: !1066, inlinedAt: !1035)
!1069 = !DILocation(line: 262, column: 26, scope: !1066, inlinedAt: !1035)
!1070 = !{!686, !408, i64 72}
!1071 = !DILocation(line: 263, column: 11, scope: !1066, inlinedAt: !1035)
!1072 = !DILocation(line: 263, column: 21, scope: !1066, inlinedAt: !1035)
!1073 = !DILocation(line: 264, column: 11, scope: !1066, inlinedAt: !1035)
!1074 = !DILocation(line: 264, column: 27, scope: !1066, inlinedAt: !1035)
!1075 = !DILocation(line: 265, column: 2, scope: !1066, inlinedAt: !1035)
!1076 = !DILocation(line: 266, column: 50, scope: !1077, inlinedAt: !1035)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 265, column: 62)
!1078 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 265, column: 13)
!1079 = !DILocation(line: 266, column: 34, scope: !1077, inlinedAt: !1035)
!1080 = !DILocation(line: 266, column: 21, scope: !1077, inlinedAt: !1035)
!1081 = !DILocation(line: 266, column: 32, scope: !1077, inlinedAt: !1035)
!1082 = !{!686, !408, i64 120}
!1083 = !DILocation(line: 267, column: 11, scope: !1077, inlinedAt: !1035)
!1084 = !DILocation(line: 267, column: 27, scope: !1077, inlinedAt: !1035)
!1085 = !DILocation(line: 268, column: 11, scope: !1077, inlinedAt: !1035)
!1086 = !DILocation(line: 268, column: 21, scope: !1077, inlinedAt: !1035)
!1087 = !DILocation(line: 273, column: 10, scope: !1031, inlinedAt: !1035)
!1088 = !DILocation(line: 273, column: 21, scope: !1031, inlinedAt: !1035)
!1089 = !DILocation(line: 274, column: 48, scope: !1031, inlinedAt: !1035)
!1090 = !DILocation(line: 274, column: 25, scope: !1031, inlinedAt: !1035)
!1091 = !DILocation(line: 274, column: 30, scope: !1031, inlinedAt: !1035)
!1092 = !DILocation(line: 275, column: 25, scope: !1031, inlinedAt: !1035)
!1093 = !DILocation(line: 275, column: 30, scope: !1031, inlinedAt: !1035)
!1094 = !DILocalVariable(name: "pctx", arg: 1, scope: !1095, file: !3, line: 282, type: !494)
!1095 = distinct !DISubprogram(name: "parse_icmp_identifier", scope: !3, file: !3, line: 282, type: !663, scopeLine: 284, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1096)
!1096 = !{!1094, !1097}
!1097 = !DILocalVariable(name: "p_info", arg: 2, scope: !1095, file: !3, line: 283, type: !665)
!1098 = !DILocation(line: 0, scope: !1095, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 348, column: 9, scope: !865, inlinedAt: !680)
!1100 = !DILocalVariable(name: "nh", arg: 1, scope: !1101, file: !396, line: 239, type: !698)
!1101 = distinct !DISubprogram(name: "parse_icmphdr", scope: !396, file: !396, line: 239, type: !1102, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1105)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!136, !698, !94, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!1105 = !{!1100, !1106, !1107, !1108}
!1106 = !DILocalVariable(name: "data_end", arg: 2, scope: !1101, file: !396, line: 240, type: !94)
!1107 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !1101, file: !396, line: 241, type: !1104)
!1108 = !DILocalVariable(name: "icmph", scope: !1101, file: !396, line: 243, type: !563)
!1109 = !DILocation(line: 0, scope: !1101, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 285, column: 6, scope: !1111, inlinedAt: !1099)
!1111 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 285, column: 6)
!1112 = !DILocation(line: 245, column: 12, scope: !1113, inlinedAt: !1110)
!1113 = distinct !DILexicalBlock(scope: !1101, file: !396, line: 245, column: 6)
!1114 = !DILocation(line: 245, column: 16, scope: !1113, inlinedAt: !1110)
!1115 = !DILocation(line: 245, column: 6, scope: !1101, inlinedAt: !1110)
!1116 = !DILocation(line: 285, column: 56, scope: !1111, inlinedAt: !1099)
!1117 = !DILocation(line: 248, column: 11, scope: !1101, inlinedAt: !1110)
!1118 = !DILocation(line: 249, column: 11, scope: !1101, inlinedAt: !1110)
!1119 = !DILocation(line: 288, column: 21, scope: !1120, inlinedAt: !1099)
!1120 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 288, column: 6)
!1121 = !{!1122, !409, i64 1}
!1122 = !{!"icmphdr", !409, i64 0, !409, i64 1, !691, i64 2, !409, i64 4}
!1123 = !DILocation(line: 288, column: 26, scope: !1120, inlinedAt: !1099)
!1124 = !DILocation(line: 288, column: 6, scope: !1095, inlinedAt: !1099)
!1125 = !DILocation(line: 291, column: 21, scope: !1126, inlinedAt: !1099)
!1126 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 291, column: 6)
!1127 = !{!1122, !409, i64 0}
!1128 = !DILocation(line: 291, column: 6, scope: !1095, inlinedAt: !1099)
!1129 = !DILocation(line: 292, column: 51, scope: !1130, inlinedAt: !1099)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 291, column: 40)
!1131 = !DILocation(line: 292, column: 28, scope: !1130, inlinedAt: !1099)
!1132 = !DILocation(line: 292, column: 15, scope: !1130, inlinedAt: !1099)
!1133 = !DILocation(line: 292, column: 26, scope: !1130, inlinedAt: !1099)
!1134 = !DILocation(line: 293, column: 11, scope: !1130, inlinedAt: !1099)
!1135 = !DILocation(line: 293, column: 21, scope: !1130, inlinedAt: !1099)
!1136 = !DILocation(line: 294, column: 11, scope: !1130, inlinedAt: !1099)
!1137 = !DILocation(line: 294, column: 27, scope: !1130, inlinedAt: !1099)
!1138 = !DILocation(line: 295, column: 2, scope: !1130, inlinedAt: !1099)
!1139 = !DILocation(line: 296, column: 57, scope: !1140, inlinedAt: !1099)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 295, column: 52)
!1141 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 295, column: 13)
!1142 = !DILocation(line: 296, column: 34, scope: !1140, inlinedAt: !1099)
!1143 = !DILocation(line: 296, column: 21, scope: !1140, inlinedAt: !1099)
!1144 = !DILocation(line: 296, column: 32, scope: !1140, inlinedAt: !1099)
!1145 = !DILocation(line: 297, column: 11, scope: !1140, inlinedAt: !1099)
!1146 = !DILocation(line: 297, column: 27, scope: !1140, inlinedAt: !1099)
!1147 = !DILocation(line: 298, column: 11, scope: !1140, inlinedAt: !1099)
!1148 = !DILocation(line: 298, column: 21, scope: !1140, inlinedAt: !1099)
!1149 = !DILocation(line: 303, column: 10, scope: !1095, inlinedAt: !1099)
!1150 = !DILocation(line: 303, column: 21, scope: !1095, inlinedAt: !1099)
!1151 = !DILocation(line: 304, column: 47, scope: !1095, inlinedAt: !1099)
!1152 = !DILocation(line: 304, column: 55, scope: !1095, inlinedAt: !1099)
!1153 = !DILocation(line: 304, column: 25, scope: !1095, inlinedAt: !1099)
!1154 = !DILocation(line: 304, column: 30, scope: !1095, inlinedAt: !1099)
!1155 = !DILocation(line: 305, column: 25, scope: !1095, inlinedAt: !1099)
!1156 = !DILocation(line: 305, column: 30, scope: !1095, inlinedAt: !1099)
!1157 = !DILocation(line: 219, column: 11, scope: !1158, inlinedAt: !875)
!1158 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 218, column: 25)
!1159 = !DILocation(line: 219, column: 22, scope: !1158, inlinedAt: !875)
!1160 = !DILocation(line: 220, column: 11, scope: !1158, inlinedAt: !875)
!1161 = !DILocation(line: 220, column: 24, scope: !1158, inlinedAt: !875)
!1162 = !DILocation(line: 357, column: 19, scope: !1163, inlinedAt: !680)
!1163 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 355, column: 39)
!1164 = !DILocalVariable(name: "ipv6", arg: 1, scope: !1165, file: !3, line: 113, type: !105)
!1165 = distinct !DISubprogram(name: "map_ipv4_to_ipv6", scope: !3, file: !3, line: 113, type: !1166, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1168)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{null, !105, !124}
!1168 = !{!1164, !1169}
!1169 = !DILocalVariable(name: "ipv4", arg: 2, scope: !1165, file: !3, line: 113, type: !124)
!1170 = !DILocation(line: 0, scope: !1165, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 356, column: 3, scope: !1163, inlinedAt: !680)
!1172 = !DILocation(line: 115, column: 2, scope: !1165, inlinedAt: !1171)
!1173 = !DILocation(line: 116, column: 20, scope: !1165, inlinedAt: !1171)
!1174 = !DILocation(line: 116, column: 2, scope: !1165, inlinedAt: !1171)
!1175 = !DILocation(line: 117, column: 2, scope: !1165, inlinedAt: !1171)
!1176 = !DILocation(line: 117, column: 27, scope: !1165, inlinedAt: !1171)
!1177 = !DILocation(line: 358, column: 38, scope: !1163, inlinedAt: !680)
!1178 = !DILocation(line: 359, column: 19, scope: !1163, inlinedAt: !680)
!1179 = !DILocation(line: 0, scope: !1165, inlinedAt: !1180)
