; ModuleID = '/home/raj/coturn/src/apps/common/hiredis_libevent2.c'
source_filename = "/home/raj/coturn/src/apps/common/hiredis_libevent2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.redisLibeventEvents = type { ptr, i32, i32, ptr, ptr, ptr, i32, i32, ptr, i32, ptr, i32 }
%struct.redis_message = type { [513 x i8], [513 x i8] }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.redisAsyncContext = type { %struct.redisContext, i32, ptr, ptr, %struct.anon.1, ptr, ptr, %struct.redisCallbackList, %struct.anon.2 }
%struct.redisContext = type { i32, [128 x i8], i32, i32, ptr, ptr, i32, ptr, %struct.anon, %struct.anon.0 }
%struct.anon = type { ptr, ptr, i32 }
%struct.anon.0 = type { ptr }
%struct.anon.1 = type { ptr, ptr, ptr, ptr, ptr, ptr }
%struct.redisCallbackList = type { ptr, ptr }
%struct.anon.2 = type { %struct.redisCallbackList, ptr, ptr }

@.str = private unnamed_addr constant [7 x i8] c"%s %s \00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [3 x i8] c"%s\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [48 x i8] c"%s: Redis connection broken: ac=0x%lx, e=0x%lx\0A\00", align 1, !dbg !12
@__FUNCTION__.send_message_to_redis = private unnamed_addr constant [22 x i8] c"send_message_to_redis\00", align 1, !dbg !17
@.str.3 = private unnamed_addr constant [10 x i8] c"127.0.0.1\00", align 1, !dbg !23
@stderr = external global ptr, align 8

!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(scope: null, file: !2, line: 295, type: !25, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 38)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 184, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 23)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 34)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 16)
!60 = distinct !DICompileUnit(language: DW_LANG_C11, file: !61, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !62, retainedTypes: !100, globals: !276, splitDebugInlining: false, nameTableKind: None)
!61 = !DIFile(filename: "/home/raj/coturn/src/apps/common/hiredis_libevent2.c", directory: "/home/raj/coturn/build", checksumkind: CSK_MD5, checksum: "c3ef14860ad3b5fc21bcf0eff3645448")
!62 = !{!63, !69, !76}
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "redisConnectionType", file: !64, line: 111, baseType: !65, size: 32, elements: !66)
!64 = !DIFile(filename: "/usr/include/hiredis/hiredis.h", directory: "", checksumkind: CSK_MD5, checksum: "5e1762de74574e650d25f42de25117d4")
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !{!67, !68}
!67 = !DIEnumerator(name: "REDIS_CONN_TCP", value: 0)
!68 = !DIEnumerator(name: "REDIS_CONN_UNIX", value: 1)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 47, baseType: !65, size: 32, elements: !71)
!70 = !DIFile(filename: "src/apps/common/ns_turn_utils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "74cb4019b1eb9d8e2b879df518b15a25")
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "TURN_LOG_LEVEL_INFO", value: 0)
!73 = !DIEnumerator(name: "TURN_LOG_LEVEL_CONTROL", value: 1)
!74 = !DIEnumerator(name: "TURN_LOG_LEVEL_WARNING", value: 2)
!75 = !DIEnumerator(name: "TURN_LOG_LEVEL_ERROR", value: 3)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 202, baseType: !65, size: 32, elements: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!79 = !DIEnumerator(name: "MSG_OOB", value: 1)
!80 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!81 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!82 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!83 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!84 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!85 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!86 = !DIEnumerator(name: "MSG_EOR", value: 128)
!87 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!88 = !DIEnumerator(name: "MSG_FIN", value: 512)
!89 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!90 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!91 = !DIEnumerator(name: "MSG_RST", value: 4096)
!92 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!93 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!94 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!95 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!96 = !DIEnumerator(name: "MSG_BATCH", value: 262144)
!97 = !DIEnumerator(name: "MSG_ZEROCOPY", value: 67108864)
!98 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!99 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!100 = !{!101, !136, !273, !123, !148, !274}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisLibeventEvents", file: !2, line: 47, size: 640, elements: !103)
!103 = !{!104, !257, !258, !259, !263, !266, !267, !268, !269, !270, !271, !272}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !102, file: !2, line: 49, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisAsyncContext", file: !107, line: 102, baseType: !108)
!107 = !DIFile(filename: "/usr/include/hiredis/async.h", directory: "", checksumkind: CSK_MD5, checksum: "5cb4b0c0e64a258568370922886d582b")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisAsyncContext", file: !107, line: 62, size: 2752, elements: !109)
!109 = !{!110, !207, !208, !209, !210, !219, !226, !229, !249}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !108, file: !107, line: 64, baseType: !111, size: 1664)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisContext", file: !64, line: 138, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisContext", file: !64, line: 117, size: 1664, elements: !113)
!113 = !{!114, !116, !120, !121, !122, !124, !185, !186, !197, !203}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !112, file: !64, line: 118, baseType: !115, size: 32)
!115 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !112, file: !64, line: 119, baseType: !117, size: 1024, offset: 32)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !112, file: !64, line: 120, baseType: !115, size: 32, offset: 1056)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !112, file: !64, line: 121, baseType: !115, size: 32, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "obuf", scope: !112, file: !64, line: 122, baseType: !123, size: 64, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !112, file: !64, line: 123, baseType: !125, size: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReader", file: !127, line: 95, baseType: !128)
!127 = !DIFile(filename: "/usr/include/hiredis/read.h", directory: "", checksumkind: CSK_MD5, checksum: "5e2fbb2b7092d07192fd3a67cc71e387")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReader", file: !127, line: 80, size: 4480, elements: !129)
!129 = !{!130, !131, !132, !133, !137, !138, !139, !154, !155, !156, !184}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !128, file: !127, line: 81, baseType: !115, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !128, file: !127, line: 82, baseType: !117, size: 1024, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !128, file: !127, line: 84, baseType: !123, size: 64, offset: 1088)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !128, file: !127, line: 85, baseType: !134, size: 64, offset: 1152)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !135, line: 46, baseType: !136)
!135 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!136 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !128, file: !127, line: 86, baseType: !134, size: 64, offset: 1216)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "maxbuf", scope: !128, file: !127, line: 87, baseType: !134, size: 64, offset: 1280)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rstack", scope: !128, file: !127, line: 89, baseType: !140, size: 2880, offset: 1344)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 2880, elements: !152)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReadTask", file: !127, line: 70, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReadTask", file: !127, line: 63, size: 320, elements: !143)
!143 = !{!144, !145, !146, !147, !149, !151}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !127, line: 64, baseType: !115, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !142, file: !127, line: 65, baseType: !115, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !142, file: !127, line: 66, baseType: !115, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !142, file: !127, line: 67, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !142, file: !127, line: 68, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !142, file: !127, line: 69, baseType: !148, size: 64, offset: 256)
!152 = !{!153}
!153 = !DISubrange(count: 9)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ridx", scope: !128, file: !127, line: 90, baseType: !115, size: 32, offset: 4224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !128, file: !127, line: 91, baseType: !148, size: 64, offset: 4288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !128, file: !127, line: 93, baseType: !157, size: 64, offset: 4352)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReplyObjectFunctions", file: !127, line: 78, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReplyObjectFunctions", file: !127, line: 72, size: 320, elements: !160)
!160 = !{!161, !167, !171, !176, !180}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "createString", scope: !159, file: !127, line: 73, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!148, !165, !123, !134}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "createArray", scope: !159, file: !127, line: 74, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!148, !165, !115}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "createInteger", scope: !159, file: !127, line: 75, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!148, !165, !175}
!175 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "createNil", scope: !159, file: !127, line: 76, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!148, !165}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "freeObject", scope: !159, file: !127, line: 77, baseType: !181, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !148}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !128, file: !127, line: 94, baseType: !148, size: 64, offset: 4416)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !112, file: !64, line: 125, baseType: !63, size: 32, offset: 1280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !112, file: !64, line: 126, baseType: !187, size: 64, offset: 1344)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !189, line: 8, size: 128, elements: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!190 = !{!191, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !188, file: !189, line: 14, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !193, line: 160, baseType: !194)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!194 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !188, file: !189, line: 15, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !193, line: 162, baseType: !194)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !112, file: !64, line: 132, baseType: !198, size: 192, offset: 1408)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !112, file: !64, line: 128, size: 192, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !198, file: !64, line: 129, baseType: !123, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "source_addr", scope: !198, file: !64, line: 130, baseType: !123, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !198, file: !64, line: 131, baseType: !115, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "unix_sock", scope: !112, file: !64, line: 136, baseType: !204, size: 64, offset: 1600)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !112, file: !64, line: 134, size: 64, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !204, file: !64, line: 135, baseType: !123, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !108, file: !107, line: 67, baseType: !115, size: 32, offset: 1664)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !108, file: !107, line: 68, baseType: !123, size: 64, offset: 1728)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !107, line: 71, baseType: !148, size: 64, offset: 1792)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !108, file: !107, line: 84, baseType: !211, size: 384, offset: 1856)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !108, file: !107, line: 74, size: 384, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !107, line: 75, baseType: !148, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "addRead", scope: !211, file: !107, line: 79, baseType: !181, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "delRead", scope: !211, file: !107, line: 80, baseType: !181, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "addWrite", scope: !211, file: !107, line: 81, baseType: !181, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "delWrite", scope: !211, file: !107, line: 82, baseType: !181, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !211, file: !107, line: 83, baseType: !181, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "onDisconnect", scope: !108, file: !107, line: 88, baseType: !220, size: 64, offset: 2240)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisDisconnectCallback", file: !107, line: 58, baseType: !222)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224, !115}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "onConnect", scope: !108, file: !107, line: 91, baseType: !227, size: 64, offset: 2304)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisConnectCallback", file: !107, line: 59, baseType: !222)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "replies", scope: !108, file: !107, line: 94, baseType: !230, size: 128, offset: 2368)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallbackList", file: !107, line: 55, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCallbackList", file: !107, line: 53, size: 128, elements: !232)
!232 = !{!233, !248}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !231, file: !107, line: 54, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallback", file: !107, line: 50, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisCallback", file: !107, line: 45, size: 256, elements: !237)
!237 = !{!238, !240, !246, !247}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !107, line: 46, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !236, file: !107, line: 47, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisCallbackFn", file: !107, line: 44, baseType: !243)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245, !148, !148}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pending_subs", scope: !236, file: !107, line: 48, baseType: !115, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !236, file: !107, line: 49, baseType: !148, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !107, line: 54, baseType: !234, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !108, file: !107, line: 101, baseType: !250, size: 256, offset: 2496)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !108, file: !107, line: 97, size: 256, elements: !251)
!251 = !{!252, !253, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "invalid", scope: !250, file: !107, line: 98, baseType: !230, size: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !250, file: !107, line: 99, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "dict", file: !107, line: 41, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "patterns", scope: !250, file: !107, line: 100, baseType: !254, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "invalid", scope: !102, file: !2, line: 50, baseType: !115, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !102, file: !2, line: 51, baseType: !115, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !102, file: !2, line: 52, baseType: !260, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !262, line: 217, flags: DIFlagFwdDecl)
!262 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rev", scope: !102, file: !2, line: 53, baseType: !264, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !262, line: 276, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "wev", scope: !102, file: !2, line: 53, baseType: !264, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "rev_set", scope: !102, file: !2, line: 54, baseType: !115, size: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "wev_set", scope: !102, file: !2, line: 54, baseType: !115, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !102, file: !2, line: 55, baseType: !123, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !102, file: !2, line: 56, baseType: !115, size: 32, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !102, file: !2, line: 57, baseType: !123, size: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !102, file: !2, line: 58, baseType: !115, size: 32, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !275, line: 45, baseType: !148)
!275 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!276 = !{!0, !7, !12, !17, !23, !28, !33, !38, !40, !45, !50, !55}
!277 = !{i32 7, !"Dwarf Version", i32 5}
!278 = !{i32 2, !"Debug Info Version", i32 3}
!279 = !{i32 1, !"wchar_size", i32 4}
!280 = !{i32 8, !"PIC Level", i32 2}
!281 = !{i32 7, !"PIE Level", i32 2}
!282 = !{i32 7, !"uwtable", i32 2}
!283 = !{i32 7, !"frame-pointer", i32 2}
!284 = !{!"clang version 16.0.0"}
!285 = distinct !DISubprogram(name: "redis_async_init", scope: !2, file: !2, line: 173, type: !286, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !288)
!286 = !DISubroutineType(types: !287)
!287 = !{null}
!288 = !{}
!289 = !DILocation(line: 176, column: 1, scope: !285)
!290 = distinct !DISubprogram(name: "is_redis_asyncconn_good", scope: !2, file: !2, line: 178, type: !291, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !288)
!291 = !DISubroutineType(types: !292)
!292 = !{!115, !274}
!293 = !DILocalVariable(name: "rch", arg: 1, scope: !290, file: !2, line: 178, type: !274)
!294 = !DILocation(line: 178, column: 50, scope: !290)
!295 = !DILocation(line: 180, column: 5, scope: !296)
!296 = distinct !DILexicalBlock(scope: !290, file: !2, line: 180, column: 5)
!297 = !DILocation(line: 180, column: 5, scope: !290)
!298 = !DILocalVariable(name: "e", scope: !299, file: !2, line: 181, type: !101)
!299 = distinct !DILexicalBlock(scope: !296, file: !2, line: 180, column: 10)
!300 = !DILocation(line: 181, column: 31, scope: !299)
!301 = !DILocation(line: 181, column: 64, scope: !299)
!302 = !DILocation(line: 182, column: 21, scope: !303)
!303 = distinct !DILexicalBlock(scope: !299, file: !2, line: 182, column: 6)
!304 = !DILocation(line: 182, column: 6, scope: !303)
!305 = !DILocation(line: 182, column: 6, scope: !299)
!306 = !DILocation(line: 183, column: 4, scope: !303)
!307 = !DILocation(line: 184, column: 2, scope: !299)
!308 = !DILocation(line: 185, column: 2, scope: !290)
!309 = !DILocation(line: 186, column: 1, scope: !290)
!310 = distinct !DISubprogram(name: "redis_le_valid", scope: !2, file: !2, line: 75, type: !311, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !60, retainedNodes: !288)
!311 = !DISubroutineType(types: !312)
!312 = !{!115, !101}
!313 = !DILocalVariable(name: "e", arg: 1, scope: !310, file: !2, line: 75, type: !101)
!314 = !DILocation(line: 75, column: 55, scope: !310)
!315 = !DILocation(line: 77, column: 10, scope: !310)
!316 = !DILocation(line: 77, column: 12, scope: !310)
!317 = !DILocation(line: 77, column: 17, scope: !310)
!318 = !DILocation(line: 77, column: 20, scope: !310)
!319 = !DILocation(line: 77, column: 16, scope: !310)
!320 = !DILocation(line: 77, column: 29, scope: !310)
!321 = !DILocation(line: 77, column: 33, scope: !310)
!322 = !DILocation(line: 77, column: 36, scope: !310)
!323 = !DILocation(line: 0, scope: !310)
!324 = !DILocation(line: 77, column: 2, scope: !310)
!325 = distinct !DISubprogram(name: "send_message_to_redis", scope: !2, file: !2, line: 188, type: !326, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !288)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !274, !273, !273, !273, null}
!328 = !DILocalVariable(name: "rch", arg: 1, scope: !325, file: !2, line: 188, type: !274)
!329 = !DILocation(line: 188, column: 49, scope: !325)
!330 = !DILocalVariable(name: "command", arg: 2, scope: !325, file: !2, line: 188, type: !273)
!331 = !DILocation(line: 188, column: 66, scope: !325)
!332 = !DILocalVariable(name: "key", arg: 3, scope: !325, file: !2, line: 188, type: !273)
!333 = !DILocation(line: 188, column: 87, scope: !325)
!334 = !DILocalVariable(name: "format", arg: 4, scope: !325, file: !2, line: 188, type: !273)
!335 = !DILocation(line: 188, column: 104, scope: !325)
!336 = !DILocation(line: 190, column: 6, scope: !337)
!337 = distinct !DILexicalBlock(scope: !325, file: !2, line: 190, column: 5)
!338 = !DILocation(line: 190, column: 5, scope: !325)
!339 = !DILocation(line: 191, column: 3, scope: !340)
!340 = distinct !DILexicalBlock(scope: !337, file: !2, line: 190, column: 11)
!341 = !DILocalVariable(name: "e", scope: !342, file: !2, line: 194, type: !101)
!342 = distinct !DILexicalBlock(scope: !337, file: !2, line: 192, column: 9)
!343 = !DILocation(line: 194, column: 31, scope: !342)
!344 = !DILocation(line: 194, column: 64, scope: !342)
!345 = !DILocation(line: 196, column: 22, scope: !346)
!346 = distinct !DILexicalBlock(scope: !342, file: !2, line: 196, column: 6)
!347 = !DILocation(line: 196, column: 7, scope: !346)
!348 = !DILocation(line: 196, column: 6, scope: !342)
!349 = !DILocation(line: 197, column: 20, scope: !350)
!350 = distinct !DILexicalBlock(scope: !346, file: !2, line: 196, column: 26)
!351 = !DILocation(line: 197, column: 4, scope: !350)
!352 = !DILocation(line: 198, column: 3, scope: !350)
!353 = !DILocation(line: 200, column: 22, scope: !354)
!354 = distinct !DILexicalBlock(scope: !342, file: !2, line: 200, column: 6)
!355 = !DILocation(line: 200, column: 7, scope: !354)
!356 = !DILocation(line: 200, column: 6, scope: !342)
!357 = !DILocation(line: 202, column: 3, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !2, line: 200, column: 26)
!359 = !DILocalVariable(name: "ac", scope: !360, file: !2, line: 204, type: !105)
!360 = distinct !DILexicalBlock(scope: !354, file: !2, line: 202, column: 10)
!361 = !DILocation(line: 204, column: 23, scope: !360)
!362 = !DILocation(line: 204, column: 26, scope: !360)
!363 = !DILocation(line: 204, column: 29, scope: !360)
!364 = !DILocalVariable(name: "rm", scope: !360, file: !2, line: 206, type: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redis_message", file: !2, line: 63, size: 8208, elements: !366)
!366 = !{!367, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !365, file: !2, line: 65, baseType: !368, size: 4104)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4104, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 513)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !365, file: !2, line: 66, baseType: !368, size: 4104, offset: 4104)
!372 = !DILocation(line: 206, column: 25, scope: !360)
!373 = !DILocation(line: 208, column: 16, scope: !360)
!374 = !DILocation(line: 208, column: 13, scope: !360)
!375 = !DILocation(line: 208, column: 53, scope: !360)
!376 = !DILocation(line: 208, column: 62, scope: !360)
!377 = !DILocation(line: 208, column: 4, scope: !360)
!378 = !DILocation(line: 209, column: 14, scope: !360)
!379 = !DILocation(line: 209, column: 11, scope: !360)
!380 = !DILocation(line: 209, column: 31, scope: !360)
!381 = !DILocation(line: 209, column: 28, scope: !360)
!382 = !DILocation(line: 209, column: 21, scope: !360)
!383 = !DILocation(line: 209, column: 20, scope: !360)
!384 = !DILocation(line: 209, column: 4, scope: !360)
!385 = !DILocalVariable(name: "args", scope: !360, file: !2, line: 211, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !387, line: 52, baseType: !388)
!387 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !389, line: 14, baseType: !390)
!389 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stdarg.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !391, baseType: !392)
!391 = !DIFile(filename: "src/apps/common/hiredis_libevent2.c", directory: "/home/raj/coturn")
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 192, elements: !399)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !394)
!394 = !{!395, !396, !397, !398}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !393, file: !391, line: 211, baseType: !65, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !393, file: !391, line: 211, baseType: !65, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !393, file: !391, line: 211, baseType: !148, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !393, file: !391, line: 211, baseType: !148, size: 64, offset: 128)
!399 = !{!400}
!400 = !DISubrange(count: 1)
!401 = !DILocation(line: 211, column: 12, scope: !360)
!402 = !DILocation(line: 212, column: 4, scope: !360)
!403 = !DILocation(line: 213, column: 17, scope: !360)
!404 = !DILocation(line: 213, column: 14, scope: !360)
!405 = !DILocation(line: 213, column: 40, scope: !360)
!406 = !DILocation(line: 213, column: 48, scope: !360)
!407 = !DILocation(line: 213, column: 4, scope: !360)
!408 = !DILocation(line: 214, column: 4, scope: !360)
!409 = !DILocation(line: 216, column: 26, scope: !410)
!410 = distinct !DILexicalBlock(scope: !360, file: !2, line: 216, column: 7)
!411 = !DILocation(line: 216, column: 36, scope: !410)
!412 = !DILocation(line: 216, column: 42, scope: !410)
!413 = !DILocation(line: 216, column: 39, scope: !410)
!414 = !DILocation(line: 216, column: 53, scope: !410)
!415 = !DILocation(line: 216, column: 50, scope: !410)
!416 = !DILocation(line: 216, column: 8, scope: !410)
!417 = !DILocation(line: 216, column: 57, scope: !410)
!418 = !DILocation(line: 216, column: 7, scope: !360)
!419 = !DILocation(line: 217, column: 5, scope: !420)
!420 = distinct !DILexicalBlock(scope: !410, file: !2, line: 216, column: 70)
!421 = !DILocation(line: 217, column: 8, scope: !420)
!422 = !DILocation(line: 217, column: 16, scope: !420)
!423 = !DILocation(line: 218, column: 121, scope: !420)
!424 = !DILocation(line: 218, column: 106, scope: !420)
!425 = !DILocation(line: 218, column: 139, scope: !420)
!426 = !DILocation(line: 218, column: 124, scope: !420)
!427 = !DILocation(line: 218, column: 5, scope: !420)
!428 = !DILocation(line: 219, column: 4, scope: !420)
!429 = !DILocation(line: 222, column: 1, scope: !325)
!430 = distinct !DISubprogram(name: "redis_reconnect", scope: !2, file: !2, line: 303, type: !431, scopeLine: 304, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !60, retainedNodes: !288)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !101}
!433 = !DILocalVariable(name: "e", arg: 1, scope: !430, file: !2, line: 303, type: !101)
!434 = !DILocation(line: 303, column: 57, scope: !430)
!435 = !DILocation(line: 305, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !430, file: !2, line: 305, column: 6)
!437 = !DILocation(line: 305, column: 9, scope: !436)
!438 = !DILocation(line: 305, column: 14, scope: !436)
!439 = !DILocation(line: 305, column: 17, scope: !436)
!440 = !DILocation(line: 305, column: 13, scope: !436)
!441 = !DILocation(line: 305, column: 6, scope: !430)
!442 = !DILocation(line: 306, column: 4, scope: !436)
!443 = !DILocation(line: 308, column: 7, scope: !444)
!444 = distinct !DILexicalBlock(scope: !430, file: !2, line: 308, column: 7)
!445 = !DILocation(line: 308, column: 10, scope: !444)
!446 = !DILocation(line: 308, column: 7, scope: !430)
!447 = !DILocation(line: 309, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !449, file: !2, line: 309, column: 7)
!449 = distinct !DILexicalBlock(scope: !444, file: !2, line: 308, column: 15)
!450 = !DILocation(line: 309, column: 10, scope: !448)
!451 = !DILocation(line: 309, column: 7, scope: !449)
!452 = !DILocation(line: 310, column: 15, scope: !448)
!453 = !DILocation(line: 310, column: 18, scope: !448)
!454 = !DILocation(line: 310, column: 5, scope: !448)
!455 = !DILocation(line: 311, column: 15, scope: !449)
!456 = !DILocation(line: 311, column: 18, scope: !449)
!457 = !DILocation(line: 311, column: 4, scope: !449)
!458 = !DILocation(line: 312, column: 4, scope: !449)
!459 = !DILocation(line: 312, column: 7, scope: !449)
!460 = !DILocation(line: 312, column: 11, scope: !449)
!461 = !DILocation(line: 313, column: 3, scope: !449)
!462 = !DILocation(line: 314, column: 3, scope: !430)
!463 = !DILocation(line: 314, column: 6, scope: !430)
!464 = !DILocation(line: 314, column: 14, scope: !430)
!465 = !DILocation(line: 316, column: 7, scope: !466)
