; ModuleID = './src/core/global.c'
source_filename = "./src/core/global.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_global = type { ptr, ptr, i64, i32, %struct.nn_list, %struct.nn_list, %struct.nn_pool }
%struct.nn_list = type { ptr, ptr }
%struct.nn_pool = type { %struct.nn_worker }
%struct.nn_worker = type { %struct.nn_mutex, %struct.nn_queue, %struct.nn_queue_item, %struct.nn_efd, %struct.nn_poller, %struct.nn_poller_hndl, %struct.nn_timerset, %struct.nn_thread }
%struct.nn_mutex = type { %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.nn_queue = type { ptr, ptr }
%struct.nn_queue_item = type { ptr }
%struct.nn_efd = type { i32, i32 }
%struct.nn_poller = type { i32, i32, i32, ptr, ptr, i32 }
%struct.nn_poller_hndl = type { i32 }
%struct.nn_timerset = type { %struct.nn_clock, %struct.nn_list }
%struct.nn_clock = type { i64, i64 }
%struct.nn_thread = type { ptr, ptr, i64 }
%struct.nn_cmsghdr = type { i64, i32, i32 }
%struct.nn_msghdr = type { ptr, i32, ptr, i64 }
%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_transport = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, %struct.nn_list_item }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "self", scope: !2, file: !381, line: 120, type: !415, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !378, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/core/global.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "5d185dd65d2efc8dd8f75197f182719b")
!4 = !{!5, !11, !22, !321, !20, !16, !322, !33, !323, !374}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 24, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !9, line: 38, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_cmsghdr", file: !13, line: 177, size: 128, elements: !14)
!13 = !DIFile(filename: "./src/core/../nn.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "0c95956590725e5a1eedd7f7b192cc23")
!14 = !{!15, !19, !21}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !12, file: !13, line: 178, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 46, baseType: !18)
!17 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!18 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !12, file: !13, line: 179, baseType: !20, size: 32, offset: 64)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !12, file: !13, line: 180, baseType: !20, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !24, line: 160, size: 384, elements: !25)
!24 = !DIFile(filename: "./src/core/../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!25 = !{!26, !27, !28, !29, !316, !320}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !23, file: !24, line: 163, baseType: !20, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !23, file: !24, line: 164, baseType: !20, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !24, line: 167, baseType: !20, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !23, file: !24, line: 173, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!20, !33, !34}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !24, line: 123, size: 128, elements: !37)
!37 = !{!38, !93}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !36, file: !24, line: 124, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !24, line: 84, size: 704, elements: !42)
!42 = !{!43, !47, !48, !54, !58, !59, !60, !64, !81, !82, !88}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !41, file: !24, line: 87, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !35}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !41, file: !24, line: 90, baseType: !44, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !41, file: !24, line: 97, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!20, !35, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !24, line: 56, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !41, file: !24, line: 98, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !35, !52}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !41, file: !24, line: 99, baseType: !55, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !41, file: !24, line: 100, baseType: !55, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !41, file: !24, line: 104, baseType: !61, size: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!20, !35}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !41, file: !24, line: 108, baseType: !65, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!20, !35, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !70, line: 30, size: 512, elements: !71)
!70 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!71 = !{!72, !80}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !69, file: !70, line: 33, baseType: !73, size: 256)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !74, line: 39, size: 256, elements: !75)
!74 = !DIFile(filename: "src/aio/../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !73, file: !74, line: 40, baseType: !77, size: 256)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !69, file: !70, line: 36, baseType: !73, size: 256, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !41, file: !24, line: 112, baseType: !65, size: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !41, file: !24, line: 115, baseType: !83, size: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!20, !35, !20, !20, !86, !16}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !41, file: !24, line: 119, baseType: !89, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!20, !35, !20, !20, !33, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !36, file: !24, line: 125, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !96, line: 42, size: 2752, elements: !97)
!96 = !DIFile(filename: "./src/core/sock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "81758969b613e986f7c84ae94c8bce2a")
!97 = !{!98, !260, !261, !262, !263, !264, !265, !266, !267, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !95, file: !96, line: 45, baseType: !99, size: 640)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !100, line: 66, size: 640, elements: !101)
!100 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!101 = !{!102, !108, !109, !110, !111, !112, !252}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !99, file: !100, line: 67, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !100, line: 58, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !20, !20, !33}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !99, file: !100, line: 68, baseType: !20, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !99, file: !100, line: 69, baseType: !20, size: 32, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !99, file: !100, line: 70, baseType: !33, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !99, file: !100, line: 71, baseType: !107, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !99, file: !100, line: 72, baseType: !113, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !115, line: 37, size: 704, elements: !116)
!115 = !DIFile(filename: "./src/core/../aio/ctx.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "02553d3500c8d7bb20cd89fa252fe2c2")
!116 = !{!117, !154, !245, !246, !247}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !114, file: !115, line: 38, baseType: !118, size: 320)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !119, line: 32, size: 320, elements: !120)
!119 = !DIFile(filename: "src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !118, file: !119, line: 36, baseType: !122, size: 320)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !123, line: 72, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !123, line: 67, size: 320, elements: !125)
!125 = !{!126, !147, !152}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !124, file: !123, line: 69, baseType: !127, size: 320)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !128, line: 22, size: 320, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!129 = !{!130, !131, !133, !134, !135, !136, !138, !139}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !127, file: !128, line: 24, baseType: !20, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !127, file: !128, line: 25, baseType: !132, size: 32, offset: 32)
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !127, file: !128, line: 26, baseType: !20, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !127, file: !128, line: 28, baseType: !132, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !127, file: !128, line: 32, baseType: !20, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !127, file: !128, line: 34, baseType: !137, size: 16, offset: 160)
!137 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !127, file: !128, line: 35, baseType: !137, size: 16, offset: 176)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !127, file: !128, line: 36, baseType: !140, size: 128, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !141, line: 55, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !141, line: 51, size: 128, elements: !143)
!143 = !{!144, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !142, file: !141, line: 53, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !142, file: !141, line: 54, baseType: !145, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !124, file: !123, line: 70, baseType: !148, size: 320)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, elements: !150)
!149 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!150 = !{!151}
!151 = !DISubrange(count: 40)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !124, file: !123, line: 71, baseType: !153, size: 64)
!153 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !114, file: !115, line: 39, baseType: !155, size: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pool", file: !157, line: 30, size: 1408, elements: !158)
!157 = !DIFile(filename: "src/aio/pool.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a87eb417ecad65fee67523e01b3df661")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !156, file: !157, line: 31, baseType: !160, size: 1408)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !161, line: 53, size: 1408, elements: !162)
!161 = !DIFile(filename: "src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!162 = !{!163, !164, !174, !175, !181, !208, !209, !232}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !160, file: !161, line: 54, baseType: !118, size: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !160, file: !161, line: 55, baseType: !165, size: 128, offset: 320)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !166, line: 37, size: 128, elements: !167)
!166 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!167 = !{!168, !173}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !165, file: !166, line: 38, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !166, line: 33, size: 64, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !166, line: 34, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !165, file: !166, line: 39, baseType: !169, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !160, file: !161, line: 56, baseType: !170, size: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !160, file: !161, line: 57, baseType: !176, size: 64, offset: 512)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !177, line: 25, size: 64, elements: !178)
!177 = !DIFile(filename: "src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !176, file: !177, line: 26, baseType: !20, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !176, file: !177, line: 27, baseType: !20, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !160, file: !161, line: 58, baseType: !182, size: 320, offset: 576)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !183, line: 31, size: 320, elements: !184)
!183 = !DIFile(filename: "src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!184 = !{!185, !186, !187, !188, !196, !207}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !182, file: !183, line: 34, baseType: !20, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !182, file: !183, line: 37, baseType: !20, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !182, file: !183, line: 40, baseType: !20, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !182, file: !183, line: 43, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !191, line: 36, size: 64, elements: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!192 = !{!193, !194, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !190, file: !191, line: 38, baseType: !20, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !190, file: !191, line: 39, baseType: !137, size: 16, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !190, file: !191, line: 40, baseType: !137, size: 16, offset: 48)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !182, file: !183, line: 52, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !183, line: 48, size: 128, elements: !199)
!199 = !{!200, !205, !206}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !198, file: !183, line: 49, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !183, line: 27, size: 32, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !202, file: !183, line: 28, baseType: !20, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !183, line: 50, baseType: !20, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !183, line: 51, baseType: !20, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !182, file: !183, line: 55, baseType: !20, size: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !160, file: !161, line: 59, baseType: !202, size: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !160, file: !161, line: 60, baseType: !210, size: 256, offset: 960)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !211, line: 37, size: 256, elements: !212)
!211 = !DIFile(filename: "src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!212 = !{!213, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !210, file: !211, line: 38, baseType: !214, size: 128)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !215, line: 31, size: 128, elements: !216)
!215 = !DIFile(filename: "src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!216 = !{!217, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !214, file: !215, line: 33, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 27, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !9, line: 45, baseType: !18)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !214, file: !215, line: 34, baseType: !218, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !210, file: !211, line: 39, baseType: !222, size: 128, offset: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !223, line: 31, size: 128, elements: !224)
!223 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!224 = !{!225, !231}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !222, file: !223, line: 32, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !223, line: 26, size: 128, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !223, line: 27, baseType: !226, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !227, file: !223, line: 28, baseType: !226, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !222, file: !223, line: 33, baseType: !226, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !160, file: !161, line: 61, baseType: !233, size: 192, offset: 1216)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !234, line: 25, size: 192, elements: !235)
!234 = !DIFile(filename: "src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!235 = !{!236, !242, !243}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !233, file: !234, line: 27, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !239, line: 28, baseType: !240)
!239 = !DIFile(filename: "src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!240 = !DISubroutineType(types: !241)
!241 = !{null, !33}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !233, file: !234, line: 28, baseType: !33, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !233, file: !234, line: 29, baseType: !244, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !123, line: 27, baseType: !18)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !114, file: !115, line: 40, baseType: !165, size: 128, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "eventsto", scope: !114, file: !115, line: 41, baseType: !165, size: 128, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "onleave", scope: !114, file: !115, line: 42, baseType: !248, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_ctx_onleave", file: !115, line: 35, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !113}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !99, file: !100, line: 73, baseType: !253, size: 320, offset: 320)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !100, line: 34, size: 320, elements: !254)
!254 = !{!255, !256, !257, !258, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !253, file: !100, line: 35, baseType: !107, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !253, file: !100, line: 36, baseType: !20, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !253, file: !100, line: 37, baseType: !33, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !100, line: 38, baseType: !20, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !253, file: !100, line: 39, baseType: !170, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !95, file: !96, line: 46, baseType: !20, size: 32, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !95, file: !96, line: 49, baseType: !35, size: 64, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "socktype", scope: !95, file: !96, line: 52, baseType: !22, size: 64, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !95, file: !96, line: 54, baseType: !20, size: 32, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !95, file: !96, line: 56, baseType: !114, size: 704, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sndfd", scope: !95, file: !96, line: 57, baseType: !176, size: 64, offset: 1600)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "rcvfd", scope: !95, file: !96, line: 58, baseType: !176, size: 64, offset: 1664)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "termsem", scope: !95, file: !96, line: 59, baseType: !268, size: 256, offset: 1728)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sem", file: !269, line: 64, size: 256, elements: !270)
!269 = !DIFile(filename: "src/aio/../utils/sem.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "925a3ae06fa6fbb251fb87fc0fbd3a0b")
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !268, file: !269, line: 65, baseType: !272, size: 256)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !273, line: 39, baseType: !274)
!273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !273, line: 35, size: 256, elements: !275)
!275 = !{!276, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !274, file: !273, line: 37, baseType: !277, size: 256)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 256, elements: !78)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !274, file: !273, line: 38, baseType: !153, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !95, file: !96, line: 63, baseType: !214, size: 128, offset: 1984)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !95, file: !96, line: 66, baseType: !222, size: 128, offset: 2112)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !95, file: !96, line: 69, baseType: !20, size: 32, offset: 2240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "linger", scope: !95, file: !96, line: 72, baseType: !20, size: 32, offset: 2272)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !95, file: !96, line: 73, baseType: !20, size: 32, offset: 2304)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !95, file: !96, line: 74, baseType: !20, size: 32, offset: 2336)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sndtimeo", scope: !95, file: !96, line: 75, baseType: !20, size: 32, offset: 2368)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rcvtimeo", scope: !95, file: !96, line: 76, baseType: !20, size: 32, offset: 2400)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_ivl", scope: !95, file: !96, line: 77, baseType: !20, size: 32, offset: 2432)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_ivl_max", scope: !95, file: !96, line: 78, baseType: !20, size: 32, offset: 2464)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sndprio", scope: !95, file: !96, line: 79, baseType: !20, size: 32, offset: 2496)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4only", scope: !95, file: !96, line: 80, baseType: !20, size: 32, offset: 2528)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "optsets", scope: !95, file: !96, line: 83, baseType: !292, size: 192, offset: 2560)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 192, elements: !314)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset", file: !295, line: 56, size: 64, elements: !296)
!295 = !DIFile(filename: "./src/core/../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !294, file: !295, line: 57, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset_vfptr", file: !295, line: 48, size: 192, elements: !301)
!301 = !{!302, !306, !310}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !300, file: !295, line: 49, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !293}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !300, file: !295, line: 50, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!20, !293, !20, !86, !16}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !300, file: !295, line: 52, baseType: !311, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!20, !293, !20, !33, !92}
!314 = !{!315}
!315 = !DISubrange(count: 3)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !23, file: !24, line: 179, baseType: !317, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!20, !20}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !23, file: !24, line: 183, baseType: !227, size: 128, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_transport", file: !295, line: 190, size: 576, elements: !325)
!325 = !{!326, !329, !330, !334, !335, !368, !369, !373}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !295, line: 194, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !324, file: !295, line: 197, baseType: !20, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !324, file: !295, line: 204, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{null}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "term", scope: !324, file: !295, line: 205, baseType: !331, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bind", scope: !324, file: !295, line: 213, baseType: !336, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!20, !33, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !295, line: 81, size: 128, elements: !342)
!342 = !{!343, !353}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !341, file: !295, line: 82, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !295, line: 70, size: 128, elements: !347)
!347 = !{!348, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !346, file: !295, line: 75, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !340}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !346, file: !295, line: 78, baseType: !349, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !341, file: !295, line: 83, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !356, line: 35, size: 2112, elements: !357)
!356 = !DIFile(filename: "./src/core/ep.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3cb96b08ce030ea933432a57e3a52863")
!357 = !{!358, !359, !360, !361, !362, !363, !364}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !355, file: !356, line: 36, baseType: !99, size: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !356, line: 37, baseType: !20, size: 32, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "epbase", scope: !355, file: !356, line: 38, baseType: !340, size: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !355, file: !356, line: 39, baseType: !94, size: 64, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !355, file: !356, line: 40, baseType: !20, size: 32, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !355, file: !356, line: 41, baseType: !227, size: 128, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !355, file: !356, line: 42, baseType: !365, size: 1032, offset: 1024)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 1032, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 129)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !324, file: !295, line: 214, baseType: !336, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "optset", scope: !324, file: !295, line: 219, baseType: !370, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!293}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !324, file: !295, line: 223, baseType: !227, size: 128, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 25, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !9, line: 40, baseType: !377)
!377 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!378 = !{!379, !385, !390, !395, !400, !405, !0, !410}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !381, line: 359, type: !382, isLocal: true, isDefinition: true)
!381 = !DIFile(filename: "./src/core/global.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "5d185dd65d2efc8dd8f75197f182719b")
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 184, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 23)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !381, line: 359, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 160, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 20)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !381, line: 430, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 136, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 17)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !381, line: 498, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 240, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 30)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !381, line: 498, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 64, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 8)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !381, line: 648, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 16, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 2)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !381, line: 241, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 88, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 11)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_global", file: !381, line: 92, size: 1920, elements: !416)
!416 = !{!417, !419, !420, !421, !422, !423, !424}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "socks", scope: !415, file: !381, line: 98, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !415, file: !381, line: 101, baseType: !374, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nsocks", scope: !415, file: !381, line: 104, baseType: !16, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !415, file: !381, line: 107, baseType: !20, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "transports", scope: !415, file: !381, line: 110, baseType: !222, size: 128, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "socktypes", scope: !415, file: !381, line: 113, baseType: !222, size: 128, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !415, file: !381, line: 116, baseType: !156, size: 1408, offset: 512)
!425 = !{i32 7, !"Dwarf Version", i32 5}
!426 = !{i32 2, !"Debug Info Version", i32 3}
!427 = !{i32 1, !"wchar_size", i32 4}
!428 = !{i32 8, !"PIC Level", i32 2}
!429 = !{i32 7, !"PIE Level", i32 2}
!430 = !{i32 7, !"uwtable", i32 2}
!431 = !{i32 7, !"frame-pointer", i32 2}
!432 = !{!"clang version 16.0.0"}
!433 = distinct !DISubprogram(name: "nn_errno", scope: !381, file: !381, line: 134, type: !434, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!20}
!436 = !{}
!437 = !DILocation(line: 136, column: 12, scope: !433)
!438 = !DILocation(line: 136, column: 5, scope: !433)
!439 = distinct !DISubprogram(name: "nn_strerror", scope: !381, file: !381, line: 139, type: !440, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !436)
!440 = !DISubroutineType(types: !441)
!441 = !{!327, !20}
!442 = !DILocalVariable(name: "errnum", arg: 1, scope: !439, file: !381, line: 139, type: !20)
!443 = !DILocation(line: 139, column: 30, scope: !439)
!444 = !DILocation(line: 141, column: 29, scope: !439)
!445 = !DILocation(line: 141, column: 12, scope: !439)
!446 = !DILocation(line: 141, column: 5, scope: !439)
!447 = distinct !DISubprogram(name: "nn_cmsg_nexthdr", scope: !381, file: !381, line: 144, type: !448, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !436)
!448 = !DISubroutineType(types: !449)
!449 = !{!11, !450, !463}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msghdr", file: !13, line: 170, size: 256, elements: !453)
!453 = !{!454, !460, !461, !462}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !452, file: !13, line: 171, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_iovec", file: !13, line: 165, size: 128, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !456, file: !13, line: 166, baseType: !33, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !456, file: !13, line: 167, baseType: !16, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !452, file: !13, line: 172, baseType: !20, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !452, file: !13, line: 173, baseType: !33, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !452, file: !13, line: 174, baseType: !16, size: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!465 = !DILocalVariable(name: "mhdr", arg: 1, scope: !447, file: !381, line: 144, type: !450)
!466 = !DILocation(line: 144, column: 61, scope: !447)
!467 = !DILocalVariable(name: "cmsg", arg: 2, scope: !447, file: !381, line: 145, type: !463)
!468 = !DILocation(line: 145, column: 30, scope: !447)
!469 = !DILocalVariable(name: "sz", scope: !447, file: !381, line: 147, type: !16)
!470 = !DILocation(line: 147, column: 12, scope: !447)
!471 = !DILocation(line: 149, column: 39, scope: !447)
!472 = !DILocation(line: 149, column: 45, scope: !447)
!473 = !DILocation(line: 149, column: 37, scope: !447)
!474 = !DILocation(line: 149, column: 8, scope: !447)
!475 = !DILocation(line: 150, column: 21, scope: !476)
!476 = distinct !DILexicalBlock(scope: !447, file: !381, line: 150, column: 9)
!477 = !DILocation(line: 150, column: 41, scope: !476)
!478 = !DILocation(line: 150, column: 47, scope: !476)
!479 = !DILocation(line: 150, column: 27, scope: !476)
!480 = !DILocation(line: 150, column: 62, scope: !476)
!481 = !DILocation(line: 150, column: 60, scope: !476)
!482 = !DILocation(line: 151, column: 12, scope: !476)
!483 = !DILocation(line: 151, column: 18, scope: !476)
!484 = !DILocation(line: 150, column: 65, scope: !476)
!485 = !DILocation(line: 150, column: 9, scope: !447)
!486 = !DILocation(line: 152, column: 9, scope: !476)
!487 = !DILocation(line: 153, column: 46, scope: !447)
!488 = !DILocation(line: 153, column: 54, scope: !447)
!489 = !DILocation(line: 153, column: 52, scope: !447)
!490 = !DILocation(line: 153, column: 5, scope: !447)
!491 = !DILocation(line: 154, column: 1, scope: !447)
!492 = distinct !DISubprogram(name: "nn_term", scope: !381, file: !381, line: 280, type: !332, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !436)
!493 = !DILocalVariable(name: "i", scope: !492, file: !381, line: 282, type: !20)
!494 = !DILocation(line: 282, column: 9, scope: !492)
!495 = !DILocation(line: 284, column: 5, scope: !492)
!496 = !DILocation(line: 287, column: 16, scope: !492)
!497 = !DILocation(line: 290, column: 14, scope: !498)
!498 = distinct !DILexicalBlock(scope: !492, file: !381, line: 290, column: 9)
!499 = !DILocation(line: 290, column: 9, scope: !498)
!500 = !DILocation(line: 290, column: 20, scope: !498)
!501 = !DILocation(line: 290, column: 28, scope: !498)
!502 = !DILocation(line: 290, column: 23, scope: !498)
!503 = !DILocation(line: 290, column: 9, scope: !492)
!504 = !DILocation(line: 291, column: 16, scope: !505)
!505 = distinct !DILexicalBlock(scope: !506, file: !381, line: 291, column: 9)
!506 = distinct !DILexicalBlock(scope: !498, file: !381, line: 290, column: 36)
!507 = !DILocation(line: 291, column: 14, scope: !505)
!508 = !DILocation(line: 291, column: 21, scope: !509)
!509 = distinct !DILexicalBlock(scope: !505, file: !381, line: 291, column: 9)
!510 = !DILocation(line: 291, column: 23, scope: !509)
!511 = !DILocation(line: 291, column: 9, scope: !505)
!512 = !DILocation(line: 292, column: 22, scope: !513)
!513 = distinct !DILexicalBlock(scope: !509, file: !381, line: 292, column: 17)
!514 = !DILocation(line: 292, column: 29, scope: !513)
!515 = !DILocation(line: 292, column: 17, scope: !513)
!516 = !DILocation(line: 292, column: 17, scope: !509)
!517 = !DILocation(line: 293, column: 39, scope: !513)
!518 = !DILocation(line: 293, column: 46, scope: !513)
!519 = !DILocation(line: 293, column: 34, scope: !513)
!520 = !DILocation(line: 293, column: 17, scope: !513)
!521 = !DILocation(line: 292, column: 30, scope: !513)
!522 = !DILocation(line: 291, column: 42, scope: !509)
!523 = !DILocation(line: 291, column: 9, scope: !509)
!524 = distinct !{!524, !511, !525, !526}
!525 = !DILocation(line: 293, column: 48, scope: !505)
