; ModuleID = './src/core/pipe.c'
source_filename = "./src/core/pipe.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_epbase = type { ptr, ptr }
%struct.nn_ep = type { %struct.nn_fsm, i32, ptr, ptr, i32, %struct.nn_list_item, [129 x i8] }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_pipebase = type { %struct.nn_fsm, ptr, i8, i8, i8, ptr, ptr, %struct.nn_fsm_event, %struct.nn_fsm_event }
%struct.nn_sock = type { %struct.nn_fsm, i32, ptr, ptr, i32, %struct.nn_ctx, %struct.nn_efd, %struct.nn_efd, %struct.nn_sem, %struct.nn_clock, %struct.nn_list, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [3 x ptr] }
%struct.nn_ctx = type { %struct.nn_mutex, ptr, %struct.nn_queue, %struct.nn_queue, ptr }
%struct.nn_mutex = type { %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.nn_queue = type { ptr, ptr }
%struct.nn_efd = type { i32, i32 }
%struct.nn_sem = type { %union.sem_t }
%union.sem_t = type { i64, [24 x i8] }
%struct.nn_clock = type { i64, i64 }
%struct.nn_list = type { ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/core/pipe.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1d337fccc2731f367f416a2189f6b16f")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 30)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 17)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 18)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 38)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 43)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 45)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !9, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 48)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 51)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 46)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 180, type: !41, isLocal: true, isDefinition: true)
!51 = distinct !DICompileUnit(language: DW_LANG_C11, file: !52, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !53, globals: !382, splitDebugInlining: false, nameTableKind: None)
!52 = !DIFile(filename: "src/core/pipe.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1d337fccc2731f367f416a2189f6b16f")
!53 = !{!54, !57, !58}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !56, line: 56, flags: DIFlagFwdDecl)
!56 = !DIFile(filename: "./src/core/../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase", file: !60, line: 147, size: 1536, elements: !61)
!60 = !DIFile(filename: "./src/core/../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!61 = !{!62, !227, !253, !254, !255, !256, !379, !380, !381}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !59, file: !60, line: 148, baseType: !63, size: 640)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !64, line: 66, size: 640, elements: !65)
!64 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!65 = !{!66, !73, !74, !75, !76, !77, !219}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !63, file: !64, line: 67, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !64, line: 58, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !57, !57, !72}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !63, file: !64, line: 68, baseType: !57, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !63, file: !64, line: 69, baseType: !57, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !63, file: !64, line: 70, baseType: !72, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !63, file: !64, line: 71, baseType: !71, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !63, file: !64, line: 72, baseType: !78, size: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !80, line: 37, size: 704, elements: !81)
!80 = !DIFile(filename: "./src/core/../aio/ctx.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "02553d3500c8d7bb20cd89fa252fe2c2")
!81 = !{!82, !118, !212, !213, !214}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !79, file: !80, line: 38, baseType: !83, size: 320)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !84, line: 32, size: 320, elements: !85)
!84 = !DIFile(filename: "src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !83, file: !84, line: 36, baseType: !87, size: 320)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !88, line: 72, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !88, line: 67, size: 320, elements: !90)
!90 = !{!91, !112, !116}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !89, file: !88, line: 69, baseType: !92, size: 320)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !93, line: 22, size: 320, elements: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!94 = !{!95, !96, !98, !99, !100, !101, !103, !104}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !92, file: !93, line: 24, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !92, file: !93, line: 25, baseType: !97, size: 32, offset: 32)
!97 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !92, file: !93, line: 26, baseType: !57, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !92, file: !93, line: 28, baseType: !97, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !92, file: !93, line: 32, baseType: !57, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !92, file: !93, line: 34, baseType: !102, size: 16, offset: 160)
!102 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !92, file: !93, line: 35, baseType: !102, size: 16, offset: 176)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !92, file: !93, line: 36, baseType: !105, size: 128, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !106, line: 55, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !106, line: 51, size: 128, elements: !108)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !107, file: !106, line: 53, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !107, file: !106, line: 54, baseType: !110, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !89, file: !88, line: 70, baseType: !113, size: 320)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 40)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !89, file: !88, line: 71, baseType: !117, size: 64)
!117 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !79, file: !80, line: 39, baseType: !119, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pool", file: !121, line: 30, size: 1408, elements: !122)
!121 = !DIFile(filename: "src/aio/pool.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a87eb417ecad65fee67523e01b3df661")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !120, file: !121, line: 31, baseType: !124, size: 1408)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !125, line: 53, size: 1408, elements: !126)
!125 = !DIFile(filename: "src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!126 = !{!127, !128, !138, !139, !145, !172, !173, !199}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !124, file: !125, line: 54, baseType: !83, size: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !124, file: !125, line: 55, baseType: !129, size: 128, offset: 320)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !130, line: 37, size: 128, elements: !131)
!130 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!131 = !{!132, !137}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !130, line: 38, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !130, line: 33, size: 64, elements: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !130, line: 34, baseType: !133, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !129, file: !130, line: 39, baseType: !133, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !124, file: !125, line: 56, baseType: !134, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !124, file: !125, line: 57, baseType: !140, size: 64, offset: 512)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !141, line: 25, size: 64, elements: !142)
!141 = !DIFile(filename: "src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !140, file: !141, line: 26, baseType: !57, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !140, file: !141, line: 27, baseType: !57, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !124, file: !125, line: 58, baseType: !146, size: 320, offset: 576)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !147, line: 31, size: 320, elements: !148)
!147 = !DIFile(filename: "src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!148 = !{!149, !150, !151, !152, !160, !171}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !147, line: 34, baseType: !57, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !146, file: !147, line: 37, baseType: !57, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !146, file: !147, line: 40, baseType: !57, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !146, file: !147, line: 43, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !155, line: 36, size: 64, elements: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !154, file: !155, line: 38, baseType: !57, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !154, file: !155, line: 39, baseType: !102, size: 16, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !154, file: !155, line: 40, baseType: !102, size: 16, offset: 48)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !146, file: !147, line: 52, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !147, line: 48, size: 128, elements: !163)
!163 = !{!164, !169, !170}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !162, file: !147, line: 49, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !147, line: 27, size: 32, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !166, file: !147, line: 28, baseType: !57, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !162, file: !147, line: 50, baseType: !57, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !147, line: 51, baseType: !57, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !146, file: !147, line: 55, baseType: !57, size: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !124, file: !125, line: 59, baseType: !166, size: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !124, file: !125, line: 60, baseType: !174, size: 256, offset: 960)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !175, line: 37, size: 256, elements: !176)
!175 = !DIFile(filename: "src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!176 = !{!177, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !174, file: !175, line: 38, baseType: !178, size: 128)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !179, line: 31, size: 128, elements: !180)
!179 = !DIFile(filename: "src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!180 = !{!181, !187}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !178, file: !179, line: 33, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !183, line: 27, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !185, line: 45, baseType: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!186 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !178, file: !179, line: 34, baseType: !182, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !174, file: !175, line: 39, baseType: !189, size: 128, offset: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !190, line: 31, size: 128, elements: !191)
!190 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!191 = !{!192, !198}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !189, file: !190, line: 32, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !190, line: 26, size: 128, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !190, line: 27, baseType: !193, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !190, line: 28, baseType: !193, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !189, file: !190, line: 33, baseType: !193, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !124, file: !125, line: 61, baseType: !200, size: 192, offset: 1216)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !201, line: 25, size: 192, elements: !202)
!201 = !DIFile(filename: "src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!202 = !{!203, !209, !210}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !200, file: !201, line: 27, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !206, line: 28, baseType: !207)
!206 = !DIFile(filename: "src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !72}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !200, file: !201, line: 28, baseType: !72, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !200, file: !201, line: 29, baseType: !211, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !88, line: 27, baseType: !186)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !79, file: !80, line: 40, baseType: !129, size: 128, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "eventsto", scope: !79, file: !80, line: 41, baseType: !129, size: 128, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "onleave", scope: !79, file: !80, line: 42, baseType: !215, size: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_ctx_onleave", file: !80, line: 35, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !78}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !63, file: !64, line: 73, baseType: !220, size: 320, offset: 320)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !64, line: 34, size: 320, elements: !221)
!221 = !{!222, !223, !224, !225, !226}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !220, file: !64, line: 35, baseType: !71, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !220, file: !64, line: 36, baseType: !57, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !220, file: !64, line: 37, baseType: !72, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !220, file: !64, line: 38, baseType: !57, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !220, file: !64, line: 39, baseType: !134, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !59, file: !60, line: 149, baseType: !228, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase_vfptr", file: !60, line: 134, size: 128, elements: !231)
!231 = !{!232, !252}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !230, file: !60, line: 138, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!57, !58, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !238, line: 30, size: 512, elements: !239)
!238 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!239 = !{!240, !251}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !237, file: !238, line: 33, baseType: !241, size: 256)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !242, line: 39, size: 256, elements: !243)
!242 = !DIFile(filename: "src/aio/../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !241, file: !242, line: 40, baseType: !245, size: 256)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 256, elements: !249)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !183, line: 24, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !185, line: 38, baseType: !248)
!248 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!249 = !{!250}
!250 = !DISubrange(count: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !237, file: !238, line: 36, baseType: !241, size: 256, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !230, file: !60, line: 142, baseType: !233, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !59, file: !60, line: 150, baseType: !246, size: 8, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !59, file: !60, line: 151, baseType: !246, size: 8, offset: 712)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !59, file: !60, line: 152, baseType: !246, size: 8, offset: 720)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !59, file: !60, line: 153, baseType: !257, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !259, line: 42, size: 2752, elements: !260)
!259 = !DIFile(filename: "./src/core/sock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "81758969b613e986f7c84ae94c8bce2a")
!260 = !{!261, !262, !263, !310, !327, !328, !329, !330, !331, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !258, file: !259, line: 45, baseType: !63, size: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !258, file: !259, line: 46, baseType: !57, size: 32, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !258, file: !259, line: 49, baseType: !264, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !56, line: 123, size: 128, elements: !266)
!266 = !{!267, !309}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !265, file: !56, line: 124, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !56, line: 84, size: 704, elements: !271)
!271 = !{!272, !276, !277, !281, !285, !286, !287, !291, !295, !296, !304}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !270, file: !56, line: 87, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !264}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !270, file: !56, line: 90, baseType: !273, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !270, file: !56, line: 97, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!57, !264, !54}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !270, file: !56, line: 98, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !264, !54}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !270, file: !56, line: 99, baseType: !282, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !270, file: !56, line: 100, baseType: !282, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !270, file: !56, line: 104, baseType: !288, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!57, !264}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !270, file: !56, line: 108, baseType: !292, size: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!57, !264, !236}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !270, file: !56, line: 112, baseType: !292, size: 64, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !270, file: !56, line: 115, baseType: !297, size: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!57, !264, !57, !57, !300, !302}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !303, line: 46, baseType: !186)
!303 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !270, file: !56, line: 119, baseType: !305, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!57, !264, !57, !57, !72, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !265, file: !56, line: 125, baseType: !257, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "socktype", scope: !258, file: !259, line: 52, baseType: !311, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !56, line: 160, size: 384, elements: !313)
!313 = !{!314, !315, !316, !317, !322, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !312, file: !56, line: 163, baseType: !57, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !312, file: !56, line: 164, baseType: !57, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !56, line: 167, baseType: !57, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !312, file: !56, line: 173, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!57, !72, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !312, file: !56, line: 179, baseType: !323, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!57, !57}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !312, file: !56, line: 183, baseType: !194, size: 128, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !259, line: 54, baseType: !57, size: 32, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !258, file: !259, line: 56, baseType: !79, size: 704, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sndfd", scope: !258, file: !259, line: 57, baseType: !140, size: 64, offset: 1600)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rcvfd", scope: !258, file: !259, line: 58, baseType: !140, size: 64, offset: 1664)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "termsem", scope: !258, file: !259, line: 59, baseType: !332, size: 256, offset: 1728)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sem", file: !333, line: 64, size: 256, elements: !334)
!333 = !DIFile(filename: "src/aio/../utils/sem.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "925a3ae06fa6fbb251fb87fc0fbd3a0b")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !332, file: !333, line: 65, baseType: !336, size: 256)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !337, line: 39, baseType: !338)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !337, line: 35, size: 256, elements: !339)
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !338, file: !337, line: 37, baseType: !341, size: 256)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !249)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !338, file: !337, line: 38, baseType: !117, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !258, file: !259, line: 63, baseType: !178, size: 128, offset: 1984)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !258, file: !259, line: 66, baseType: !189, size: 128, offset: 2112)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !258, file: !259, line: 69, baseType: !57, size: 32, offset: 2240)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "linger", scope: !258, file: !259, line: 72, baseType: !57, size: 32, offset: 2272)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !258, file: !259, line: 73, baseType: !57, size: 32, offset: 2304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !258, file: !259, line: 74, baseType: !57, size: 32, offset: 2336)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sndtimeo", scope: !258, file: !259, line: 75, baseType: !57, size: 32, offset: 2368)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rcvtimeo", scope: !258, file: !259, line: 76, baseType: !57, size: 32, offset: 2400)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_ivl", scope: !258, file: !259, line: 77, baseType: !57, size: 32, offset: 2432)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_ivl_max", scope: !258, file: !259, line: 78, baseType: !57, size: 32, offset: 2464)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sndprio", scope: !258, file: !259, line: 79, baseType: !57, size: 32, offset: 2496)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4only", scope: !258, file: !259, line: 80, baseType: !57, size: 32, offset: 2528)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optsets", scope: !258, file: !259, line: 83, baseType: !356, size: 192, offset: 2560)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 192, elements: !377)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset", file: !60, line: 56, size: 64, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !358, file: !60, line: 57, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset_vfptr", file: !60, line: 48, size: 192, elements: !364)
!364 = !{!365, !369, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !363, file: !60, line: 49, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !357}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !363, file: !60, line: 50, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!57, !357, !57, !300, !302}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !363, file: !60, line: 52, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!57, !357, !57, !72, !308}
!377 = !{!378}
!378 = !DISubrange(count: 3)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !60, line: 154, baseType: !72, size: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !59, file: !60, line: 155, baseType: !220, size: 320, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !59, file: !60, line: 156, baseType: !220, size: 320, offset: 1216)
!382 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !44, !49}
!383 = !{i32 7, !"Dwarf Version", i32 5}
!384 = !{i32 2, !"Debug Info Version", i32 3}
!385 = !{i32 1, !"wchar_size", i32 4}
!386 = !{i32 8, !"PIC Level", i32 2}
!387 = !{i32 7, !"PIE Level", i32 2}
!388 = !{i32 7, !"uwtable", i32 2}
!389 = !{i32 7, !"frame-pointer", i32 2}
!390 = !{!"clang version 16.0.0"}
!391 = distinct !DISubprogram(name: "nn_pipebase_init", scope: !2, file: !2, line: 48, type: !392, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !51, retainedNodes: !422)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !58, !228, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !60, line: 81, size: 128, elements: !396)
!396 = !{!397, !407}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !395, file: !60, line: 82, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !60, line: 70, size: 128, elements: !401)
!401 = !{!402, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !400, file: !60, line: 75, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !394}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !400, file: !60, line: 78, baseType: !403, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !395, file: !60, line: 83, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !410, line: 35, size: 2112, elements: !411)
!410 = !DIFile(filename: "./src/core/ep.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3cb96b08ce030ea933432a57e3a52863")
!411 = !{!412, !413, !414, !415, !416, !417, !418}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !409, file: !410, line: 36, baseType: !63, size: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !409, file: !410, line: 37, baseType: !57, size: 32, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "epbase", scope: !409, file: !410, line: 38, baseType: !394, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !409, file: !410, line: 39, baseType: !257, size: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !409, file: !410, line: 40, baseType: !57, size: 32, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !409, file: !410, line: 41, baseType: !194, size: 128, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !409, file: !410, line: 42, baseType: !419, size: 1032, offset: 1024)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1032, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 129)
!422 = !{}
!423 = !DILocalVariable(name: "self", arg: 1, scope: !391, file: !2, line: 48, type: !58)
!424 = !DILocation(line: 48, column: 44, scope: !391)
!425 = !DILocalVariable(name: "vfptr", arg: 2, scope: !391, file: !2, line: 49, type: !228)
!426 = !DILocation(line: 49, column: 37, scope: !391)
!427 = !DILocalVariable(name: "epbase", arg: 3, scope: !391, file: !2, line: 49, type: !394)
!428 = !DILocation(line: 49, column: 62, scope: !391)
!429 = !DILocation(line: 51, column: 5, scope: !391)
!430 = !DILocation(line: 51, column: 5, scope: !431)
!431 = distinct !DILexicalBlock(scope: !432, file: !2, line: 51, column: 5)
!432 = distinct !DILexicalBlock(scope: !391, file: !2, line: 51, column: 5)
!433 = !DILocation(line: 51, column: 5, scope: !432)
!434 = !DILocation(line: 51, column: 5, scope: !435)
!435 = distinct !DILexicalBlock(scope: !431, file: !2, line: 51, column: 5)
!436 = !DILocation(line: 53, column: 19, scope: !391)
!437 = !DILocation(line: 53, column: 25, scope: !391)
!438 = !DILocation(line: 53, column: 39, scope: !391)
!439 = !DILocation(line: 53, column: 46, scope: !391)
!440 = !DILocation(line: 53, column: 54, scope: !391)
!441 = !DILocation(line: 53, column: 58, scope: !391)
!442 = !DILocation(line: 53, column: 64, scope: !391)
!443 = !DILocation(line: 53, column: 5, scope: !391)
!444 = !DILocation(line: 54, column: 19, scope: !391)
!445 = !DILocation(line: 54, column: 5, scope: !391)
!446 = !DILocation(line: 54, column: 11, scope: !391)
!447 = !DILocation(line: 54, column: 17, scope: !391)
!448 = !DILocation(line: 55, column: 5, scope: !391)
!449 = !DILocation(line: 55, column: 11, scope: !391)
!450 = !DILocation(line: 55, column: 17, scope: !391)
!451 = !DILocation(line: 56, column: 5, scope: !391)
!452 = !DILocation(line: 56, column: 11, scope: !391)
!453 = !DILocation(line: 56, column: 19, scope: !391)
!454 = !DILocation(line: 57, column: 5, scope: !391)
!455 = !DILocation(line: 57, column: 11, scope: !391)
!456 = !DILocation(line: 57, column: 20, scope: !391)
!457 = !DILocation(line: 58, column: 18, scope: !391)
!458 = !DILocation(line: 58, column: 26, scope: !391)
!459 = !DILocation(line: 58, column: 30, scope: !391)
!460 = !DILocation(line: 58, column: 5, scope: !391)
!461 = !DILocation(line: 58, column: 11, scope: !391)
!462 = !DILocation(line: 58, column: 16, scope: !391)
!463 = !DILocation(line: 59, column: 25, scope: !391)
!464 = !DILocation(line: 59, column: 31, scope: !391)
!465 = !DILocation(line: 59, column: 5, scope: !391)
!466 = !DILocation(line: 60, column: 25, scope: !391)
!467 = !DILocation(line: 60, column: 31, scope: !391)
!468 = !DILocation(line: 60, column: 5, scope: !391)
!469 = !DILocation(line: 61, column: 1, scope: !391)
!470 = distinct !DISubprogram(name: "nn_pipebase_term", scope: !2, file: !2, line: 63, type: !471, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !51, retainedNodes: !422)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !58}
!473 = !DILocalVariable(name: "self", arg: 1, scope: !470, file: !2, line: 63, type: !58)
!474 = !DILocation(line: 63, column: 44, scope: !470)
!475 = !DILocation(line: 65, column: 5, scope: !470)
!476 = !DILocation(line: 65, column: 5, scope: !477)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 65, column: 5)
!478 = distinct !DILexicalBlock(scope: !470, file: !2, line: 65, column: 5)
!479 = !DILocation(line: 65, column: 5, scope: !478)
!480 = !DILocation(line: 65, column: 5, scope: !481)
!481 = distinct !DILexicalBlock(scope: !477, file: !2, line: 65, column: 5)
!482 = !DILocation(line: 67, column: 25, scope: !470)
!483 = !DILocation(line: 67, column: 31, scope: !470)
!484 = !DILocation(line: 67, column: 5, scope: !470)
