; ModuleID = './src/core/sock.c'
source_filename = "./src/core/sock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sock = type { %struct.nn_fsm, i32, ptr, ptr, i32, %struct.nn_ctx, %struct.nn_efd, %struct.nn_efd, %struct.nn_sem, %struct.nn_clock, %struct.nn_list, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [3 x ptr] }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_ctx = type { %struct.nn_mutex, ptr, %struct.nn_queue, %struct.nn_queue, ptr }
%struct.nn_mutex = type { %union.pthread_mutex_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.nn_queue = type { ptr, ptr }
%struct.nn_efd = type { i32, i32 }
%struct.nn_sem = type { %union.sem_t }
%union.sem_t = type { i64, [24 x i8] }
%struct.nn_clock = type { i64, i64 }
%struct.nn_list = type { ptr, ptr }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/core/sock.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "088b482bf70c53ce5aa2698ae8e293ae")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 30)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 744, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 93)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 18)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 17)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 413, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 2)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 516, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 7)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 723, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 75)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 751, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 22)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !2, line: 775, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 55)
!47 = distinct !DICompileUnit(language: DW_LANG_C11, file: !48, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !49, globals: !387, splitDebugInlining: false, nameTableKind: None)
!48 = !DIFile(filename: "src/core/sock.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "088b482bf70c53ce5aa2698ae8e293ae")
!49 = !{!50, !51, !52, !385, !245, !386, !238, !263}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !54, line: 35, size: 2112, elements: !55)
!54 = !DIFile(filename: "./src/core/ep.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3cb96b08ce030ea933432a57e3a52863")
!55 = !{!56, !220, !221, !237, !379, !380, !381}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !53, file: !54, line: 36, baseType: !57, size: 640)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !58, line: 66, size: 640, elements: !59)
!58 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!59 = !{!60, !66, !67, !68, !69, !70, !212}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !57, file: !58, line: 67, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !58, line: 58, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !51, !51, !50}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !57, file: !58, line: 68, baseType: !51, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !57, file: !58, line: 69, baseType: !51, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !57, file: !58, line: 70, baseType: !50, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !57, file: !58, line: 71, baseType: !65, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !57, file: !58, line: 72, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !73, line: 37, size: 704, elements: !74)
!73 = !DIFile(filename: "./src/core/../aio/ctx.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "02553d3500c8d7bb20cd89fa252fe2c2")
!74 = !{!75, !111, !205, !206, !207}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !72, file: !73, line: 38, baseType: !76, size: 320)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !77, line: 32, size: 320, elements: !78)
!77 = !DIFile(filename: "src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !76, file: !77, line: 36, baseType: !80, size: 320)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !81, line: 72, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !81, line: 67, size: 320, elements: !83)
!83 = !{!84, !105, !109}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !82, file: !81, line: 69, baseType: !85, size: 320)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !86, line: 22, size: 320, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!87 = !{!88, !89, !91, !92, !93, !94, !96, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !85, file: !86, line: 24, baseType: !51, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !85, file: !86, line: 25, baseType: !90, size: 32, offset: 32)
!90 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !85, file: !86, line: 26, baseType: !51, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !85, file: !86, line: 28, baseType: !90, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !85, file: !86, line: 32, baseType: !51, size: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !85, file: !86, line: 34, baseType: !95, size: 16, offset: 160)
!95 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !85, file: !86, line: 35, baseType: !95, size: 16, offset: 176)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !85, file: !86, line: 36, baseType: !98, size: 128, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !99, line: 55, baseType: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !99, line: 51, size: 128, elements: !101)
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !100, file: !99, line: 53, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !100, file: !99, line: 54, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !82, file: !81, line: 70, baseType: !106, size: 320)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 40)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !82, file: !81, line: 71, baseType: !110, size: 64)
!110 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !72, file: !73, line: 39, baseType: !112, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pool", file: !114, line: 30, size: 1408, elements: !115)
!114 = !DIFile(filename: "src/aio/pool.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a87eb417ecad65fee67523e01b3df661")
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !113, file: !114, line: 31, baseType: !117, size: 1408)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !118, line: 53, size: 1408, elements: !119)
!118 = !DIFile(filename: "src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!119 = !{!120, !121, !131, !132, !138, !165, !166, !192}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !117, file: !118, line: 54, baseType: !76, size: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !117, file: !118, line: 55, baseType: !122, size: 128, offset: 320)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !123, line: 37, size: 128, elements: !124)
!123 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!124 = !{!125, !130}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !123, line: 38, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !123, line: 33, size: 64, elements: !128)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !123, line: 34, baseType: !126, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !122, file: !123, line: 39, baseType: !126, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !117, file: !118, line: 56, baseType: !127, size: 64, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !117, file: !118, line: 57, baseType: !133, size: 64, offset: 512)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !134, line: 25, size: 64, elements: !135)
!134 = !DIFile(filename: "src/utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !133, file: !134, line: 26, baseType: !51, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !133, file: !134, line: 27, baseType: !51, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !117, file: !118, line: 58, baseType: !139, size: 320, offset: 576)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !140, line: 31, size: 320, elements: !141)
!140 = !DIFile(filename: "src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!141 = !{!142, !143, !144, !145, !153, !164}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !139, file: !140, line: 34, baseType: !51, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !139, file: !140, line: 37, baseType: !51, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !139, file: !140, line: 40, baseType: !51, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !139, file: !140, line: 43, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !148, line: 36, size: 64, elements: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !147, file: !148, line: 38, baseType: !51, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !147, file: !148, line: 39, baseType: !95, size: 16, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !147, file: !148, line: 40, baseType: !95, size: 16, offset: 48)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !139, file: !140, line: 52, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !140, line: 48, size: 128, elements: !156)
!156 = !{!157, !162, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !155, file: !140, line: 49, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !140, line: 27, size: 32, elements: !160)
!160 = !{!161}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !159, file: !140, line: 28, baseType: !51, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !140, line: 50, baseType: !51, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !140, line: 51, baseType: !51, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !139, file: !140, line: 55, baseType: !51, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !117, file: !118, line: 59, baseType: !159, size: 32, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !117, file: !118, line: 60, baseType: !167, size: 256, offset: 960)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !168, line: 37, size: 256, elements: !169)
!168 = !DIFile(filename: "src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!169 = !{!170, !181}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !167, file: !168, line: 38, baseType: !171, size: 128)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !172, line: 31, size: 128, elements: !173)
!172 = !DIFile(filename: "src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!173 = !{!174, !180}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !171, file: !172, line: 33, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !176, line: 27, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !178, line: 45, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!179 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !171, file: !172, line: 34, baseType: !175, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !167, file: !168, line: 39, baseType: !182, size: 128, offset: 128)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !183, line: 31, size: 128, elements: !184)
!183 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!184 = !{!185, !191}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !182, file: !183, line: 32, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !183, line: 26, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !183, line: 27, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !187, file: !183, line: 28, baseType: !186, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !182, file: !183, line: 33, baseType: !186, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !117, file: !118, line: 61, baseType: !193, size: 192, offset: 1216)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !194, line: 25, size: 192, elements: !195)
!194 = !DIFile(filename: "src/utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!195 = !{!196, !202, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !193, file: !194, line: 27, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !199, line: 28, baseType: !200)
!199 = !DIFile(filename: "src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!200 = !DISubroutineType(types: !201)
!201 = !{null, !50}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !193, file: !194, line: 28, baseType: !50, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !193, file: !194, line: 29, baseType: !204, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !81, line: 27, baseType: !179)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !72, file: !73, line: 40, baseType: !122, size: 128, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "eventsto", scope: !72, file: !73, line: 41, baseType: !122, size: 128, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "onleave", scope: !72, file: !73, line: 42, baseType: !208, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_ctx_onleave", file: !73, line: 35, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !71}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !57, file: !58, line: 73, baseType: !213, size: 320, offset: 320)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !58, line: 34, size: 320, elements: !214)
!214 = !{!215, !216, !217, !218, !219}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !213, file: !58, line: 35, baseType: !65, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !213, file: !58, line: 36, baseType: !51, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !213, file: !58, line: 37, baseType: !50, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !58, line: 38, baseType: !51, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !213, file: !58, line: 39, baseType: !127, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !53, file: !54, line: 37, baseType: !51, size: 32, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "epbase", scope: !53, file: !54, line: 38, baseType: !222, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !224, line: 81, size: 128, elements: !225)
!224 = !DIFile(filename: "./src/core/../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!225 = !{!226, !236}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !223, file: !224, line: 82, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !224, line: 70, size: 128, elements: !230)
!230 = !{!231, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !229, file: !224, line: 75, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !222}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !229, file: !224, line: 78, baseType: !232, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !223, file: !224, line: 83, baseType: !52, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !53, file: !54, line: 39, baseType: !238, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !240, line: 42, size: 2752, elements: !241)
!240 = !DIFile(filename: "./src/core/sock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "81758969b613e986f7c84ae94c8bce2a")
!241 = !{!242, !243, !244, !310, !327, !328, !329, !330, !331, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !239, file: !240, line: 45, baseType: !57, size: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !239, file: !240, line: 46, baseType: !51, size: 32, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !239, file: !240, line: 49, baseType: !245, size: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !247, line: 123, size: 128, elements: !248)
!247 = !DIFile(filename: "./src/core/../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!248 = !{!249, !309}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !246, file: !247, line: 124, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !247, line: 84, size: 704, elements: !253)
!253 = !{!254, !258, !259, !265, !269, !270, !271, !275, !295, !296, !304}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !252, file: !247, line: 87, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !245}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !252, file: !247, line: 90, baseType: !255, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !252, file: !247, line: 97, baseType: !260, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!51, !245, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !247, line: 56, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !252, file: !247, line: 98, baseType: !266, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !245, !263}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !252, file: !247, line: 99, baseType: !266, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !252, file: !247, line: 100, baseType: !266, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !252, file: !247, line: 104, baseType: !272, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!51, !245}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !252, file: !247, line: 108, baseType: !276, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!51, !245, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !281, line: 30, size: 512, elements: !282)
!281 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!282 = !{!283, !294}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !280, file: !281, line: 33, baseType: !284, size: 256)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !285, line: 39, size: 256, elements: !286)
!285 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !284, file: !285, line: 40, baseType: !288, size: 256)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 256, elements: !292)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !176, line: 24, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !178, line: 38, baseType: !291)
!291 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!292 = !{!293}
!293 = !DISubrange(count: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !280, file: !281, line: 36, baseType: !284, size: 256, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !252, file: !247, line: 112, baseType: !276, size: 64, offset: 512)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !252, file: !247, line: 115, baseType: !297, size: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!51, !245, !51, !51, !300, !302}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !303, line: 46, baseType: !179)
!303 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!304 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !252, file: !247, line: 119, baseType: !305, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!51, !245, !51, !51, !50, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !246, file: !247, line: 125, baseType: !238, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "socktype", scope: !239, file: !240, line: 52, baseType: !311, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !247, line: 160, size: 384, elements: !313)
!313 = !{!314, !315, !316, !317, !322, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !312, file: !247, line: 163, baseType: !51, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !312, file: !247, line: 164, baseType: !51, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !247, line: 167, baseType: !51, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !312, file: !247, line: 173, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!51, !50, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !312, file: !247, line: 179, baseType: !323, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!51, !51}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !312, file: !247, line: 183, baseType: !187, size: 128, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !239, file: !240, line: 54, baseType: !51, size: 32, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !239, file: !240, line: 56, baseType: !72, size: 704, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sndfd", scope: !239, file: !240, line: 57, baseType: !133, size: 64, offset: 1600)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rcvfd", scope: !239, file: !240, line: 58, baseType: !133, size: 64, offset: 1664)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "termsem", scope: !239, file: !240, line: 59, baseType: !332, size: 256, offset: 1728)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sem", file: !333, line: 64, size: 256, elements: !334)
!333 = !DIFile(filename: "src/aio/../utils/sem.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "925a3ae06fa6fbb251fb87fc0fbd3a0b")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !332, file: !333, line: 65, baseType: !336, size: 256)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !337, line: 39, baseType: !338)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "", checksumkind: CSK_MD5, checksum: "f0ec69aef73516c696d526041269f8fd")
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !337, line: 35, size: 256, elements: !339)
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !338, file: !337, line: 37, baseType: !341, size: 256)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !292)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !338, file: !337, line: 38, baseType: !110, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !239, file: !240, line: 63, baseType: !171, size: 128, offset: 1984)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !239, file: !240, line: 66, baseType: !182, size: 128, offset: 2112)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !239, file: !240, line: 69, baseType: !51, size: 32, offset: 2240)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "linger", scope: !239, file: !240, line: 72, baseType: !51, size: 32, offset: 2272)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sndbuf", scope: !239, file: !240, line: 73, baseType: !51, size: 32, offset: 2304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rcvbuf", scope: !239, file: !240, line: 74, baseType: !51, size: 32, offset: 2336)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sndtimeo", scope: !239, file: !240, line: 75, baseType: !51, size: 32, offset: 2368)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rcvtimeo", scope: !239, file: !240, line: 76, baseType: !51, size: 32, offset: 2400)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_ivl", scope: !239, file: !240, line: 77, baseType: !51, size: 32, offset: 2432)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_ivl_max", scope: !239, file: !240, line: 78, baseType: !51, size: 32, offset: 2464)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sndprio", scope: !239, file: !240, line: 79, baseType: !51, size: 32, offset: 2496)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4only", scope: !239, file: !240, line: 80, baseType: !51, size: 32, offset: 2528)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "optsets", scope: !239, file: !240, line: 83, baseType: !356, size: 192, offset: 2560)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 192, elements: !377)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset", file: !224, line: 56, size: 64, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !358, file: !224, line: 57, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset_vfptr", file: !224, line: 48, size: 192, elements: !364)
!364 = !{!365, !369, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !363, file: !224, line: 49, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !357}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !363, file: !224, line: 50, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!51, !357, !51, !300, !302}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !363, file: !224, line: 52, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!51, !357, !51, !50, !308}
!377 = !{!378}
!378 = !DISubrange(count: 3)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !53, file: !54, line: 40, baseType: !51, size: 32, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !53, file: !54, line: 41, baseType: !187, size: 128, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !53, file: !54, line: 42, baseType: !382, size: 1032, offset: 1024)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1032, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 129)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!387 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42}
!388 = !{i32 7, !"Dwarf Version", i32 5}
!389 = !{i32 2, !"Debug Info Version", i32 3}
!390 = !{i32 1, !"wchar_size", i32 4}
!391 = !{i32 8, !"PIC Level", i32 2}
!392 = !{i32 7, !"PIE Level", i32 2}
!393 = !{i32 7, !"uwtable", i32 2}
!394 = !{i32 7, !"frame-pointer", i32 2}
!395 = !{!"clang version 16.0.0"}
!396 = distinct !DISubprogram(name: "nn_sock_init", scope: !2, file: !2, line: 65, type: !397, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{!51, !238, !311}
!399 = !{}
!400 = !DILocalVariable(name: "self", arg: 1, scope: !396, file: !2, line: 65, type: !238)
!401 = !DILocation(line: 65, column: 35, scope: !396)
!402 = !DILocalVariable(name: "socktype", arg: 2, scope: !396, file: !2, line: 65, type: !311)
!403 = !DILocation(line: 65, column: 61, scope: !396)
!404 = !DILocalVariable(name: "rc", scope: !396, file: !2, line: 67, type: !51)
!405 = !DILocation(line: 67, column: 9, scope: !396)
!406 = !DILocalVariable(name: "i", scope: !396, file: !2, line: 68, type: !51)
!407 = !DILocation(line: 68, column: 9, scope: !396)
!408 = !DILocation(line: 71, column: 5, scope: !396)
!409 = !DILocation(line: 71, column: 5, scope: !410)
!410 = distinct !DILexicalBlock(scope: !411, file: !2, line: 71, column: 5)
!411 = distinct !DILexicalBlock(scope: !396, file: !2, line: 71, column: 5)
!412 = !DILocation(line: 71, column: 5, scope: !411)
!413 = !DILocation(line: 71, column: 5, scope: !414)
!414 = distinct !DILexicalBlock(scope: !410, file: !2, line: 71, column: 5)
!415 = !DILocation(line: 75, column: 19, scope: !396)
!416 = !DILocation(line: 75, column: 25, scope: !396)
!417 = !DILocation(line: 75, column: 30, scope: !396)
!418 = !DILocation(line: 75, column: 5, scope: !396)
!419 = !DILocation(line: 78, column: 24, scope: !396)
!420 = !DILocation(line: 78, column: 30, scope: !396)
!421 = !DILocation(line: 78, column: 53, scope: !396)
!422 = !DILocation(line: 78, column: 59, scope: !396)
!423 = !DILocation(line: 78, column: 5, scope: !396)
!424 = !DILocation(line: 79, column: 5, scope: !396)
!425 = !DILocation(line: 79, column: 11, scope: !396)
!426 = !DILocation(line: 79, column: 17, scope: !396)
!427 = !DILocation(line: 83, column: 9, scope: !428)
!428 = distinct !DILexicalBlock(scope: !396, file: !2, line: 83, column: 9)
!429 = !DILocation(line: 83, column: 19, scope: !428)
!430 = !DILocation(line: 83, column: 25, scope: !428)
!431 = !DILocation(line: 83, column: 9, scope: !396)
!432 = !DILocation(line: 84, column: 18, scope: !428)
!433 = !DILocation(line: 84, column: 24, scope: !428)
!434 = !DILocation(line: 84, column: 9, scope: !428)
!435 = !DILocation(line: 86, column: 28, scope: !436)
!436 = distinct !DILexicalBlock(scope: !428, file: !2, line: 85, column: 10)
!437 = !DILocation(line: 86, column: 34, scope: !436)
!438 = !DILocation(line: 86, column: 14, scope: !436)
!439 = !DILocation(line: 86, column: 12, scope: !436)
!440 = !DILocation(line: 87, column: 13, scope: !441)
!441 = distinct !DILexicalBlock(scope: !436, file: !2, line: 87, column: 13)
!442 = !DILocation(line: 87, column: 13, scope: !436)
!443 = !DILocation(line: 88, column: 20, scope: !441)
!444 = !DILocation(line: 88, column: 13, scope: !441)
!445 = !DILocation(line: 90, column: 9, scope: !446)
!446 = distinct !DILexicalBlock(scope: !396, file: !2, line: 90, column: 9)
!447 = !DILocation(line: 90, column: 19, scope: !446)
!448 = !DILocation(line: 90, column: 25, scope: !446)
!449 = !DILocation(line: 90, column: 9, scope: !396)
!450 = !DILocation(line: 91, column: 18, scope: !446)
!451 = !DILocation(line: 91, column: 24, scope: !446)
!452 = !DILocation(line: 91, column: 9, scope: !446)
!453 = !DILocation(line: 93, column: 28, scope: !454)
!454 = distinct !DILexicalBlock(scope: !446, file: !2, line: 92, column: 10)
!455 = !DILocation(line: 93, column: 34, scope: !454)
!456 = !DILocation(line: 93, column: 14, scope: !454)
!457 = !DILocation(line: 93, column: 12, scope: !454)
!458 = !DILocation(line: 94, column: 13, scope: !459)
!459 = distinct !DILexicalBlock(scope: !454, file: !2, line: 94, column: 13)
!460 = !DILocation(line: 94, column: 13, scope: !454)
!461 = !DILocation(line: 95, column: 19, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !2, line: 95, column: 17)
!463 = distinct !DILexicalBlock(scope: !459, file: !2, line: 94, column: 31)
!464 = !DILocation(line: 95, column: 29, scope: !462)
!465 = !DILocation(line: 95, column: 35, scope: !462)
!466 = !DILocation(line: 95, column: 17, scope: !463)
!467 = !DILocation(line: 96, column: 31, scope: !462)
!468 = !DILocation(line: 96, column: 37, scope: !462)
!469 = !DILocation(line: 96, column: 17, scope: !462)
!470 = !DILocation(line: 97, column: 20, scope: !463)
!471 = !DILocation(line: 97, column: 13, scope: !463)
!472 = !DILocation(line: 100, column: 19, scope: !396)
!473 = !DILocation(line: 100, column: 25, scope: !396)
!474 = !DILocation(line: 100, column: 5, scope: !396)
!475 = !DILocation(line: 101, column: 9, scope: !476)
!476 = distinct !DILexicalBlock(scope: !396, file: !2, line: 101, column: 9)
!477 = !DILocation(line: 101, column: 9, scope: !396)
!478 = !DILocation(line: 102, column: 15, scope: !479)
!479 = distinct !DILexicalBlock(scope: !480, file: !2, line: 102, column: 13)
!480 = distinct !DILexicalBlock(scope: !476, file: !2, line: 101, column: 27)
!481 = !DILocation(line: 102, column: 25, scope: !479)
!482 = !DILocation(line: 102, column: 31, scope: !479)
!483 = !DILocation(line: 102, column: 13, scope: !480)
!484 = !DILocation(line: 103, column: 27, scope: !479)
!485 = !DILocation(line: 103, column: 33, scope: !479)
!486 = !DILocation(line: 103, column: 13, scope: !479)
!487 = !DILocation(line: 104, column: 15, scope: !488)
!488 = distinct !DILexicalBlock(scope: !480, file: !2, line: 104, column: 13)
!489 = !DILocation(line: 104, column: 25, scope: !488)
!490 = !DILocation(line: 104, column: 31, scope: !488)
!491 = !DILocation(line: 104, column: 13, scope: !480)
!492 = !DILocation(line: 105, column: 27, scope: !488)
!493 = !DILocation(line: 105, column: 33, scope: !488)
!494 = !DILocation(line: 105, column: 13, scope: !488)
!495 = !DILocation(line: 106, column: 16, scope: !480)
!496 = !DILocation(line: 106, column: 9, scope: !480)
!497 = !DILocation(line: 109, column: 5, scope: !396)
!498 = !DILocation(line: 109, column: 11, scope: !396)
!499 = !DILocation(line: 109, column: 17, scope: !396)
!500 = !DILocation(line: 110, column: 21, scope: !396)
!501 = !DILocation(line: 110, column: 27, scope: !396)
!502 = !DILocation(line: 110, column: 5, scope: !396)
!503 = !DILocation(line: 111, column: 20, scope: !396)
!504 = !DILocation(line: 111, column: 26, scope: !396)
!505 = !DILocation(line: 111, column: 5, scope: !396)
!506 = !DILocation(line: 112, column: 5, scope: !396)
!507 = !DILocation(line: 112, column: 11, scope: !396)
!508 = !DILocation(line: 112, column: 15, scope: !396)
!509 = !DILocation(line: 115, column: 5, scope: !396)
!510 = !DILocation(line: 115, column: 11, scope: !396)
!511 = !DILocation(line: 115, column: 18, scope: !396)
!512 = !DILocation(line: 116, column: 5, scope: !396)
!513 = !DILocation(line: 116, column: 11, scope: !396)
!514 = !DILocation(line: 116, column: 18, scope: !396)
!515 = !DILocation(line: 117, column: 5, scope: !396)
!516 = !DILocation(line: 117, column: 11, scope: !396)
!517 = !DILocation(line: 117, column: 18, scope: !396)
!518 = !DILocation(line: 118, column: 5, scope: !396)
!519 = !DILocation(line: 118, column: 11, scope: !396)
!520 = !DILocation(line: 118, column: 20, scope: !396)
!521 = !DILocation(line: 119, column: 5, scope: !396)
!522 = !DILocation(line: 119, column: 11, scope: !396)
!523 = !DILocation(line: 119, column: 20, scope: !396)
!524 = !DILocation(line: 120, column: 5, scope: !396)
!525 = !DILocation(line: 120, column: 11, scope: !396)
!526 = !DILocation(line: 120, column: 25, scope: !396)
!527 = !DILocation(line: 121, column: 5, scope: !396)
!528 = !DILocation(line: 121, column: 11, scope: !396)
!529 = !DILocation(line: 121, column: 29, scope: !396)
!530 = !DILocation(line: 122, column: 5, scope: !396)
!531 = !DILocation(line: 122, column: 11, scope: !396)
!532 = !DILocation(line: 122, column: 19, scope: !396)
!533 = !DILocation(line: 123, column: 5, scope: !396)
!534 = !DILocation(line: 123, column: 11, scope: !396)
!535 = !DILocation(line: 123, column: 20, scope: !396)
!536 = !DILocation(line: 127, column: 12, scope: !537)
!537 = distinct !DILexicalBlock(scope: !396, file: !2, line: 127, column: 5)
!538 = !DILocation(line: 127, column: 10, scope: !537)
!539 = !DILocation(line: 127, column: 17, scope: !540)
!540 = distinct !DILexicalBlock(scope: !537, file: !2, line: 127, column: 5)
!541 = !DILocation(line: 127, column: 19, scope: !540)
!542 = !DILocation(line: 127, column: 5, scope: !537)
!543 = !DILocation(line: 128, column: 9, scope: !540)
!544 = !DILocation(line: 128, column: 15, scope: !540)
!545 = !DILocation(line: 128, column: 24, scope: !540)
!546 = !DILocation(line: 128, column: 27, scope: !540)
!547 = !DILocation(line: 127, column: 40, scope: !540)
!548 = !DILocation(line: 127, column: 5, scope: !540)
!549 = distinct !{!549, !542, !550, !551}
!550 = !DILocation(line: 128, column: 29, scope: !537)
!551 = !{!"llvm.loop.mustprogress"}
!552 = !DILocation(line: 131, column: 10, scope: !396)
!553 = !DILocation(line: 131, column: 20, scope: !396)
!554 = !DILocation(line: 131, column: 36, scope: !396)
!555 = !DILocation(line: 131, column: 43, scope: !396)
!556 = !DILocation(line: 131, column: 49, scope: !396)
!557 = !DILocation(line: 131, column: 8, scope: !396)
!558 = !DILocation(line: 132, column: 5, scope: !396)
!559 = !DILocation(line: 132, column: 5, scope: !560)
!560 = distinct !DILexicalBlock(scope: !561, file: !2, line: 132, column: 5)
!561 = distinct !DILexicalBlock(scope: !396, file: !2, line: 132, column: 5)
!562 = !DILocation(line: 132, column: 5, scope: !561)
!563 = !DILocation(line: 132, column: 5, scope: !564)
!564 = distinct !DILexicalBlock(scope: !560, file: !2, line: 132, column: 5)
!565 = !DILocation(line: 133, column: 22, scope: !396)
!566 = !DILocation(line: 133, column: 5, scope: !396)
!567 = !DILocation(line: 133, column: 11, scope: !396)
!568 = !DILocation(line: 133, column: 20, scope: !396)
!569 = !DILocation(line: 136, column: 20, scope: !396)
!570 = !DILocation(line: 136, column: 26, scope: !396)
!571 = !DILocation(line: 136, column: 5, scope: !396)
!572 = !DILocation(line: 137, column: 20, scope: !396)
!573 = !DILocation(line: 137, column: 26, scope: !396)
!574 = !DILocation(line: 137, column: 5, scope: !396)
!575 = !DILocation(line: 138, column: 20, scope: !396)
!576 = !DILocation(line: 138, column: 26, scope: !396)
!577 = !DILocation(line: 138, column: 5, scope: !396)
!578 = !DILocation(line: 140, column: 5, scope: !396)
!579 = !DILocation(line: 141, column: 1, scope: !396)
!580 = distinct !DISubprogram(name: "nn_sock_onleave", scope: !2, file: !2, line: 634, type: !210, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !399)
!581 = !DILocalVariable(name: "self", arg: 1, scope: !580, file: !2, line: 634, type: !71)
!582 = !DILocation(line: 634, column: 45, scope: !580)
!583 = !DILocalVariable(name: "sock", scope: !580, file: !2, line: 636, type: !238)
!584 = !DILocation(line: 636, column: 21, scope: !580)
!585 = !DILocalVariable(name: "events", scope: !580, file: !2, line: 637, type: !51)
!586 = !DILocation(line: 637, column: 9, scope: !580)
!587 = !DILocation(line: 639, column: 12, scope: !580)
!588 = !DILocation(line: 639, column: 10, scope: !580)
!589 = !DILocation(line: 643, column: 9, scope: !590)
!590 = distinct !DILexicalBlock(scope: !580, file: !2, line: 643, column: 9)
!591 = !DILocation(line: 643, column: 9, scope: !580)
!592 = !DILocation(line: 644, column: 9, scope: !590)
!593 = !DILocation(line: 647, column: 14, scope: !580)
!594 = !DILocation(line: 647, column: 20, scope: !580)
!595 = !DILocation(line: 647, column: 30, scope: !580)
!596 = !DILocation(line: 647, column: 37, scope: !580)
!597 = !DILocation(line: 647, column: 45, scope: !580)
!598 = !DILocation(line: 647, column: 51, scope: !580)
!599 = !DILocation(line: 647, column: 12, scope: !580)
!600 = !DILocation(line: 648, column: 5, scope: !580)
!601 = !DILocation(line: 648, column: 5, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !2, line: 648, column: 5)
!603 = distinct !DILexicalBlock(scope: !580, file: !2, line: 648, column: 5)
!604 = !DILocation(line: 648, column: 5, scope: !603)
!605 = !DILocation(line: 648, column: 5, scope: !606)
!606 = distinct !DILexicalBlock(scope: !602, file: !2, line: 648, column: 5)
!607 = !DILocation(line: 651, column: 11, scope: !608)
!608 = distinct !DILexicalBlock(scope: !580, file: !2, line: 651, column: 9)
!609 = !DILocation(line: 651, column: 17, scope: !608)
!610 = !DILocation(line: 651, column: 27, scope: !608)
!611 = !DILocation(line: 651, column: 33, scope: !608)
!612 = !DILocation(line: 651, column: 9, scope: !580)
!613 = !DILocation(line: 652, column: 13, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !2, line: 652, column: 13)
!615 = distinct !DILexicalBlock(scope: !608, file: !2, line: 651, column: 61)
!616 = !DILocation(line: 652, column: 20, scope: !614)
!617 = !DILocation(line: 652, column: 13, scope: !615)
!618 = !DILocation(line: 653, column: 19, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !2, line: 653, column: 17)
!620 = distinct !DILexicalBlock(scope: !614, file: !2, line: 652, column: 44)
!621 = !DILocation(line: 653, column: 25, scope: !619)
!622 = !DILocation(line: 653, column: 31, scope: !619)
!623 = !DILocation(line: 653, column: 17, scope: !620)
!624 = !DILocation(line: 654, column: 17, scope: !625)
!625 = distinct !DILexicalBlock(scope: !619, file: !2, line: 653, column: 51)
!626 = !DILocation(line: 654, column: 23, scope: !625)
!627 = !DILocation(line: 654, column: 29, scope: !625)
!628 = !DILocation(line: 655, column: 33, scope: !625)
!629 = !DILocation(line: 655, column: 39, scope: !625)
!630 = !DILocation(line: 655, column: 17, scope: !625)
!631 = !DILocation(line: 656, column: 13, scope: !625)
!632 = !DILocation(line: 657, column: 9, scope: !620)
!633 = !DILocation(line: 659, column: 17, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !2, line: 659, column: 17)
!635 = distinct !DILexicalBlock(scope: !614, file: !2, line: 658, column: 14)
!636 = !DILocation(line: 659, column: 23, scope: !634)
!637 = !DILocation(line: 659, column: 29, scope: !634)
!638 = !DILocation(line: 659, column: 17, scope: !635)
!639 = !DILocation(line: 660, column: 17, scope: !640)
!640 = distinct !DILexicalBlock(scope: !634, file: !2, line: 659, column: 48)
!641 = !DILocation(line: 660, column: 23, scope: !640)
!642 = !DILocation(line: 660, column: 29, scope: !640)
!643 = !DILocation(line: 661, column: 35, scope: !640)
!644 = !DILocation(line: 661, column: 41, scope: !640)
!645 = !DILocation(line: 661, column: 17, scope: !640)
!646 = !DILocation(line: 662, column: 13, scope: !640)
!647 = !DILocation(line: 664, column: 5, scope: !615)
!648 = !DILocation(line: 667, column: 11, scope: !649)
!649 = distinct !DILexicalBlock(scope: !580, file: !2, line: 667, column: 9)
!650 = !DILocation(line: 667, column: 17, scope: !649)
!651 = !DILocation(line: 667, column: 27, scope: !649)
!652 = !DILocation(line: 667, column: 33, scope: !649)
!653 = !DILocation(line: 667, column: 9, scope: !580)
!654 = !DILocation(line: 668, column: 13, scope: !655)
!655 = distinct !DILexicalBlock(scope: !656, file: !2, line: 668, column: 13)
!656 = distinct !DILexicalBlock(scope: !649, file: !2, line: 667, column: 61)
!657 = !DILocation(line: 668, column: 20, scope: !655)
!658 = !DILocation(line: 668, column: 13, scope: !656)
!659 = !DILocation(line: 669, column: 19, scope: !660)
!660 = distinct !DILexicalBlock(scope: !661, file: !2, line: 669, column: 17)
!661 = distinct !DILexicalBlock(scope: !655, file: !2, line: 668, column: 45)
!662 = !DILocation(line: 669, column: 25, scope: !660)
!663 = !DILocation(line: 669, column: 31, scope: !660)
!664 = !DILocation(line: 669, column: 17, scope: !661)
!665 = !DILocation(line: 670, column: 17, scope: !666)
!666 = distinct !DILexicalBlock(scope: !660, file: !2, line: 669, column: 52)
!667 = !DILocation(line: 670, column: 23, scope: !666)
!668 = !DILocation(line: 670, column: 29, scope: !666)
!669 = !DILocation(line: 671, column: 33, scope: !666)
!670 = !DILocation(line: 671, column: 39, scope: !666)
!671 = !DILocation(line: 671, column: 17, scope: !666)
!672 = !DILocation(line: 672, column: 13, scope: !666)
!673 = !DILocation(line: 673, column: 9, scope: !661)
!674 = !DILocation(line: 675, column: 17, scope: !675)
!675 = distinct !DILexicalBlock(scope: !676, file: !2, line: 675, column: 17)
!676 = distinct !DILexicalBlock(scope: !655, file: !2, line: 674, column: 14)
!677 = !DILocation(line: 675, column: 23, scope: !675)
!678 = !DILocation(line: 675, column: 29, scope: !675)
!679 = !DILocation(line: 675, column: 17, scope: !676)
!680 = !DILocation(line: 676, column: 17, scope: !681)
!681 = distinct !DILexicalBlock(scope: !675, file: !2, line: 675, column: 49)
!682 = !DILocation(line: 676, column: 23, scope: !681)
!683 = !DILocation(line: 676, column: 29, scope: !681)
!684 = !DILocation(line: 677, column: 35, scope: !681)
!685 = !DILocation(line: 677, column: 41, scope: !681)
!686 = !DILocation(line: 677, column: 17, scope: !681)
!687 = !DILocation(line: 678, column: 13, scope: !681)
!688 = !DILocation(line: 680, column: 5, scope: !656)
!689 = !DILocation(line: 681, column: 1, scope: !580)
!690 = distinct !DISubprogram(name: "nn_sock_handler", scope: !2, file: !2, line: 710, type: !63, scopeLine: 712, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !399)
!691 = !DILocalVariable(name: "self", arg: 1, scope: !690, file: !2, line: 710, type: !65)
!692 = !DILocation(line: 710, column: 45, scope: !690)
!693 = !DILocalVariable(name: "src", arg: 2, scope: !690, file: !2, line: 710, type: !51)
!694 = !DILocation(line: 710, column: 55, scope: !690)
!695 = !DILocalVariable(name: "type", arg: 3, scope: !690, file: !2, line: 710, type: !51)
!696 = !DILocation(line: 710, column: 64, scope: !690)
!697 = !DILocalVariable(name: "srcptr", arg: 4, scope: !690, file: !2, line: 711, type: !50)
!698 = !DILocation(line: 711, column: 11, scope: !690)
!699 = !DILocalVariable(name: "sock", scope: !690, file: !2, line: 713, type: !238)
!700 = !DILocation(line: 713, column: 21, scope: !690)
!701 = !DILocalVariable(name: "it", scope: !690, file: !2, line: 714, type: !186)
!702 = !DILocation(line: 714, column: 26, scope: !690)
!703 = !DILocalVariable(name: "ep", scope: !690, file: !2, line: 715, type: !52)
!704 = !DILocation(line: 715, column: 19, scope: !690)
!705 = !DILocation(line: 717, column: 12, scope: !690)
!706 = !DILocation(line: 717, column: 10, scope: !690)
!707 = !DILocation(line: 722, column: 9, scope: !708)
!708 = distinct !DILexicalBlock(scope: !690, file: !2, line: 722, column: 9)
!709 = !DILocation(line: 0, scope: !708)
!710 = !DILocation(line: 722, column: 9, scope: !690)
!711 = !DILocation(line: 723, column: 9, scope: !712)
!712 = distinct !DILexicalBlock(scope: !708, file: !2, line: 722, column: 64)
!713 = !DILocation(line: 723, column: 9, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !2, line: 723, column: 9)
!715 = distinct !DILexicalBlock(scope: !712, file: !2, line: 723, column: 9)
!716 = !DILocation(line: 723, column: 9, scope: !715)
!717 = !DILocation(line: 723, column: 9, scope: !718)
!718 = distinct !DILexicalBlock(scope: !714, file: !2, line: 723, column: 9)
!719 = !DILocation(line: 728, column: 15, scope: !720)
!720 = distinct !DILexicalBlock(scope: !712, file: !2, line: 728, column: 13)
!721 = !DILocation(line: 728, column: 21, scope: !720)
!722 = !DILocation(line: 728, column: 31, scope: !720)
!723 = !DILocation(line: 728, column: 37, scope: !720)
!724 = !DILocation(line: 728, column: 13, scope: !712)
!725 = !DILocation(line: 729, column: 27, scope: !726)
!726 = distinct !DILexicalBlock(scope: !720, file: !2, line: 728, column: 65)
!727 = !DILocation(line: 729, column: 33, scope: !726)
!728 = !DILocation(line: 729, column: 13, scope: !726)
!729 = !DILocation(line: 730, column: 22, scope: !726)
!730 = !DILocation(line: 730, column: 28, scope: !726)
!731 = !DILocation(line: 730, column: 13, scope: !726)
!732 = !DILocation(line: 731, column: 9, scope: !726)
!733 = !DILocation(line: 732, column: 15, scope: !734)
!734 = distinct !DILexicalBlock(scope: !712, file: !2, line: 732, column: 13)
!735 = !DILocation(line: 732, column: 21, scope: !734)
!736 = !DILocation(line: 732, column: 31, scope: !734)
!737 = !DILocation(line: 732, column: 37, scope: !734)
!738 = !DILocation(line: 732, column: 13, scope: !712)
!739 = !DILocation(line: 733, column: 27, scope: !740)
!740 = distinct !DILexicalBlock(scope: !734, file: !2, line: 732, column: 65)
!741 = !DILocation(line: 733, column: 33, scope: !740)
!742 = !DILocation(line: 733, column: 13, scope: !740)
!743 = !DILocation(line: 734, column: 22, scope: !740)
!744 = !DILocation(line: 734, column: 28, scope: !740)
!745 = !DILocation(line: 734, column: 13, scope: !740)
!746 = !DILocation(line: 735, column: 9, scope: !740)
!747 = !DILocation(line: 738, column: 35, scope: !748)
!748 = distinct !DILexicalBlock(scope: !712, file: !2, line: 738, column: 9)
!749 = !DILocation(line: 738, column: 41, scope: !748)
!750 = !DILocation(line: 738, column: 19, scope: !748)
!751 = !DILocation(line: 738, column: 17, scope: !748)
!752 = !DILocation(line: 738, column: 14, scope: !748)
!753 = !DILocation(line: 739, column: 15, scope: !754)
!754 = distinct !DILexicalBlock(scope: !748, file: !2, line: 738, column: 9)
!755 = !DILocation(line: 739, column: 35, scope: !754)
!756 = !DILocation(line: 739, column: 41, scope: !754)
!757 = !DILocation(line: 739, column: 21, scope: !754)
!758 = !DILocation(line: 739, column: 18, scope: !754)
!759 = !DILocation(line: 738, column: 9, scope: !748)
!760 = !DILocation(line: 741, column: 25, scope: !754)
!761 = !DILocation(line: 741, column: 13, scope: !754)
!762 = !DILocation(line: 740, column: 35, scope: !754)
!763 = !DILocation(line: 740, column: 41, scope: !754)
!764 = !DILocation(line: 740, column: 46, scope: !754)
!765 = !DILocation(line: 740, column: 20, scope: !754)
!766 = !DILocation(line: 740, column: 18, scope: !754)
!767 = !DILocation(line: 738, column: 9, scope: !754)
!768 = distinct !{!768, !759, !769, !551}
!769 = !DILocation(line: 741, column: 57, scope: !748)
!770 = !DILocation(line: 742, column: 9, scope: !712)
!771 = !DILocation(line: 742, column: 15, scope: !712)
!772 = !DILocation(line: 742, column: 21, scope: !712)
!773 = !DILocation(line: 743, column: 9, scope: !712)
!774 = !DILocation(line: 745, column: 9, scope: !775)
!775 = distinct !DILexicalBlock(scope: !690, file: !2, line: 745, column: 9)
!776 = !DILocation(line: 745, column: 9, scope: !690)
!777 = !DILocation(line: 751, column: 9, scope: !778)
!778 = distinct !DILexicalBlock(scope: !775, file: !2, line: 745, column: 62)
!779 = !DILocation(line: 751, column: 9, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !2, line: 751, column: 9)
!781 = distinct !DILexicalBlock(scope: !778, file: !2, line: 751, column: 9)
!782 = !DILocation(line: 751, column: 9, scope: !781)
!783 = !DILocation(line: 751, column: 9, scope: !784)
!784 = distinct !DILexicalBlock(scope: !780, file: !2, line: 751, column: 9)
!785 = !DILocation(line: 754, column: 30, scope: !778)
!786 = !DILocation(line: 754, column: 12, scope: !778)
!787 = !DILocation(line: 755, column: 25, scope: !778)
!788 = !DILocation(line: 755, column: 31, scope: !778)
!789 = !DILocation(line: 755, column: 37, scope: !778)
!790 = !DILocation(line: 755, column: 41, scope: !778)
!791 = !DILocation(line: 755, column: 9, scope: !778)
!792 = !DILocation(line: 756, column: 21, scope: !778)
!793 = !DILocation(line: 756, column: 9, scope: !778)
!794 = !DILocation(line: 757, column: 18, scope: !778)
!795 = !DILocation(line: 757, column: 9, scope: !778)
!796 = !DILabel(scope: !778, name: "finish2", file: !2, line: 759)
!797 = !DILocation(line: 759, column: 1, scope: !778)
!798 = !DILocation(line: 763, column: 30, scope: !799)
!799 = distinct !DILexicalBlock(scope: !778, file: !2, line: 763, column: 13)
!800 = !DILocation(line: 763, column: 36, scope: !799)
!801 = !DILocation(line: 763, column: 14, scope: !799)
!802 = !DILocation(line: 763, column: 13, scope: !778)
!803 = !DILocation(line: 764, column: 13, scope: !799)
!804 = !DILocation(line: 765, column: 9, scope: !778)
!805 = !DILocation(line: 765, column: 15, scope: !778)
!806 = !DILocation(line: 765, column: 21, scope: !778)
!807 = !DILocation(line: 766, column: 14, scope: !808)
!808 = distinct !DILexicalBlock(scope: !778, file: !2, line: 766, column: 13)
!809 = !DILocation(line: 766, column: 20, scope: !808)
!810 = !DILocation(line: 766, column: 30, scope: !808)
!811 = !DILocation(line: 766, column: 37, scope: !808)
!812 = !DILocation(line: 766, column: 13, scope: !778)
!813 = !DILocation(line: 767, column: 13, scope: !808)
!814 = !DILocation(line: 768, column: 9, scope: !778)
!815 = !DILocation(line: 768, column: 15, scope: !778)
!816 = !DILocation(line: 768, column: 25, scope: !778)
!817 = !DILocation(line: 768, column: 32, scope: !778)
!818 = !DILocation(line: 768, column: 38, scope: !778)
!819 = !DILocation(line: 768, column: 44, scope: !778)
!820 = !DILocation(line: 769, column: 9, scope: !778)
!821 = !DILocation(line: 771, column: 9, scope: !822)
!822 = distinct !DILexicalBlock(scope: !690, file: !2, line: 771, column: 9)
!823 = !DILocation(line: 771, column: 9, scope: !690)
!824 = !DILocation(line: 775, column: 9, scope: !825)
!825 = distinct !DILexicalBlock(scope: !822, file: !2, line: 771, column: 58)
!826 = !DILocation(line: 775, column: 9, scope: !827)
!827 = distinct !DILexicalBlock(scope: !828, file: !2, line: 775, column: 9)
!828 = distinct !DILexicalBlock(scope: !825, file: !2, line: 775, column: 9)
!829 = !DILocation(line: 0, scope: !827)
!830 = !DILocation(line: 775, column: 9, scope: !828)
!831 = !DILocation(line: 775, column: 9, scope: !832)
!832 = distinct !DILexicalBlock(scope: !827, file: !2, line: 775, column: 9)
!833 = !DILabel(scope: !825, name: "finish1", file: !2, line: 777)
!834 = !DILocation(line: 777, column: 1, scope: !825)
!835 = !DILocation(line: 780, column: 9, scope: !825)
!836 = !DILocation(line: 780, column: 15, scope: !825)
!837 = !DILocation(line: 780, column: 25, scope: !825)
!838 = !DILocation(line: 780, column: 32, scope: !825)
!839 = !DILocation(line: 780, column: 41, scope: !825)
!840 = !DILocation(line: 780, column: 47, scope: !825)
!841 = !DILocation(line: 781, column: 9, scope: !825)
!842 = !DILocation(line: 781, column: 15, scope: !825)
!843 = !DILocation(line: 781, column: 21, scope: !825)
!844 = !DILocation(line: 785, column: 23, scope: !825)
!845 = !DILocation(line: 785, column: 29, scope: !825)
!846 = !DILocation(line: 785, column: 9, scope: !825)
!847 = !DILocation(line: 787, column: 9, scope: !825)
!848 = !DILocation(line: 790, column: 13, scope: !690)
!849 = !DILocation(line: 790, column: 19, scope: !690)
!850 = !DILocation(line: 790, column: 5, scope: !690)
!851 = !DILocation(line: 796, column: 17, scope: !852)
!852 = distinct !DILexicalBlock(scope: !690, file: !2, line: 790, column: 26)
!853 = !DILocation(line: 796, column: 9, scope: !852)
!854 = !DILocation(line: 799, column: 21, scope: !855)
!855 = distinct !DILexicalBlock(scope: !852, file: !2, line: 796, column: 22)
!856 = !DILocation(line: 799, column: 13, scope: !855)
!857 = !DILocation(line: 801, column: 17, scope: !858)
!858 = distinct !DILexicalBlock(scope: !855, file: !2, line: 799, column: 27)
!859 = !DILocation(line: 801, column: 23, scope: !858)
!860 = !DILocation(line: 801, column: 29, scope: !858)
!861 = !DILocation(line: 802, column: 17, scope: !858)
!862 = !DILocation(line: 804, column: 41, scope: !858)
!863 = !DILocation(line: 804, column: 17, scope: !858)
!864 = !DILocation(line: 805, column: 17, scope: !858)
!865 = !DILocation(line: 807, column: 17, scope: !858)
!866 = !DILocation(line: 807, column: 17, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !2, line: 807, column: 17)
!868 = distinct !DILexicalBlock(scope: !869, file: !2, line: 807, column: 17)
!869 = distinct !DILexicalBlock(scope: !858, file: !2, line: 807, column: 17)
!870 = !DILocation(line: 808, column: 13, scope: !858)
!871 = !DILocation(line: 811, column: 13, scope: !855)
!872 = !DILocation(line: 811, column: 13, scope: !873)
!873 = distinct !DILexicalBlock(scope: !874, file: !2, line: 811, column: 13)
!874 = distinct !DILexicalBlock(scope: !875, file: !2, line: 811, column: 13)
!875 = distinct !DILexicalBlock(scope: !855, file: !2, line: 811, column: 13)
!876 = !DILocation(line: 812, column: 9, scope: !855)
!877 = !DILocation(line: 818, column: 17, scope: !852)
!878 = !DILocation(line: 818, column: 9, scope: !852)
!879 = !DILocation(line: 821, column: 21, scope: !880)
!880 = distinct !DILexicalBlock(scope: !852, file: !2, line: 818, column: 22)
!881 = !DILocation(line: 821, column: 13, scope: !880)
!882 = !DILocation(line: 823, column: 41, scope: !883)
!883 = distinct !DILexicalBlock(scope: !880, file: !2, line: 821, column: 27)
!884 = !DILocation(line: 823, column: 17, scope: !883)
!885 = !DILocation(line: 824, column: 17, scope: !883)
!886 = !DILocation(line: 826, column: 17, scope: !883)
!887 = !DILocation(line: 826, column: 17, scope: !888)
!888 = distinct !DILexicalBlock(scope: !889, file: !2, line: 826, column: 17)
!889 = distinct !DILexicalBlock(scope: !890, file: !2, line: 826, column: 17)
!890 = distinct !DILexicalBlock(scope: !883, file: !2, line: 826, column: 17)
!891 = !DILocation(line: 827, column: 13, scope: !883)
!892 = !DILocation(line: 832, column: 21, scope: !880)
!893 = !DILocation(line: 832, column: 13, scope: !880)
!894 = !DILocation(line: 834, column: 17, scope: !895)
!895 = distinct !DILexicalBlock(scope: !880, file: !2, line: 832, column: 27)
!896 = !DILocation(line: 834, column: 23, scope: !895)
!897 = !DILocation(line: 834, column: 33, scope: !895)
!898 = !DILocation(line: 834, column: 40, scope: !895)
!899 = !DILocation(line: 834, column: 44, scope: !895)
!900 = !DILocation(line: 834, column: 50, scope: !895)
!901 = !DILocation(line: 835, column: 39, scope: !895)
!902 = !DILocation(line: 836, column: 17, scope: !895)
!903 = !DILocation(line: 838, column: 17, scope: !895)
!904 = !DILocation(line: 838, column: 23, scope: !895)
!905 = !DILocation(line: 838, column: 33, scope: !895)
!906 = !DILocation(line: 838, column: 40, scope: !895)
!907 = !DILocation(line: 838, column: 45, scope: !895)
!908 = !DILocation(line: 838, column: 51, scope: !895)
!909 = !DILocation(line: 839, column: 39, scope: !895)
!910 = !DILocation(line: 840, column: 17, scope: !895)
!911 = !DILocation(line: 842, column: 17, scope: !895)
!912 = !DILocation(line: 842, column: 17, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !2, line: 842, column: 17)
!914 = distinct !DILexicalBlock(scope: !915, file: !2, line: 842, column: 17)
!915 = distinct !DILexicalBlock(scope: !895, file: !2, line: 842, column: 17)
!916 = !DILocation(line: 843, column: 13, scope: !895)
!917 = !DILocation(line: 844, column: 9, scope: !880)
!918 = !DILocation(line: 850, column: 9, scope: !852)
!919 = !DILocation(line: 850, column: 9, scope: !920)
!920 = distinct !DILexicalBlock(scope: !921, file: !2, line: 850, column: 9)
!921 = distinct !DILexicalBlock(scope: !922, file: !2, line: 850, column: 9)
!922 = distinct !DILexicalBlock(scope: !852, file: !2, line: 850, column: 9)
!923 = !DILocation(line: 850, column: 9, scope: !922)
!924 = !DILocation(line: 856, column: 9, scope: !852)
!925 = !DILocation(line: 856, column: 9, scope: !926)
!926 = distinct !DILexicalBlock(scope: !927, file: !2, line: 856, column: 9)
!927 = distinct !DILexicalBlock(scope: !928, file: !2, line: 856, column: 9)
!928 = distinct !DILexicalBlock(scope: !852, file: !2, line: 856, column: 9)
!929 = !DILocation(line: 857, column: 5, scope: !852)
!930 = !DILocation(line: 858, column: 1, scope: !690)
!931 = distinct !DISubprogram(name: "nn_sock_stopped", scope: !2, file: !2, line: 143, type: !932, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !238}
!934 = !DILocalVariable(name: "self", arg: 1, scope: !931, file: !2, line: 143, type: !238)
!935 = !DILocation(line: 143, column: 39, scope: !931)
!936 = !DILocation(line: 146, column: 30, scope: !931)
!937 = !DILocation(line: 146, column: 36, scope: !931)
!938 = !DILocation(line: 146, column: 5, scope: !931)
!939 = !DILocation(line: 146, column: 11, scope: !931)
!940 = !DILocation(line: 146, column: 15, scope: !931)
!941 = !DILocation(line: 146, column: 23, scope: !931)
!942 = !DILocation(line: 146, column: 27, scope: !931)
!943 = !DILocation(line: 147, column: 5, scope: !931)
!944 = !DILocation(line: 147, column: 11, scope: !931)
!945 = !DILocation(line: 147, column: 15, scope: !931)
!946 = !DILocation(line: 147, column: 23, scope: !931)
!947 = !DILocation(line: 147, column: 27, scope: !931)
!948 = !DILocation(line: 148, column: 5, scope: !931)
!949 = !DILocation(line: 148, column: 11, scope: !931)
!950 = !DILocation(line: 148, column: 15, scope: !931)
!951 = !DILocation(line: 148, column: 23, scope: !931)
!952 = !DILocation(line: 148, column: 30, scope: !931)
!953 = !DILocation(line: 149, column: 5, scope: !931)
!954 = !DILocation(line: 149, column: 11, scope: !931)
!955 = !DILocation(line: 149, column: 15, scope: !931)
!956 = !DILocation(line: 149, column: 23, scope: !931)
!957 = !DILocation(line: 149, column: 28, scope: !931)
!958 = !DILocation(line: 150, column: 19, scope: !931)
!959 = !DILocation(line: 150, column: 25, scope: !931)
!960 = !DILocation(line: 150, column: 29, scope: !931)
!961 = !DILocation(line: 150, column: 35, scope: !931)
!962 = !DILocation(line: 150, column: 41, scope: !931)
!963 = !DILocation(line: 150, column: 45, scope: !931)
!964 = !DILocation(line: 150, column: 5, scope: !931)
!965 = !DILocation(line: 151, column: 1, scope: !931)
!966 = distinct !DISubprogram(name: "nn_sock_zombify", scope: !2, file: !2, line: 153, type: !932, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!967 = !DILocalVariable(name: "self", arg: 1, scope: !966, file: !2, line: 153, type: !238)
!968 = !DILocation(line: 153, column: 39, scope: !966)
!969 = !DILocation(line: 155, column: 20, scope: !966)
!970 = !DILocation(line: 155, column: 26, scope: !966)
!971 = !DILocation(line: 155, column: 5, scope: !966)
!972 = !DILocation(line: 156, column: 21, scope: !966)
!973 = !DILocation(line: 156, column: 27, scope: !966)
!974 = !DILocation(line: 156, column: 5, scope: !966)
!975 = !DILocation(line: 157, column: 20, scope: !966)
!976 = !DILocation(line: 157, column: 26, scope: !966)
!977 = !DILocation(line: 157, column: 5, scope: !966)
!978 = !DILocation(line: 158, column: 1, scope: !966)
!979 = distinct !DISubprogram(name: "nn_sock_term", scope: !2, file: !2, line: 160, type: !980, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!980 = !DISubroutineType(types: !981)
!981 = !{!51, !238}
!982 = !DILocalVariable(name: "self", arg: 1, scope: !979, file: !2, line: 160, type: !238)
!983 = !DILocation(line: 160, column: 35, scope: !979)
!984 = !DILocalVariable(name: "rc", scope: !979, file: !2, line: 162, type: !51)
!985 = !DILocation(line: 162, column: 9, scope: !979)
!986 = !DILocalVariable(name: "i", scope: !979, file: !2, line: 163, type: !51)
!987 = !DILocation(line: 163, column: 9, scope: !979)
!988 = !DILocation(line: 166, column: 20, scope: !979)
!989 = !DILocation(line: 166, column: 26, scope: !979)
!990 = !DILocation(line: 166, column: 5, scope: !979)
!991 = !DILocation(line: 167, column: 19, scope: !979)
!992 = !DILocation(line: 167, column: 25, scope: !979)
!993 = !DILocation(line: 167, column: 5, scope: !979)
!994 = !DILocation(line: 168, column: 20, scope: !979)
!995 = !DILocation(line: 168, column: 26, scope: !979)
!996 = !DILocation(line: 168, column: 5, scope: !979)
!997 = !DILocation(line: 172, column: 24, scope: !979)
!998 = !DILocation(line: 172, column: 30, scope: !979)
!999 = !DILocation(line: 172, column: 10, scope: !979)
!1000 = !DILocation(line: 172, column: 8, scope: !979)
!1001 = !DILocation(line: 173, column: 9, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !979, file: !2, line: 173, column: 9)
!1003 = !DILocation(line: 173, column: 9, scope: !979)
!1004 = !DILocation(line: 174, column: 9, scope: !1002)
!1005 = !DILocation(line: 175, column: 5, scope: !979)
!1006 = !DILocation(line: 175, column: 5, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 175, column: 5)
!1008 = distinct !DILexicalBlock(scope: !979, file: !2, line: 175, column: 5)
!1009 = !DILocation(line: 175, column: 5, scope: !1008)
!1010 = !DILocation(line: 175, column: 5, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 175, column: 5)
!1012 = !DILocation(line: 181, column: 20, scope: !979)
!1013 = !DILocation(line: 181, column: 26, scope: !979)
!1014 = !DILocation(line: 181, column: 5, scope: !979)
!1015 = !DILocation(line: 182, column: 20, scope: !979)
!1016 = !DILocation(line: 182, column: 26, scope: !979)
!1017 = !DILocation(line: 182, column: 5, scope: !979)
!1018 = !DILocation(line: 185, column: 30, scope: !979)
!1019 = !DILocation(line: 185, column: 36, scope: !979)
!1020 = !DILocation(line: 185, column: 5, scope: !979)
!1021 = !DILocation(line: 186, column: 19, scope: !979)
!1022 = !DILocation(line: 186, column: 25, scope: !979)
!1023 = !DILocation(line: 186, column: 5, scope: !979)
!1024 = !DILocation(line: 187, column: 19, scope: !979)
!1025 = !DILocation(line: 187, column: 25, scope: !979)
!1026 = !DILocation(line: 187, column: 5, scope: !979)
!1027 = !DILocation(line: 188, column: 20, scope: !979)
!1028 = !DILocation(line: 188, column: 26, scope: !979)
!1029 = !DILocation(line: 188, column: 5, scope: !979)
!1030 = !DILocation(line: 189, column: 21, scope: !979)
!1031 = !DILocation(line: 189, column: 27, scope: !979)
!1032 = !DILocation(line: 189, column: 5, scope: !979)
!1033 = !DILocation(line: 190, column: 19, scope: !979)
!1034 = !DILocation(line: 190, column: 25, scope: !979)
!1035 = !DILocation(line: 190, column: 5, scope: !979)
!1036 = !DILocation(line: 193, column: 12, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !979, file: !2, line: 193, column: 5)
!1038 = !DILocation(line: 193, column: 10, scope: !1037)
!1039 = !DILocation(line: 193, column: 17, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 193, column: 5)
!1041 = !DILocation(line: 193, column: 19, scope: !1040)
!1042 = !DILocation(line: 193, column: 5, scope: !1037)
!1043 = !DILocation(line: 194, column: 13, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 194, column: 13)
!1045 = !DILocation(line: 194, column: 19, scope: !1044)
!1046 = !DILocation(line: 194, column: 28, scope: !1044)
!1047 = !DILocation(line: 194, column: 13, scope: !1040)
!1048 = !DILocation(line: 195, column: 13, scope: !1044)
!1049 = !DILocation(line: 195, column: 19, scope: !1044)
!1050 = !DILocation(line: 195, column: 28, scope: !1044)
!1051 = !DILocation(line: 195, column: 32, scope: !1044)
!1052 = !DILocation(line: 195, column: 39, scope: !1044)
!1053 = !DILocation(line: 195, column: 48, scope: !1044)
!1054 = !DILocation(line: 195, column: 54, scope: !1044)
!1055 = !DILocation(line: 195, column: 63, scope: !1044)
!1056 = !DILocation(line: 194, column: 29, scope: !1044)
!1057 = !DILocation(line: 193, column: 40, scope: !1040)
!1058 = !DILocation(line: 193, column: 5, scope: !1040)
!1059 = distinct !{!1059, !1042, !1060, !551}
!1060 = !DILocation(line: 195, column: 65, scope: !1037)
!1061 = !DILocation(line: 197, column: 5, scope: !979)
!1062 = !DILocation(line: 198, column: 1, scope: !979)
!1063 = distinct !DISubprogram(name: "nn_sock_getctx", scope: !2, file: !2, line: 200, type: !1064, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!71, !238}
!1066 = !DILocalVariable(name: "self", arg: 1, scope: !1063, file: !2, line: 200, type: !238)
!1067 = !DILocation(line: 200, column: 48, scope: !1063)
!1068 = !DILocation(line: 202, column: 13, scope: !1063)
!1069 = !DILocation(line: 202, column: 19, scope: !1063)
!1070 = !DILocation(line: 202, column: 5, scope: !1063)
!1071 = distinct !DISubprogram(name: "nn_sock_ispeer", scope: !2, file: !2, line: 205, type: !1072, scopeLine: 206, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!51, !238, !51}
!1074 = !DILocalVariable(name: "self", arg: 1, scope: !1071, file: !2, line: 205, type: !238)
!1075 = !DILocation(line: 205, column: 37, scope: !1071)
!1076 = !DILocalVariable(name: "socktype", arg: 2, scope: !1071, file: !2, line: 205, type: !51)
!1077 = !DILocation(line: 205, column: 47, scope: !1071)
!1078 = !DILocation(line: 211, column: 10, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1071, file: !2, line: 211, column: 9)
!1080 = !DILocation(line: 211, column: 16, scope: !1079)
!1081 = !DILocation(line: 211, column: 26, scope: !1079)
!1082 = !DILocation(line: 211, column: 35, scope: !1079)
!1083 = !DILocation(line: 211, column: 49, scope: !1079)
!1084 = !DILocation(line: 211, column: 59, scope: !1079)
!1085 = !DILocation(line: 211, column: 45, scope: !1079)
!1086 = !DILocation(line: 211, column: 9, scope: !1071)
!1087 = !DILocation(line: 212, column: 9, scope: !1079)
!1088 = !DILocation(line: 216, column: 12, scope: !1071)
!1089 = !DILocation(line: 216, column: 18, scope: !1071)
!1090 = !DILocation(line: 216, column: 28, scope: !1071)
!1091 = !DILocation(line: 216, column: 36, scope: !1071)
!1092 = !DILocation(line: 216, column: 5, scope: !1071)
!1093 = !DILocation(line: 217, column: 1, scope: !1071)
!1094 = distinct !DISubprogram(name: "nn_sock_setopt", scope: !2, file: !2, line: 219, type: !1095, scopeLine: 221, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!51, !238, !51, !51, !300, !302}
!1097 = !DILocalVariable(name: "self", arg: 1, scope: !1094, file: !2, line: 219, type: !238)
!1098 = !DILocation(line: 219, column: 37, scope: !1094)
!1099 = !DILocalVariable(name: "level", arg: 2, scope: !1094, file: !2, line: 219, type: !51)
!1100 = !DILocation(line: 219, column: 47, scope: !1094)
!1101 = !DILocalVariable(name: "option", arg: 3, scope: !1094, file: !2, line: 219, type: !51)
!1102 = !DILocation(line: 219, column: 58, scope: !1094)
!1103 = !DILocalVariable(name: "optval", arg: 4, scope: !1094, file: !2, line: 220, type: !300)
!1104 = !DILocation(line: 220, column: 17, scope: !1094)
!1105 = !DILocalVariable(name: "optvallen", arg: 5, scope: !1094, file: !2, line: 220, type: !302)
!1106 = !DILocation(line: 220, column: 32, scope: !1094)
!1107 = !DILocalVariable(name: "rc", scope: !1094, file: !2, line: 222, type: !51)
!1108 = !DILocation(line: 222, column: 9, scope: !1094)
!1109 = !DILocation(line: 224, column: 20, scope: !1094)
!1110 = !DILocation(line: 224, column: 26, scope: !1094)
!1111 = !DILocation(line: 224, column: 5, scope: !1094)
!1112 = !DILocation(line: 225, column: 9, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1094, file: !2, line: 225, column: 9)
!1114 = !DILocation(line: 225, column: 9, scope: !1094)
!1115 = !DILocation(line: 226, column: 24, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1113, file: !2, line: 225, column: 56)
!1117 = !DILocation(line: 226, column: 30, scope: !1116)
!1118 = !DILocation(line: 226, column: 9, scope: !1116)
!1119 = !DILocation(line: 227, column: 9, scope: !1116)
!1120 = !DILocation(line: 229, column: 32, scope: !1094)
!1121 = !DILocation(line: 229, column: 38, scope: !1094)
!1122 = !DILocation(line: 229, column: 45, scope: !1094)
!1123 = !DILocation(line: 229, column: 53, scope: !1094)
!1124 = !DILocation(line: 229, column: 61, scope: !1094)
!1125 = !DILocation(line: 229, column: 10, scope: !1094)
!1126 = !DILocation(line: 229, column: 8, scope: !1094)
!1127 = !DILocation(line: 230, column: 20, scope: !1094)
!1128 = !DILocation(line: 230, column: 26, scope: !1094)
!1129 = !DILocation(line: 230, column: 5, scope: !1094)
!1130 = !DILocation(line: 232, column: 12, scope: !1094)
!1131 = !DILocation(line: 232, column: 5, scope: !1094)
!1132 = !DILocation(line: 233, column: 1, scope: !1094)
!1133 = distinct !DISubprogram(name: "nn_sock_setopt_inner", scope: !2, file: !2, line: 235, type: !1095, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !399)
!1134 = !DILocalVariable(name: "self", arg: 1, scope: !1133, file: !2, line: 235, type: !238)
!1135 = !DILocation(line: 235, column: 50, scope: !1133)
!1136 = !DILocalVariable(name: "level", arg: 2, scope: !1133, file: !2, line: 235, type: !51)
!1137 = !DILocation(line: 235, column: 60, scope: !1133)
!1138 = !DILocalVariable(name: "option", arg: 3, scope: !1133, file: !2, line: 236, type: !51)
!1139 = !DILocation(line: 236, column: 9, scope: !1133)
!1140 = !DILocalVariable(name: "optval", arg: 4, scope: !1133, file: !2, line: 236, type: !300)
!1141 = !DILocation(line: 236, column: 29, scope: !1133)
!1142 = !DILocalVariable(name: "optvallen", arg: 5, scope: !1133, file: !2, line: 236, type: !302)
!1143 = !DILocation(line: 236, column: 44, scope: !1133)
!1144 = !DILocalVariable(name: "optset", scope: !1133, file: !2, line: 238, type: !357)
!1145 = !DILocation(line: 238, column: 23, scope: !1133)
!1146 = !DILocalVariable(name: "val", scope: !1133, file: !2, line: 239, type: !51)
!1147 = !DILocation(line: 239, column: 9, scope: !1133)
!1148 = !DILocalVariable(name: "dst", scope: !1133, file: !2, line: 240, type: !386)
!1149 = !DILocation(line: 240, column: 10, scope: !1133)
!1150 = !DILocation(line: 243, column: 9, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 243, column: 9)
!1152 = !DILocation(line: 243, column: 15, scope: !1151)
!1153 = !DILocation(line: 243, column: 9, scope: !1133)
!1154 = !DILocation(line: 244, column: 16, scope: !1151)
!1155 = !DILocation(line: 244, column: 22, scope: !1151)
!1156 = !DILocation(line: 244, column: 32, scope: !1151)
!1157 = !DILocation(line: 244, column: 39, scope: !1151)
!1158 = !DILocation(line: 244, column: 47, scope: !1151)
!1159 = !DILocation(line: 244, column: 53, scope: !1151)
!1160 = !DILocation(line: 244, column: 63, scope: !1151)
!1161 = !DILocation(line: 244, column: 70, scope: !1151)
!1162 = !DILocation(line: 245, column: 13, scope: !1151)
!1163 = !DILocation(line: 245, column: 21, scope: !1151)
!1164 = !DILocation(line: 244, column: 9, scope: !1151)
!1165 = !DILocation(line: 248, column: 9, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 248, column: 9)
!1167 = !DILocation(line: 248, column: 15, scope: !1166)
!1168 = !DILocation(line: 248, column: 9, scope: !1133)
!1169 = !DILocation(line: 249, column: 34, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1166, file: !2, line: 248, column: 32)
!1171 = !DILocation(line: 249, column: 40, scope: !1170)
!1172 = !DILocation(line: 249, column: 18, scope: !1170)
!1173 = !DILocation(line: 249, column: 16, scope: !1170)
!1174 = !DILocation(line: 250, column: 14, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1170, file: !2, line: 250, column: 13)
!1176 = !DILocation(line: 250, column: 13, scope: !1170)
!1177 = !DILocation(line: 251, column: 13, scope: !1175)
!1178 = !DILocation(line: 252, column: 16, scope: !1170)
!1179 = !DILocation(line: 252, column: 24, scope: !1170)
!1180 = !DILocation(line: 252, column: 31, scope: !1170)
!1181 = !DILocation(line: 252, column: 39, scope: !1170)
!1182 = !DILocation(line: 252, column: 47, scope: !1170)
!1183 = !DILocation(line: 252, column: 55, scope: !1170)
!1184 = !DILocation(line: 252, column: 63, scope: !1170)
!1185 = !DILocation(line: 252, column: 9, scope: !1170)
!1186 = !DILocation(line: 256, column: 9, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 256, column: 9)
!1188 = !DILocation(line: 256, column: 19, scope: !1187)
!1189 = !DILocation(line: 256, column: 9, scope: !1133)
!1190 = !DILocation(line: 257, column: 9, scope: !1187)
!1191 = !DILocation(line: 258, column: 19, scope: !1133)
!1192 = !DILocation(line: 258, column: 11, scope: !1133)
!1193 = !DILocation(line: 258, column: 9, scope: !1133)
!1194 = !DILocation(line: 261, column: 9, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 261, column: 9)
!1196 = !DILocation(line: 261, column: 15, scope: !1195)
!1197 = !DILocation(line: 261, column: 9, scope: !1133)
!1198 = !DILocation(line: 262, column: 17, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 261, column: 33)
!1200 = !DILocation(line: 262, column: 9, scope: !1199)
!1201 = !DILocation(line: 264, column: 20, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1199, file: !2, line: 262, column: 25)
!1203 = !DILocation(line: 264, column: 26, scope: !1202)
!1204 = !DILocation(line: 264, column: 17, scope: !1202)
!1205 = !DILocation(line: 265, column: 13, scope: !1202)
!1206 = !DILocation(line: 267, column: 17, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 267, column: 17)
!1208 = !DILocation(line: 267, column: 17, scope: !1202)
!1209 = !DILocation(line: 268, column: 17, scope: !1207)
!1210 = !DILocation(line: 269, column: 20, scope: !1202)
!1211 = !DILocation(line: 269, column: 26, scope: !1202)
!1212 = !DILocation(line: 269, column: 17, scope: !1202)
!1213 = !DILocation(line: 270, column: 13, scope: !1202)
!1214 = !DILocation(line: 272, column: 17, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 272, column: 17)
!1216 = !DILocation(line: 272, column: 17, scope: !1202)
!1217 = !DILocation(line: 273, column: 17, scope: !1215)
!1218 = !DILocation(line: 274, column: 20, scope: !1202)
!1219 = !DILocation(line: 274, column: 26, scope: !1202)
!1220 = !DILocation(line: 274, column: 17, scope: !1202)
!1221 = !DILocation(line: 275, column: 13, scope: !1202)
!1222 = !DILocation(line: 277, column: 20, scope: !1202)
!1223 = !DILocation(line: 277, column: 26, scope: !1202)
!1224 = !DILocation(line: 277, column: 17, scope: !1202)
!1225 = !DILocation(line: 278, column: 13, scope: !1202)
!1226 = !DILocation(line: 280, column: 20, scope: !1202)
!1227 = !DILocation(line: 280, column: 26, scope: !1202)
!1228 = !DILocation(line: 280, column: 17, scope: !1202)
!1229 = !DILocation(line: 281, column: 13, scope: !1202)
!1230 = !DILocation(line: 283, column: 17, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 283, column: 17)
!1232 = !DILocation(line: 283, column: 17, scope: !1202)
!1233 = !DILocation(line: 284, column: 17, scope: !1231)
!1234 = !DILocation(line: 285, column: 20, scope: !1202)
!1235 = !DILocation(line: 285, column: 26, scope: !1202)
!1236 = !DILocation(line: 285, column: 17, scope: !1202)
!1237 = !DILocation(line: 286, column: 13, scope: !1202)
!1238 = !DILocation(line: 288, column: 17, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 288, column: 17)
!1240 = !DILocation(line: 288, column: 17, scope: !1202)
!1241 = !DILocation(line: 289, column: 17, scope: !1239)
!1242 = !DILocation(line: 290, column: 20, scope: !1202)
!1243 = !DILocation(line: 290, column: 26, scope: !1202)
!1244 = !DILocation(line: 290, column: 17, scope: !1202)
!1245 = !DILocation(line: 291, column: 13, scope: !1202)
!1246 = !DILocation(line: 293, column: 17, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 293, column: 17)
!1248 = !DILocation(line: 293, column: 17, scope: !1202)
!1249 = !DILocation(line: 294, column: 17, scope: !1247)
!1250 = !DILocation(line: 295, column: 20, scope: !1202)
!1251 = !DILocation(line: 295, column: 26, scope: !1202)
!1252 = !DILocation(line: 295, column: 17, scope: !1202)
!1253 = !DILocation(line: 296, column: 13, scope: !1202)
!1254 = !DILocation(line: 298, column: 17, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1202, file: !2, line: 298, column: 17)
!1256 = !DILocation(line: 0, scope: !1255)
!1257 = !DILocation(line: 298, column: 17, scope: !1202)
!1258 = !DILocation(line: 299, column: 17, scope: !1255)
!1259 = !DILocation(line: 300, column: 20, scope: !1202)
!1260 = !DILocation(line: 300, column: 26, scope: !1202)
!1261 = !DILocation(line: 300, column: 17, scope: !1202)
!1262 = !DILocation(line: 301, column: 13, scope: !1202)
!1263 = !DILocation(line: 303, column: 13, scope: !1202)
!1264 = !DILocation(line: 305, column: 16, scope: !1199)
!1265 = !DILocation(line: 305, column: 10, scope: !1199)
!1266 = !DILocation(line: 305, column: 14, scope: !1199)
!1267 = !DILocation(line: 307, column: 9, scope: !1199)
!1268 = !DILocation(line: 310, column: 5, scope: !1133)
!1269 = !DILocation(line: 310, column: 5, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1271, file: !2, line: 310, column: 5)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !2, line: 310, column: 5)
!1272 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 310, column: 5)
!1273 = !DILocation(line: 311, column: 1, scope: !1133)
!1274 = distinct !DISubprogram(name: "nn_sock_getopt", scope: !2, file: !2, line: 313, type: !1275, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!51, !238, !51, !51, !50, !308}
!1277 = !DILocalVariable(name: "self", arg: 1, scope: !1274, file: !2, line: 313, type: !238)
!1278 = !DILocation(line: 313, column: 37, scope: !1274)
!1279 = !DILocalVariable(name: "level", arg: 2, scope: !1274, file: !2, line: 313, type: !51)
!1280 = !DILocation(line: 313, column: 47, scope: !1274)
!1281 = !DILocalVariable(name: "option", arg: 3, scope: !1274, file: !2, line: 313, type: !51)
!1282 = !DILocation(line: 313, column: 58, scope: !1274)
!1283 = !DILocalVariable(name: "optval", arg: 4, scope: !1274, file: !2, line: 314, type: !50)
!1284 = !DILocation(line: 314, column: 11, scope: !1274)
!1285 = !DILocalVariable(name: "optvallen", arg: 5, scope: !1274, file: !2, line: 314, type: !308)
!1286 = !DILocation(line: 314, column: 27, scope: !1274)
!1287 = !DILocalVariable(name: "rc", scope: !1274, file: !2, line: 316, type: !51)
!1288 = !DILocation(line: 316, column: 9, scope: !1274)
!1289 = !DILocation(line: 318, column: 20, scope: !1274)
!1290 = !DILocation(line: 318, column: 26, scope: !1274)
!1291 = !DILocation(line: 318, column: 5, scope: !1274)
!1292 = !DILocation(line: 319, column: 9, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 319, column: 9)
!1294 = !DILocation(line: 319, column: 9, scope: !1274)
!1295 = !DILocation(line: 320, column: 24, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1293, file: !2, line: 319, column: 56)
!1297 = !DILocation(line: 320, column: 30, scope: !1296)
!1298 = !DILocation(line: 320, column: 9, scope: !1296)
!1299 = !DILocation(line: 321, column: 9, scope: !1296)
!1300 = !DILocation(line: 323, column: 32, scope: !1274)
!1301 = !DILocation(line: 323, column: 38, scope: !1274)
!1302 = !DILocation(line: 323, column: 45, scope: !1274)
!1303 = !DILocation(line: 323, column: 53, scope: !1274)
!1304 = !DILocation(line: 323, column: 61, scope: !1274)
!1305 = !DILocation(line: 323, column: 10, scope: !1274)
!1306 = !DILocation(line: 323, column: 8, scope: !1274)
!1307 = !DILocation(line: 324, column: 20, scope: !1274)
!1308 = !DILocation(line: 324, column: 26, scope: !1274)
!1309 = !DILocation(line: 324, column: 5, scope: !1274)
!1310 = !DILocation(line: 326, column: 12, scope: !1274)
!1311 = !DILocation(line: 326, column: 5, scope: !1274)
!1312 = !DILocation(line: 327, column: 1, scope: !1274)
!1313 = distinct !DISubprogram(name: "nn_sock_getopt_inner", scope: !2, file: !2, line: 329, type: !1275, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !399)
!1314 = !DILocalVariable(name: "self", arg: 1, scope: !1313, file: !2, line: 329, type: !238)
!1315 = !DILocation(line: 329, column: 43, scope: !1313)
!1316 = !DILocalVariable(name: "level", arg: 2, scope: !1313, file: !2, line: 329, type: !51)
!1317 = !DILocation(line: 329, column: 53, scope: !1313)
!1318 = !DILocalVariable(name: "option", arg: 3, scope: !1313, file: !2, line: 330, type: !51)
!1319 = !DILocation(line: 330, column: 9, scope: !1313)
!1320 = !DILocalVariable(name: "optval", arg: 4, scope: !1313, file: !2, line: 330, type: !50)
!1321 = !DILocation(line: 330, column: 23, scope: !1313)
!1322 = !DILocalVariable(name: "optvallen", arg: 5, scope: !1313, file: !2, line: 330, type: !308)
!1323 = !DILocation(line: 330, column: 39, scope: !1313)
!1324 = !DILocalVariable(name: "rc", scope: !1313, file: !2, line: 332, type: !51)
!1325 = !DILocation(line: 332, column: 9, scope: !1313)
!1326 = !DILocalVariable(name: "optset", scope: !1313, file: !2, line: 333, type: !357)
!1327 = !DILocation(line: 333, column: 23, scope: !1313)
!1328 = !DILocalVariable(name: "intval", scope: !1313, file: !2, line: 334, type: !51)
!1329 = !DILocation(line: 334, column: 9, scope: !1313)
!1330 = !DILocalVariable(name: "fd", scope: !1313, file: !2, line: 335, type: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fd", file: !134, line: 23, baseType: !51)
!1332 = !DILocation(line: 335, column: 11, scope: !1313)
!1333 = !DILocation(line: 338, column: 9, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1313, file: !2, line: 338, column: 9)
!1335 = !DILocation(line: 338, column: 15, scope: !1334)
!1336 = !DILocation(line: 338, column: 9, scope: !1313)
!1337 = !DILocation(line: 339, column: 17, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1334, file: !2, line: 338, column: 33)
!1339 = !DILocation(line: 339, column: 9, scope: !1338)
!1340 = !DILocation(line: 341, column: 22, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1338, file: !2, line: 339, column: 25)
!1342 = !DILocation(line: 341, column: 28, scope: !1341)
!1343 = !DILocation(line: 341, column: 38, scope: !1341)
!1344 = !DILocation(line: 341, column: 20, scope: !1341)
!1345 = !DILocation(line: 342, column: 13, scope: !1341)
!1346 = !DILocation(line: 344, column: 22, scope: !1341)
!1347 = !DILocation(line: 344, column: 28, scope: !1341)
!1348 = !DILocation(line: 344, column: 38, scope: !1341)
!1349 = !DILocation(line: 344, column: 20, scope: !1341)
!1350 = !DILocation(line: 345, column: 13, scope: !1341)
!1351 = !DILocation(line: 347, column: 22, scope: !1341)
!1352 = !DILocation(line: 347, column: 28, scope: !1341)
!1353 = !DILocation(line: 347, column: 20, scope: !1341)
!1354 = !DILocation(line: 348, column: 13, scope: !1341)
!1355 = !DILocation(line: 350, column: 22, scope: !1341)
!1356 = !DILocation(line: 350, column: 28, scope: !1341)
!1357 = !DILocation(line: 350, column: 20, scope: !1341)
!1358 = !DILocation(line: 351, column: 13, scope: !1341)
!1359 = !DILocation(line: 353, column: 22, scope: !1341)
!1360 = !DILocation(line: 353, column: 28, scope: !1341)
!1361 = !DILocation(line: 353, column: 20, scope: !1341)
!1362 = !DILocation(line: 354, column: 13, scope: !1341)
!1363 = !DILocation(line: 356, column: 22, scope: !1341)
!1364 = !DILocation(line: 356, column: 28, scope: !1341)
!1365 = !DILocation(line: 356, column: 20, scope: !1341)
!1366 = !DILocation(line: 357, column: 13, scope: !1341)
!1367 = !DILocation(line: 359, column: 22, scope: !1341)
!1368 = !DILocation(line: 359, column: 28, scope: !1341)
!1369 = !DILocation(line: 359, column: 20, scope: !1341)
!1370 = !DILocation(line: 360, column: 13, scope: !1341)
!1371 = !DILocation(line: 362, column: 22, scope: !1341)
!1372 = !DILocation(line: 362, column: 28, scope: !1341)
!1373 = !DILocation(line: 362, column: 20, scope: !1341)
!1374 = !DILocation(line: 363, column: 13, scope: !1341)
!1375 = !DILocation(line: 365, column: 22, scope: !1341)
!1376 = !DILocation(line: 365, column: 28, scope: !1341)
!1377 = !DILocation(line: 365, column: 20, scope: !1341)
!1378 = !DILocation(line: 366, column: 13, scope: !1341)
!1379 = !DILocation(line: 368, column: 22, scope: !1341)
!1380 = !DILocation(line: 368, column: 28, scope: !1341)
!1381 = !DILocation(line: 368, column: 20, scope: !1341)
!1382 = !DILocation(line: 369, column: 13, scope: !1341)
!1383 = !DILocation(line: 371, column: 22, scope: !1341)
!1384 = !DILocation(line: 371, column: 28, scope: !1341)
!1385 = !DILocation(line: 371, column: 20, scope: !1341)
!1386 = !DILocation(line: 372, column: 13, scope: !1341)
!1387 = !DILocation(line: 374, column: 17, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1341, file: !2, line: 374, column: 17)
!1389 = !DILocation(line: 374, column: 23, scope: !1388)
!1390 = !DILocation(line: 374, column: 33, scope: !1388)
!1391 = !DILocation(line: 374, column: 39, scope: !1388)
!1392 = !DILocation(line: 374, column: 17, scope: !1341)
!1393 = !DILocation(line: 375, column: 17, scope: !1388)
!1394 = !DILocation(line: 376, column: 33, scope: !1341)
