; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.writer_msg_s = type { i32, ptr, %struct.ybin_s, %struct.ybin_s, i32 }
%struct.ybin_s = type { ptr, i64 }
%struct.tcp_thread_s = type { i64, ptr, i32, i32, ptr, ptr }
%struct.finedb_s = type { i32, ptr, i32, i32, i64, ptr, i16 }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.snappy_env = type { ptr, ptr, ptr }
%struct.msghdr = type { ptr, i32, ptr, i64, ptr, i64, i32 }
%struct.MDB_val = type { i64, ptr }
%struct.timeval = type { i64, i64 }
%struct.ydynabin_s = type { ptr, i64, i64, i64 }

@finedb_g = dso_local local_unnamed_addr global ptr null, align 8, !dbg !0
@.str = private unnamed_addr constant [15 x i8] c"dht:n:s:f:p:i:\00", align 1, !dbg !42
@optarg = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [7 x i8] c"main.c\00", align 1, !dbg !47
@__FUNCTION__.main = private unnamed_addr constant [5 x i8] c"main\00", align 1, !dbg !52
@.str.2 = private unnamed_addr constant [104 x i8] c"Configuration\0A\09# threads: %d\0A\09# dbs: %d\0A\09Map size: %d\0A\09Port number: %d\0A\09Database path: %s\0A\09Timeout: %d\0A\00", align 1, !dbg !58
@__FUNCTION__.signal_handler = private unnamed_addr constant [15 x i8] c"signal_handler\00", align 1, !dbg !63

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !41, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "main.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "7c53ee4eb893ec28c6f0c99a4b65a1c8")
!4 = !{!5, !11, !18}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ybool_e", file: !6, line: 45, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../lib/ylib/ydefs.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "d3a2b1768a8684c59dbd5861ab8c9350")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "YFALSE", value: 0)
!10 = !DIEnumerator(name: "YTRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ylog_type_e", file: !12, line: 245, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/ylib/ylog.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "0a4bfecb6867d4cb83bdff3f2b1d4b13")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "YLOG_STDERR", value: 1)
!15 = !DIEnumerator(name: "YLOG_FILE", value: 2)
!16 = !DIEnumerator(name: "YLOG_SYSLOG", value: 4)
!17 = !DIEnumerator(name: "YLOG_HANDLER", value: 8)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ylog_priority_e", file: !12, line: 267, baseType: !7, size: 32, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25}
!20 = !DIEnumerator(name: "YLOG_DEBUG", value: 0)
!21 = !DIEnumerator(name: "YLOG_INFO", value: 1)
!22 = !DIEnumerator(name: "YLOG_NOTE", value: 2)
!23 = !DIEnumerator(name: "YLOG_WARN", value: 3)
!24 = !DIEnumerator(name: "YLOG_ERR", value: 4)
!25 = !DIEnumerator(name: "YLOG_CRIT", value: 5)
!26 = !{!27, !7, !28, !31, !36, !37, !40}
!27 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 46, baseType: !30)
!29 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!30 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !32, line: 72, baseType: !33)
!32 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !{!0, !42, !47, !52, !58, !63, !66, !71}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !3, line: 54, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 120, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 15)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !3, line: 98, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 56, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 7)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !3, line: 98, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 40, elements: !56)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!56 = !{!57}
!57 = !DISubrange(count: 5)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !3, line: 98, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 832, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 104)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !3, line: 42, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 120, elements: !45)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(scope: null, file: !3, line: 42, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 232, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 29)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !3, line: 28, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 4248, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 531)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_t", file: !78, line: 49, baseType: !79)
!78 = !DIFile(filename: "./finedb.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "349d81e48e8fe143f3d7a471f97edb42")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_s", file: !78, line: 41, size: 384, elements: !80)
!80 = !{!81, !83, !88, !89, !90, !93, !97}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !79, file: !78, line: 42, baseType: !82, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybool_t", file: !6, line: 52, baseType: !5)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !79, file: !78, line: 43, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_env", file: !86, line: 197, baseType: !87)
!86 = !DIFile(filename: "../../lib/lmdb/lmdb.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "9ff9d4834608bdc966449cf81c779c6a")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_env", file: !86, line: 197, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !79, file: !78, line: 44, baseType: !36, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "threads_socket", scope: !79, file: !78, line: 45, baseType: !36, size: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "writer_tid", scope: !79, file: !78, line: 46, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !92, line: 27, baseType: !30)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_threads", scope: !79, file: !78, line: 47, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "yvect_t", file: !95, line: 56, baseType: !96)
!95 = !DIFile(filename: "../../lib/ylib/yvect.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "73ac1eb655eaae5d93c48c36880d9ca2")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !79, file: !78, line: 48, baseType: !27, size: 16, offset: 320)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !100, line: 17, type: !101, isLocal: true, isDefinition: true)
!100 = !DIFile(filename: "command_del.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "a89492865516366155a7a5f348975dd0")
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 112, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 14)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !100, line: 17, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 96, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 12)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !100, line: 17, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 96, elements: !107)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(scope: null, file: !100, line: 45, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 328, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 41)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !100, line: 52, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 216, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 27)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !100, line: 55, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 280, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 35)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !100, line: 60, type: !44, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(scope: null, file: !100, line: 60, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 24, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 3)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !100, line: 60, type: !49, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !100, line: 66, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 80, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 10)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !143, line: 23, type: !144, isLocal: true, isDefinition: true)
!143 = !DIFile(filename: "server.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "4987e9b216923177d8f94ac3c2e98db1")
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 72, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 9)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !143, line: 23, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 248, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 31)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !143, line: 23, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 104, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 13)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !143, line: 29, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 32)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !143, line: 32, type: !159, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !143, line: 40, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 88, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 11)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !143, line: 44, type: !154, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !143, line: 66, type: !106, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !143, line: 66, type: !68, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !177, line: 13, type: !44, isLocal: true, isDefinition: true)
!177 = !DIFile(filename: "command_ping.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "b38166355381d93ac2785964c898e39b")
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !177, line: 13, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 104, elements: !155)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !177, line: 13, type: !154, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !185, line: 16, type: !186, isLocal: true, isDefinition: true)
!185 = !DIFile(filename: "writer_thread.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "9fdba751c28a582e86262a953f23a9ae")
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 184, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 23)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !185, line: 17, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 16)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !185, line: 17, type: !106, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !185, line: 17, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 336, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 42)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !185, line: 29, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 152, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 19)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !185, line: 31, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 208, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 26)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !185, line: 33, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 288, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 36)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !185, line: 37, type: !111, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !185, line: 39, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 224, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 28)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !185, line: 41, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 296, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 37)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !230, line: 33, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "finedb.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "4e29fb71de217c956e2bf4cc5fc98b87")
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 48, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 6)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !230, line: 33, type: !191, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !230, line: 38, type: !144, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !230, line: 38, type: !106, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !230, line: 38, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 200, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 25)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !230, line: 43, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 24)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !230, line: 44, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 264, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 33)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !230, line: 50, type: !159, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !230, line: 63, type: !138, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !261, line: 25, type: !101, isLocal: true, isDefinition: true)
!261 = !DIFile(filename: "command_put.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "9da0ac82fe52607193c75654eb3eec33")
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !261, line: 25, type: !106, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !261, line: 25, type: !111, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !261, line: 40, type: !154, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !261, line: 54, type: !154, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !261, line: 73, type: !225, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !261, line: 77, type: !119, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !261, line: 82, type: !242, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !261, line: 94, type: !114, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !261, line: 125, type: !208, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !261, line: 128, type: !213, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !261, line: 138, type: !44, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !261, line: 138, type: !131, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !261, line: 138, type: !49, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !261, line: 142, type: !138, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !292, line: 20, type: !44, isLocal: true, isDefinition: true)
!292 = !DIFile(filename: "command_list.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "e4cbd883bcb9d23ee06819d9e0fdc7f3")
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !292, line: 20, type: !180, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !292, line: 20, type: !154, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !292, line: 31, type: !191, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !292, line: 34, type: !166, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !292, line: 47, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 152, elements: !204)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !292, line: 47, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 20)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !292, line: 63, type: !242, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !292, line: 66, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 384, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 48)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !318, line: 8, type: !166, isLocal: true, isDefinition: true)
!318 = !DIFile(filename: "database.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "00058a6d5c3cfab231afd3ed67f1b000")
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !318, line: 8, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 112, elements: !102)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !318, line: 8, type: !44, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !318, line: 12, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 304, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 38)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !318, line: 18, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 272, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 34)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !318, line: 25, type: !159, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !318, line: 33, type: !220, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !318, line: 40, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 344, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 43)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !318, line: 44, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 136, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 17)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !318, line: 50, type: !65, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !318, line: 50, type: !191, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !318, line: 52, type: !345, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !318, line: 65, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 216, elements: !120)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !318, line: 65, type: !124, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !318, line: 77, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 224, elements: !221)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !318, line: 77, type: !124, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !318, line: 106, type: !180, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !318, line: 106, type: !225, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !318, line: 118, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 312, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 39)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !318, line: 147, type: !180, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !318, line: 186, type: !180, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !318, line: 214, type: !101, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !318, line: 217, type: !326, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !318, line: 236, type: !321, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !318, line: 243, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 320, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 40)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !318, line: 281, type: !321, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !318, line: 288, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 240, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 30)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "path", scope: !397, file: !398, line: 11, type: !409, isLocal: true, isDefinition: true)
!397 = distinct !DISubprogram(name: "get_self_path", scope: !398, file: !398, line: 10, type: !399, scopeLine: 10, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !407)
!398 = !DIFile(filename: "self_path.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "2bbc590e709ff14bd139f9008aac95cd")
!399 = !DISubroutineType(types: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !403, globals: !404, splitDebugInlining: false, nameTableKind: None)
!403 = !{!40}
!404 = !{!395, !405}
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !398, line: 14, type: !44, isLocal: true, isDefinition: true)
!407 = !{!408}
!408 = !DILocalVariable(name: "pt", scope: !397, file: !398, line: 12, type: !38)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32768, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 4096)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !414, line: 18, type: !101, isLocal: true, isDefinition: true)
!414 = !DIFile(filename: "command_get.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "97f84e4100e311456268f78cada1acf6")
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !414, line: 18, type: !106, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !414, line: 18, type: !111, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !414, line: 45, type: !345, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !414, line: 49, type: !119, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !414, line: 56, type: !44, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !414, line: 62, type: !111, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !414, line: 67, type: !138, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !431, line: 18, type: !191, isLocal: true, isDefinition: true)
!431 = !DIFile(filename: "command_setdb.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "79bf1a53ff4e683f73e5a870bf619e61")
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !431, line: 18, type: !321, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !431, line: 18, type: !101, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !431, line: 36, type: !345, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !431, line: 40, type: !111, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !442, line: 8, type: !443, isLocal: true, isDefinition: true)
!442 = !DIFile(filename: "command_start_stop.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "6742c9ae510390180624d8006d030220")
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 168, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 21)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !442, line: 8, type: !321, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !442, line: 8, type: !101, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !442, line: 19, type: !111, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !442, line: 26, type: !180, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !442, line: 26, type: !154, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !442, line: 36, type: !166, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !460, line: 45, type: !306, isLocal: true, isDefinition: true)
!460 = !DIFile(filename: "connection_thread.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "d5b8816e925b284004cff38d62711b09")
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !460, line: 45, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 176, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 22)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !460, line: 45, type: !242, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !460, line: 78, type: !361, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !460, line: 78, type: !154, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !460, line: 82, type: !186, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !460, line: 83, type: !326, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !460, line: 88, type: !247, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !460, line: 89, type: !340, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !460, line: 100, type: !159, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !460, line: 109, type: !208, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !460, line: 111, type: !186, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !460, line: 120, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 368, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 46)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !460, line: 125, type: !345, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !460, line: 129, type: !166, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !460, line: 134, type: !203, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !460, line: 157, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 168, elements: !444)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !460, line: 157, type: !331, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !460, line: 160, type: !154, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !460, line: 164, type: !101, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !460, line: 172, type: !370, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !460, line: 191, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 200, elements: !243)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !460, line: 191, type: !306, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !460, line: 221, type: !331, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !460, line: 225, type: !242, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !460, line: 228, type: !313, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !460, line: 231, type: !124, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !460, line: 237, type: !370, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !460, line: 239, type: !306, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "_commands", scope: !527, file: !460, line: 15, type: !587, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !528, retainedTypes: !552, globals: !586, splitDebugInlining: false, nameTableKind: None)
!528 = !{!5, !18, !529, !535, !542}
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !530, line: 41, baseType: !7, size: 32, elements: !531)
!530 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "619dab7fd722af1ca0fa7f4b6fd4f842")
!531 = !{!532, !533, !534}
!532 = !DIEnumerator(name: "SHUT_RD", value: 0)
!533 = !DIEnumerator(name: "SHUT_WR", value: 1)
!534 = !DIEnumerator(name: "SHUT_RDWR", value: 2)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol_option_e", file: !536, line: 88, baseType: !7, size: 32, elements: !537)
!536 = !DIFile(filename: "./protocol.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "90e12b9ba2bd5e3d7e691fccfd080d02")
!537 = !{!538, !539, !540, !541}
!538 = !DIEnumerator(name: "PROTO_OPT_SYNC", value: 16)
!539 = !DIEnumerator(name: "PROTO_OPT_SERIALIZED", value: 32)
!540 = !DIEnumerator(name: "PROTO_OPT_COMPRESSED", value: 64)
!541 = !DIEnumerator(name: "PROTO_OPT_SERVTOSERV", value: 128)
!542 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "protocol_response_e", file: !536, line: 108, baseType: !7, size: 32, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551}
!544 = !DIEnumerator(name: "RESP_ERR_UNDEFINED", value: 0)
!545 = !DIEnumerator(name: "RESP_OK", value: 1)
!546 = !DIEnumerator(name: "RESP_ERR_PROTOCOL", value: 2)
!547 = !DIEnumerator(name: "RESP_ERR_SERVER", value: 3)
!548 = !DIEnumerator(name: "RESP_ERR_FULL_DB", value: 4)
!549 = !DIEnumerator(name: "RESP_ERR_TOO_MANY_DB", value: 5)
!550 = !DIEnumerator(name: "RESP_ERR_BAD_NAME", value: 6)
!551 = !DIEnumerator(name: "RESP_ERR_TRANSACTION", value: 7)
!552 = !{!40, !553, !28, !578, !579, !583}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_thread_t", file: !555, line: 30, baseType: !556)
!555 = !DIFile(filename: "./connection_thread.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "285f9cd07088f6d468faef64cb1dc74b")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_thread_s", file: !555, line: 23, size: 320, elements: !557)
!557 = !{!558, !559, !571, !572, !573, !574}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !556, file: !555, line: 24, baseType: !91, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "finedb", scope: !556, file: !555, line: 25, baseType: !560, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_t", file: !78, line: 49, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_s", file: !78, line: 41, size: 384, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !562, file: !78, line: 42, baseType: !82, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !562, file: !78, line: 43, baseType: !84, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !562, file: !78, line: 44, baseType: !36, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "threads_socket", scope: !562, file: !78, line: 45, baseType: !36, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "writer_tid", scope: !562, file: !78, line: 46, baseType: !91, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_threads", scope: !562, file: !78, line: 47, baseType: !94, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !562, file: !78, line: 48, baseType: !27, size: 16, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !556, file: !555, line: 26, baseType: !36, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "write_sock", scope: !556, file: !555, line: 27, baseType: !36, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !556, file: !555, line: 28, baseType: !38, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !556, file: !555, line: 29, baseType: !575, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDB_txn", file: !86, line: 204, baseType: !577)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDB_txn", file: !86, line: 204, flags: DIFlagFwdDecl)
!578 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !580, line: 115, baseType: !581)
!580 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !582, line: 204, baseType: !38)
!582 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !584, line: 26, baseType: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !582, line: 42, baseType: !7)
!586 = !{!458, !461, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !491, !493, !495, !497, !500, !502, !504, !506, !508, !511, !513, !515, !517, !519, !521, !523, !525}
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1024, elements: !192)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "command_handler_t", file: !589, line: 19, baseType: !590)
!589 = !DIFile(filename: "./command.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "87e91f1361a7d18a8e85eefadb7c868e")
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!593, !553, !82, !82, !82, !595}
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "yerr_t", file: !594, line: 23, baseType: !36)
!594 = !DIFile(filename: "../../lib/ylib/yerror.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "4851c124a64e017d0b9d8820f73f7100")
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ydynabin_t", file: !597, line: 45, baseType: !598)
!597 = !DIFile(filename: "../../lib/ylib/ydynabin.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "e9b56a3dd8293288d1beb69b8bafd958")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ydynabin_s", file: !597, line: 37, size: 256, elements: !599)
!599 = !{!600, !601, !602, !603}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !598, file: !597, line: 38, baseType: !40, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !598, file: !597, line: 39, baseType: !28, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !598, file: !597, line: 40, baseType: !28, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !598, file: !597, line: 41, baseType: !28, size: 64, offset: 192)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !606, line: 16, type: !44, isLocal: true, isDefinition: true)
!606 = !DIFile(filename: "command_drop.c", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "05ba3cf55f911d82ca19e623753d952b")
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !606, line: 16, type: !180, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !606, line: 16, type: !111, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !606, line: 32, type: !114, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !606, line: 39, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 144, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 18)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !606, line: 42, type: !242, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !606, line: 45, type: !191, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !606, line: 45, type: !131, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !606, line: 45, type: !49, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !606, line: 49, type: !166, isLocal: true, isDefinition: true)
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !100, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !636, globals: !638, splitDebugInlining: false, nameTableKind: None)
!629 = !{!5, !630, !18, !542}
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "writer_action_e", file: !631, line: 13, baseType: !7, size: 32, elements: !632)
!631 = !DIFile(filename: "./writer_thread.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "3a724ae2321376421ad42c1087f049ab")
!632 = !{!633, !634, !635}
!633 = !DIEnumerator(name: "WRITE_PUT", value: 0)
!634 = !DIEnumerator(name: "WRITE_DEL", value: 1)
!635 = !DIEnumerator(name: "WRITE_DROP", value: 2)
!636 = !{!40, !28, !637}
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !582, line: 40, baseType: !27)
!638 = !{!98, !104, !109, !112, !117, !122, !127, !129, !134, !136}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !143, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, retainedTypes: !653, globals: !664, splitDebugInlining: false, nameTableKind: None)
!640 = !{!641, !18, !5}
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !642, line: 24, baseType: !7, size: 32, elements: !643)
!642 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "0d4e972fdeb3da9a5bc94fa41144e9f8")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652}
!644 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!645 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!646 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!647 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!648 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!649 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!650 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!651 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!652 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!653 = !{!40, !654, !656, !637}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !655, line: 30, baseType: !583)
!655 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !658, line: 180, size: 128, elements: !659)
!658 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!659 = !{!660, !663}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !657, file: !658, line: 182, baseType: !661, size: 16)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !662, line: 28, baseType: !27)
!662 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !657, file: !658, line: 183, baseType: !101, size: 112, offset: 16)
!664 = !{!141, !147, !152, !157, !162, !164, !169, !171, !173}
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, globals: !667, splitDebugInlining: false, nameTableKind: None)
!666 = !{!5, !18, !542}
!667 = !{!175, !178, !181}
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !669, retainedTypes: !670, globals: !682, splitDebugInlining: false, nameTableKind: None)
!669 = !{!5, !18, !630}
!670 = !{!671, !40}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_t", file: !78, line: 49, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_s", file: !78, line: 41, size: 384, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !673, file: !78, line: 42, baseType: !82, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !673, file: !78, line: 43, baseType: !84, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !673, file: !78, line: 44, baseType: !36, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "threads_socket", scope: !673, file: !78, line: 45, baseType: !36, size: 32, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "writer_tid", scope: !673, file: !78, line: 46, baseType: !91, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_threads", scope: !673, file: !78, line: 47, baseType: !94, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !673, file: !78, line: 48, baseType: !27, size: 16, offset: 320)
!682 = !{!183, !189, !194, !196, !201, !206, !211, !216, !218, !223}
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !684, retainedTypes: !403, globals: !693, splitDebugInlining: false, nameTableKind: None)
!684 = !{!5, !685, !18}
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yv_size_e", file: !95, line: 31, baseType: !7, size: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692}
!687 = !DIEnumerator(name: "YVECT_SIZE_NANO", value: 4)
!688 = !DIEnumerator(name: "YVECT_SIZE_MINI", value: 32)
!689 = !DIEnumerator(name: "YVECT_SIZE_MEDIUM", value: 256)
!690 = !DIEnumerator(name: "YVECT_SIZE_DEFAULT", value: 4096)
!691 = !DIEnumerator(name: "YVECT_SIZE_BIG", value: 65536)
!692 = !DIEnumerator(name: "YVECT_SIZE_HUGE", value: 1048576)
!693 = !{!228, !234, !236, !238, !240, !245, !250, !255, !257}
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !636, globals: !695, splitDebugInlining: false, nameTableKind: None)
!695 = !{!259, !262, !264, !266, !268, !270, !272, !274, !276, !696, !698, !700, !702, !278, !280, !704, !282, !284, !286, !288}
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !261, line: 105, type: !154, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !261, line: 107, type: !220, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !261, line: 115, type: !203, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !261, line: 119, type: !242, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !261, line: 134, type: !392, isLocal: true, isDefinition: true)
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, retainedTypes: !707, globals: !730, splitDebugInlining: false, nameTableKind: None)
!707 = !{!708, !38, !40, !729, !579, !637}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_thread_t", file: !555, line: 30, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_thread_s", file: !555, line: 23, size: 320, elements: !711)
!711 = !{!712, !713, !725, !726, !727, !728}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !710, file: !555, line: 24, baseType: !91, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "finedb", scope: !710, file: !555, line: 25, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_t", file: !78, line: 49, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_s", file: !78, line: 41, size: 384, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !716, file: !78, line: 42, baseType: !82, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !716, file: !78, line: 43, baseType: !84, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !716, file: !78, line: 44, baseType: !36, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "threads_socket", scope: !716, file: !78, line: 45, baseType: !36, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "writer_tid", scope: !716, file: !78, line: 46, baseType: !91, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_threads", scope: !716, file: !78, line: 47, baseType: !94, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !716, file: !78, line: 48, baseType: !27, size: 16, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !710, file: !555, line: 26, baseType: !36, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "write_sock", scope: !710, file: !555, line: 27, baseType: !36, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !710, file: !555, line: 28, baseType: !38, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !710, file: !555, line: 29, baseType: !575, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !584, line: 25, baseType: !637)
!730 = !{!290, !293, !295, !297, !299, !301, !304, !309, !311}
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !732, retainedTypes: !403, globals: !753, splitDebugInlining: false, nameTableKind: None)
!732 = !{!18, !5, !733}
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MDB_cursor_op", file: !86, line: 321, baseType: !7, size: 32, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!735 = !DIEnumerator(name: "MDB_FIRST", value: 0)
!736 = !DIEnumerator(name: "MDB_FIRST_DUP", value: 1)
!737 = !DIEnumerator(name: "MDB_GET_BOTH", value: 2)
!738 = !DIEnumerator(name: "MDB_GET_BOTH_RANGE", value: 3)
!739 = !DIEnumerator(name: "MDB_GET_CURRENT", value: 4)
!740 = !DIEnumerator(name: "MDB_GET_MULTIPLE", value: 5)
!741 = !DIEnumerator(name: "MDB_LAST", value: 6)
!742 = !DIEnumerator(name: "MDB_LAST_DUP", value: 7)
!743 = !DIEnumerator(name: "MDB_NEXT", value: 8)
!744 = !DIEnumerator(name: "MDB_NEXT_DUP", value: 9)
!745 = !DIEnumerator(name: "MDB_NEXT_MULTIPLE", value: 10)
!746 = !DIEnumerator(name: "MDB_NEXT_NODUP", value: 11)
!747 = !DIEnumerator(name: "MDB_PREV", value: 12)
!748 = !DIEnumerator(name: "MDB_PREV_DUP", value: 13)
!749 = !DIEnumerator(name: "MDB_PREV_NODUP", value: 14)
!750 = !DIEnumerator(name: "MDB_SET", value: 15)
!751 = !DIEnumerator(name: "MDB_SET_KEY", value: 16)
!752 = !DIEnumerator(name: "MDB_SET_RANGE", value: 17)
!753 = !{!316, !319, !322, !324, !329, !334, !336, !338, !343, !348, !350, !352, !354, !357, !359, !362, !364, !366, !368, !373, !375, !377, !379, !381, !383, !388, !390}
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, retainedTypes: !636, globals: !755, splitDebugInlining: false, nameTableKind: None)
!755 = !{!412, !415, !417, !419, !421, !423, !425, !427}
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, retainedTypes: !757, globals: !758, splitDebugInlining: false, nameTableKind: None)
!757 = !{!40, !28}
!758 = !{!429, !432, !434, !436, !438}
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !666, retainedTypes: !403, globals: !760, splitDebugInlining: false, nameTableKind: None)
!760 = !{!440, !446, !448, !450, !452, !454, !456}
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !403, globals: !762, splitDebugInlining: false, nameTableKind: None)
!762 = !{!604, !607, !609, !611, !613, !618, !620, !622, !624, !626}
!763 = !{!"clang version 16.0.0"}
!764 = !{i32 7, !"Dwarf Version", i32 5}
!765 = !{i32 2, !"Debug Info Version", i32 3}
!766 = !{i32 1, !"wchar_size", i32 4}
!767 = !{i32 8, !"PIC Level", i32 2}
!768 = !{i32 7, !"PIE Level", i32 2}
!769 = !{i32 7, !"uwtable", i32 2}
!770 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 53, type: !771, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!36, !36, !37}
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!774 = !DILocalVariable(name: "argc", arg: 1, scope: !770, file: !3, line: 53, type: !36)
!775 = !DILocalVariable(name: "argv", arg: 2, scope: !770, file: !3, line: 53, type: !37)
!776 = !DILocalVariable(name: "optstr", scope: !770, file: !3, line: 54, type: !38)
!777 = !DILocalVariable(name: "i", scope: !770, file: !3, line: 55, type: !36)
!778 = !DILocalVariable(name: "nbr_dbs", scope: !770, file: !3, line: 56, type: !7)
!779 = !DILocalVariable(name: "mapsize", scope: !770, file: !3, line: 57, type: !28)
!780 = !DILocalVariable(name: "nbr_threads", scope: !770, file: !3, line: 58, type: !27)
!781 = !DILocalVariable(name: "port", scope: !770, file: !3, line: 59, type: !27)
!782 = !DILocalVariable(name: "timeout", scope: !770, file: !3, line: 60, type: !27)
!783 = !DILocalVariable(name: "db_path", scope: !770, file: !3, line: 61, type: !38)
!784 = !DILocalVariable(name: "finedb", scope: !770, file: !3, line: 62, type: !76)
!785 = !DILocation(line: 0, scope: !770)
!786 = !DILocation(line: 65, column: 2, scope: !770)
!787 = !DILocation(line: 67, column: 2, scope: !770)
!788 = !{!789, !789, i64 0}
!789 = !{!"any pointer", !790, i64 0}
!790 = !{!"omnipotent char", !791, i64 0}
!791 = !{!"Simple C/C++ TBAA"}
!792 = !DILocation(line: 68, column: 2, scope: !770)
!793 = !DILocation(line: 70, column: 2, scope: !770)
!794 = !DILocation(line: 57, column: 9, scope: !770)
!795 = !DILocation(line: 58, column: 17, scope: !770)
!796 = !DILocation(line: 59, column: 17, scope: !770)
!797 = !DILocation(line: 60, column: 17, scope: !770)
!798 = !DILocation(line: 61, column: 8, scope: !770)
!799 = !DILocation(line: 56, column: 15, scope: !770)
!800 = !DILocation(line: 70, column: 14, scope: !770)
!801 = distinct !{!801, !793, !802}
!802 = !DILocation(line: 97, column: 2, scope: !770)
!803 = !DILocation(line: 73, column: 39, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !3, line: 71, column: 14)
!805 = distinct !DILexicalBlock(scope: !770, file: !3, line: 70, column: 49)
!806 = !DILocalVariable(name: "__nptr", arg: 1, scope: !807, file: !808, line: 362, type: !401)
!807 = distinct !DISubprogram(name: "atoi", scope: !808, file: !808, line: 362, type: !809, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !811)
!808 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!809 = !DISubroutineType(types: !810)
!810 = !{!36, !401}
!811 = !{!806}
!812 = !DILocation(line: 0, scope: !807, inlinedAt: !813)
!813 = distinct !DILocation(line: 73, column: 34, scope: !804)
!814 = !DILocation(line: 364, column: 16, scope: !807, inlinedAt: !813)
!815 = !DILocation(line: 73, column: 18, scope: !804)
!816 = !DILocation(line: 74, column: 4, scope: !804)
!817 = !DILocation(line: 76, column: 33, scope: !804)
!818 = !DILocation(line: 0, scope: !807, inlinedAt: !819)
!819 = distinct !DILocation(line: 76, column: 28, scope: !804)
!820 = !DILocation(line: 364, column: 16, scope: !807, inlinedAt: !819)
!821 = !DILocation(line: 364, column: 10, scope: !807, inlinedAt: !819)
!822 = !DILocation(line: 77, column: 4, scope: !804)
!823 = !DILocation(line: 79, column: 27, scope: !804)
!824 = !DILocation(line: 0, scope: !807, inlinedAt: !825)
!825 = distinct !DILocation(line: 79, column: 22, scope: !804)
!826 = !DILocation(line: 364, column: 16, scope: !807, inlinedAt: !825)
!827 = !DILocation(line: 79, column: 14, scope: !804)
!828 = !DILocation(line: 80, column: 4, scope: !804)
!829 = !DILocation(line: 82, column: 32, scope: !804)
!830 = !DILocation(line: 0, scope: !807, inlinedAt: !831)
!831 = distinct !DILocation(line: 82, column: 27, scope: !804)
!832 = !DILocation(line: 364, column: 16, scope: !807, inlinedAt: !831)
!833 = !DILocation(line: 82, column: 11, scope: !804)
!834 = !DILocation(line: 83, column: 4, scope: !804)
!835 = !DILocation(line: 85, column: 21, scope: !804)
!836 = !DILocation(line: 85, column: 14, scope: !804)
!837 = !DILocation(line: 86, column: 4, scope: !804)
!838 = !DILocation(line: 88, column: 19, scope: !804)
!839 = !DILocation(line: 0, scope: !807, inlinedAt: !840)
!840 = distinct !DILocation(line: 88, column: 14, scope: !804)
!841 = !DILocation(line: 364, column: 16, scope: !807, inlinedAt: !840)
!842 = !DILocation(line: 88, column: 14, scope: !804)
!843 = !DILocation(line: 89, column: 4, scope: !804)
!844 = !DILocation(line: 91, column: 4, scope: !804)
!845 = !DILocation(line: 92, column: 4, scope: !804)
!846 = !DILocation(line: 94, column: 4, scope: !804)
!847 = !DILocation(line: 95, column: 4, scope: !804)
!848 = !DILocation(line: 98, column: 2, scope: !770)
!849 = !DILocation(line: 103, column: 11, scope: !770)
!850 = !DILocation(line: 104, column: 11, scope: !770)
!851 = !DILocation(line: 106, column: 2, scope: !770)
!852 = !DILocation(line: 108, column: 2, scope: !770)
!853 = distinct !DISubprogram(name: "signal_handler", scope: !3, file: !3, line: 41, type: !34, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !854)
!854 = !{!855}
!855 = !DILocalVariable(name: "sig", arg: 1, scope: !853, file: !3, line: 41, type: !36)
!856 = !DILocation(line: 0, scope: !853)
!857 = !DILocation(line: 42, column: 2, scope: !853)
!858 = !DILocation(line: 43, column: 2, scope: !853)
!859 = !DILocation(line: 44, column: 6, scope: !860)
!860 = distinct !DILexicalBlock(scope: !853, file: !3, line: 44, column: 6)
!861 = !DILocation(line: 44, column: 6, scope: !853)
!862 = !DILocation(line: 45, column: 3, scope: !860)
!863 = !DILocation(line: 47, column: 2, scope: !853)
!864 = !DISubprogram(name: "signal", scope: !32, file: !32, line: 88, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{!31, !36, !31}
!867 = !{}
!868 = !DISubprogram(name: "ylog_init", scope: !12, file: !12, line: 332, type: !869, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !36, !38, !38, !7}
!871 = !DISubprogram(name: "ylog_set_prio", scope: !12, file: !12, line: 341, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !874}
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "ylog_priority_t", file: !12, line: 278, baseType: !18)
!875 = !DISubprogram(name: "getopt", scope: !876, file: !876, line: 91, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!876 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_core.h", directory: "", checksumkind: CSK_MD5, checksum: "81ab788980ce9d5be2ba931a6ae17301")
!877 = !DISubroutineType(types: !878)
!878 = !{!36, !36, !879, !401}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!881 = !DISubprogram(name: "strtol", scope: !808, file: !808, line: 177, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!882 = !DISubroutineType(types: !883)
!883 = !{!884, !885, !886, !36}
!884 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!885 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !401)
!886 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !37)
!887 = !DISubprogram(name: "strdup", scope: !888, file: !888, line: 187, type: !889, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!888 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!889 = !DISubroutineType(types: !890)
!890 = !{!38, !401}
!891 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 27, type: !892, scopeLine: 27, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !867)
!892 = !DISubroutineType(types: !893)
!893 = !{null}
!894 = !DILocation(line: 28, column: 2, scope: !891)
!895 = !DILocation(line: 38, column: 1, scope: !891)
!896 = !DISubprogram(name: "exit", scope: !808, file: !808, line: 624, type: !34, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !867)
!897 = !DISubprogram(name: "ylog_write", scope: !12, file: !12, line: 385, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!898 = !DISubroutineType(types: !899)
!899 = !{!82, !874, !401, !36, !401, !401, null}
!900 = distinct !DISubprogram(name: "command_del", scope: !100, file: !100, line: 11, type: !901, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !628, retainedNodes: !932)
!901 = !DISubroutineType(types: !902)
!902 = !{!593, !903, !82, !82, !82, !924}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_thread_t", file: !555, line: 30, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_thread_s", file: !555, line: 23, size: 320, elements: !906)
!906 = !{!907, !908, !920, !921, !922, !923}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !905, file: !555, line: 24, baseType: !91, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "finedb", scope: !905, file: !555, line: 25, baseType: !909, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "finedb_t", file: !78, line: 49, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "finedb_s", file: !78, line: 41, size: 384, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !911, file: !78, line: 42, baseType: !82, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !911, file: !78, line: 43, baseType: !84, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !911, file: !78, line: 44, baseType: !36, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "threads_socket", scope: !911, file: !78, line: 45, baseType: !36, size: 32, offset: 160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "writer_tid", scope: !911, file: !78, line: 46, baseType: !91, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_threads", scope: !911, file: !78, line: 47, baseType: !94, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !911, file: !78, line: 48, baseType: !27, size: 16, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !905, file: !555, line: 26, baseType: !36, size: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "write_sock", scope: !905, file: !555, line: 27, baseType: !36, size: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !905, file: !555, line: 28, baseType: !38, size: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "transaction", scope: !905, file: !555, line: 29, baseType: !575, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "ydynabin_t", file: !597, line: 45, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ydynabin_s", file: !597, line: 37, size: 256, elements: !927)
!927 = !{!928, !929, !930, !931}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !926, file: !597, line: 38, baseType: !40, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !926, file: !597, line: 39, baseType: !28, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !926, file: !597, line: 40, baseType: !28, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !926, file: !597, line: 41, baseType: !28, size: 64, offset: 192)
!932 = !{!933, !934, !935, !936, !937, !938, !940, !941, !942, !943, !960, !961}
!933 = !DILocalVariable(name: "thread", arg: 1, scope: !900, file: !100, line: 11, type: !903)
!934 = !DILocalVariable(name: "sync", arg: 2, scope: !900, file: !100, line: 11, type: !82)
!935 = !DILocalVariable(name: "compress", arg: 3, scope: !900, file: !100, line: 11, type: !82)
!936 = !DILocalVariable(name: "serialized", arg: 4, scope: !900, file: !100, line: 11, type: !82)
!937 = !DILocalVariable(name: "buff", arg: 5, scope: !900, file: !100, line: 11, type: !924)
!938 = !DILocalVariable(name: "pkey_len", scope: !900, file: !100, line: 12, type: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!940 = !DILocalVariable(name: "key_len", scope: !900, file: !100, line: 12, type: !729)
!941 = !DILocalVariable(name: "ptr", scope: !900, file: !100, line: 13, type: !40)
!942 = !DILocalVariable(name: "key", scope: !900, file: !100, line: 13, type: !40)
!943 = !DILocalVariable(name: "msg", scope: !900, file: !100, line: 14, type: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "writer_msg_t", file: !631, line: 34, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "writer_msg_s", file: !631, line: 28, size: 448, elements: !947)
!947 = !{!948, !950, !951, !958, !959}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !946, file: !631, line: 29, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "writer_action_t", file: !631, line: 17, baseType: !630)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !946, file: !631, line: 30, baseType: !38, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !946, file: !631, line: 31, baseType: !952, size: 128, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybin_t", file: !953, line: 33, baseType: !954)
!953 = !DIFile(filename: "../../lib/ylib/ybin.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "7abd7d5e6afd31e8416cab6f0a6bf3b3")
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ybin_s", file: !953, line: 27, size: 128, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !954, file: !953, line: 28, baseType: !40, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !954, file: !953, line: 29, baseType: !28, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !946, file: !631, line: 32, baseType: !952, size: 128, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "create_only", scope: !946, file: !631, line: 33, baseType: !82, size: 32, offset: 384)
!960 = !DILocalVariable(name: "answer", scope: !900, file: !100, line: 15, type: !39)
!961 = !DILabel(scope: !900, name: "error", file: !100, line: 65)
!962 = !DILocation(line: 0, scope: !900)
!963 = !DILocation(line: 14, column: 2, scope: !900)
!964 = !DILocation(line: 17, column: 2, scope: !900)
!965 = !DILocation(line: 19, column: 6, scope: !966)
!966 = distinct !DILexicalBlock(scope: !900, file: !100, line: 19, column: 6)
!967 = !DILocation(line: 19, column: 58, scope: !966)
!968 = !DILocation(line: 19, column: 6, scope: !900)
!969 = !DILocation(line: 21, column: 13, scope: !900)
!970 = !DILocation(line: 22, column: 12, scope: !900)
!971 = !{!972, !972, i64 0}
!972 = !{!"short", !790, i64 0}
!973 = !DILocation(line: 24, column: 41, scope: !974)
!974 = distinct !DILexicalBlock(scope: !900, file: !100, line: 24, column: 6)
!975 = !DILocation(line: 24, column: 6, scope: !974)
!976 = !DILocation(line: 24, column: 58, scope: !974)
!977 = !DILocation(line: 24, column: 6, scope: !900)
!978 = !DILocation(line: 26, column: 8, scope: !900)
!979 = !DILocation(line: 27, column: 13, scope: !980)
!980 = distinct !DILexicalBlock(scope: !900, file: !100, line: 27, column: 6)
!981 = !DILocation(line: 27, column: 39, scope: !980)
!982 = !DILocation(line: 27, column: 6, scope: !900)
!983 = !DILocation(line: 29, column: 2, scope: !900)
!984 = !DILocation(line: 31, column: 7, scope: !985)
!985 = distinct !DILexicalBlock(scope: !900, file: !100, line: 31, column: 6)
!986 = !DILocation(line: 31, column: 6, scope: !900)
!987 = !DILocation(line: 33, column: 3, scope: !988)
!988 = distinct !DILexicalBlock(scope: !985, file: !100, line: 31, column: 13)
!989 = !DILocation(line: 34, column: 2, scope: !988)
!990 = !DILocation(line: 37, column: 13, scope: !991)
!991 = distinct !DILexicalBlock(scope: !900, file: !100, line: 37, column: 6)
!992 = !DILocation(line: 37, column: 11, scope: !991)
!993 = !DILocation(line: 37, column: 44, scope: !991)
!994 = !DILocation(line: 37, column: 6, scope: !900)
!995 = !DILocation(line: 39, column: 12, scope: !900)
!996 = !{!997, !790, i64 0}
!997 = !{!"writer_msg_s", !790, i64 0, !789, i64 8, !998, i64 16, !998, i64 32, !790, i64 48}
!998 = !{!"ybin_s", !789, i64 0, !999, i64 8}
!999 = !{!"long", !790, i64 0}
!1000 = !DILocation(line: 40, column: 17, scope: !900)
!1001 = !DILocation(line: 40, column: 2, scope: !900)
!1002 = !DILocation(line: 41, column: 6, scope: !900)
!1003 = !DILocation(line: 42, column: 25, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !100, line: 41, column: 13)
!1005 = distinct !DILexicalBlock(scope: !900, file: !100, line: 41, column: 6)
!1006 = !{!1007, !789, i64 24}
!1007 = !{!"tcp_thread_s", !999, i64 0, !789, i64 8, !1008, i64 16, !1008, i64 20, !789, i64 24, !789, i64 32}
!1008 = !{!"int", !790, i64 0}
!1009 = !DILocation(line: 42, column: 17, scope: !1004)
!1010 = !DILocation(line: 42, column: 34, scope: !1004)
!1011 = !DILocation(line: 42, column: 8, scope: !1004)
!1012 = !DILocation(line: 42, column: 15, scope: !1004)
!1013 = !{!997, !789, i64 8}
!1014 = !DILocation(line: 44, column: 23, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1004, file: !100, line: 44, column: 7)
!1016 = !{!1007, !1008, i64 20}
!1017 = !DILocation(line: 44, column: 7, scope: !1015)
!1018 = !DILocation(line: 44, column: 57, scope: !1015)
!1019 = !DILocation(line: 44, column: 7, scope: !1004)
!1020 = !DILocation(line: 45, column: 4, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1015, file: !100, line: 44, column: 62)
!1022 = !DILocation(line: 46, column: 4, scope: !1021)
!1023 = !DILocation(line: 51, column: 27, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !900, file: !100, line: 51, column: 6)
!1025 = !{!1007, !789, i64 8}
!1026 = !DILocation(line: 51, column: 35, scope: !1024)
!1027 = !{!1028, !789, i64 8}
!1028 = !{!"finedb_s", !790, i64 0, !789, i64 8, !1008, i64 16, !1008, i64 20, !999, i64 24, !789, i64 32, !972, i64 40}
!1029 = !DILocation(line: 51, column: 53, scope: !1024)
!1030 = !{!1007, !789, i64 32}
!1031 = !DILocation(line: 51, column: 74, scope: !1024)
!1032 = !DILocation(line: 51, column: 6, scope: !1024)
!1033 = !DILocation(line: 51, column: 93, scope: !1024)
!1034 = !DILocation(line: 51, column: 6, scope: !900)
!1035 = !DILocation(line: 52, column: 3, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1024, file: !100, line: 51, column: 105)
!1037 = !DILocation(line: 54, column: 2, scope: !1036)
!1038 = !DILocation(line: 55, column: 3, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1024, file: !100, line: 54, column: 9)
!1040 = !DILocation(line: 58, column: 2, scope: !900)
!1041 = !DILocation(line: 59, column: 2, scope: !900)
!1042 = !DILocation(line: 60, column: 2, scope: !900)
!1043 = !DILocation(line: 63, column: 10, scope: !900)
!1044 = !DILocation(line: 63, column: 2, scope: !900)
!1045 = !DILocation(line: 65, column: 1, scope: !900)
!1046 = !DILocation(line: 66, column: 2, scope: !900)
!1047 = !DILocation(line: 68, column: 2, scope: !900)
!1048 = !DILocation(line: 67, column: 2, scope: !900)
!1049 = !DILocation(line: 69, column: 2, scope: !900)
!1050 = !DILocation(line: 70, column: 2, scope: !900)
!1051 = !DILocation(line: 71, column: 1, scope: !900)
!1052 = !DISubprogram(name: "ydynabin_forward", scope: !597, file: !597, line: 82, type: !1053, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!40, !924, !28}
!1055 = !DISubprogram(name: "calloc", scope: !808, file: !808, line: 543, type: !1056, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!40, !28, !28}
!1058 = !DISubprogram(name: "ybin_set", scope: !953, file: !953, line: 46, type: !1059, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1061, !1061, !40, !28}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!1062 = !DISubprogram(name: "nn_send", scope: !1063, file: !1063, line: 248, type: !1064, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1063 = !DIFile(filename: "../../include/nanomsg/nn.h", directory: "/home/raj/FineDB/src/server", checksumkind: CSK_MD5, checksum: "0c95956590725e5a1eedd7f7b192cc23")
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!36, !36, !1066, !28, !36}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1068 = !DISubprogram(name: "free", scope: !808, file: !808, line: 555, type: !1069, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !40}
!1071 = distinct !DISubprogram(name: "server_create_listening_socket", scope: !143, file: !143, line: 16, type: !1072, scopeLine: 16, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !639, retainedNodes: !1075)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!593, !1074, !27}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!1075 = !{!1076, !1077, !1078, !1092, !1093}
!1076 = !DILocalVariable(name: "psock", arg: 1, scope: !1071, file: !143, line: 16, type: !1074)
!1077 = !DILocalVariable(name: "port", arg: 2, scope: !1071, file: !143, line: 16, type: !27)
!1078 = !DILocalVariable(name: "addr", scope: !1071, file: !143, line: 17, type: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !655, line: 245, size: 128, elements: !1080)
!1080 = !{!1081, !1082, !1084, !1088}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !1079, file: !655, line: 247, baseType: !661, size: 16)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !1079, file: !655, line: 248, baseType: !1083, size: 16, offset: 16)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !655, line: 123, baseType: !729)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1079, file: !655, line: 249, baseType: !1085, size: 32, offset: 32)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !655, line: 31, size: 32, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1085, file: !655, line: 33, baseType: !654, size: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !1079, file: !655, line: 252, baseType: !1089, size: 64, offset: 64)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 64, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 8)
!1092 = !DILocalVariable(name: "addr_size", scope: !1071, file: !143, line: 18, type: !7)
!1093 = !DILocalVariable(name: "on", scope: !1071, file: !143, line: 19, type: !1094)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!1095 = !DILocation(line: 0, scope: !1071)
!1096 = !DILocation(line: 17, column: 2, scope: !1071)
!1097 = !DILocation(line: 17, column: 21, scope: !1071)
!1098 = !DILocation(line: 19, column: 2, scope: !1071)
!1099 = !DILocation(line: 19, column: 12, scope: !1071)
!1100 = !{!1008, !1008, i64 0}
!1101 = !DILocation(line: 22, column: 16, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1071, file: !143, line: 22, column: 6)
!1103 = !DILocation(line: 22, column: 14, scope: !1102)
!1104 = !DILocation(line: 22, column: 49, scope: !1102)
!1105 = !DILocation(line: 22, column: 6, scope: !1071)
!1106 = !DILocation(line: 23, column: 3, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1102, file: !143, line: 22, column: 54)
!1108 = !DILocation(line: 24, column: 3, scope: !1107)
!1109 = !DILocation(line: 27, column: 6, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1071, file: !143, line: 27, column: 6)
!1111 = !DILocation(line: 28, column: 29, scope: !1110)
!1112 = !DILocation(line: 27, column: 6, scope: !1071)
!1113 = !DILocation(line: 29, column: 3, scope: !1110)
!1114 = !DILocation(line: 30, column: 17, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1071, file: !143, line: 30, column: 6)
!1116 = !DILocation(line: 30, column: 6, scope: !1115)
!1117 = !DILocation(line: 31, column: 29, scope: !1115)
!1118 = !DILocation(line: 30, column: 6, scope: !1071)
!1119 = !DILocation(line: 32, column: 3, scope: !1115)
!1120 = !DILocation(line: 36, column: 23, scope: !1071)
!1121 = !DILocation(line: 37, column: 18, scope: !1071)
!1122 = !{!1123, !972, i64 0}
!1123 = !{!"sockaddr_in", !972, i64 0, !972, i64 2, !1124, i64 4, !790, i64 8}
!1124 = !{!"in_addr", !1008, i64 0}
!1125 = !DILocation(line: 38, column: 7, scope: !1071)
!1126 = !DILocation(line: 38, column: 16, scope: !1071)
!1127 = !{!1123, !972, i64 2}
!1128 = !DILocation(line: 39, column: 11, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1071, file: !143, line: 39, column: 6)
!1130 = !DILocation(line: 39, column: 6, scope: !1129)
!1131 = !DILocation(line: 39, column: 55, scope: !1129)
!1132 = !DILocation(line: 39, column: 6, scope: !1071)
!1133 = !DILocation(line: 40, column: 3, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1129, file: !143, line: 39, column: 60)
!1135 = !DILocation(line: 41, column: 3, scope: !1134)
!1136 = !DILocation(line: 43, column: 13, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1071, file: !143, line: 43, column: 6)
!1138 = !DILocation(line: 43, column: 6, scope: !1137)
!1139 = !DILocation(line: 43, column: 6, scope: !1071)
!1140 = !DILocation(line: 44, column: 3, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !143, line: 43, column: 33)
!1142 = !DILocation(line: 45, column: 3, scope: !1141)
!1143 = !DILocation(line: 48, column: 1, scope: !1071)
!1144 = !DISubprogram(name: "socket", scope: !530, file: !530, line: 102, type: !1145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!36, !36, !36, !36}
!1147 = !DISubprogram(name: "setsockopt", scope: !530, file: !530, line: 277, type: !1148, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!36, !36, !36, !36, !1066, !1150}
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !1151, line: 274, baseType: !1152)
!1151 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !582, line: 210, baseType: !7)
!1153 = !DISubprogram(name: "bind", scope: !530, file: !530, line: 112, type: !1154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !867)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!36, !36, !1156, !1150}
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__CONST_SOCKADDR_ARG", file: !530, line: 84, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !530, line: 83, size: 64, elements: !1158)
!1158 = !{!1159, !1163, !1168, !1173, !1178, !1183, !1187, !1213, !1218, !1223, !1228, !1233, !1238}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr__", scope: !1157, file: !530, line: 83, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_at__", scope: !1157, file: !530, line: 83, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1165)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1167)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_at", file: !530, line: 79, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_ax25__", scope: !1157, file: !530, line: 83, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ax25", file: !530, line: 79, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_dl__", scope: !1157, file: !530, line: 83, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_dl", file: !530, line: 79, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_eon__", scope: !1157, file: !530, line: 83, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_eon", file: !530, line: 79, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_in__", scope: !1157, file: !530, line: 83, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1185)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "__sockaddr_in6__", scope: !1157, file: !530, line: 83, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !655, line: 260, size: 224, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1212}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !1191, file: !655, line: 262, baseType: !661, size: 16)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !1191, file: !655, line: 263, baseType: !1083, size: 16, offset: 16)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !1191, file: !655, line: 264, baseType: !583, size: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1191, file: !655, line: 265, baseType: !1197, size: 128, offset: 64)
