; ModuleID = '/home/raj/lwan/freegeoip/freegeoip.c'
source_filename = "/home/raj/lwan/freegeoip/freegeoip.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lwan_var_descriptor_t_ = type { ptr, i64, ptr, ptr, ptr, ptr }
%struct.lwan_serve_files_settings_t = type { ptr, ptr, i8 }
%struct.lwan_t_ = type { %struct.lwan_trie_t_, ptr, %struct.anon.0, ptr, %struct.lwan_config_t_, i32 }
%struct.lwan_trie_t_ = type { ptr, ptr }
%struct.anon.0 = type { ptr, i32, i16 }
%struct.lwan_config_t_ = type { ptr, i16, i8, i8, i32, i16 }
%struct.lwan_url_map_t_ = type { ptr, ptr, ptr, i64, i32, ptr, ptr, %struct.anon.6 }
%struct.anon.6 = type { ptr, ptr }
%struct.in_addr = type { i32 }
%struct.ip_info_t = type { %struct.cache_entry_t, %struct.anon.7, %struct.anon.7, %struct.anon.8, double, double, %struct.anon.9, ptr, ptr }
%struct.cache_entry_t = type { %struct.list_node, ptr, i32, i32, i64 }
%struct.list_node = type { ptr, ptr }
%struct.anon.7 = type { ptr, ptr }
%struct.anon.8 = type { ptr, ptr }
%struct.anon.9 = type { ptr, ptr }
%struct.query_limit_t = type { %struct.cache_entry_t, i32 }
%struct.lwan_response_t_ = type { ptr, ptr, i64, ptr, %struct.anon.5 }
%struct.anon.5 = type { ptr, ptr, ptr }
%struct.ip_net_t = type { %union.ip_to_octet, %union.ip_to_octet }
%union.ip_to_octet = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "json_template_str", scope: !2, file: !83, line: 71, type: !341, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !114, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/raj/lwan/freegeoip/freegeoip.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "561ad2ff5308a7ee192b72afbd6bde90")
!4 = !{!5, !15, !34, !46}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 158, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "common/lwan.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "56f65bbbfce1c5452d6905964ca2b84f")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "CONN_MASK", value: -1)
!10 = !DIEnumerator(name: "CONN_KEEP_ALIVE", value: 1)
!11 = !DIEnumerator(name: "CONN_IS_ALIVE", value: 2)
!12 = !DIEnumerator(name: "CONN_SHOULD_RESUME_CORO", value: 4)
!13 = !DIEnumerator(name: "CONN_WRITE_EVENTS", value: 8)
!14 = !DIEnumerator(name: "CONN_MUST_READ", value: 16)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 114, baseType: !16, size: 32, elements: !17)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!18 = !DIEnumerator(name: "HTTP_OK", value: 200)
!19 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!20 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!21 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!22 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!23 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!24 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!25 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!26 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!27 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!28 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!29 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!30 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!31 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!32 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!33 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 145, baseType: !7, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!36 = !DIEnumerator(name: "REQUEST_ALL_FLAGS", value: -1)
!37 = !DIEnumerator(name: "REQUEST_METHOD_GET", value: 1)
!38 = !DIEnumerator(name: "REQUEST_METHOD_HEAD", value: 2)
!39 = !DIEnumerator(name: "REQUEST_METHOD_POST", value: 4)
!40 = !DIEnumerator(name: "REQUEST_ACCEPT_DEFLATE", value: 8)
!41 = !DIEnumerator(name: "REQUEST_ACCEPT_GZIP", value: 16)
!42 = !DIEnumerator(name: "REQUEST_IS_HTTP_1_0", value: 32)
!43 = !DIEnumerator(name: "RESPONSE_SENT_HEADERS", value: 64)
!44 = !DIEnumerator(name: "RESPONSE_CHUNKED_ENCODING", value: 128)
!45 = !DIEnumerator(name: "RESPONSE_NO_CONTENT_LENGTH", value: 256)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 133, baseType: !16, size: 32, elements: !47)
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55}
!48 = !DIEnumerator(name: "HANDLER_PARSE_QUERY_STRING", value: 1)
!49 = !DIEnumerator(name: "HANDLER_PARSE_IF_MODIFIED_SINCE", value: 2)
!50 = !DIEnumerator(name: "HANDLER_PARSE_RANGE", value: 4)
!51 = !DIEnumerator(name: "HANDLER_PARSE_ACCEPT_ENCODING", value: 8)
!52 = !DIEnumerator(name: "HANDLER_PARSE_POST_DATA", value: 16)
!53 = !DIEnumerator(name: "HANDLER_MUST_AUTHORIZE", value: 32)
!54 = !DIEnumerator(name: "HANDLER_REMOVE_LEADING_SLASH", value: 64)
!55 = !DIEnumerator(name: "HANDLER_PARSE_MASK", value: 31)
!56 = !{!57, !58, !59, !71, !81, !109}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_handler_flags_t", file: !6, line: 143, baseType: !46)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_entry_t", file: !61, line: 27, size: 320, elements: !62)
!61 = !DIFile(filename: "common/lwan-cache.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "f48e19cadb0735f737f22aa65af51f83")
!62 = !{!63, !70, !73, !74, !75}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !60, file: !61, line: 28, baseType: !64, size: 128)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !65, line: 191, size: 128, elements: !66)
!65 = !DIFile(filename: "common/list.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "c0dffb77b1bbbbb179ef8d69b9e1dd8c")
!66 = !{!67, !69}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !65, line: 193, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !64, file: !65, line: 193, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !60, file: !61, line: 29, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !60, file: !61, line: 30, baseType: !16, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !60, file: !61, line: 31, baseType: !16, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !60, file: !61, line: 32, baseType: !76, size: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !77, line: 10, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !79, line: 160, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!80 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_info_t", file: !83, line: 37, size: 1088, elements: !84)
!83 = !DIFile(filename: "freegeoip/freegeoip.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "561ad2ff5308a7ee192b72afbd6bde90")
!84 = !{!85, !86, !91, !92, !97, !99, !100, !105, !106}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !82, file: !83, line: 38, baseType: !60, size: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "country", scope: !82, file: !83, line: 42, baseType: !87, size: 128, offset: 320)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !83, line: 39, size: 128, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !87, file: !83, line: 40, baseType: !71, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !83, line: 41, baseType: !71, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !82, file: !83, line: 42, baseType: !87, size: 128, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "city", scope: !82, file: !83, line: 46, baseType: !93, size: 128, offset: 576)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !83, line: 43, size: 128, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !83, line: 44, baseType: !71, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "zip_code", scope: !93, file: !83, line: 45, baseType: !71, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "latitude", scope: !82, file: !83, line: 47, baseType: !98, size: 64, offset: 704)
!98 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "longitude", scope: !82, file: !83, line: 47, baseType: !98, size: 64, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "metro", scope: !82, file: !83, line: 50, baseType: !101, size: 128, offset: 832)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !83, line: 48, size: 128, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !101, file: !83, line: 49, baseType: !71, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !101, file: !83, line: 49, baseType: !71, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !82, file: !83, line: 51, baseType: !71, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !82, file: !83, line: 52, baseType: !107, size: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "query_limit_t", file: !83, line: 174, size: 384, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !110, file: !83, line: 175, baseType: !60, size: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !110, file: !83, line: 176, baseType: !16, size: 32, offset: 320)
!114 = !{!115, !120, !125, !130, !135, !137, !142, !147, !152, !157, !162, !164, !169, !174, !0, !178, !183, !185, !190, !192, !197, !202, !204, !206, !211, !213, !218, !220, !273, !278, !283, !285, !290, !292, !298, !300, !302, !325, !330, !332, !334, !336}
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !83, line: 403, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 296, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 37)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !83, line: 403, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 40, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 5)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !83, line: 403, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 32)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !83, line: 406, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 248, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 31)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !83, line: 409, type: !132, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !83, line: 411, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 136, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 17)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !83, line: 414, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 224, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 28)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !83, line: 419, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 344, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 43)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !83, line: 428, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 56, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 7)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !83, line: 429, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 48, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 6)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !83, line: 430, type: !159, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !83, line: 431, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 16, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 2)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !83, line: 431, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 72, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 9)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "query_limit", scope: !2, file: !83, line: 179, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "cache_t", file: !61, line: 40, flags: DIFlagFwdDecl)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !83, line: 56, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 104, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 13)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !83, line: 57, type: !180, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !83, line: 58, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 96, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 12)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !83, line: 59, type: !187, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(scope: null, file: !83, line: 60, type: !194, isLocal: true, isDefinition: true)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 80, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 10)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !83, line: 61, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 112, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 14)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !83, line: 62, type: !171, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !83, line: 63, type: !194, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !83, line: 64, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 88, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 11)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !83, line: 65, type: !208, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !83, line: 66, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 24, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 3)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !83, line: 67, type: !171, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "template_descriptor", scope: !2, file: !83, line: 55, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 4992, elements: !181)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_var_descriptor_t", file: !225, line: 26, baseType: !226)
!225 = !DIFile(filename: "common/lwan-template.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1f1d0e1deded933cc0657e991f0859fe")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_var_descriptor_t_", file: !225, line: 30, size: 384, elements: !227)
!227 = !{!228, !229, !234, !257, !262, !271}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !225, line: 31, baseType: !107, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !226, file: !225, line: 32, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !232, line: 85, baseType: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 152, baseType: !80)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "append_to_strbuf", scope: !226, file: !225, line: 34, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !238, !57}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !240, line: 25, baseType: !241)
!240 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !240, line: 27, size: 256, elements: !242)
!242 = !{!243, !248, !256}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !240, line: 31, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 28, size: 64, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !244, file: !240, line: 29, baseType: !71, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !244, file: !240, line: 30, baseType: !107, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !241, file: !240, line: 34, baseType: !249, size: 128, offset: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !241, file: !240, line: 32, size: 128, elements: !250)
!250 = !{!251, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !249, file: !240, line: 33, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 46, baseType: !254)
!253 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!254 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !249, file: !240, line: 33, baseType: !252, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !241, file: !240, line: 35, baseType: !16, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "get_is_empty", scope: !226, file: !225, line: 35, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !57}
!261 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !226, file: !225, line: 37, baseType: !263, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_list_generator_t", file: !225, line: 28, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!7, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !269, line: 34, baseType: !270)
!269 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !269, line: 34, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "list_desc", scope: !226, file: !225, line: 38, baseType: !272, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "json_template", scope: !2, file: !83, line: 183, type: !275, isLocal: true, isDefinition: true)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_t", file: !225, line: 25, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_tpl_t_", file: !225, line: 25, flags: DIFlagFwdDecl)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "xml_template_str", scope: !2, file: !83, line: 88, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 3552, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 444)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "xml_template", scope: !2, file: !83, line: 184, type: !275, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "csv_template_str", scope: !2, file: !83, line: 104, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1472, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 184)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "csv_template", scope: !2, file: !83, line: 185, type: !275, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "db", scope: !2, file: !83, line: 187, type: !294, isLocal: true, isDefinition: true)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3", file: !296, line: 272, baseType: !297)
!296 = !DIFile(filename: "/usr/include/sqlite3.h", directory: "", checksumkind: CSK_MD5, checksum: "a588c4681dc2c3e9f3424818d7f39d50")
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", file: !296, line: 272, flags: DIFlagFwdDecl)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !83, line: 253, type: !215, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !83, line: 254, type: !171, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "reserved_ips", scope: !2, file: !83, line: 151, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1024, elements: !323)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_net_t", file: !83, line: 142, size: 64, elements: !307)
!307 = !{!308, !322}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !306, file: !83, line: 143, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ip_to_octet", file: !83, line: 137, size: 32, elements: !310)
!310 = !{!311, !316}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "octet", scope: !309, file: !83, line: 138, baseType: !312, size: 32)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 32, elements: !314)
!313 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!314 = !{!315}
!315 = !DISubrange(count: 4)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !309, file: !83, line: 139, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !318, line: 30, baseType: !319)
!318 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !320, line: 26, baseType: !321)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !79, line: 42, baseType: !16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !306, file: !83, line: 144, baseType: !309, size: 32, offset: 32)
!323 = !{!324}
!324 = !DISubrange(count: 16)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "ip_to_city_query", scope: !2, file: !83, line: 118, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 5248, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 656)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "cache", scope: !2, file: !83, line: 186, type: !176, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !83, line: 378, type: !127, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !83, line: 380, type: !132, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !83, line: 382, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 208, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 26)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 3024, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 378)
!344 = !{i32 7, !"Dwarf Version", i32 5}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = !{i32 1, !"wchar_size", i32 4}
!347 = !{i32 8, !"PIC Level", i32 2}
!348 = !{i32 7, !"PIE Level", i32 2}
!349 = !{i32 7, !"uwtable", i32 2}
!350 = !{i32 7, !"frame-pointer", i32 2}
!351 = !{!"clang version 16.0.0"}
!352 = distinct !DISubprogram(name: "main", scope: !83, file: !83, line: 395, type: !353, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{!7}
!355 = !{}
!356 = !DILocalVariable(name: "l", scope: !352, file: !83, line: 397, type: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !6, line: 103, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !6, line: 275, size: 640, elements: !359)
!359 = !{!360, !387, !420, !427, !431, !441}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !358, file: !6, line: 276, baseType: !361, size: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !362, line: 25, baseType: !363)
!362 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !362, line: 41, size: 128, elements: !364)
!364 = !{!365, !383}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !363, file: !362, line: 42, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !362, line: 26, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !362, line: 29, size: 640, elements: !369)
!369 = !{!370, !374, !382}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !362, line: 30, baseType: !371, size: 512)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 512, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 8)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !368, file: !362, line: 31, baseType: !375, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !362, line: 27, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !362, line: 35, size: 192, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !377, file: !362, line: 36, baseType: !71, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !377, file: !362, line: 37, baseType: !57, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !362, line: 38, baseType: !375, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !368, file: !362, line: 32, baseType: !7, size: 32, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !363, file: !362, line: 43, baseType: !384, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !57}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !358, file: !6, line: 277, baseType: !388, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !6, line: 112, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !6, line: 196, size: 256, elements: !391)
!391 = !{!392, !394, !395, !396, !418, !419}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !6, line: 199, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !6, line: 165, baseType: !5)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !390, file: !6, line: 200, baseType: !16, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !390, file: !6, line: 201, baseType: !267, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !390, file: !6, line: 202, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !6, line: 108, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !6, line: 253, size: 832, elements: !400)
!400 = !{!401, !403, !412, !413, !415}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !399, file: !6, line: 254, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !399, file: !6, line: 259, baseType: !404, size: 576, offset: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !6, line: 255, size: 576, elements: !405)
!405 = !{!406, !410, !411}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !404, file: !6, line: 256, baseType: !407, size: 240)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 240, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 30)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !404, file: !6, line: 257, baseType: !407, size: 240, offset: 240)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !404, file: !6, line: 258, baseType: !76, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !399, file: !6, line: 261, baseType: !7, size: 32, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !399, file: !6, line: 262, baseType: !414, size: 64, offset: 672)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !167)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !399, file: !6, line: 263, baseType: !416, size: 64, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !417, line: 27, baseType: !254)
!417 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !6, line: 203, baseType: !7, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !390, file: !6, line: 203, baseType: !7, size: 32, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !358, file: !6, line: 283, baseType: !421, size: 128, offset: 192)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !6, line: 279, size: 128, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !421, file: !6, line: 280, baseType: !397, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !421, file: !6, line: 281, baseType: !16, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !421, file: !6, line: 282, baseType: !426, size: 16, offset: 96)
!426 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !358, file: !6, line: 285, baseType: !428, size: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !430, line: 6, flags: DIFlagFwdDecl)
!430 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !358, file: !6, line: 286, baseType: !432, size: 192, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !6, line: 111, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !6, line: 266, size: 192, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !433, file: !6, line: 267, baseType: !71, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !433, file: !6, line: 268, baseType: !426, size: 16, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !433, file: !6, line: 269, baseType: !261, size: 8, offset: 80)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !433, file: !6, line: 270, baseType: !261, size: 8, offset: 88)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !433, file: !6, line: 271, baseType: !16, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !433, file: !6, line: 272, baseType: !426, size: 16, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !358, file: !6, line: 287, baseType: !7, size: 32, offset: 576)
!442 = !DILocation(line: 397, column: 12, scope: !352)
!443 = !DILocation(line: 399, column: 5, scope: !352)
!444 = !DILocation(line: 401, column: 21, scope: !352)
!445 = !DILocation(line: 401, column: 19, scope: !352)
!446 = !DILocation(line: 402, column: 10, scope: !447)
!447 = distinct !DILexicalBlock(scope: !352, file: !83, line: 402, column: 9)
!448 = !DILocation(line: 402, column: 9, scope: !352)
!449 = !DILocation(line: 403, column: 9, scope: !447)
!450 = !DILocation(line: 404, column: 20, scope: !352)
!451 = !DILocation(line: 404, column: 18, scope: !352)
!452 = !DILocation(line: 405, column: 10, scope: !453)
!453 = distinct !DILexicalBlock(scope: !352, file: !83, line: 405, column: 9)
!454 = !DILocation(line: 405, column: 9, scope: !352)
!455 = !DILocation(line: 406, column: 9, scope: !453)
!456 = !DILocation(line: 407, column: 20, scope: !352)
!457 = !DILocation(line: 407, column: 18, scope: !352)
!458 = !DILocation(line: 408, column: 10, scope: !459)
!459 = distinct !DILexicalBlock(scope: !352, file: !83, line: 408, column: 9)
!460 = !DILocation(line: 408, column: 9, scope: !352)
!461 = !DILocation(line: 409, column: 9, scope: !459)
!462 = !DILocalVariable(name: "result", scope: !352, file: !83, line: 411, type: !7)
!463 = !DILocation(line: 411, column: 9, scope: !352)
!464 = !DILocation(line: 411, column: 18, scope: !352)
!465 = !DILocation(line: 413, column: 9, scope: !466)
!466 = distinct !DILexicalBlock(scope: !352, file: !83, line: 413, column: 9)
!467 = !DILocation(line: 413, column: 16, scope: !466)
!468 = !DILocation(line: 413, column: 9, scope: !352)
!469 = !DILocation(line: 414, column: 9, scope: !466)
!470 = !DILocation(line: 416, column: 13, scope: !352)
!471 = !DILocation(line: 416, column: 11, scope: !352)
!472 = !DILocation(line: 419, column: 5, scope: !352)
!473 = !DILocation(line: 421, column: 19, scope: !352)
!474 = !DILocation(line: 421, column: 17, scope: !352)
!475 = !DILocalVariable(name: "default_map", scope: !352, file: !83, line: 427, type: !476)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 2880, elements: !123)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_url_map_t", file: !6, line: 109, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_url_map_t_", file: !6, line: 236, size: 576, elements: !480)
!480 = !{!481, !540, !541, !542, !543, !544, !564, !565}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !479, file: !6, line: 237, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !486, !539, !57}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !6, line: 131, baseType: !15)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !6, line: 106, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !6, line: 206, size: 1280, elements: !489)
!489 = !{!490, !492, !493, !499, !500, !501, !512, !513, !522}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !488, file: !6, line: 207, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !6, line: 156, baseType: !34)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !488, file: !6, line: 208, baseType: !7, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !488, file: !6, line: 209, baseType: !494, size: 128, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !6, line: 110, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !6, line: 191, size: 128, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !495, file: !6, line: 192, baseType: !71, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !495, file: !6, line: 193, baseType: !252, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !488, file: !6, line: 210, baseType: !494, size: 128, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !488, file: !6, line: 211, baseType: !388, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !488, file: !6, line: 216, baseType: !502, size: 128, offset: 384)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !6, line: 213, size: 128, elements: !503)
!503 = !{!504, !511}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !502, file: !6, line: 214, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !6, line: 105, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !6, line: 173, size: 128, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !507, file: !6, line: 174, baseType: !71, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !507, file: !6, line: 175, baseType: !71, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !502, file: !6, line: 215, baseType: !252, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !488, file: !6, line: 216, baseType: !502, size: 128, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !488, file: !6, line: 223, baseType: !514, size: 192, offset: 640)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !6, line: 217, size: 192, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !514, file: !6, line: 218, baseType: !76, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !514, file: !6, line: 222, baseType: !518, size: 128, offset: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !6, line: 219, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !518, file: !6, line: 220, baseType: !231, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !518, file: !6, line: 221, baseType: !231, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !488, file: !6, line: 224, baseType: !523, size: 448, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !6, line: 107, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !6, line: 178, size: 448, elements: !525)
!525 = !{!526, !527, !528, !529, !530}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !524, file: !6, line: 179, baseType: !238, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !524, file: !6, line: 180, baseType: !107, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !524, file: !6, line: 181, baseType: !252, size: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !524, file: !6, line: 182, baseType: !505, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !524, file: !6, line: 188, baseType: !531, size: 192, offset: 256)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !524, file: !6, line: 184, size: 192, elements: !532)
!532 = !{!533, !537, !538}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !531, file: !6, line: 185, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!485, !486, !57}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !531, file: !6, line: 186, baseType: !57, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !531, file: !6, line: 187, baseType: !57, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !6, line: 238, baseType: !57, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !479, file: !6, line: 240, baseType: !107, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_len", scope: !479, file: !6, line: 241, baseType: !252, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !479, file: !6, line: 242, baseType: !58, size: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !479, file: !6, line: 244, baseType: !545, size: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_module_t", file: !6, line: 104, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_module_t_", file: !6, line: 227, size: 384, elements: !549)
!549 = !{!550, !551, !555, !561, !562, !563}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !548, file: !6, line: 228, baseType: !107, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !548, file: !6, line: 229, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!57, !57}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init_from_hash", scope: !548, file: !6, line: 230, baseType: !556, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!57, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !548, file: !6, line: 231, baseType: !384, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !548, file: !6, line: 232, baseType: !482, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !548, file: !6, line: 233, baseType: !58, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !479, file: !6, line: 245, baseType: !57, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !479, file: !6, line: 250, baseType: !566, size: 128, offset: 448)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !479, file: !6, line: 247, size: 128, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !566, file: !6, line: 248, baseType: !71, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "password_file", scope: !566, file: !6, line: 249, baseType: !71, size: 64, offset: 64)
!570 = !DILocation(line: 427, column: 26, scope: !352)
!571 = !DILocation(line: 427, column: 42, scope: !352)
!572 = !DILocation(line: 428, column: 9, scope: !352)
!573 = !DILocation(line: 428, column: 68, scope: !352)
!574 = !DILocation(line: 429, column: 9, scope: !352)
!575 = !DILocation(line: 429, column: 67, scope: !352)
!576 = !DILocation(line: 430, column: 9, scope: !352)
!577 = !DILocation(line: 430, column: 67, scope: !352)
!578 = !DILocation(line: 431, column: 9, scope: !352)
!579 = !DILocation(line: 431, column: 26, scope: !352)
!580 = !DILocation(line: 435, column: 26, scope: !352)
!581 = !DILocation(line: 435, column: 5, scope: !352)
!582 = !DILocation(line: 436, column: 5, scope: !352)
!583 = !DILocation(line: 437, column: 5, scope: !352)
!584 = !DILocation(line: 439, column: 19, scope: !352)
!585 = !DILocation(line: 439, column: 5, scope: !352)
!586 = !DILocation(line: 440, column: 19, scope: !352)
!587 = !DILocation(line: 440, column: 5, scope: !352)
!588 = !DILocation(line: 441, column: 19, scope: !352)
!589 = !DILocation(line: 441, column: 5, scope: !352)
!590 = !DILocation(line: 443, column: 19, scope: !352)
!591 = !DILocation(line: 443, column: 5, scope: !352)
!592 = !DILocation(line: 445, column: 19, scope: !352)
!593 = !DILocation(line: 445, column: 5, scope: !352)
!594 = !DILocation(line: 446, column: 19, scope: !352)
!595 = !DILocation(line: 446, column: 5, scope: !352)
!596 = !DILocation(line: 448, column: 5, scope: !352)
!597 = distinct !DISubprogram(name: "create_ipinfo", scope: !83, file: !83, line: 241, type: !598, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !355)
!598 = !DISubroutineType(types: !599)
!599 = !{!59, !107, !57}
!600 = !DILocalVariable(name: "key", arg: 1, scope: !597, file: !83, line: 241, type: !107)
!601 = !DILocation(line: 241, column: 27, scope: !597)
!602 = !DILocalVariable(name: "context", arg: 2, scope: !597, file: !83, line: 241, type: !57)
!603 = !DILocation(line: 241, column: 38, scope: !597)
!604 = !DILocalVariable(name: "stmt", scope: !597, file: !83, line: 243, type: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !296, line: 3892, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !296, line: 3892, flags: DIFlagFwdDecl)
!608 = !DILocation(line: 243, column: 19, scope: !597)
!609 = !DILocalVariable(name: "ip_info", scope: !597, file: !83, line: 244, type: !81)
!610 = !DILocation(line: 244, column: 23, scope: !597)
!611 = !DILocalVariable(name: "addr", scope: !597, file: !83, line: 245, type: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !318, line: 31, size: 32, elements: !613)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !612, file: !318, line: 33, baseType: !317, size: 32)
!615 = !DILocation(line: 245, column: 20, scope: !597)
!616 = !DILocation(line: 247, column: 9, scope: !617)
!617 = distinct !DILexicalBlock(scope: !597, file: !83, line: 247, column: 9)
!618 = !DILocation(line: 247, column: 9, scope: !597)
!619 = !DILocation(line: 248, column: 9, scope: !617)
!620 = !DILocation(line: 250, column: 29, scope: !621)
!621 = distinct !DILexicalBlock(scope: !597, file: !83, line: 250, column: 9)
!622 = !DILocation(line: 250, column: 9, scope: !621)
!623 = !DILocation(line: 250, column: 9, scope: !597)
!624 = !DILocation(line: 251, column: 19, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !83, line: 250, column: 38)
!626 = !DILocation(line: 251, column: 17, scope: !625)
!627 = !DILocation(line: 252, column: 13, scope: !628)
!628 = distinct !DILexicalBlock(scope: !625, file: !83, line: 252, column: 13)
