; ModuleID = './src/protocols/pair/xpair.c'
source_filename = "./src/protocols/pair/xpair.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_xpair = type { %struct.nn_sockbase, %struct.nn_excl }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_excl = type { ptr, ptr, ptr }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [29 x i8] c"./src/protocols/pair/xpair.c\00", align 1, !dbg !7
@nn_xpair_sockbase_vfptr = internal constant %struct.nn_sockbase_vfptr { ptr null, ptr @nn_xpair_destroy, ptr @nn_xpair_add, ptr @nn_xpair_rm, ptr @nn_xpair_in, ptr @nn_xpair_out, ptr @nn_xpair_events, ptr @nn_xpair_send, ptr @nn_xpair_recv, ptr @nn_xpair_setopt, ptr @nn_xpair_getopt }, align 8, !dbg !12
@nn_xpair_socktype_struct = internal global %struct.nn_socktype { i32 2, i32 16, i32 0, ptr @nn_xpair_create, ptr @nn_xpair_ispeer, %struct.nn_list_item { ptr inttoptr (i64 -1 to ptr), ptr inttoptr (i64 -1 to ptr) } }, align 8, !dbg !126
@nn_xpair_socktype = dso_local global ptr @nn_xpair_socktype_struct, align 8, !dbg !102


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/protocols/pair/xpair.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "0558ab8d0e92aed749264a086cc20791")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 29)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "nn_xpair_sockbase_vfptr", scope: !14, file: !2, line: 59, type: !26, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !15, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !16, globals: !101, splitDebugInlining: false, nameTableKind: None)
!15 = !DIFile(filename: "src/protocols/pair/xpair.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "0558ab8d0e92aed749264a086cc20791")
!16 = !{!17, !100}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xpair", file: !2, line: 36, size: 320, elements: !19)
!19 = !{!20, !93}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !18, file: !2, line: 37, baseType: !21, size: 128)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !22, line: 123, size: 128, elements: !23)
!22 = !DIFile(filename: "./src/protocols/pair/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!23 = !{!24, !90}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !21, file: !22, line: 124, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !22, line: 84, size: 704, elements: !28)
!28 = !{!29, !34, !35, !42, !46, !47, !48, !52, !74, !75, !84}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !27, file: !22, line: 87, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !27, file: !22, line: 90, baseType: !30, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !27, file: !22, line: 97, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !33, !40}
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !22, line: 56, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !27, file: !22, line: 98, baseType: !43, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !33, !40}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !27, file: !22, line: 99, baseType: !43, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !27, file: !22, line: 100, baseType: !43, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !27, file: !22, line: 104, baseType: !49, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!39, !33}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !27, file: !22, line: 108, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!39, !33, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !58, line: 30, size: 512, elements: !59)
!58 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!59 = !{!60, !73}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !57, file: !58, line: 33, baseType: !61, size: 256)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !62, line: 39, size: 256, elements: !63)
!62 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !61, file: !62, line: 40, baseType: !65, size: 256)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 256, elements: !71)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !67, line: 24, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !69, line: 38, baseType: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !{!72}
!72 = !DISubrange(count: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !57, file: !58, line: 36, baseType: !61, size: 256, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !27, file: !22, line: 112, baseType: !53, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !27, file: !22, line: 115, baseType: !76, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!39, !33, !39, !39, !79, !81}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !82, line: 46, baseType: !83)
!82 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!83 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !27, file: !22, line: 119, baseType: !85, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!39, !33, !39, !39, !88, !89}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !21, file: !22, line: 125, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !22, line: 125, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "excl", scope: !18, file: !2, line: 38, baseType: !94, size: 192, offset: 128)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_excl", file: !95, line: 33, size: 192, elements: !96)
!95 = !DIFile(filename: "./src/protocols/pair/../utils/excl.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f0be91890d61f5b1f69020e9c0441656")
!96 = !{!97, !98, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !94, file: !95, line: 37, baseType: !40, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "inpipe", scope: !94, file: !95, line: 40, baseType: !40, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "outpipe", scope: !94, file: !95, line: 43, baseType: !40, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!101 = !{!0, !7, !102, !12, !126}
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "nn_xpair_socktype", scope: !14, file: !2, line: 185, type: !104, isLocal: false, isDefinition: true)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !22, line: 160, size: 384, elements: !106)
!106 = !{!107, !108, !109, !110, !115, !119}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !105, file: !22, line: 163, baseType: !39, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !105, file: !22, line: 164, baseType: !39, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !22, line: 167, baseType: !39, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !105, file: !22, line: 173, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!39, !88, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !105, file: !22, line: 179, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!39, !39}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !105, file: !22, line: 183, baseType: !120, size: 128, offset: 256)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !121, line: 26, size: 128, elements: !122)
!121 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !121, line: 27, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !121, line: 28, baseType: !124, size: 64, offset: 64)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "nn_xpair_socktype_struct", scope: !14, file: !2, line: 176, type: !105, isLocal: true, isDefinition: true)
!128 = !{i32 7, !"Dwarf Version", i32 5}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{i32 1, !"wchar_size", i32 4}
!131 = !{i32 8, !"PIC Level", i32 2}
!132 = !{i32 7, !"PIE Level", i32 2}
!133 = !{i32 7, !"uwtable", i32 2}
!134 = !{i32 7, !"frame-pointer", i32 2}
!135 = !{!"clang version 16.0.0"}
!136 = distinct !DISubprogram(name: "nn_xpair_create", scope: !2, file: !2, line: 159, type: !112, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !137)
!137 = !{}
!138 = !DILocalVariable(name: "hint", arg: 1, scope: !136, file: !2, line: 159, type: !88)
!139 = !DILocation(line: 159, column: 28, scope: !136)
!140 = !DILocalVariable(name: "sockbase", arg: 2, scope: !136, file: !2, line: 159, type: !114)
!141 = !DILocation(line: 159, column: 55, scope: !136)
!142 = !DILocalVariable(name: "self", scope: !136, file: !2, line: 161, type: !17)
!143 = !DILocation(line: 161, column: 22, scope: !136)
!144 = !DILocation(line: 163, column: 12, scope: !136)
!145 = !DILocation(line: 163, column: 10, scope: !136)
!146 = !DILocation(line: 164, column: 5, scope: !136)
!147 = !DILocation(line: 164, column: 5, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !2, line: 164, column: 5)
!149 = distinct !DILexicalBlock(scope: !136, file: !2, line: 164, column: 5)
!150 = !DILocation(line: 164, column: 5, scope: !149)
!151 = !DILocation(line: 164, column: 5, scope: !152)
!152 = distinct !DILexicalBlock(scope: !148, file: !2, line: 164, column: 5)
!153 = !DILocation(line: 165, column: 20, scope: !136)
!154 = !DILocation(line: 165, column: 52, scope: !136)
!155 = !DILocation(line: 165, column: 5, scope: !136)
!156 = !DILocation(line: 166, column: 18, scope: !136)
!157 = !DILocation(line: 166, column: 24, scope: !136)
!158 = !DILocation(line: 166, column: 6, scope: !136)
!159 = !DILocation(line: 166, column: 15, scope: !136)
!160 = !DILocation(line: 168, column: 5, scope: !136)
!161 = distinct !DISubprogram(name: "nn_xpair_init", scope: !2, file: !2, line: 73, type: !162, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14, retainedNodes: !137)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !17, !25, !88}
!164 = !DILocalVariable(name: "self", arg: 1, scope: !161, file: !2, line: 73, type: !17)
!165 = !DILocation(line: 73, column: 45, scope: !161)
!166 = !DILocalVariable(name: "vfptr", arg: 2, scope: !161, file: !2, line: 74, type: !25)
!167 = !DILocation(line: 74, column: 37, scope: !161)
!168 = !DILocalVariable(name: "hint", arg: 3, scope: !161, file: !2, line: 74, type: !88)
!169 = !DILocation(line: 74, column: 50, scope: !161)
!170 = !DILocation(line: 76, column: 24, scope: !161)
!171 = !DILocation(line: 76, column: 30, scope: !161)
!172 = !DILocation(line: 76, column: 40, scope: !161)
!173 = !DILocation(line: 76, column: 47, scope: !161)
!174 = !DILocation(line: 76, column: 5, scope: !161)
!175 = !DILocation(line: 77, column: 20, scope: !161)
!176 = !DILocation(line: 77, column: 26, scope: !161)
!177 = !DILocation(line: 77, column: 5, scope: !161)
!178 = !DILocation(line: 78, column: 1, scope: !161)
!179 = distinct !DISubprogram(name: "nn_xpair_ispeer", scope: !2, file: !2, line: 171, type: !117, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !137)
!180 = !DILocalVariable(name: "socktype", arg: 1, scope: !179, file: !2, line: 171, type: !39)
!181 = !DILocation(line: 171, column: 26, scope: !179)
!182 = !DILocation(line: 173, column: 12, scope: !179)
!183 = !DILocation(line: 173, column: 21, scope: !179)
!184 = !DILocation(line: 173, column: 5, scope: !179)
