; ModuleID = './src/transports/tcp/btcp.c'
source_filename = "./src/transports/tcp/btcp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_epbase_vfptr = type { ptr, ptr }
%struct.nn_btcp = type { %struct.nn_fsm, i32, %struct.nn_epbase, %struct.nn_usock, ptr, %struct.nn_list }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_epbase = type { ptr, ptr }
%struct.nn_usock = type { %struct.nn_fsm, i32, ptr, i32, %struct.nn_worker_fd, %struct.anon, %struct.anon.0, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, ptr }
%struct.nn_worker_fd = type { ptr, %struct.nn_poller_hndl }
%struct.nn_poller_hndl = type { i32 }
%struct.anon = type { ptr, i64, ptr, i64, i64 }
%struct.anon.0 = type { %struct.msghdr, [3 x %struct.iovec] }
%struct.msghdr = type { ptr, i32, ptr, i64, ptr, i64, i32 }
%struct.iovec = type { ptr, i64 }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }
%struct.nn_list = type { ptr, ptr }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_btcp_epbase_vfptr", scope: !2, file: !21, line: 84, type: !62, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !420, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/transports/tcp/btcp.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f272e1eea37bd94667228f316d28abba")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !6, line: 24, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "0d4e972fdeb3da9a5bc94fa41144e9f8")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!10 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!11 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!12 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!13 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!14 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!15 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!16 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!17 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!18 = !{!19, !367, !34, !263, !33, !368, !389, !412, !215}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_btcp", file: !21, line: 61, size: 5248, elements: !22)
!21 = !DIFile(filename: "./src/transports/tcp/btcp.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f272e1eea37bd94667228f316d28abba")
!22 = !{!23, !55, !56, !74, !262, !366}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !20, file: !21, line: 64, baseType: !24, size: 640)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !25, line: 66, size: 640, elements: !26)
!25 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!26 = !{!27, !35, !36, !37, !38, !39, !42}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !24, file: !25, line: 67, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !25, line: 58, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !32, !33, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !24, file: !25, line: 68, baseType: !33, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !24, file: !25, line: 69, baseType: !33, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !24, file: !25, line: 70, baseType: !34, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !24, file: !25, line: 71, baseType: !32, size: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !24, file: !25, line: 72, baseType: !40, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !25, line: 30, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !24, file: !25, line: 73, baseType: !43, size: 320, offset: 320)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !25, line: 34, size: 320, elements: !44)
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !43, file: !25, line: 35, baseType: !32, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !43, file: !25, line: 36, baseType: !33, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !43, file: !25, line: 37, baseType: !34, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !25, line: 38, baseType: !33, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !43, file: !25, line: 39, baseType: !50, size: 64, offset: 256)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !51, line: 33, size: 64, elements: !52)
!51 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !50, file: !51, line: 34, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !20, file: !21, line: 65, baseType: !33, size: 32, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "epbase", scope: !20, file: !21, line: 69, baseType: !57, size: 128, offset: 704)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !58, line: 81, size: 128, elements: !59)
!58 = !DIFile(filename: "./src/transports/tcp/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!59 = !{!60, !71}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !57, file: !58, line: 82, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !58, line: 70, size: 128, elements: !64)
!64 = !{!65, !70}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !63, file: !58, line: 75, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !63, file: !58, line: 78, baseType: !66, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !57, file: !58, line: 83, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !58, line: 83, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !20, file: !21, line: 72, baseType: !75, size: 4224, offset: 832)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_usock", file: !76, line: 29, size: 4224, elements: !77)
!76 = !DIFile(filename: "src/aio/usock_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "31b785bc46a858e5ba003f912abaeac8")
!77 = !{!78, !79, !80, !200, !201, !206, !220, !246, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !75, file: !76, line: 32, baseType: !24, size: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !75, file: !76, line: 33, baseType: !33, size: 32, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !75, file: !76, line: 36, baseType: !81, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !83, line: 53, size: 1408, elements: !84)
!83 = !DIFile(filename: "src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!84 = !{!85, !121, !126, !127, !133, !160, !161, !187}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !82, file: !83, line: 54, baseType: !86, size: 320)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !87, line: 32, size: 320, elements: !88)
!87 = !DIFile(filename: "src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !86, file: !87, line: 36, baseType: !90, size: 320)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !91, line: 72, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !91, line: 67, size: 320, elements: !93)
!93 = !{!94, !114, !119}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !92, file: !91, line: 69, baseType: !95, size: 320)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !96, line: 22, size: 320, elements: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!97 = !{!98, !99, !100, !101, !102, !103, !105, !106}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !95, file: !96, line: 24, baseType: !33, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !95, file: !96, line: 25, baseType: !7, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !95, file: !96, line: 26, baseType: !33, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !95, file: !96, line: 28, baseType: !7, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !95, file: !96, line: 32, baseType: !33, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !95, file: !96, line: 34, baseType: !104, size: 16, offset: 160)
!104 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !95, file: !96, line: 35, baseType: !104, size: 16, offset: 176)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !95, file: !96, line: 36, baseType: !107, size: 128, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !108, line: 55, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !108, line: 51, size: 128, elements: !110)
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !109, file: !108, line: 53, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !109, file: !108, line: 54, baseType: !112, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !92, file: !91, line: 70, baseType: !115, size: 320)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 320, elements: !117)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !{!118}
!118 = !DISubrange(count: 40)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !92, file: !91, line: 71, baseType: !120, size: 64)
!120 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !82, file: !83, line: 55, baseType: !122, size: 128, offset: 320)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !51, line: 37, size: 128, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !122, file: !51, line: 38, baseType: !54, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !122, file: !51, line: 39, baseType: !54, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !82, file: !83, line: 56, baseType: !50, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !82, file: !83, line: 57, baseType: !128, size: 64, offset: 512)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !129, line: 25, size: 64, elements: !130)
!129 = !DIFile(filename: "src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !128, file: !129, line: 26, baseType: !33, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !128, file: !129, line: 27, baseType: !33, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !82, file: !83, line: 58, baseType: !134, size: 320, offset: 576)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !135, line: 31, size: 320, elements: !136)
!135 = !DIFile(filename: "src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!136 = !{!137, !138, !139, !140, !148, !159}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !135, line: 34, baseType: !33, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !134, file: !135, line: 37, baseType: !33, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !134, file: !135, line: 40, baseType: !33, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !134, file: !135, line: 43, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !143, line: 36, size: 64, elements: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!144 = !{!145, !146, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !142, file: !143, line: 38, baseType: !33, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !142, file: !143, line: 39, baseType: !104, size: 16, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !142, file: !143, line: 40, baseType: !104, size: 16, offset: 48)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !134, file: !135, line: 52, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !135, line: 48, size: 128, elements: !151)
!151 = !{!152, !157, !158}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !150, file: !135, line: 49, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !135, line: 27, size: 32, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !154, file: !135, line: 28, baseType: !33, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !135, line: 50, baseType: !33, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !135, line: 51, baseType: !33, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !134, file: !135, line: 55, baseType: !33, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !82, file: !83, line: 59, baseType: !154, size: 32, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !82, file: !83, line: 60, baseType: !162, size: 256, offset: 960)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !163, line: 37, size: 256, elements: !164)
!163 = !DIFile(filename: "src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!164 = !{!165, !176}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !162, file: !163, line: 38, baseType: !166, size: 128)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !167, line: 31, size: 128, elements: !168)
!167 = !DIFile(filename: "src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!168 = !{!169, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !166, file: !167, line: 33, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !171, line: 27, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !173, line: 45, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!174 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !166, file: !167, line: 34, baseType: !170, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !162, file: !163, line: 39, baseType: !177, size: 128, offset: 128)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !178, line: 31, size: 128, elements: !179)
!178 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!179 = !{!180, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !177, file: !178, line: 32, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !178, line: 26, size: 128, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !178, line: 27, baseType: !181, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !178, line: 28, baseType: !181, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !177, file: !178, line: 33, baseType: !181, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !82, file: !83, line: 61, baseType: !188, size: 192, offset: 1216)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !189, line: 25, size: 192, elements: !190)
!189 = !DIFile(filename: "src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!190 = !{!191, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !188, file: !189, line: 27, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !194, line: 28, baseType: !195)
!194 = !DIFile(filename: "src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!195 = !DISubroutineType(types: !196)
!196 = !{null, !34}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !188, file: !189, line: 28, baseType: !34, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !188, file: !189, line: 29, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !91, line: 27, baseType: !174)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !75, file: !76, line: 39, baseType: !33, size: 32, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "wfd", scope: !75, file: !76, line: 40, baseType: !202, size: 128, offset: 832)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_fd", file: !83, line: 40, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !202, file: !83, line: 41, baseType: !32, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !202, file: !83, line: 42, baseType: !154, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !75, file: !76, line: 59, baseType: !207, size: 320, offset: 960)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !75, file: !76, line: 43, size: 320, elements: !208)
!208 = !{!209, !214, !217, !218, !219}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !207, file: !76, line: 46, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !171, line: 24, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !173, line: 38, baseType: !213)
!213 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !207, file: !76, line: 47, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !216, line: 46, baseType: !174)
!216 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!217 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !207, file: !76, line: 50, baseType: !210, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "batch_len", scope: !207, file: !76, line: 53, baseType: !215, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "batch_pos", scope: !207, file: !76, line: 58, baseType: !215, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !75, file: !76, line: 69, baseType: !221, size: 832, offset: 1280)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !75, file: !76, line: 62, size: 832, elements: !222)
!222 = !{!223, !242}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !221, file: !76, line: 65, baseType: !224, size: 448)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !225, line: 259, size: 448, elements: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!226 = !{!227, !228, !231, !238, !239, !240, !241}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !224, file: !225, line: 261, baseType: !34, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !224, file: !225, line: 262, baseType: !229, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !225, line: 33, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !173, line: 210, baseType: !7)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !224, file: !225, line: 264, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !234, line: 26, size: 128, elements: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !233, file: !234, line: 28, baseType: !34, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !233, file: !234, line: 29, baseType: !215, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !224, file: !225, line: 265, baseType: !215, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !224, file: !225, line: 267, baseType: !34, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !224, file: !225, line: 268, baseType: !215, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !224, file: !225, line: 273, baseType: !33, size: 32, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !221, file: !76, line: 68, baseType: !243, size: 384, offset: 448)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 384, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 3)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "task_connecting", scope: !75, file: !76, line: 72, baseType: !247, size: 128, offset: 2112)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !83, line: 48, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !247, file: !83, line: 49, baseType: !32, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !247, file: !83, line: 50, baseType: !50, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "task_connected", scope: !75, file: !76, line: 73, baseType: !247, size: 128, offset: 2240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "task_accept", scope: !75, file: !76, line: 74, baseType: !247, size: 128, offset: 2368)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "task_send", scope: !75, file: !76, line: 75, baseType: !247, size: 128, offset: 2496)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "task_recv", scope: !75, file: !76, line: 76, baseType: !247, size: 128, offset: 2624)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "task_stop", scope: !75, file: !76, line: 77, baseType: !247, size: 128, offset: 2752)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "event_established", scope: !75, file: !76, line: 80, baseType: !43, size: 320, offset: 2880)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "event_sent", scope: !75, file: !76, line: 81, baseType: !43, size: 320, offset: 3200)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "event_received", scope: !75, file: !76, line: 82, baseType: !43, size: 320, offset: 3520)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "event_error", scope: !75, file: !76, line: 83, baseType: !43, size: 320, offset: 3840)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "asock", scope: !75, file: !76, line: 87, baseType: !261, size: 64, offset: 4160)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "atcp", scope: !20, file: !21, line: 75, baseType: !263, size: 64, offset: 5056)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_atcp", file: !265, line: 44, size: 12864, elements: !266)
!265 = !DIFile(filename: "./src/transports/tcp/atcp.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b417eb1b29da82fff98b8dac33745c14")
!266 = !{!267, !268, !269, !270, !271, !276, !363, !364, !365}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !264, file: !265, line: 47, baseType: !24, size: 640)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !265, line: 48, baseType: !33, size: 32, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !264, file: !265, line: 51, baseType: !75, size: 4224, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !264, file: !265, line: 54, baseType: !261, size: 64, offset: 4928)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "listener_owner", scope: !264, file: !265, line: 55, baseType: !272, size: 128, offset: 4992)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_owner", file: !25, line: 61, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !272, file: !25, line: 62, baseType: !33, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !272, file: !25, line: 63, baseType: !32, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "stcp", scope: !264, file: !265, line: 58, baseType: !277, size: 6976, offset: 5120)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_stcp", file: !278, line: 41, size: 6976, elements: !279)
!278 = !DIFile(filename: "./src/transports/tcp/stcp.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f6f65c8822f9985e9560a60ac94ab206")
!279 = !{!280, !281, !282, !283, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !277, file: !278, line: 44, baseType: !24, size: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !277, file: !278, line: 45, baseType: !33, size: 32, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !277, file: !278, line: 48, baseType: !261, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "streamhdr", scope: !277, file: !278, line: 51, baseType: !284, size: 3008, offset: 768)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_streamhdr", file: !285, line: 41, size: 3008, elements: !286)
!285 = !DIFile(filename: "./src/transports/tcp/../utils/streamhdr.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7d060aeed02236eba444409cfc4451d2")
!286 = !{!287, !288, !289, !310, !311, !312, !349, !353}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !284, file: !285, line: 44, baseType: !24, size: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !284, file: !285, line: 45, baseType: !33, size: 32, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !284, file: !285, line: 48, baseType: !290, size: 1664, offset: 704)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timer", file: !291, line: 32, size: 1664, elements: !292)
!291 = !DIFile(filename: "./src/transports/tcp/../utils/../../aio/timer.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "36b8c8892aa99fc49b85b12a9caf893a")
!292 = !{!293, !294, !295, !296, !297, !307, !308, !309}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !290, file: !291, line: 33, baseType: !24, size: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !290, file: !291, line: 34, baseType: !33, size: 32, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start_task", scope: !290, file: !291, line: 35, baseType: !247, size: 128, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "stop_task", scope: !290, file: !291, line: 36, baseType: !247, size: 128, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "wtimer", scope: !290, file: !291, line: 37, baseType: !298, size: 256, offset: 960)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !299, line: 37, size: 256, elements: !300)
!299 = !DIFile(filename: "src/aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !298, file: !299, line: 38, baseType: !32, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !298, file: !299, line: 39, baseType: !303, size: 192, offset: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !163, line: 32, size: 192, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !303, file: !163, line: 33, baseType: !182, size: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !303, file: !163, line: 34, baseType: !170, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !290, file: !291, line: 38, baseType: !43, size: 320, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !290, file: !291, line: 39, baseType: !81, size: 64, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !290, file: !291, line: 40, baseType: !33, size: 32, offset: 1600)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !284, file: !285, line: 51, baseType: !261, size: 64, offset: 2368)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "usock_owner", scope: !284, file: !285, line: 54, baseType: !272, size: 128, offset: 2432)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !284, file: !285, line: 57, baseType: !313, size: 64, offset: 2560)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase", file: !58, line: 147, size: 1536, elements: !315)
!315 = !{!316, !317, !340, !341, !342, !343, !346, !347, !348}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !314, file: !58, line: 148, baseType: !24, size: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !314, file: !58, line: 149, baseType: !318, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase_vfptr", file: !58, line: 134, size: 128, elements: !321)
!321 = !{!322, !339}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !320, file: !58, line: 138, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!33, !313, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !328, line: 30, size: 512, elements: !329)
!328 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!329 = !{!330, !338}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !327, file: !328, line: 33, baseType: !331, size: 256)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !332, line: 39, size: 256, elements: !333)
!332 = !DIFile(filename: "src/aio/../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !331, file: !332, line: 40, baseType: !335, size: 256)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 256, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !327, file: !328, line: 36, baseType: !331, size: 256, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !320, file: !58, line: 142, baseType: !323, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !58, line: 150, baseType: !211, size: 8, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !314, file: !58, line: 151, baseType: !211, size: 8, offset: 712)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !314, file: !58, line: 152, baseType: !211, size: 8, offset: 720)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !314, file: !58, line: 153, baseType: !344, size: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !58, line: 39, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !58, line: 154, baseType: !34, size: 64, offset: 832)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !314, file: !58, line: 155, baseType: !43, size: 320, offset: 896)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !314, file: !58, line: 156, baseType: !43, size: 320, offset: 1216)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "protohdr", scope: !284, file: !285, line: 60, baseType: !350, size: 64, offset: 2624)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !284, file: !285, line: 63, baseType: !43, size: 320, offset: 2688)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "usock_owner", scope: !277, file: !278, line: 54, baseType: !272, size: 128, offset: 3776)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !277, file: !278, line: 57, baseType: !314, size: 1536, offset: 3904)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !277, file: !278, line: 60, baseType: !33, size: 32, offset: 5440)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "inhdr", scope: !277, file: !278, line: 63, baseType: !350, size: 64, offset: 5472)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "inmsg", scope: !277, file: !278, line: 66, baseType: !327, size: 512, offset: 5536)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !277, file: !278, line: 69, baseType: !33, size: 32, offset: 6048)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "outhdr", scope: !277, file: !278, line: 72, baseType: !350, size: 64, offset: 6080)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "outmsg", scope: !277, file: !278, line: 75, baseType: !327, size: 512, offset: 6144)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !277, file: !278, line: 78, baseType: !43, size: 320, offset: 6656)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "accepted", scope: !264, file: !265, line: 61, baseType: !43, size: 320, offset: 12096)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !264, file: !265, line: 62, baseType: !43, size: 320, offset: 12416)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !264, file: !265, line: 65, baseType: !182, size: 128, offset: 12736)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "atcps", scope: !20, file: !21, line: 78, baseType: !177, size: 128, offset: 5120)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !370, line: 245, size: 128, elements: !371)
!370 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!371 = !{!372, !376, !380, !387}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !369, file: !370, line: 247, baseType: !373, size: 16)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !374, line: 28, baseType: !375)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!375 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !369, file: !370, line: 248, baseType: !377, size: 16, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !370, line: 123, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !171, line: 25, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !173, line: 40, baseType: !375)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !369, file: !370, line: 249, baseType: !381, size: 32, offset: 32)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !370, line: 31, size: 32, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !381, file: !370, line: 33, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !370, line: 30, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !171, line: 26, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !173, line: 42, baseType: !7)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !369, file: !370, line: 252, baseType: !388, size: 64, offset: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 64, elements: !351)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !370, line: 260, size: 224, elements: !391)
!391 = !{!392, !393, !394, !395, !411}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !390, file: !370, line: 262, baseType: !373, size: 16)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !390, file: !370, line: 263, baseType: !377, size: 16, offset: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !390, file: !370, line: 264, baseType: !385, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !390, file: !370, line: 265, baseType: !396, size: 128, offset: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !370, line: 219, size: 128, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !396, file: !370, line: 226, baseType: !399, size: 128)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !370, line: 221, size: 128, elements: !400)
!400 = !{!401, !405, !407}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !399, file: !370, line: 223, baseType: !402, size: 128)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !399, file: !370, line: 224, baseType: !406, size: 128)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !351)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !399, file: !370, line: 225, baseType: !408, size: 128)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 128, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 4)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !390, file: !370, line: 266, baseType: !385, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !225, line: 180, size: 128, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !413, file: !225, line: 182, baseType: !373, size: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !413, file: !225, line: 183, baseType: !417, size: 112, offset: 16)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 112, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 14)
!420 = !{!0, !421, !426, !431, !436, !441, !446, !451, !456, !461, !466, !469, !472, !477}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !21, line: 111, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 184, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 23)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !21, line: 111, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 224, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 28)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !21, line: 137, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 240, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 30)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !21, line: 137, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 264, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 33)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !21, line: 178, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 272, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 34)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !21, line: 180, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 152, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 19)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !21, line: 226, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 408, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 51)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !21, line: 261, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 16, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 2)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !21, line: 295, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 192, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 24)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !21, line: 341, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 32, elements: !409)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !21, line: 344, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !351)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !21, line: 353, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 136, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 17)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !21, line: 379, type: !448, isLocal: true, isDefinition: true)
!479 = !{i32 7, !"Dwarf Version", i32 5}
!480 = !{i32 2, !"Debug Info Version", i32 3}
!481 = !{i32 1, !"wchar_size", i32 4}
!482 = !{i32 8, !"PIC Level", i32 2}
!483 = !{i32 7, !"PIE Level", i32 2}
!484 = !{i32 7, !"uwtable", i32 2}
!485 = !{i32 7, !"frame-pointer", i32 2}
!486 = !{!"clang version 16.0.0"}
!487 = distinct !DISubprogram(name: "nn_btcp_stop", scope: !21, file: !21, line: 163, type: !67, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !488)
!488 = !{}
!489 = !DILocalVariable(name: "self", arg: 1, scope: !487, file: !21, line: 163, type: !69)
!490 = !DILocation(line: 163, column: 45, scope: !487)
!491 = !DILocalVariable(name: "btcp", scope: !487, file: !21, line: 165, type: !19)
!492 = !DILocation(line: 165, column: 21, scope: !487)
!493 = !DILocation(line: 167, column: 12, scope: !487)
!494 = !DILocation(line: 167, column: 10, scope: !487)
!495 = !DILocation(line: 169, column: 19, scope: !487)
!496 = !DILocation(line: 169, column: 25, scope: !487)
!497 = !DILocation(line: 169, column: 5, scope: !487)
!498 = !DILocation(line: 170, column: 1, scope: !487)
!499 = distinct !DISubprogram(name: "nn_btcp_destroy", scope: !21, file: !21, line: 172, type: !67, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !488)
!500 = !DILocalVariable(name: "self", arg: 1, scope: !499, file: !21, line: 172, type: !69)
!501 = !DILocation(line: 172, column: 48, scope: !499)
!502 = !DILocalVariable(name: "btcp", scope: !499, file: !21, line: 174, type: !19)
!503 = !DILocation(line: 174, column: 21, scope: !499)
!504 = !DILocation(line: 176, column: 12, scope: !499)
!505 = !DILocation(line: 176, column: 10, scope: !499)
!506 = !DILocation(line: 178, column: 5, scope: !499)
!507 = !DILocation(line: 178, column: 5, scope: !508)
!508 = distinct !DILexicalBlock(scope: !509, file: !21, line: 178, column: 5)
!509 = distinct !DILexicalBlock(scope: !499, file: !21, line: 178, column: 5)
!510 = !DILocation(line: 178, column: 5, scope: !509)
!511 = !DILocation(line: 178, column: 5, scope: !512)
!512 = distinct !DILexicalBlock(scope: !508, file: !21, line: 178, column: 5)
!513 = !DILocation(line: 179, column: 20, scope: !499)
!514 = !DILocation(line: 179, column: 26, scope: !499)
!515 = !DILocation(line: 179, column: 5, scope: !499)
!516 = !DILocation(line: 180, column: 5, scope: !499)
!517 = !DILocation(line: 180, column: 5, scope: !518)
!518 = distinct !DILexicalBlock(scope: !519, file: !21, line: 180, column: 5)
!519 = distinct !DILexicalBlock(scope: !499, file: !21, line: 180, column: 5)
!520 = !DILocation(line: 180, column: 5, scope: !519)
!521 = !DILocation(line: 180, column: 5, scope: !522)
!522 = distinct !DILexicalBlock(scope: !518, file: !21, line: 180, column: 5)
!523 = !DILocation(line: 181, column: 21, scope: !499)
!524 = !DILocation(line: 181, column: 27, scope: !499)
!525 = !DILocation(line: 181, column: 5, scope: !499)
!526 = !DILocation(line: 182, column: 22, scope: !499)
!527 = !DILocation(line: 182, column: 28, scope: !499)
!528 = !DILocation(line: 182, column: 5, scope: !499)
!529 = !DILocation(line: 183, column: 19, scope: !499)
!530 = !DILocation(line: 183, column: 25, scope: !499)
!531 = !DILocation(line: 183, column: 5, scope: !499)
!532 = !DILocation(line: 185, column: 14, scope: !499)
!533 = !DILocation(line: 185, column: 5, scope: !499)
!534 = !DILocation(line: 186, column: 1, scope: !499)
!535 = distinct !DISubprogram(name: "nn_btcp_create", scope: !21, file: !21, line: 95, type: !536, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !488)
!536 = !DISubroutineType(types: !537)
!537 = !{!33, !34, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!539 = !DILocalVariable(name: "hint", arg: 1, scope: !535, file: !21, line: 95, type: !34)
!540 = !DILocation(line: 95, column: 27, scope: !535)
!541 = !DILocalVariable(name: "epbase", arg: 2, scope: !535, file: !21, line: 95, type: !538)
!542 = !DILocation(line: 95, column: 52, scope: !535)
!543 = !DILocalVariable(name: "rc", scope: !535, file: !21, line: 97, type: !33)
!544 = !DILocation(line: 97, column: 9, scope: !535)
!545 = !DILocalVariable(name: "self", scope: !535, file: !21, line: 98, type: !19)
!546 = !DILocation(line: 98, column: 21, scope: !535)
!547 = !DILocalVariable(name: "addr", scope: !535, file: !21, line: 99, type: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!550 = !DILocation(line: 99, column: 17, scope: !535)
!551 = !DILocalVariable(name: "addrlen", scope: !535, file: !21, line: 100, type: !215)
!552 = !DILocation(line: 100, column: 12, scope: !535)
!553 = !DILocalVariable(name: "end", scope: !535, file: !21, line: 101, type: !548)
!554 = !DILocation(line: 101, column: 17, scope: !535)
!555 = !DILocalVariable(name: "pos", scope: !535, file: !21, line: 102, type: !548)
!556 = !DILocation(line: 102, column: 17, scope: !535)
!557 = !DILocalVariable(name: "port", scope: !535, file: !21, line: 103, type: !33)
!558 = !DILocation(line: 103, column: 9, scope: !535)
!559 = !DILocalVariable(name: "ss", scope: !535, file: !21, line: 104, type: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !225, line: 193, size: 1024, elements: !561)
!561 = !{!562, !563, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !560, file: !225, line: 195, baseType: !373, size: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !560, file: !225, line: 196, baseType: !564, size: 944, offset: 16)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 944, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 118)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !560, file: !225, line: 197, baseType: !174, size: 64, offset: 960)
!568 = !DILocation(line: 104, column: 29, scope: !535)
!569 = !DILocalVariable(name: "sslen", scope: !535, file: !21, line: 105, type: !215)
!570 = !DILocation(line: 105, column: 12, scope: !535)
!571 = !DILocalVariable(name: "ipv4only", scope: !535, file: !21, line: 106, type: !33)
!572 = !DILocation(line: 106, column: 9, scope: !535)
!573 = !DILocalVariable(name: "ipv4onlylen", scope: !535, file: !21, line: 107, type: !215)
!574 = !DILocation(line: 107, column: 12, scope: !535)
!575 = !DILocation(line: 110, column: 12, scope: !535)
!576 = !DILocation(line: 110, column: 10, scope: !535)
!577 = !DILocation(line: 111, column: 5, scope: !535)
!578 = !DILocation(line: 111, column: 5, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !21, line: 111, column: 5)
!580 = distinct !DILexicalBlock(scope: !535, file: !21, line: 111, column: 5)
!581 = !DILocation(line: 111, column: 5, scope: !580)
!582 = !DILocation(line: 111, column: 5, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !21, line: 111, column: 5)
!584 = !DILocation(line: 114, column: 22, scope: !535)
!585 = !DILocation(line: 114, column: 28, scope: !535)
!586 = !DILocation(line: 114, column: 59, scope: !535)
!587 = !DILocation(line: 114, column: 5, scope: !535)
!588 = !DILocation(line: 115, column: 32, scope: !535)
!589 = !DILocation(line: 115, column: 38, scope: !535)
!590 = !DILocation(line: 115, column: 12, scope: !535)
!591 = !DILocation(line: 115, column: 10, scope: !535)
!592 = !DILocation(line: 116, column: 23, scope: !535)
!593 = !DILocation(line: 116, column: 15, scope: !535)
!594 = !DILocation(line: 116, column: 13, scope: !535)
!595 = !DILocation(line: 119, column: 11, scope: !535)
!596 = !DILocation(line: 119, column: 26, scope: !535)
!597 = !DILocation(line: 119, column: 18, scope: !535)
!598 = !DILocation(line: 119, column: 16, scope: !535)
!599 = !DILocation(line: 119, column: 9, scope: !535)
!600 = !DILocation(line: 120, column: 20, scope: !535)
!601 = !DILocation(line: 120, column: 11, scope: !535)
!602 = !DILocation(line: 120, column: 9, scope: !535)
!603 = !DILocation(line: 121, column: 9, scope: !604)
!604 = distinct !DILexicalBlock(scope: !535, file: !21, line: 121, column: 9)
!605 = !DILocation(line: 121, column: 9, scope: !535)
!606 = !DILocation(line: 122, column: 26, scope: !607)
!607 = distinct !DILexicalBlock(scope: !604, file: !21, line: 121, column: 25)
!608 = !DILocation(line: 122, column: 32, scope: !607)
!609 = !DILocation(line: 122, column: 9, scope: !607)
!610 = !DILocation(line: 123, column: 9, scope: !607)
!611 = !DILocation(line: 125, column: 5, scope: !535)
!612 = !DILocation(line: 126, column: 27, scope: !535)
!613 = !DILocation(line: 126, column: 32, scope: !535)
!614 = !DILocation(line: 126, column: 38, scope: !535)
!615 = !DILocation(line: 126, column: 36, scope: !535)
!616 = !DILocation(line: 126, column: 10, scope: !535)
!617 = !DILocation(line: 126, column: 8, scope: !535)
!618 = !DILocation(line: 127, column: 9, scope: !619)
!619 = distinct !DILexicalBlock(scope: !535, file: !21, line: 127, column: 9)
!620 = !DILocation(line: 127, column: 9, scope: !535)
!621 = !DILocation(line: 128, column: 26, scope: !622)
!622 = distinct !DILexicalBlock(scope: !619, file: !21, line: 127, column: 27)
!623 = !DILocation(line: 128, column: 32, scope: !622)
!624 = !DILocation(line: 128, column: 9, scope: !622)
!625 = !DILocation(line: 129, column: 9, scope: !622)
!626 = !DILocation(line: 131, column: 12, scope: !535)
!627 = !DILocation(line: 131, column: 10, scope: !535)
!628 = !DILocation(line: 134, column: 17, scope: !535)
!629 = !DILocation(line: 135, column: 24, scope: !535)
!630 = !DILocation(line: 135, column: 30, scope: !535)
!631 = !DILocation(line: 135, column: 5, scope: !535)
!632 = !DILocation(line: 137, column: 5, scope: !535)
!633 = !DILocation(line: 137, column: 5, scope: !634)
