; ModuleID = './src/transports/tcp/stcp.c'
source_filename = "./src/transports/tcp/stcp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_pipebase_vfptr = type { ptr, ptr }
%struct.nn_iovec = type { ptr, i64 }
%struct.nn_stcp = type { %struct.nn_fsm, i32, ptr, %struct.nn_streamhdr, %struct.nn_fsm_owner, %struct.nn_pipebase, i32, [8 x i8], %struct.nn_msg, i32, [8 x i8], %struct.nn_msg, %struct.nn_fsm_event }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_streamhdr = type { %struct.nn_fsm, i32, %struct.nn_timer, ptr, %struct.nn_fsm_owner, ptr, [8 x i8], %struct.nn_fsm_event }
%struct.nn_timer = type { %struct.nn_fsm, i32, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_timer, %struct.nn_fsm_event, ptr, i32 }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_worker_timer = type { ptr, %struct.nn_timerset_hndl }
%struct.nn_timerset_hndl = type { %struct.nn_list_item, i64 }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_fsm_owner = type { i32, ptr }
%struct.nn_pipebase = type { %struct.nn_fsm, ptr, i8, i8, i8, ptr, ptr, %struct.nn_fsm_event, %struct.nn_fsm_event }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_stcp_pipebase_vfptr", scope: !2, file: !320, line: 56, type: !272, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !317, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/transports/tcp/stcp.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "27b90ccb49767b246e4d984da9fa70ed")
!4 = !{!5, !6, !316, !20, !185}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_stcp", file: !8, line: 41, size: 6976, elements: !9)
!8 = !DIFile(filename: "./src/transports/tcp/stcp.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f6f65c8822f9985e9560a60ac94ab206")
!9 = !{!10, !41, !42, !231, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !7, file: !8, line: 44, baseType: !11, size: 640)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !12, line: 66, size: 640, elements: !13)
!12 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!13 = !{!14, !21, !22, !23, !24, !25, !28}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !11, file: !12, line: 67, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !12, line: 58, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19, !20, !20, !5}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !11, file: !12, line: 68, baseType: !20, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !11, file: !12, line: 69, baseType: !20, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !11, file: !12, line: 70, baseType: !5, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !11, file: !12, line: 71, baseType: !19, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !11, file: !12, line: 72, baseType: !26, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !12, line: 30, flags: DIFlagFwdDecl)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !11, file: !12, line: 73, baseType: !29, size: 320, offset: 320)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !12, line: 34, size: 320, elements: !30)
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !29, file: !12, line: 35, baseType: !19, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !29, file: !12, line: 36, baseType: !20, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !29, file: !12, line: 37, baseType: !5, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !12, line: 38, baseType: !20, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !29, file: !12, line: 39, baseType: !36, size: 64, offset: 256)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !37, line: 33, size: 64, elements: !38)
!37 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !37, line: 34, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !7, file: !8, line: 45, baseType: !20, size: 32, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !7, file: !8, line: 48, baseType: !43, size: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_usock", file: !45, line: 29, size: 4224, elements: !46)
!45 = !DIFile(filename: "src/aio/usock_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "31b785bc46a858e5ba003f912abaeac8")
!46 = !{!47, !48, !49, !170, !171, !176, !190, !216, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !44, file: !45, line: 32, baseType: !11, size: 640)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !44, file: !45, line: 33, baseType: !20, size: 32, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !44, file: !45, line: 36, baseType: !50, size: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !52, line: 53, size: 1408, elements: !53)
!52 = !DIFile(filename: "src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!53 = !{!54, !91, !96, !97, !103, !130, !131, !157}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !51, file: !52, line: 54, baseType: !55, size: 320)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !56, line: 32, size: 320, elements: !57)
!56 = !DIFile(filename: "src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !55, file: !56, line: 36, baseType: !59, size: 320)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !60, line: 72, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!61 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !60, line: 67, size: 320, elements: !62)
!62 = !{!63, !84, !89}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !61, file: !60, line: 69, baseType: !64, size: 320)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !65, line: 22, size: 320, elements: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!66 = !{!67, !68, !70, !71, !72, !73, !75, !76}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !64, file: !65, line: 24, baseType: !20, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !64, file: !65, line: 25, baseType: !69, size: 32, offset: 32)
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !64, file: !65, line: 26, baseType: !20, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !64, file: !65, line: 28, baseType: !69, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !64, file: !65, line: 32, baseType: !20, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !64, file: !65, line: 34, baseType: !74, size: 16, offset: 160)
!74 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !64, file: !65, line: 35, baseType: !74, size: 16, offset: 176)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !64, file: !65, line: 36, baseType: !77, size: 128, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !78, line: 55, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !78, line: 51, size: 128, elements: !80)
!80 = !{!81, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !79, file: !78, line: 53, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !79, file: !78, line: 54, baseType: !82, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !61, file: !60, line: 70, baseType: !85, size: 320)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 320, elements: !87)
!86 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!87 = !{!88}
!88 = !DISubrange(count: 40)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !61, file: !60, line: 71, baseType: !90, size: 64)
!90 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !51, file: !52, line: 55, baseType: !92, size: 128, offset: 320)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !37, line: 37, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !92, file: !37, line: 38, baseType: !40, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !92, file: !37, line: 39, baseType: !40, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !51, file: !52, line: 56, baseType: !36, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !51, file: !52, line: 57, baseType: !98, size: 64, offset: 512)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !99, line: 25, size: 64, elements: !100)
!99 = !DIFile(filename: "src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !98, file: !99, line: 26, baseType: !20, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !98, file: !99, line: 27, baseType: !20, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !51, file: !52, line: 58, baseType: !104, size: 320, offset: 576)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !105, line: 31, size: 320, elements: !106)
!105 = !DIFile(filename: "src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!106 = !{!107, !108, !109, !110, !118, !129}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !105, line: 34, baseType: !20, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !104, file: !105, line: 37, baseType: !20, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !104, file: !105, line: 40, baseType: !20, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !104, file: !105, line: 43, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !113, line: 36, size: 64, elements: !114)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !112, file: !113, line: 38, baseType: !20, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !112, file: !113, line: 39, baseType: !74, size: 16, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !112, file: !113, line: 40, baseType: !74, size: 16, offset: 48)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !104, file: !105, line: 52, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !105, line: 48, size: 128, elements: !121)
!121 = !{!122, !127, !128}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !120, file: !105, line: 49, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !105, line: 27, size: 32, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !124, file: !105, line: 28, baseType: !20, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !120, file: !105, line: 50, baseType: !20, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !120, file: !105, line: 51, baseType: !20, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !104, file: !105, line: 55, baseType: !20, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !51, file: !52, line: 59, baseType: !124, size: 32, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !51, file: !52, line: 60, baseType: !132, size: 256, offset: 960)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !133, line: 37, size: 256, elements: !134)
!133 = !DIFile(filename: "src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!134 = !{!135, !146}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !132, file: !133, line: 38, baseType: !136, size: 128)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !137, line: 31, size: 128, elements: !138)
!137 = !DIFile(filename: "src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!138 = !{!139, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !136, file: !137, line: 33, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !141, line: 27, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !143, line: 45, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!144 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !136, file: !137, line: 34, baseType: !140, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !132, file: !133, line: 39, baseType: !147, size: 128, offset: 128)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !148, line: 31, size: 128, elements: !149)
!148 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!149 = !{!150, !156}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !147, file: !148, line: 32, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !148, line: 26, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !148, line: 27, baseType: !151, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !148, line: 28, baseType: !151, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !147, file: !148, line: 33, baseType: !151, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !51, file: !52, line: 61, baseType: !158, size: 192, offset: 1216)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !159, line: 25, size: 192, elements: !160)
!159 = !DIFile(filename: "src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!160 = !{!161, !167, !168}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !158, file: !159, line: 27, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !164, line: 28, baseType: !165)
!164 = !DIFile(filename: "src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!165 = !DISubroutineType(types: !166)
!166 = !{null, !5}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !158, file: !159, line: 28, baseType: !5, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !158, file: !159, line: 29, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !60, line: 27, baseType: !144)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !44, file: !45, line: 39, baseType: !20, size: 32, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "wfd", scope: !44, file: !45, line: 40, baseType: !172, size: 128, offset: 832)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_fd", file: !52, line: 40, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !172, file: !52, line: 41, baseType: !19, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !172, file: !52, line: 42, baseType: !124, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !44, file: !45, line: 59, baseType: !177, size: 320, offset: 960)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !45, line: 43, size: 320, elements: !178)
!178 = !{!179, !184, !187, !188, !189}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !177, file: !45, line: 46, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !141, line: 24, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !143, line: 38, baseType: !183)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, file: !45, line: 47, baseType: !185, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 46, baseType: !144)
!186 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !177, file: !45, line: 50, baseType: !180, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "batch_len", scope: !177, file: !45, line: 53, baseType: !185, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "batch_pos", scope: !177, file: !45, line: 58, baseType: !185, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !44, file: !45, line: 69, baseType: !191, size: 832, offset: 1280)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !45, line: 62, size: 832, elements: !192)
!192 = !{!193, !212}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !191, file: !45, line: 65, baseType: !194, size: 448)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !195, line: 259, size: 448, elements: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!196 = !{!197, !198, !201, !208, !209, !210, !211}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !194, file: !195, line: 261, baseType: !5, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !194, file: !195, line: 262, baseType: !199, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !195, line: 33, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !143, line: 210, baseType: !69)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !194, file: !195, line: 264, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !204, line: 26, size: 128, elements: !205)
!204 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !203, file: !204, line: 28, baseType: !5, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !203, file: !204, line: 29, baseType: !185, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !194, file: !195, line: 265, baseType: !185, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !194, file: !195, line: 267, baseType: !5, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !194, file: !195, line: 268, baseType: !185, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !194, file: !195, line: 273, baseType: !20, size: 32, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !191, file: !45, line: 68, baseType: !213, size: 384, offset: 448)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 384, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 3)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "task_connecting", scope: !44, file: !45, line: 72, baseType: !217, size: 128, offset: 2112)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !52, line: 48, size: 128, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !217, file: !52, line: 49, baseType: !19, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !217, file: !52, line: 50, baseType: !36, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "task_connected", scope: !44, file: !45, line: 73, baseType: !217, size: 128, offset: 2240)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "task_accept", scope: !44, file: !45, line: 74, baseType: !217, size: 128, offset: 2368)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "task_send", scope: !44, file: !45, line: 75, baseType: !217, size: 128, offset: 2496)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "task_recv", scope: !44, file: !45, line: 76, baseType: !217, size: 128, offset: 2624)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "task_stop", scope: !44, file: !45, line: 77, baseType: !217, size: 128, offset: 2752)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "event_established", scope: !44, file: !45, line: 80, baseType: !29, size: 320, offset: 2880)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "event_sent", scope: !44, file: !45, line: 81, baseType: !29, size: 320, offset: 3200)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "event_received", scope: !44, file: !45, line: 82, baseType: !29, size: 320, offset: 3520)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "event_error", scope: !44, file: !45, line: 83, baseType: !29, size: 320, offset: 3840)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "asock", scope: !44, file: !45, line: 87, baseType: !43, size: 64, offset: 4160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "streamhdr", scope: !7, file: !8, line: 51, baseType: !232, size: 3008, offset: 768)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_streamhdr", file: !233, line: 41, size: 3008, elements: !234)
!233 = !DIFile(filename: "./src/transports/tcp/../utils/streamhdr.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7d060aeed02236eba444409cfc4451d2")
!234 = !{!235, !236, !237, !258, !259, !264, !302, !306}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !232, file: !233, line: 44, baseType: !11, size: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !232, file: !233, line: 45, baseType: !20, size: 32, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !232, file: !233, line: 48, baseType: !238, size: 1664, offset: 704)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timer", file: !239, line: 32, size: 1664, elements: !240)
!239 = !DIFile(filename: "./src/transports/tcp/../utils/../../aio/timer.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "36b8c8892aa99fc49b85b12a9caf893a")
!240 = !{!241, !242, !243, !244, !245, !255, !256, !257}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !238, file: !239, line: 33, baseType: !11, size: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !238, file: !239, line: 34, baseType: !20, size: 32, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "start_task", scope: !238, file: !239, line: 35, baseType: !217, size: 128, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "stop_task", scope: !238, file: !239, line: 36, baseType: !217, size: 128, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "wtimer", scope: !238, file: !239, line: 37, baseType: !246, size: 256, offset: 960)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !247, line: 37, size: 256, elements: !248)
!247 = !DIFile(filename: "src/aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !246, file: !247, line: 38, baseType: !19, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !246, file: !247, line: 39, baseType: !251, size: 192, offset: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !133, line: 32, size: 192, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !251, file: !133, line: 33, baseType: !152, size: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !251, file: !133, line: 34, baseType: !140, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !238, file: !239, line: 38, baseType: !29, size: 320, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !238, file: !239, line: 39, baseType: !50, size: 64, offset: 1536)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !238, file: !239, line: 40, baseType: !20, size: 32, offset: 1600)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !232, file: !233, line: 51, baseType: !43, size: 64, offset: 2368)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "usock_owner", scope: !232, file: !233, line: 54, baseType: !260, size: 128, offset: 2432)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_owner", file: !12, line: 61, size: 128, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !260, file: !12, line: 62, baseType: !20, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !260, file: !12, line: 63, baseType: !19, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !232, file: !233, line: 57, baseType: !265, size: 64, offset: 2560)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase", file: !267, line: 147, size: 1536, elements: !268)
!267 = !DIFile(filename: "./src/transports/tcp/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!268 = !{!269, !270, !293, !294, !295, !296, !299, !300, !301}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !266, file: !267, line: 148, baseType: !11, size: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !266, file: !267, line: 149, baseType: !271, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase_vfptr", file: !267, line: 134, size: 128, elements: !274)
!274 = !{!275, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !273, file: !267, line: 138, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!20, !265, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !281, line: 30, size: 512, elements: !282)
!281 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!282 = !{!283, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !280, file: !281, line: 33, baseType: !284, size: 256)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !285, line: 39, size: 256, elements: !286)
!285 = !DIFile(filename: "src/aio/../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !284, file: !285, line: 40, baseType: !288, size: 256)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 256, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !280, file: !281, line: 36, baseType: !284, size: 256, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !273, file: !267, line: 142, baseType: !276, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !267, line: 150, baseType: !181, size: 8, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !266, file: !267, line: 151, baseType: !181, size: 8, offset: 712)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !266, file: !267, line: 152, baseType: !181, size: 8, offset: 720)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !266, file: !267, line: 153, baseType: !297, size: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !267, line: 39, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !267, line: 154, baseType: !5, size: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !266, file: !267, line: 155, baseType: !29, size: 320, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !266, file: !267, line: 156, baseType: !29, size: 320, offset: 1216)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "protohdr", scope: !232, file: !233, line: 60, baseType: !303, size: 64, offset: 2624)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 64, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 8)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !232, file: !233, line: 63, baseType: !29, size: 320, offset: 2688)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "usock_owner", scope: !7, file: !8, line: 54, baseType: !260, size: 128, offset: 3776)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !7, file: !8, line: 57, baseType: !266, size: 1536, offset: 3904)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !7, file: !8, line: 60, baseType: !20, size: 32, offset: 5440)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "inhdr", scope: !7, file: !8, line: 63, baseType: !303, size: 64, offset: 5472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "inmsg", scope: !7, file: !8, line: 66, baseType: !280, size: 512, offset: 5536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !7, file: !8, line: 69, baseType: !20, size: 32, offset: 6048)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "outhdr", scope: !7, file: !8, line: 72, baseType: !303, size: 64, offset: 6080)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "outmsg", scope: !7, file: !8, line: 75, baseType: !280, size: 512, offset: 6144)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !7, file: !8, line: 78, baseType: !29, size: 320, offset: 6656)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!317 = !{!0, !318, !324, !329, !334, !339, !344, !346, !348, !353, !358}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !320, line: 84, type: !321, isLocal: true, isDefinition: true)
!320 = !DIFile(filename: "./src/transports/tcp/stcp.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "27b90ccb49767b246e4d984da9fa70ed")
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 240, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 30)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !320, line: 84, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 272, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 34)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !320, line: 84, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 224, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 28)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !320, line: 102, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 424, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 53)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !320, line: 124, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 288, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 36)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !320, line: 125, type: !85, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !320, line: 156, type: !85, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !320, line: 215, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 16, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 2)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !320, line: 266, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 136, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 17)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !320, line: 298, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 344, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 43)
!363 = !{i32 7, !"Dwarf Version", i32 5}
!364 = !{i32 2, !"Debug Info Version", i32 3}
!365 = !{i32 1, !"wchar_size", i32 4}
!366 = !{i32 8, !"PIC Level", i32 2}
!367 = !{i32 7, !"PIE Level", i32 2}
!368 = !{i32 7, !"uwtable", i32 2}
!369 = !{i32 7, !"frame-pointer", i32 2}
!370 = !{!"clang version 16.0.0"}
!371 = distinct !DISubprogram(name: "nn_stcp_send", scope: !320, file: !320, line: 117, type: !277, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !372)
!372 = !{}
!373 = !DILocalVariable(name: "self", arg: 1, scope: !371, file: !320, line: 117, type: !265)
!374 = !DILocation(line: 117, column: 46, scope: !371)
!375 = !DILocalVariable(name: "msg", arg: 2, scope: !371, file: !320, line: 117, type: !279)
!376 = !DILocation(line: 117, column: 67, scope: !371)
!377 = !DILocalVariable(name: "stcp", scope: !371, file: !320, line: 119, type: !6)
!378 = !DILocation(line: 119, column: 21, scope: !371)
!379 = !DILocalVariable(name: "iov", scope: !371, file: !320, line: 120, type: !380)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 384, elements: !214)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_iovec", file: !382, line: 165, size: 128, elements: !383)
!382 = !DIFile(filename: "src/nn.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "0c95956590725e5a1eedd7f7b192cc23")
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !381, file: !382, line: 166, baseType: !5, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !381, file: !382, line: 167, baseType: !185, size: 64, offset: 64)
!386 = !DILocation(line: 120, column: 21, scope: !371)
!387 = !DILocation(line: 122, column: 12, scope: !371)
!388 = !DILocation(line: 122, column: 10, scope: !371)
!389 = !DILocation(line: 124, column: 5, scope: !371)
!390 = !DILocation(line: 124, column: 5, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !320, line: 124, column: 5)
!392 = distinct !DILexicalBlock(scope: !371, file: !320, line: 124, column: 5)
!393 = !DILocation(line: 124, column: 5, scope: !392)
!394 = !DILocation(line: 124, column: 5, scope: !395)
!395 = distinct !DILexicalBlock(scope: !391, file: !320, line: 124, column: 5)
!396 = !DILocation(line: 125, column: 5, scope: !371)
!397 = !DILocation(line: 125, column: 5, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !320, line: 125, column: 5)
!399 = distinct !DILexicalBlock(scope: !371, file: !320, line: 125, column: 5)
!400 = !DILocation(line: 125, column: 5, scope: !399)
!401 = !DILocation(line: 125, column: 5, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !320, line: 125, column: 5)
!403 = !DILocation(line: 128, column: 19, scope: !371)
!404 = !DILocation(line: 128, column: 25, scope: !371)
!405 = !DILocation(line: 128, column: 5, scope: !371)
!406 = !DILocation(line: 129, column: 17, scope: !371)
!407 = !DILocation(line: 129, column: 23, scope: !371)
!408 = !DILocation(line: 129, column: 31, scope: !371)
!409 = !DILocation(line: 129, column: 5, scope: !371)
!410 = !DILocation(line: 132, column: 15, scope: !371)
!411 = !DILocation(line: 132, column: 21, scope: !371)
!412 = !DILocation(line: 132, column: 48, scope: !371)
!413 = !DILocation(line: 132, column: 54, scope: !371)
!414 = !DILocation(line: 132, column: 61, scope: !371)
!415 = !DILocation(line: 132, column: 29, scope: !371)
!416 = !DILocation(line: 133, column: 28, scope: !371)
!417 = !DILocation(line: 133, column: 34, scope: !371)
!418 = !DILocation(line: 133, column: 41, scope: !371)
!419 = !DILocation(line: 133, column: 9, scope: !371)
!420 = !DILocation(line: 132, column: 66, scope: !371)
!421 = !DILocation(line: 132, column: 5, scope: !371)
!422 = !DILocation(line: 136, column: 24, scope: !371)
!423 = !DILocation(line: 136, column: 30, scope: !371)
!424 = !DILocation(line: 136, column: 5, scope: !371)
!425 = !DILocation(line: 136, column: 13, scope: !371)
!426 = !DILocation(line: 136, column: 22, scope: !371)
!427 = !DILocation(line: 137, column: 5, scope: !371)
!428 = !DILocation(line: 137, column: 13, scope: !371)
!429 = !DILocation(line: 137, column: 21, scope: !371)
!430 = !DILocation(line: 138, column: 43, scope: !371)
!431 = !DILocation(line: 138, column: 49, scope: !371)
!432 = !DILocation(line: 138, column: 56, scope: !371)
!433 = !DILocation(line: 138, column: 24, scope: !371)
!434 = !DILocation(line: 138, column: 5, scope: !371)
!435 = !DILocation(line: 138, column: 13, scope: !371)
!436 = !DILocation(line: 138, column: 22, scope: !371)
!437 = !DILocation(line: 139, column: 42, scope: !371)
!438 = !DILocation(line: 139, column: 48, scope: !371)
!439 = !DILocation(line: 139, column: 55, scope: !371)
!440 = !DILocation(line: 139, column: 23, scope: !371)
!441 = !DILocation(line: 139, column: 5, scope: !371)
!442 = !DILocation(line: 139, column: 13, scope: !371)
!443 = !DILocation(line: 139, column: 21, scope: !371)
!444 = !DILocation(line: 140, column: 43, scope: !371)
!445 = !DILocation(line: 140, column: 49, scope: !371)
!446 = !DILocation(line: 140, column: 56, scope: !371)
!447 = !DILocation(line: 140, column: 24, scope: !371)
!448 = !DILocation(line: 140, column: 5, scope: !371)
!449 = !DILocation(line: 140, column: 13, scope: !371)
!450 = !DILocation(line: 140, column: 22, scope: !371)
!451 = !DILocation(line: 141, column: 42, scope: !371)
!452 = !DILocation(line: 141, column: 48, scope: !371)
!453 = !DILocation(line: 141, column: 55, scope: !371)
!454 = !DILocation(line: 141, column: 23, scope: !371)
!455 = !DILocation(line: 141, column: 5, scope: !371)
!456 = !DILocation(line: 141, column: 13, scope: !371)
!457 = !DILocation(line: 141, column: 21, scope: !371)
!458 = !DILocation(line: 142, column: 20, scope: !371)
!459 = !DILocation(line: 142, column: 26, scope: !371)
!460 = !DILocation(line: 142, column: 33, scope: !371)
!461 = !DILocation(line: 142, column: 5, scope: !371)
!462 = !DILocation(line: 144, column: 5, scope: !371)
!463 = !DILocation(line: 144, column: 11, scope: !371)
!464 = !DILocation(line: 144, column: 20, scope: !371)
!465 = !DILocation(line: 146, column: 5, scope: !371)
!466 = distinct !DISubprogram(name: "nn_stcp_recv", scope: !320, file: !320, line: 149, type: !277, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !372)
!467 = !DILocalVariable(name: "self", arg: 1, scope: !466, file: !320, line: 149, type: !265)
!468 = !DILocation(line: 149, column: 46, scope: !466)
!469 = !DILocalVariable(name: "msg", arg: 2, scope: !466, file: !320, line: 149, type: !279)
!470 = !DILocation(line: 149, column: 67, scope: !466)
!471 = !DILocalVariable(name: "stcp", scope: !466, file: !320, line: 151, type: !6)
!472 = !DILocation(line: 151, column: 21, scope: !466)
!473 = !DILocation(line: 153, column: 12, scope: !466)
!474 = !DILocation(line: 153, column: 10, scope: !466)
!475 = !DILocation(line: 155, column: 5, scope: !466)
!476 = !DILocation(line: 155, column: 5, scope: !477)
!477 = distinct !DILexicalBlock(scope: !478, file: !320, line: 155, column: 5)
!478 = distinct !DILexicalBlock(scope: !466, file: !320, line: 155, column: 5)
!479 = !DILocation(line: 155, column: 5, scope: !478)
!480 = !DILocation(line: 155, column: 5, scope: !481)
!481 = distinct !DILexicalBlock(scope: !477, file: !320, line: 155, column: 5)
!482 = !DILocation(line: 156, column: 5, scope: !466)
!483 = !DILocation(line: 156, column: 5, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !320, line: 156, column: 5)
!485 = distinct !DILexicalBlock(scope: !466, file: !320, line: 156, column: 5)
!486 = !DILocation(line: 156, column: 5, scope: !485)
!487 = !DILocation(line: 156, column: 5, scope: !488)
!488 = distinct !DILexicalBlock(scope: !484, file: !320, line: 156, column: 5)
!489 = !DILocation(line: 159, column: 16, scope: !466)
!490 = !DILocation(line: 159, column: 22, scope: !466)
!491 = !DILocation(line: 159, column: 28, scope: !466)
!492 = !DILocation(line: 159, column: 5, scope: !466)
!493 = !DILocation(line: 160, column: 19, scope: !466)
!494 = !DILocation(line: 160, column: 25, scope: !466)
!495 = !DILocation(line: 160, column: 5, scope: !466)
!496 = !DILocation(line: 163, column: 5, scope: !466)
!497 = !DILocation(line: 163, column: 11, scope: !466)
!498 = !DILocation(line: 163, column: 19, scope: !466)
!499 = !DILocation(line: 164, column: 20, scope: !466)
!500 = !DILocation(line: 164, column: 26, scope: !466)
!501 = !DILocation(line: 164, column: 33, scope: !466)
!502 = !DILocation(line: 164, column: 39, scope: !466)
!503 = !DILocation(line: 164, column: 5, scope: !466)
!504 = !DILocation(line: 166, column: 5, scope: !466)
!505 = distinct !DISubprogram(name: "nn_stcp_init", scope: !320, file: !320, line: 65, type: !506, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !372)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !6, !20, !508, !19}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !267, line: 81, size: 128, elements: !510)
!510 = !{!511, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !509, file: !267, line: 82, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !267, line: 70, size: 128, elements: !515)
!515 = !{!516, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !514, file: !267, line: 75, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !508}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !514, file: !267, line: 78, baseType: !517, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !509, file: !267, line: 83, baseType: !522, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !267, line: 83, flags: DIFlagFwdDecl)
!524 = !DILocalVariable(name: "self", arg: 1, scope: !505, file: !320, line: 65, type: !6)
!525 = !DILocation(line: 65, column: 36, scope: !505)
!526 = !DILocalVariable(name: "src", arg: 2, scope: !505, file: !320, line: 65, type: !20)
!527 = !DILocation(line: 65, column: 46, scope: !505)
!528 = !DILocalVariable(name: "epbase", arg: 3, scope: !505, file: !320, line: 66, type: !508)
!529 = !DILocation(line: 66, column: 23, scope: !505)
!530 = !DILocalVariable(name: "owner", arg: 4, scope: !505, file: !320, line: 66, type: !19)
!531 = !DILocation(line: 66, column: 46, scope: !505)
!532 = !DILocation(line: 68, column: 19, scope: !505)
!533 = !DILocation(line: 68, column: 25, scope: !505)
!534 = !DILocation(line: 68, column: 47, scope: !505)
!535 = !DILocation(line: 68, column: 52, scope: !505)
!536 = !DILocation(line: 68, column: 58, scope: !505)
!537 = !DILocation(line: 68, column: 5, scope: !505)
!538 = !DILocation(line: 69, column: 5, scope: !505)
!539 = !DILocation(line: 69, column: 11, scope: !505)
!540 = !DILocation(line: 69, column: 17, scope: !505)
!541 = !DILocation(line: 70, column: 25, scope: !505)
!542 = !DILocation(line: 70, column: 31, scope: !505)
!543 = !DILocation(line: 70, column: 66, scope: !505)
!544 = !DILocation(line: 70, column: 72, scope: !505)
!545 = !DILocation(line: 70, column: 5, scope: !505)
!546 = !DILocation(line: 71, column: 5, scope: !505)
!547 = !DILocation(line: 71, column: 11, scope: !505)
!548 = !DILocation(line: 71, column: 17, scope: !505)
!549 = !DILocation(line: 72, column: 5, scope: !505)
!550 = !DILocation(line: 72, column: 11, scope: !505)
!551 = !DILocation(line: 72, column: 23, scope: !505)
!552 = !DILocation(line: 72, column: 27, scope: !505)
!553 = !DILocation(line: 73, column: 5, scope: !505)
!554 = !DILocation(line: 73, column: 11, scope: !505)
!555 = !DILocation(line: 73, column: 23, scope: !505)
!556 = !DILocation(line: 73, column: 27, scope: !505)
!557 = !DILocation(line: 74, column: 24, scope: !505)
!558 = !DILocation(line: 74, column: 30, scope: !505)
!559 = !DILocation(line: 74, column: 65, scope: !505)
!560 = !DILocation(line: 74, column: 5, scope: !505)
!561 = !DILocation(line: 75, column: 5, scope: !505)
!562 = !DILocation(line: 75, column: 11, scope: !505)
!563 = !DILocation(line: 75, column: 19, scope: !505)
!564 = !DILocation(line: 76, column: 19, scope: !505)
!565 = !DILocation(line: 76, column: 25, scope: !505)
!566 = !DILocation(line: 76, column: 5, scope: !505)
!567 = !DILocation(line: 77, column: 5, scope: !505)
!568 = !DILocation(line: 77, column: 11, scope: !505)
!569 = !DILocation(line: 77, column: 20, scope: !505)
!570 = !DILocation(line: 78, column: 19, scope: !505)
!571 = !DILocation(line: 78, column: 25, scope: !505)
!572 = !DILocation(line: 78, column: 5, scope: !505)
!573 = !DILocation(line: 79, column: 25, scope: !505)
!574 = !DILocation(line: 79, column: 31, scope: !505)
!575 = !DILocation(line: 79, column: 5, scope: !505)
!576 = !DILocation(line: 80, column: 1, scope: !505)
!577 = distinct !DISubprogram(name: "nn_stcp_handler", scope: !320, file: !320, line: 169, type: !17, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !372)
!578 = !DILocalVariable(name: "self", arg: 1, scope: !577, file: !320, line: 169, type: !19)
!579 = !DILocation(line: 169, column: 45, scope: !577)
!580 = !DILocalVariable(name: "src", arg: 2, scope: !577, file: !320, line: 169, type: !20)
!581 = !DILocation(line: 169, column: 55, scope: !577)
!582 = !DILocalVariable(name: "type", arg: 3, scope: !577, file: !320, line: 169, type: !20)
!583 = !DILocation(line: 169, column: 64, scope: !577)
