; ModuleID = './src/transports/tcp/tcp.c'
source_filename = "./src/transports/tcp/tcp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_transport = type { ptr, i32, ptr, ptr, ptr, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_optset_vfptr = type { ptr, ptr, ptr }
%struct.nn_tcp_optset = type { %struct.nn_optset, i32 }
%struct.nn_optset = type { ptr }

@nn_tcp_vfptr = internal global %struct.nn_transport { ptr @.str, i32 -3, ptr null, ptr null, ptr @nn_tcp_bind, ptr @nn_tcp_connect, ptr @nn_tcp_optset, %struct.nn_list_item { ptr inttoptr (i64 -1 to ptr), ptr inttoptr (i64 -1 to ptr) } }, align 8, !dbg !0
@nn_tcp = dso_local global ptr @nn_tcp_vfptr, align 8, !dbg !44
@.str = private unnamed_addr constant [4 x i8] c"tcp\00", align 1, !dbg !91
@stderr = external global ptr, align 8
@.str.1 = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !96
@.str.2 = private unnamed_addr constant [27 x i8] c"./src/transports/tcp/tcp.c\00", align 1, !dbg !101
@nn_tcp_optset_vfptr = internal constant %struct.nn_optset_vfptr { ptr @nn_tcp_optset_destroy, ptr @nn_tcp_optset_setopt, ptr @nn_tcp_optset_getopt }, align 8, !dbg !106

; Function Attrs: noinline nounwind optnone uwtable
define internal i32 @nn_tcp_bind(ptr noundef %0, ptr noundef %1) #0 !dbg !116 {
  %3 = alloca ptr, align 8
  %4 = alloca ptr, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_tcp_vfptr", scope: !2, file: !7, line: 70, type: !47, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !43, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/transports/tcp/tcp.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2bea3ab5586d259787caf0c8b2018d97")
!4 = !{!5, !40, !42}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_tcp_optset", file: !7, line: 49, size: 128, elements: !8)
!7 = !DIFile(filename: "./src/transports/tcp/tcp.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2bea3ab5586d259787caf0c8b2018d97")
!8 = !{!9, !39}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !6, file: !7, line: 50, baseType: !10, size: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset", file: !11, line: 56, size: 64, elements: !12)
!11 = !DIFile(filename: "./src/transports/tcp/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !10, file: !11, line: 57, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_optset_vfptr", file: !11, line: 48, size: 192, elements: !17)
!17 = !{!18, !23, !33}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !16, file: !11, line: 49, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !16, file: !11, line: 50, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !22, !27, !28, !30}
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!32 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !16, file: !11, line: 52, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!27, !22, !27, !37, !38}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nodelay", scope: !6, file: !7, line: 51, baseType: !27, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!43 = !{!44, !91, !0, !96, !101, !106}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "nn_tcp", scope: !2, file: !7, line: 81, type: !46, isLocal: false, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_transport", file: !11, line: 190, size: 576, elements: !48)
!48 = !{!49, !52, !53, !57, !58, !79, !80, !84}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !47, file: !11, line: 194, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !47, file: !11, line: 197, baseType: !27, size: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !47, file: !11, line: 204, baseType: !54, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "term", scope: !47, file: !11, line: 205, baseType: !54, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "bind", scope: !47, file: !11, line: 213, baseType: !59, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!27, !37, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !11, line: 81, size: 128, elements: !65)
!65 = !{!66, !76}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !64, file: !11, line: 82, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !11, line: 70, size: 128, elements: !70)
!70 = !{!71, !75}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !69, file: !11, line: 75, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !63}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !69, file: !11, line: 78, baseType: !72, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !64, file: !11, line: 83, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !11, line: 83, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !47, file: !11, line: 214, baseType: !59, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "optset", scope: !47, file: !11, line: 219, baseType: !81, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!22}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !47, file: !11, line: 223, baseType: !85, size: 128, offset: 448)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !86, line: 26, size: 128, elements: !87)
!86 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!87 = !{!88, !90}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !86, line: 27, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !86, line: 28, baseType: !89, size: 64, offset: 64)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !7, line: 71, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 4)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !7, line: 98, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 184, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 23)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !7, line: 98, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 216, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 27)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "nn_tcp_optset_vfptr", scope: !2, file: !7, line: 59, type: !15, isLocal: true, isDefinition: true)
!108 = !{i32 7, !"Dwarf Version", i32 5}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{i32 8, !"PIC Level", i32 2}
!112 = !{i32 7, !"PIE Level", i32 2}
!113 = !{i32 7, !"uwtable", i32 2}
!114 = !{i32 7, !"frame-pointer", i32 2}
!115 = !{!"clang version 16.0.0"}
!116 = distinct !DISubprogram(name: "nn_tcp_bind", scope: !7, file: !7, line: 83, type: !60, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !117)
!117 = !{}
!118 = !DILocalVariable(name: "hint", arg: 1, scope: !116, file: !7, line: 83, type: !37)
!119 = !DILocation(line: 83, column: 31, scope: !116)
!120 = !DILocalVariable(name: "epbase", arg: 2, scope: !116, file: !7, line: 83, type: !62)
!121 = !DILocation(line: 83, column: 56, scope: !116)
!122 = !DILocation(line: 85, column: 28, scope: !116)
!123 = !DILocation(line: 85, column: 34, scope: !116)
!124 = !DILocation(line: 85, column: 12, scope: !116)
!125 = !DILocation(line: 85, column: 5, scope: !116)
!126 = distinct !DISubprogram(name: "nn_tcp_connect", scope: !7, file: !7, line: 88, type: !60, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !117)
!127 = !DILocalVariable(name: "hint", arg: 1, scope: !126, file: !7, line: 88, type: !37)
!128 = !DILocation(line: 88, column: 34, scope: !126)
!129 = !DILocalVariable(name: "epbase", arg: 2, scope: !126, file: !7, line: 88, type: !62)
!130 = !DILocation(line: 88, column: 59, scope: !126)
!131 = !DILocation(line: 90, column: 28, scope: !126)
!132 = !DILocation(line: 90, column: 34, scope: !126)
!133 = !DILocation(line: 90, column: 12, scope: !126)
!134 = !DILocation(line: 90, column: 5, scope: !126)
!135 = distinct !DISubprogram(name: "nn_tcp_optset", scope: !7, file: !7, line: 93, type: !82, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !117)
!136 = !DILocalVariable(name: "optset", scope: !135, file: !7, line: 95, type: !5)
!137 = !DILocation(line: 95, column: 27, scope: !135)
!138 = !DILocation(line: 97, column: 14, scope: !135)
!139 = !DILocation(line: 97, column: 12, scope: !135)
!140 = !DILocation(line: 98, column: 5, scope: !135)
!141 = !DILocation(line: 98, column: 5, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !7, line: 98, column: 5)
!143 = distinct !DILexicalBlock(scope: !135, file: !7, line: 98, column: 5)
!144 = !DILocation(line: 98, column: 5, scope: !143)
!145 = !DILocation(line: 98, column: 5, scope: !146)
!146 = distinct !DILexicalBlock(scope: !142, file: !7, line: 98, column: 5)
!147 = !DILocation(line: 99, column: 5, scope: !135)
