; ModuleID = './src/transports/utils/literal.c'
source_filename = "./src/transports/utils/literal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.in_addr = type { i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [17 x i8] c"%s [%d] (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"./src/transports/utils/literal.c\00", align 1, !dbg !7

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @nn_literal_resolve(ptr noundef %0, i64 noundef %1, i32 noundef %2, ptr noundef %3, ptr noundef %4) #0 !dbg !77 {
  %6 = alloca i32, align 4
  %7 = alloca ptr, align 8
  %8 = alloca i64, align 8
  %9 = alloca i32, align 4
  %10 = alloca ptr, align 8
  %11 = alloca ptr, align 8
  %12 = alloca i32, align 4
  %13 = alloca [46 x i8], align 16
  %14 = alloca %struct.in_addr, align 4
  %15 = alloca %struct.in6_addr, align 4
  store ptr %0, ptr %7, align 8
  call void @llvm.dbg.declare(metadata ptr %7, metadata !97, metadata !DIExpression()), !dbg !98
  store i64 %1, ptr %8, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/transports/utils/literal.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cdc6a8f0f937d2fa4565915c49658af7")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 17)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 33)
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !13, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !14, globals: !68, splitDebugInlining: false, nameTableKind: None)
!13 = !DIFile(filename: "src/transports/utils/literal.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cdc6a8f0f937d2fa4565915c49658af7")
!14 = !{!15, !55, !56}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !17, line: 260, size: 224, elements: !18)
!17 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!18 = !{!19, !23, !29, !33, !54}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !16, file: !17, line: 262, baseType: !20, size: 16)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !21, line: 28, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !16, file: !17, line: 263, baseType: !24, size: 16, offset: 16)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !17, line: 123, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 25, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !28, line: 40, baseType: !22)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !16, file: !17, line: 264, baseType: !30, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 26, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !28, line: 42, baseType: !32)
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !16, file: !17, line: 265, baseType: !34, size: 128, offset: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !17, line: 219, size: 128, elements: !35)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !34, file: !17, line: 226, baseType: !37, size: 128)
!37 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !17, line: 221, size: 128, elements: !38)
!38 = !{!39, !46, !50}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !37, file: !17, line: 223, baseType: !40, size: 128)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !44)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !26, line: 24, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !28, line: 38, baseType: !43)
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !{!45}
!45 = !DISubrange(count: 16)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !37, file: !17, line: 224, baseType: !47, size: 128)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !37, file: !17, line: 225, baseType: !51, size: 128)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 4)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !16, file: !17, line: 266, baseType: !30, size: 32, offset: 192)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !17, line: 245, size: 128, elements: !58)
!58 = !{!59, !60, !61, !66}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !57, file: !17, line: 247, baseType: !20, size: 16)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !57, file: !17, line: 248, baseType: !24, size: 16, offset: 16)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !57, file: !17, line: 249, baseType: !62, size: 32, offset: 32)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !17, line: 31, size: 32, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !62, file: !17, line: 33, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !17, line: 30, baseType: !30)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !57, file: !17, line: 252, baseType: !67, size: 64, offset: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !48)
!68 = !{!0, !7}
!69 = !{i32 7, !"Dwarf Version", i32 5}
!70 = !{i32 2, !"Debug Info Version", i32 3}
!71 = !{i32 1, !"wchar_size", i32 4}
!72 = !{i32 8, !"PIC Level", i32 2}
!73 = !{i32 7, !"PIE Level", i32 2}
!74 = !{i32 7, !"uwtable", i32 2}
!75 = !{i32 7, !"frame-pointer", i32 2}
!76 = !{!"clang version 16.0.0"}
!77 = distinct !DISubprogram(name: "nn_literal_resolve", scope: !2, file: !2, line: 34, type: !78, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !96)
!78 = !DISubroutineType(types: !79)
!79 = !{!55, !80, !82, !55, !85, !95}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!84 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !87, line: 193, size: 1024, elements: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!88 = !{!89, !90, !94}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !86, file: !87, line: 195, baseType: !20, size: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !86, file: !87, line: 196, baseType: !91, size: 944, offset: 16)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 944, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 118)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !86, file: !87, line: 197, baseType: !84, size: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!96 = !{}
!97 = !DILocalVariable(name: "addr", arg: 1, scope: !77, file: !2, line: 34, type: !80)
!98 = !DILocation(line: 34, column: 37, scope: !77)
!99 = !DILocalVariable(name: "addrlen", arg: 2, scope: !77, file: !2, line: 34, type: !82)
!100 = !DILocation(line: 34, column: 50, scope: !77)
!101 = !DILocalVariable(name: "ipv4only", arg: 3, scope: !77, file: !2, line: 35, type: !55)
!102 = !DILocation(line: 35, column: 9, scope: !77)
!103 = !DILocalVariable(name: "result", arg: 4, scope: !77, file: !2, line: 35, type: !85)
!104 = !DILocation(line: 35, column: 44, scope: !77)
!105 = !DILocalVariable(name: "resultlen", arg: 5, scope: !77, file: !2, line: 35, type: !95)
!106 = !DILocation(line: 35, column: 60, scope: !77)
!107 = !DILocalVariable(name: "rc", scope: !77, file: !2, line: 37, type: !55)
!108 = !DILocation(line: 37, column: 9, scope: !77)
!109 = !DILocalVariable(name: "addrz", scope: !77, file: !2, line: 38, type: !110)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 46)
!113 = !DILocation(line: 38, column: 10, scope: !77)
!114 = !DILocalVariable(name: "inaddr", scope: !77, file: !2, line: 40, type: !62)
!115 = !DILocation(line: 40, column: 20, scope: !77)
!116 = !DILocalVariable(name: "in6addr", scope: !77, file: !2, line: 41, type: !34)
!117 = !DILocation(line: 41, column: 21, scope: !77)
!118 = !DILocation(line: 46, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !77, file: !2, line: 46, column: 9)
!120 = !DILocation(line: 46, column: 17, scope: !119)
!121 = !DILocation(line: 46, column: 21, scope: !119)
!122 = !DILocation(line: 46, column: 24, scope: !119)
!123 = !DILocation(line: 46, column: 33, scope: !119)
!124 = !DILocation(line: 46, column: 9, scope: !77)
!125 = !DILocation(line: 47, column: 13, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !2, line: 47, column: 13)
!127 = distinct !DILexicalBlock(scope: !119, file: !2, line: 46, column: 41)
!128 = !DILocation(line: 47, column: 19, scope: !126)
!129 = !DILocation(line: 47, column: 27, scope: !126)
!130 = !DILocation(line: 47, column: 32, scope: !126)
!131 = !DILocation(line: 47, column: 13, scope: !127)
!132 = !DILocation(line: 48, column: 13, scope: !126)
!133 = !DILocation(line: 49, column: 13, scope: !134)
!134 = distinct !DILexicalBlock(scope: !127, file: !2, line: 49, column: 13)
!135 = !DILocation(line: 49, column: 21, scope: !134)
!136 = !DILocation(line: 49, column: 25, scope: !134)
!137 = !DILocation(line: 49, column: 29, scope: !134)
!138 = !DILocation(line: 49, column: 13, scope: !127)
!139 = !DILocation(line: 50, column: 13, scope: !134)
!140 = !DILocation(line: 51, column: 9, scope: !127)
!141 = !DILocation(line: 51, column: 24, scope: !127)
!142 = !DILocation(line: 51, column: 29, scope: !127)
!143 = !DILocation(line: 51, column: 34, scope: !127)
!144 = !DILocation(line: 51, column: 42, scope: !127)
!145 = !DILocation(line: 52, column: 16, scope: !127)
!146 = !DILocation(line: 52, column: 24, scope: !127)
!147 = !DILocation(line: 52, column: 9, scope: !127)
!148 = !DILocation(line: 52, column: 29, scope: !127)
!149 = !DILocation(line: 53, column: 5, scope: !127)
!150 = !DILocation(line: 55, column: 13, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !2, line: 55, column: 13)
!152 = distinct !DILexicalBlock(scope: !119, file: !2, line: 54, column: 10)
!153 = !DILocation(line: 55, column: 21, scope: !151)
!154 = !DILocation(line: 55, column: 25, scope: !151)
!155 = !DILocation(line: 55, column: 13, scope: !152)
!156 = !DILocation(line: 56, column: 13, scope: !151)
!157 = !DILocation(line: 57, column: 9, scope: !152)
!158 = !DILocation(line: 57, column: 24, scope: !152)
!159 = !DILocation(line: 57, column: 30, scope: !152)
