; ModuleID = './src/transports/utils/streamhdr.c'
source_filename = "./src/transports/utils/streamhdr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_streamhdr = type { %struct.nn_fsm, i32, %struct.nn_timer, ptr, %struct.nn_fsm_owner, ptr, [8 x i8], %struct.nn_fsm_event }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_timer = type { %struct.nn_fsm, i32, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_timer, %struct.nn_fsm_event, ptr, i32 }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_worker_timer = type { ptr, %struct.nn_timerset_hndl }
%struct.nn_timerset_hndl = type { %struct.nn_list_item, i64 }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_fsm_owner = type { i32, ptr }
%struct.nn_fsm_event = type { ptr, i32, ptr, i32, %struct.nn_queue_item }
%struct.nn_iovec = type { ptr, i64 }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [30 x i8] c"Assertion failed: %s (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [39 x i8] c"self->state == NN_STREAMHDR_STATE_IDLE\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [35 x i8] c"./src/transports/utils/streamhdr.c\00", align 1, !dbg !12

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/transports/utils/streamhdr.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "46808a1b89bd0035c15152a1086fe504")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 30)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 39)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 35)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 53)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 24)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 9)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 2)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 206, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 5)
!42 = distinct !DICompileUnit(language: DW_LANG_C11, file: !43, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !44, globals: !343, splitDebugInlining: false, nameTableKind: None)
!43 = !DIFile(filename: "src/transports/utils/streamhdr.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "46808a1b89bd0035c15152a1086fe504")
!44 = !{!45, !46, !51, !342}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !47, line: 25, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !49, line: 40, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_streamhdr", file: !53, line: 41, size: 3008, elements: !54)
!53 = !DIFile(filename: "./src/transports/utils/streamhdr.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7d060aeed02236eba444409cfc4451d2")
!54 = !{!55, !86, !87, !229, !294, !299, !337, !341}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !52, file: !53, line: 44, baseType: !56, size: 640)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !57, line: 66, size: 640, elements: !58)
!57 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!58 = !{!59, !66, !67, !68, !69, !70, !73}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !56, file: !57, line: 67, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !57, line: 58, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64, !65, !65, !45}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !56, file: !57, line: 68, baseType: !65, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !56, file: !57, line: 69, baseType: !65, size: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !56, file: !57, line: 70, baseType: !45, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !56, file: !57, line: 71, baseType: !64, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !56, file: !57, line: 72, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !57, line: 30, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !56, file: !57, line: 73, baseType: !74, size: 320, offset: 320)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !57, line: 34, size: 320, elements: !75)
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !74, file: !57, line: 35, baseType: !64, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !74, file: !57, line: 36, baseType: !65, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !74, file: !57, line: 37, baseType: !45, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !57, line: 38, baseType: !65, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !74, file: !57, line: 39, baseType: !81, size: 64, offset: 256)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !82, line: 33, size: 64, elements: !83)
!82 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !82, line: 34, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !52, file: !53, line: 45, baseType: !65, size: 32, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !52, file: !53, line: 48, baseType: !88, size: 1664, offset: 704)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timer", file: !89, line: 32, size: 1664, elements: !90)
!89 = !DIFile(filename: "./src/transports/utils/../../aio/timer.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "36b8c8892aa99fc49b85b12a9caf893a")
!90 = !{!91, !92, !93, !99, !100, !120, !121, !228}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !88, file: !89, line: 33, baseType: !56, size: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !88, file: !89, line: 34, baseType: !65, size: 32, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "start_task", scope: !88, file: !89, line: 35, baseType: !94, size: 128, offset: 704)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !95, line: 48, size: 128, elements: !96)
!95 = !DIFile(filename: "src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !94, file: !95, line: 49, baseType: !64, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !94, file: !95, line: 50, baseType: !81, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "stop_task", scope: !88, file: !89, line: 36, baseType: !94, size: 128, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "wtimer", scope: !88, file: !89, line: 37, baseType: !101, size: 256, offset: 960)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !102, line: 37, size: 256, elements: !103)
!102 = !DIFile(filename: "src/aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !101, file: !102, line: 38, baseType: !64, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !101, file: !102, line: 39, baseType: !106, size: 192, offset: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !107, line: 32, size: 192, elements: !108)
!107 = !DIFile(filename: "src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!108 = !{!109, !116}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !106, file: !107, line: 33, baseType: !110, size: 128)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !111, line: 26, size: 128, elements: !112)
!111 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!112 = !{!113, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !111, line: 27, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !111, line: 28, baseType: !114, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !106, file: !107, line: 34, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 27, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 45, baseType: !119)
!119 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !88, file: !89, line: 38, baseType: !74, size: 320, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !88, file: !89, line: 39, baseType: !122, size: 64, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !95, line: 53, size: 1408, elements: !124)
!124 = !{!125, !161, !166, !167, !173, !200, !201, !215}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !123, file: !95, line: 54, baseType: !126, size: 320)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !127, line: 32, size: 320, elements: !128)
!127 = !DIFile(filename: "src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !126, file: !127, line: 36, baseType: !130, size: 320)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !131, line: 72, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !131, line: 67, size: 320, elements: !133)
!133 = !{!134, !155, !159}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !132, file: !131, line: 69, baseType: !135, size: 320)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !136, line: 22, size: 320, elements: !137)
!136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!137 = !{!138, !139, !141, !142, !143, !144, !146, !147}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !135, file: !136, line: 24, baseType: !65, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !135, file: !136, line: 25, baseType: !140, size: 32, offset: 32)
!140 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !135, file: !136, line: 26, baseType: !65, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !135, file: !136, line: 28, baseType: !140, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !135, file: !136, line: 32, baseType: !65, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !135, file: !136, line: 34, baseType: !145, size: 16, offset: 160)
!145 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !135, file: !136, line: 35, baseType: !145, size: 16, offset: 176)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !135, file: !136, line: 36, baseType: !148, size: 128, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !149, line: 55, baseType: !150)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !149, line: 51, size: 128, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !150, file: !149, line: 53, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !150, file: !149, line: 54, baseType: !153, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !132, file: !131, line: 70, baseType: !156, size: 320)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 40)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !132, file: !131, line: 71, baseType: !160, size: 64)
!160 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !123, file: !95, line: 55, baseType: !162, size: 128, offset: 320)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !82, line: 37, size: 128, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !162, file: !82, line: 38, baseType: !85, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !162, file: !82, line: 39, baseType: !85, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !123, file: !95, line: 56, baseType: !81, size: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !123, file: !95, line: 57, baseType: !168, size: 64, offset: 512)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !169, line: 25, size: 64, elements: !170)
!169 = !DIFile(filename: "src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !168, file: !169, line: 26, baseType: !65, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !168, file: !169, line: 27, baseType: !65, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !123, file: !95, line: 58, baseType: !174, size: 320, offset: 576)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !175, line: 31, size: 320, elements: !176)
!175 = !DIFile(filename: "src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!176 = !{!177, !178, !179, !180, !188, !199}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !174, file: !175, line: 34, baseType: !65, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !174, file: !175, line: 37, baseType: !65, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !174, file: !175, line: 40, baseType: !65, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !174, file: !175, line: 43, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !183, line: 36, size: 64, elements: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!184 = !{!185, !186, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !182, file: !183, line: 38, baseType: !65, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !182, file: !183, line: 39, baseType: !145, size: 16, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !182, file: !183, line: 40, baseType: !145, size: 16, offset: 48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !174, file: !175, line: 52, baseType: !189, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !175, line: 48, size: 128, elements: !191)
!191 = !{!192, !197, !198}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !190, file: !175, line: 49, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !175, line: 27, size: 32, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !194, file: !175, line: 28, baseType: !65, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !175, line: 50, baseType: !65, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !175, line: 51, baseType: !65, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !174, file: !175, line: 55, baseType: !65, size: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !123, file: !95, line: 59, baseType: !194, size: 32, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !123, file: !95, line: 60, baseType: !202, size: 256, offset: 960)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !107, line: 37, size: 256, elements: !203)
!203 = !{!204, !210}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !202, file: !107, line: 38, baseType: !205, size: 128)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !206, line: 31, size: 128, elements: !207)
!206 = !DIFile(filename: "src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !205, file: !206, line: 33, baseType: !117, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !205, file: !206, line: 34, baseType: !117, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !202, file: !107, line: 39, baseType: !211, size: 128, offset: 128)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !111, line: 31, size: 128, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !211, file: !111, line: 32, baseType: !114, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !211, file: !111, line: 33, baseType: !114, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !123, file: !95, line: 61, baseType: !216, size: 192, offset: 1216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !217, line: 25, size: 192, elements: !218)
!217 = !DIFile(filename: "src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!218 = !{!219, !225, !226}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !216, file: !217, line: 27, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !222, line: 28, baseType: !223)
!222 = !DIFile(filename: "src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!223 = !DISubroutineType(types: !224)
!224 = !{null, !45}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !216, file: !217, line: 28, baseType: !45, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !216, file: !217, line: 29, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !131, line: 27, baseType: !119)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !88, file: !89, line: 40, baseType: !65, size: 32, offset: 1600)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !52, file: !53, line: 51, baseType: !230, size: 64, offset: 2368)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_usock", file: !232, line: 29, size: 4224, elements: !233)
!232 = !DIFile(filename: "src/aio/usock_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "31b785bc46a858e5ba003f912abaeac8")
!233 = !{!234, !235, !236, !237, !238, !243, !257, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !231, file: !232, line: 32, baseType: !56, size: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !231, file: !232, line: 33, baseType: !65, size: 32, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !231, file: !232, line: 36, baseType: !122, size: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !231, file: !232, line: 39, baseType: !65, size: 32, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "wfd", scope: !231, file: !232, line: 40, baseType: !239, size: 128, offset: 832)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_fd", file: !95, line: 40, size: 128, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !239, file: !95, line: 41, baseType: !64, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !239, file: !95, line: 42, baseType: !194, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !231, file: !232, line: 59, baseType: !244, size: 320, offset: 960)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !232, line: 43, size: 320, elements: !245)
!245 = !{!246, !251, !254, !255, !256}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !232, line: 46, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 24, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !49, line: 38, baseType: !250)
!250 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !232, line: 47, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 46, baseType: !119)
!253 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !244, file: !232, line: 50, baseType: !247, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "batch_len", scope: !244, file: !232, line: 53, baseType: !252, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "batch_pos", scope: !244, file: !232, line: 58, baseType: !252, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !231, file: !232, line: 69, baseType: !258, size: 832, offset: 1280)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !231, file: !232, line: 62, size: 832, elements: !259)
!259 = !{!260, !279}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !258, file: !232, line: 65, baseType: !261, size: 448)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !262, line: 259, size: 448, elements: !263)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!263 = !{!264, !265, !268, !275, !276, !277, !278}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !261, file: !262, line: 261, baseType: !45, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !261, file: !262, line: 262, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !262, line: 33, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !49, line: 210, baseType: !140)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !261, file: !262, line: 264, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !271, line: 26, size: 128, elements: !272)
!271 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !270, file: !271, line: 28, baseType: !45, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !270, file: !271, line: 29, baseType: !252, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !261, file: !262, line: 265, baseType: !252, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !261, file: !262, line: 267, baseType: !45, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !261, file: !262, line: 268, baseType: !252, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !261, file: !262, line: 273, baseType: !65, size: 32, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !258, file: !232, line: 68, baseType: !280, size: 384, offset: 448)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 384, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 3)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "task_connecting", scope: !231, file: !232, line: 72, baseType: !94, size: 128, offset: 2112)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "task_connected", scope: !231, file: !232, line: 73, baseType: !94, size: 128, offset: 2240)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "task_accept", scope: !231, file: !232, line: 74, baseType: !94, size: 128, offset: 2368)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "task_send", scope: !231, file: !232, line: 75, baseType: !94, size: 128, offset: 2496)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "task_recv", scope: !231, file: !232, line: 76, baseType: !94, size: 128, offset: 2624)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "task_stop", scope: !231, file: !232, line: 77, baseType: !94, size: 128, offset: 2752)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "event_established", scope: !231, file: !232, line: 80, baseType: !74, size: 320, offset: 2880)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "event_sent", scope: !231, file: !232, line: 81, baseType: !74, size: 320, offset: 3200)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "event_received", scope: !231, file: !232, line: 82, baseType: !74, size: 320, offset: 3520)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "event_error", scope: !231, file: !232, line: 83, baseType: !74, size: 320, offset: 3840)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "asock", scope: !231, file: !232, line: 87, baseType: !230, size: 64, offset: 4160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "usock_owner", scope: !52, file: !53, line: 54, baseType: !295, size: 128, offset: 2432)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_owner", file: !57, line: 61, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !295, file: !57, line: 62, baseType: !65, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !295, file: !57, line: 63, baseType: !64, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !52, file: !53, line: 57, baseType: !300, size: 64, offset: 2560)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase", file: !302, line: 147, size: 1536, elements: !303)
!302 = !DIFile(filename: "./src/transports/utils/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!303 = !{!304, !305, !328, !329, !330, !331, !334, !335, !336}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !301, file: !302, line: 148, baseType: !56, size: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !301, file: !302, line: 149, baseType: !306, size: 64, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase_vfptr", file: !302, line: 134, size: 128, elements: !309)
!309 = !{!310, !327}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !308, file: !302, line: 138, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!65, !300, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !316, line: 30, size: 512, elements: !317)
!316 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!317 = !{!318, !326}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !315, file: !316, line: 33, baseType: !319, size: 256)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !320, line: 39, size: 256, elements: !321)
!320 = !DIFile(filename: "src/aio/../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !319, file: !320, line: 40, baseType: !323, size: 256)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 256, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !315, file: !316, line: 36, baseType: !319, size: 256, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !308, file: !302, line: 142, baseType: !311, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !301, file: !302, line: 150, baseType: !248, size: 8, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !301, file: !302, line: 151, baseType: !248, size: 8, offset: 712)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !301, file: !302, line: 152, baseType: !248, size: 8, offset: 720)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !301, file: !302, line: 153, baseType: !332, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !302, line: 39, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !302, line: 154, baseType: !45, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !301, file: !302, line: 155, baseType: !74, size: 320, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !301, file: !302, line: 156, baseType: !74, size: 320, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "protohdr", scope: !52, file: !53, line: 60, baseType: !338, size: 64, offset: 2624)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 64, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !52, file: !53, line: 63, baseType: !74, size: 320, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!343 = !{!0, !7, !12, !17, !22, !27, !32, !37}
!344 = !{i32 7, !"Dwarf Version", i32 5}
!345 = !{i32 2, !"Debug Info Version", i32 3}
!346 = !{i32 1, !"wchar_size", i32 4}
!347 = !{i32 8, !"PIC Level", i32 2}
!348 = !{i32 7, !"PIE Level", i32 2}
!349 = !{i32 7, !"uwtable", i32 2}
!350 = !{i32 7, !"frame-pointer", i32 2}
!351 = !{!"clang version 16.0.0"}
!352 = distinct !DISubprogram(name: "nn_streamhdr_init", scope: !2, file: !2, line: 50, type: !353, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !42, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !51, !65, !64}
!355 = !{}
!356 = !DILocalVariable(name: "self", arg: 1, scope: !352, file: !2, line: 50, type: !51)
!357 = !DILocation(line: 50, column: 46, scope: !352)
!358 = !DILocalVariable(name: "src", arg: 2, scope: !352, file: !2, line: 50, type: !65)
!359 = !DILocation(line: 50, column: 56, scope: !352)
!360 = !DILocalVariable(name: "owner", arg: 3, scope: !352, file: !2, line: 51, type: !64)
!361 = !DILocation(line: 51, column: 20, scope: !352)
!362 = !DILocation(line: 53, column: 19, scope: !352)
!363 = !DILocation(line: 53, column: 25, scope: !352)
!364 = !DILocation(line: 53, column: 52, scope: !352)
!365 = !DILocation(line: 53, column: 57, scope: !352)
!366 = !DILocation(line: 53, column: 63, scope: !352)
!367 = !DILocation(line: 53, column: 5, scope: !352)
!368 = !DILocation(line: 54, column: 5, scope: !352)
!369 = !DILocation(line: 54, column: 11, scope: !352)
!370 = !DILocation(line: 54, column: 17, scope: !352)
!371 = !DILocation(line: 55, column: 21, scope: !352)
!372 = !DILocation(line: 55, column: 27, scope: !352)
!373 = !DILocation(line: 55, column: 59, scope: !352)
!374 = !DILocation(line: 55, column: 65, scope: !352)
!375 = !DILocation(line: 55, column: 5, scope: !352)
!376 = !DILocation(line: 56, column: 25, scope: !352)
!377 = !DILocation(line: 56, column: 31, scope: !352)
!378 = !DILocation(line: 56, column: 5, scope: !352)
!379 = !DILocation(line: 58, column: 5, scope: !352)
!380 = !DILocation(line: 58, column: 11, scope: !352)
!381 = !DILocation(line: 58, column: 17, scope: !352)
!382 = !DILocation(line: 59, column: 5, scope: !352)
!383 = !DILocation(line: 59, column: 11, scope: !352)
!384 = !DILocation(line: 59, column: 23, scope: !352)
!385 = !DILocation(line: 59, column: 27, scope: !352)
!386 = !DILocation(line: 60, column: 5, scope: !352)
!387 = !DILocation(line: 60, column: 11, scope: !352)
!388 = !DILocation(line: 60, column: 23, scope: !352)
!389 = !DILocation(line: 60, column: 27, scope: !352)
!390 = !DILocation(line: 61, column: 5, scope: !352)
!391 = !DILocation(line: 61, column: 11, scope: !352)
!392 = !DILocation(line: 61, column: 20, scope: !352)
!393 = !DILocation(line: 62, column: 1, scope: !352)
!394 = distinct !DISubprogram(name: "nn_streamhdr_handler", scope: !2, file: !2, line: 110, type: !62, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !42, retainedNodes: !355)
!395 = !DILocalVariable(name: "self", arg: 1, scope: !394, file: !2, line: 110, type: !64)
!396 = !DILocation(line: 110, column: 50, scope: !394)
!397 = !DILocalVariable(name: "src", arg: 2, scope: !394, file: !2, line: 110, type: !65)
!398 = !DILocation(line: 110, column: 60, scope: !394)
!399 = !DILocalVariable(name: "type", arg: 3, scope: !394, file: !2, line: 110, type: !65)
!400 = !DILocation(line: 110, column: 69, scope: !394)
!401 = !DILocalVariable(name: "srcptr", arg: 4, scope: !394, file: !2, line: 111, type: !45)
!402 = !DILocation(line: 111, column: 11, scope: !394)
!403 = !DILocalVariable(name: "streamhdr", scope: !394, file: !2, line: 113, type: !51)
!404 = !DILocation(line: 113, column: 26, scope: !394)
!405 = !DILocalVariable(name: "iovec", scope: !394, file: !2, line: 114, type: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_iovec", file: !407, line: 165, size: 128, elements: !408)
!407 = !DIFile(filename: "src/nn.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "0c95956590725e5a1eedd7f7b192cc23")
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !406, file: !407, line: 166, baseType: !45, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !406, file: !407, line: 167, baseType: !252, size: 64, offset: 64)
!411 = !DILocation(line: 114, column: 21, scope: !394)
!412 = !DILocalVariable(name: "protocol", scope: !394, file: !2, line: 115, type: !65)
!413 = !DILocation(line: 115, column: 9, scope: !394)
!414 = !DILocation(line: 117, column: 17, scope: !394)
!415 = !DILocation(line: 117, column: 15, scope: !394)
!416 = !DILocation(line: 122, column: 9, scope: !417)
!417 = distinct !DILexicalBlock(scope: !394, file: !2, line: 122, column: 9)
!418 = !DILocation(line: 0, scope: !417)
!419 = !DILocation(line: 122, column: 9, scope: !394)
!420 = !DILocation(line: 123, column: 25, scope: !421)
!421 = distinct !DILexicalBlock(scope: !417, file: !2, line: 122, column: 64)
!422 = !DILocation(line: 123, column: 36, scope: !421)
!423 = !DILocation(line: 123, column: 9, scope: !421)
!424 = !DILocation(line: 124, column: 9, scope: !421)
!425 = !DILocation(line: 124, column: 20, scope: !421)
!426 = !DILocation(line: 124, column: 26, scope: !421)
!427 = !DILocation(line: 125, column: 5, scope: !421)
!428 = !DILocation(line: 126, column: 9, scope: !429)
!429 = distinct !DILexicalBlock(scope: !394, file: !2, line: 126, column: 9)
!430 = !DILocation(line: 126, column: 9, scope: !394)
!431 = !DILocation(line: 127, column: 32, scope: !432)
!432 = distinct !DILexicalBlock(scope: !433, file: !2, line: 127, column: 13)
!433 = distinct !DILexicalBlock(scope: !429, file: !2, line: 126, column: 68)
!434 = !DILocation(line: 127, column: 43, scope: !432)
!435 = !DILocation(line: 127, column: 14, scope: !432)
!436 = !DILocation(line: 127, column: 13, scope: !433)
!437 = !DILocation(line: 128, column: 13, scope: !432)
!438 = !DILocation(line: 129, column: 9, scope: !433)
!439 = !DILocation(line: 129, column: 20, scope: !433)
!440 = !DILocation(line: 129, column: 26, scope: !433)
!441 = !DILocation(line: 130, column: 26, scope: !433)
!442 = !DILocation(line: 130, column: 37, scope: !433)
!443 = !DILocation(line: 130, column: 9, scope: !433)
!444 = !DILocation(line: 131, column: 9, scope: !433)
!445 = !DILocation(line: 134, column: 13, scope: !394)
!446 = !DILocation(line: 134, column: 24, scope: !394)
!447 = !DILocation(line: 134, column: 5, scope: !394)
!448 = !DILocation(line: 140, column: 17, scope: !449)
!449 = distinct !DILexicalBlock(scope: !394, file: !2, line: 134, column: 31)
!450 = !DILocation(line: 140, column: 9, scope: !449)
!451 = !DILocation(line: 143, column: 21, scope: !452)
!452 = distinct !DILexicalBlock(scope: !449, file: !2, line: 140, column: 22)
!453 = !DILocation(line: 143, column: 13, scope: !452)
!454 = !DILocation(line: 145, column: 34, scope: !455)
!455 = distinct !DILexicalBlock(scope: !452, file: !2, line: 143, column: 27)
!456 = !DILocation(line: 145, column: 45, scope: !455)
!457 = !DILocation(line: 145, column: 17, scope: !455)
!458 = !DILocation(line: 146, column: 34, scope: !455)
!459 = !DILocation(line: 146, column: 45, scope: !455)
!460 = !DILocation(line: 146, column: 23, scope: !455)
!461 = !DILocation(line: 146, column: 32, scope: !455)
!462 = !DILocation(line: 147, column: 23, scope: !455)
!463 = !DILocation(line: 147, column: 31, scope: !455)
!464 = !DILocation(line: 148, column: 32, scope: !455)
!465 = !DILocation(line: 148, column: 43, scope: !455)
!466 = !DILocation(line: 148, column: 17, scope: !455)
!467 = !DILocation(line: 149, column: 17, scope: !455)
!468 = !DILocation(line: 149, column: 28, scope: !455)
!469 = !DILocation(line: 149, column: 34, scope: !455)
!470 = !DILocation(line: 150, column: 17, scope: !455)
!471 = !DILocation(line: 152, column: 17, scope: !455)
!472 = !DILocation(line: 152, column: 17, scope: !473)
!473 = distinct !DILexicalBlock(scope: !474, file: !2, line: 152, column: 17)
!474 = distinct !DILexicalBlock(scope: !475, file: !2, line: 152, column: 17)
!475 = distinct !DILexicalBlock(scope: !455, file: !2, line: 152, column: 17)
!476 = !DILocation(line: 153, column: 13, scope: !455)
