; ModuleID = '/home/raj/coturn/src/server/ns_turn_allocation.c'
source_filename = "/home/raj/coturn/src/server/ns_turn_allocation.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._allocation = type { i32, %struct.stun_tid, %struct._turn_permission_hashtable, [2 x %struct.relay_endpoint_session], [2 x i32], %struct._ch_map, ptr, ptr, %struct._tcp_connection_list }
%struct.stun_tid = type { [12 x i8] }
%struct._turn_permission_hashtable = type { [8 x %struct._turn_permission_array] }
%struct._turn_permission_array = type { [3 x %struct._turn_permission_slot], i64, ptr }
%struct._turn_permission_slot = type { %struct._turn_permission_info }
%struct._turn_permission_info = type { i32, %struct._lm_map, %union.ioa_addr, i32, ptr, ptr, i32, i64 }
%struct._lm_map = type { [8 x %struct._lm_map_array] }
%struct._lm_map_array = type { [3 x i64], [3 x i64], i64, ptr, ptr }
%union.ioa_addr = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.relay_endpoint_session = type { ptr, i32, ptr }
%struct._ch_map = type { [8 x %struct._chn_map_array] }
%struct._chn_map_array = type { [3 x %struct._ch_info], i64, ptr }
%struct._ch_info = type { i16, i32, i16, %union.ioa_addr, i32, ptr, ptr, ptr }
%struct._tcp_connection_list = type { i64, ptr }

!19 = distinct !DIGlobalVariable(scope: null, file: !2, line: 304, type: !20, isLocal: true, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 62)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 304, type: !25, isLocal: true, isDefinition: true)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 20)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(scope: null, file: !2, line: 311, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 512, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 64)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(scope: null, file: !2, line: 613, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 60)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(scope: null, file: !2, line: 613, type: !14, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(scope: null, file: !2, line: 288, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 52)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !2, line: 288, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 320, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 40)
!50 = distinct !DICompileUnit(language: DW_LANG_C11, file: !51, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !70, globals: !299, splitDebugInlining: false, nameTableKind: None)
!51 = !DIFile(filename: "/home/raj/coturn/src/server/ns_turn_allocation.c", directory: "/home/raj/coturn/build", checksumkind: CSK_MD5, checksum: "8047f23c0c79d27e9f4fd57e487c0bad")
!52 = !{!53, !63}
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_TC_STATE", file: !54, line: 67, baseType: !55, size: 32, elements: !56)
!54 = !DIFile(filename: "src/server/ns_turn_allocation.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0cb2cf61c9ec5dd3030a6e5a6f8d4af1")
!55 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!56 = !{!57, !58, !59, !60, !61, !62}
!57 = !DIEnumerator(name: "TC_STATE_UNKNOWN", value: 0)
!58 = !DIEnumerator(name: "TC_STATE_CLIENT_TO_PEER_CONNECTING", value: 1)
!59 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTING", value: 2)
!60 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTED", value: 3)
!61 = !DIEnumerator(name: "TC_STATE_READY", value: 4)
!62 = !DIEnumerator(name: "TC_STATE_FAILED", value: 5)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 47, baseType: !55, size: 32, elements: !65)
!64 = !DIFile(filename: "src/apps/common/ns_turn_utils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "74cb4019b1eb9d8e2b879df518b15a25")
!65 = !{!66, !67, !68, !69}
!66 = !DIEnumerator(name: "TURN_LOG_LEVEL_INFO", value: 0)
!67 = !DIEnumerator(name: "TURN_LOG_LEVEL_CONTROL", value: 1)
!68 = !DIEnumerator(name: "TURN_LOG_LEVEL_WARNING", value: 2)
!69 = !DIEnumerator(name: "TURN_LOG_LEVEL_ERROR", value: 3)
!70 = !{!71, !72, !78, !89, !84, !88, !188, !110, !200, !201, !206, !207, !243, !87, !244, !241, !151}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !74, line: 24, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !76, line: 38, baseType: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "foreachcb_type", file: !79, line: 52, baseType: !80)
!79 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !84, !88}
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !79, line: 47, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !74, line: 27, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !76, line: 45, baseType: !87)
!87 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !79, line: 48, baseType: !87)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_info", file: !54, line: 152, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_info", file: !54, line: 143, size: 5184, elements: !92)
!92 = !{!93, !94, !120, !178, !181, !184, !185, !186}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !91, file: !54, line: 144, baseType: !83, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !91, file: !54, line: 145, baseType: !95, size: 4608, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map", file: !79, line: 117, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map", file: !79, line: 115, size: 4608, elements: !97)
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !96, file: !79, line: 116, baseType: !99, size: 4608)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 4608, elements: !118)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map_array", file: !79, line: 113, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map_array", file: !79, line: 107, size: 576, elements: !102)
!102 = !{!103, !107, !109, !112, !115}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "main_keys", scope: !101, file: !79, line: 108, baseType: !104, size: 192)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 3)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "main_values", scope: !101, file: !79, line: 109, baseType: !108, size: 192, offset: 192)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 192, elements: !105)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !101, file: !79, line: 110, baseType: !110, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !87)
!111 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "extra_keys", scope: !101, file: !79, line: 111, baseType: !113, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !101, file: !79, line: 112, baseType: !116, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!118 = !{!119}
!119 = !DISubrange(count: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !91, file: !54, line: 146, baseType: !121, size: 224, offset: 4672)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !122, line: 48, baseType: !123)
!122 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !122, line: 44, size: 224, elements: !124)
!124 = !{!125, !137, !155}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !123, file: !122, line: 45, baseType: !126, size: 128)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !127, line: 180, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!128 = !{!129, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !126, file: !127, line: 182, baseType: !130, size: 16)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !131, line: 28, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !126, file: !127, line: 183, baseType: !134, size: 112, offset: 16)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 14)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !123, file: !122, line: 46, baseType: !138, size: 128)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !139, line: 245, size: 128, elements: !140)
!139 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!140 = !{!141, !142, !146, !153}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !138, file: !139, line: 247, baseType: !130, size: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !138, file: !139, line: 248, baseType: !143, size: 16, offset: 16)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !139, line: 123, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !74, line: 25, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !76, line: 40, baseType: !132)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !138, file: !139, line: 249, baseType: !147, size: 32, offset: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !139, line: 31, size: 32, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !147, file: !139, line: 33, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !139, line: 30, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !74, line: 26, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !76, line: 42, baseType: !55)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !138, file: !139, line: 252, baseType: !154, size: 64, offset: 64)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !118)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !123, file: !122, line: 47, baseType: !156, size: 224)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !139, line: 260, size: 224, elements: !157)
!157 = !{!158, !159, !160, !161, !177}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !156, file: !139, line: 262, baseType: !130, size: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !156, file: !139, line: 263, baseType: !143, size: 16, offset: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !156, file: !139, line: 264, baseType: !151, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !156, file: !139, line: 265, baseType: !162, size: 128, offset: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !139, line: 219, size: 128, elements: !163)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !162, file: !139, line: 226, baseType: !165, size: 128)
!165 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !162, file: !139, line: 221, size: 128, elements: !166)
!166 = !{!167, !171, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !165, file: !139, line: 223, baseType: !168, size: 128)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 128, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 16)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !165, file: !139, line: 224, baseType: !172, size: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, elements: !118)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !165, file: !139, line: 225, baseType: !174, size: 128)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 128, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 4)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !156, file: !139, line: 266, baseType: !151, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !91, file: !54, line: 147, baseType: !179, size: 32, offset: 4896)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !180, line: 108, baseType: !151)
!180 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !91, file: !54, line: 148, baseType: !182, size: 64, offset: 4928)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !183, line: 122, baseType: !71)
!183 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !91, file: !54, line: 149, baseType: !71, size: 64, offset: 4992)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !91, file: !54, line: 150, baseType: !83, size: 32, offset: 5056)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !91, file: !54, line: 151, baseType: !187, size: 64, offset: 5120)
!187 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_info", file: !54, line: 121, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_info", file: !54, line: 112, size: 576, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !190, file: !54, line: 113, baseType: !144, size: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !190, file: !54, line: 114, baseType: !83, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !190, file: !54, line: 115, baseType: !144, size: 16, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !190, file: !54, line: 116, baseType: !121, size: 224, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !190, file: !54, line: 117, baseType: !179, size: 32, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !190, file: !54, line: 118, baseType: !182, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !190, file: !54, line: 119, baseType: !71, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_channel", scope: !190, file: !54, line: 120, baseType: !71, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_slot", file: !54, line: 156, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_slot", file: !54, line: 154, size: 5184, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !203, file: !54, line: 155, baseType: !90, size: 5184)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection", file: !183, line: 50, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection", file: !54, line: 85, size: 960, elements: !210)
!210 = !{!211, !213, !215, !216, !221, !222, !223, !224, !233, !234, !235}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !209, file: !54, line: 87, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "TC_STATE", file: !54, line: 76, baseType: !53)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !209, file: !54, line: 88, baseType: !214, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_id", file: !54, line: 78, baseType: !151)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !209, file: !54, line: 89, baseType: !121, size: 224, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "client_s", scope: !209, file: !54, line: 90, baseType: !217, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !183, line: 116, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !183, line: 115, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !183, line: 114, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "peer_s", scope: !209, file: !54, line: 91, baseType: !217, size: 64, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "peer_conn_timeout", scope: !209, file: !54, line: 92, baseType: !182, size: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bind_timeout", scope: !209, file: !54, line: 93, baseType: !182, size: 64, offset: 512)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !209, file: !54, line: 94, baseType: !225, size: 96, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !226, line: 52, baseType: !227)
!226 = !DIFile(filename: "src/client/ns_turn_msg.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "43c56357294df21a547ee0716fe3769d")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 47, size: 96, elements: !228)
!228 = !{!229}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !227, file: !226, line: 51, baseType: !230, size: 96)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 96, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 12)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !209, file: !54, line: 95, baseType: !71, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !209, file: !54, line: 96, baseType: !83, size: 32, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ub_to_client", scope: !209, file: !54, line: 97, baseType: !236, size: 128, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "unsent_buffer", file: !54, line: 83, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 80, size: 128, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !237, file: !54, line: 81, baseType: !110, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !237, file: !54, line: 82, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !183, line: 124, baseType: !71)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation", file: !54, line: 186, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_allocation", file: !54, line: 176, size: 141120, elements: !247)
!247 = !{!248, !249, !250, !263, !273, !275, !288, !289, !293}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !246, file: !54, line: 177, baseType: !83, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !246, file: !54, line: 178, baseType: !225, size: 96, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "addr_to_perm", scope: !246, file: !54, line: 179, baseType: !251, size: 125440, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_hashtable", file: !54, line: 166, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_hashtable", file: !54, line: 164, size: 125440, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !252, file: !54, line: 165, baseType: !255, size: 125440)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 125440, elements: !118)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_array", file: !54, line: 162, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_array", file: !54, line: 158, size: 15680, elements: !258)
!258 = !{!259, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "main_slots", scope: !257, file: !54, line: 159, baseType: !260, size: 15552)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 15552, elements: !105)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !257, file: !54, line: 160, baseType: !110, size: 64, offset: 15552)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slots", scope: !257, file: !54, line: 161, baseType: !200, size: 64, offset: 15616)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions", scope: !246, file: !54, line: 180, baseType: !264, size: 384, offset: 125568)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 384, elements: !271)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "relay_endpoint_session", file: !54, line: 55, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 50, size: 192, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !266, file: !54, line: 52, baseType: !217, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !266, file: !54, line: 53, baseType: !179, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !266, file: !54, line: 54, baseType: !182, size: 64, offset: 128)
!271 = !{!272}
!272 = !DISubrange(count: 2)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions_failure", scope: !246, file: !54, line: 181, baseType: !274, size: 64, offset: 125952)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !271)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !246, file: !54, line: 182, baseType: !276, size: 14848, offset: 126016)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map", file: !54, line: 136, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_map", file: !54, line: 134, size: 14848, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !277, file: !54, line: 135, baseType: !280, size: 14848)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 14848, elements: !118)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map_array", file: !54, line: 132, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chn_map_array", file: !54, line: 128, size: 1856, elements: !283)
!283 = !{!284, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "main_chns", scope: !282, file: !54, line: 129, baseType: !285, size: 1728)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 1728, elements: !105)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !282, file: !54, line: 130, baseType: !110, size: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "extra_chns", scope: !282, file: !54, line: 131, baseType: !206, size: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !246, file: !54, line: 183, baseType: !71, size: 64, offset: 140864)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_connections", scope: !246, file: !54, line: 184, baseType: !290, size: 64, offset: 140928)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !79, line: 43, baseType: !292)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !79, line: 42, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tcs", scope: !246, file: !54, line: 185, baseType: !294, size: 128, offset: 140992)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_list", file: !54, line: 103, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection_list", file: !54, line: 100, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !295, file: !54, line: 101, baseType: !110, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !295, file: !54, line: 102, baseType: !243, size: 64, offset: 64)
!299 = !{!0, !7, !12, !18, !23, !28, !33, !38, !40, !45}
!300 = !{i32 7, !"Dwarf Version", i32 5}
!301 = !{i32 2, !"Debug Info Version", i32 3}
!302 = !{i32 1, !"wchar_size", i32 4}
!303 = !{i32 8, !"PIC Level", i32 2}
!304 = !{i32 7, !"PIE Level", i32 2}
!305 = !{i32 7, !"uwtable", i32 2}
!306 = !{i32 7, !"frame-pointer", i32 2}
!307 = !{!"clang version 16.0.0"}
!308 = distinct !DISubprogram(name: "init_allocation", scope: !2, file: !2, line: 41, type: !309, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !311)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !71, !244, !290}
!311 = !{}
!312 = !DILocalVariable(name: "owner", arg: 1, scope: !308, file: !2, line: 41, type: !71)
!313 = !DILocation(line: 41, column: 28, scope: !308)
!314 = !DILocalVariable(name: "a", arg: 2, scope: !308, file: !2, line: 41, type: !244)
!315 = !DILocation(line: 41, column: 47, scope: !308)
!316 = !DILocalVariable(name: "tcp_connections", arg: 3, scope: !308, file: !2, line: 41, type: !290)
!317 = !DILocation(line: 41, column: 58, scope: !308)
!318 = !DILocation(line: 42, column: 6, scope: !319)
!319 = distinct !DILexicalBlock(scope: !308, file: !2, line: 42, column: 6)
!320 = !DILocation(line: 42, column: 6, scope: !308)
!321 = !DILocation(line: 43, column: 11, scope: !322)
!322 = distinct !DILexicalBlock(scope: !319, file: !2, line: 42, column: 9)
!323 = !DILocation(line: 43, column: 5, scope: !322)
!324 = !DILocation(line: 44, column: 16, scope: !322)
!325 = !DILocation(line: 44, column: 5, scope: !322)
!326 = !DILocation(line: 44, column: 8, scope: !322)
!327 = !DILocation(line: 44, column: 14, scope: !322)
!328 = !DILocation(line: 45, column: 26, scope: !322)
!329 = !DILocation(line: 45, column: 5, scope: !322)
!330 = !DILocation(line: 45, column: 8, scope: !322)
!331 = !DILocation(line: 45, column: 24, scope: !322)
!332 = !DILocation(line: 46, column: 38, scope: !322)
!333 = !DILocation(line: 46, column: 41, scope: !322)
!334 = !DILocation(line: 46, column: 5, scope: !322)
!335 = !DILocation(line: 47, column: 3, scope: !322)
!336 = !DILocation(line: 48, column: 1, scope: !308)
!337 = distinct !DISubprogram(name: "init_turn_permission_hashtable", scope: !2, file: !2, line: 192, type: !338, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !50, retainedNodes: !311)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!341 = !DILocalVariable(name: "map", arg: 1, scope: !337, file: !2, line: 192, type: !340)
!342 = !DILocation(line: 192, column: 71, scope: !337)
!343 = !DILocation(line: 194, column: 6, scope: !344)
!344 = distinct !DILexicalBlock(scope: !337, file: !2, line: 194, column: 6)
!345 = !DILocation(line: 194, column: 6, scope: !337)
!346 = !DILocation(line: 195, column: 9, scope: !344)
!347 = !DILocation(line: 195, column: 3, scope: !344)
!348 = !DILocation(line: 196, column: 1, scope: !337)
!349 = distinct !DISubprogram(name: "clear_allocation", scope: !2, file: !2, line: 50, type: !350, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !311)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !244}
!352 = !DILocalVariable(name: "a", arg: 1, scope: !349, file: !2, line: 50, type: !244)
!353 = !DILocation(line: 50, column: 35, scope: !349)
!354 = !DILocation(line: 52, column: 6, scope: !355)
!355 = distinct !DILexicalBlock(scope: !349, file: !2, line: 52, column: 6)
!356 = !DILocation(line: 52, column: 6, scope: !349)
!357 = !DILocation(line: 54, column: 6, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !2, line: 54, column: 6)
!359 = distinct !DILexicalBlock(scope: !355, file: !2, line: 52, column: 9)
!360 = !DILocation(line: 54, column: 9, scope: !358)
