; ModuleID = '/home/raj/coturn/src/server/ns_turn_server.c'
source_filename = "/home/raj/coturn/src/server/ns_turn_server.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_turnserver = type { i8, i64, ptr, i32, ptr, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, i32, ptr, ptr, ptr, ptr, i32, %union.ioa_addr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, ptr, i64, ptr, i32, ptr, ptr, ptr, ptr, i32, ptr, i32, ptr, ptr, i32, ptr }
%union.ioa_addr = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._turn_server_addrs_list = type { ptr, i64, %struct._turn_mutex }
%struct._turn_mutex = type { i32, ptr }
%struct._ts_ur_super_session = type { ptr, i64, i32, ptr, %struct._allocation, ptr, i32, i32, i32, [17 x i8], i32, [513 x i8], [64 x i8], i32, [257 x i8], i32, i32, i32, %struct._realm_options_t, i32, [128 x i8], i32, i32, i32, i32, i64, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i64, i64, [33 x i8], i64 }
%struct._allocation = type { i32, %struct.stun_tid, %struct._turn_permission_hashtable, [2 x %struct.relay_endpoint_session], [2 x i32], %struct._ch_map, ptr, ptr, %struct._tcp_connection_list }
%struct.stun_tid = type { [12 x i8] }

!56 = !DIFile(filename: "src/server/ns_turn_allocation.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0cb2cf61c9ec5dd3030a6e5a6f8d4af1")
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DIEnumerator(name: "TC_STATE_UNKNOWN", value: 0)
!59 = !DIEnumerator(name: "TC_STATE_CLIENT_TO_PEER_CONNECTING", value: 1)
!60 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTING", value: 2)
!61 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTED", value: 3)
!62 = !DIEnumerator(name: "TC_STATE_READY", value: 4)
!63 = !DIEnumerator(name: "TC_STATE_FAILED", value: 5)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MESSAGE_TO_RELAY_TYPE", file: !26, line: 69, baseType: !19, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70}
!66 = !DIEnumerator(name: "RMT_UNKNOWN", value: 0)
!67 = !DIEnumerator(name: "RMT_SOCKET", value: 1)
!68 = !DIEnumerator(name: "RMT_CB_SOCKET", value: 2)
!69 = !DIEnumerator(name: "RMT_MOBILE_SOCKET", value: 3)
!70 = !DIEnumerator(name: "RMT_CANCEL_SESSION", value: 4)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !26, line: 79, baseType: !19, size: 32, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV4", value: 0)
!74 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV6", value: 1)
!75 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_KEEP", value: 2)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 47, baseType: !19, size: 32, elements: !78)
!77 = !DIFile(filename: "src/apps/common/ns_turn_utils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "74cb4019b1eb9d8e2b879df518b15a25")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "TURN_LOG_LEVEL_INFO", value: 0)
!80 = !DIEnumerator(name: "TURN_LOG_LEVEL_CONTROL", value: 1)
!81 = !DIEnumerator(name: "TURN_LOG_LEVEL_WARNING", value: 2)
!82 = !DIEnumerator(name: "TURN_LOG_LEVEL_ERROR", value: 3)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SHATYPE", file: !84, line: 160, baseType: !85, size: 32, elements: !86)
!84 = !DIFile(filename: "src/client/ns_turn_msg_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "4d8c44ae9e82b7a50b86805787352690")
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !{!87, !88, !89, !90, !91, !92}
!87 = !DIEnumerator(name: "SHATYPE_ERROR", value: -1)
!88 = !DIEnumerator(name: "SHATYPE_DEFAULT", value: 0)
!89 = !DIEnumerator(name: "SHATYPE_SHA1", value: 0)
!90 = !DIEnumerator(name: "SHATYPE_SHA256", value: 1)
!91 = !DIEnumerator(name: "SHATYPE_SHA384", value: 2)
!92 = !DIEnumerator(name: "SHATYPE_SHA512", value: 3)
!93 = !{!94, !96, !102, !106, !173, !176, !177, !178, !426, !244, !616, !85, !392, !618, !222, !531, !98, !223, !225, !232, !664, !432, !19, !806, !808, !809, !810, !230, !507, !811, !813, !603, !135}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !97, line: 108, baseType: !98)
!97 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !99, line: 26, baseType: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !101, line: 42, baseType: !19)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !99, line: 24, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !101, line: 38, baseType: !105)
!105 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_data", file: !108, line: 132, baseType: !109)
!108 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_data", file: !108, line: 129, size: 768, elements: !110)
!110 = !{!111, !169}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !109, file: !108, line: 130, baseType: !112, size: 224)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !113, line: 48, baseType: !114)
!113 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !113, line: 44, size: 224, elements: !115)
!115 = !{!116, !128, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !114, file: !113, line: 45, baseType: !117, size: 128)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !118, line: 180, size: 128, elements: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!119 = !{!120, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !117, file: !118, line: 182, baseType: !121, size: 16)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !122, line: 28, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !117, file: !118, line: 183, baseType: !125, size: 112, offset: 16)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 14)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !114, file: !113, line: 46, baseType: !129, size: 128)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !130, line: 245, size: 128, elements: !131)
!130 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!131 = !{!132, !133, !137, !142}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !129, file: !130, line: 247, baseType: !121, size: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !129, file: !130, line: 248, baseType: !134, size: 16, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !130, line: 123, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !99, line: 25, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !101, line: 40, baseType: !123)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !129, file: !130, line: 249, baseType: !138, size: 32, offset: 32)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !130, line: 31, size: 32, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !138, file: !130, line: 33, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !130, line: 30, baseType: !98)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !129, file: !130, line: 252, baseType: !143, size: 64, offset: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 64, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 8)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !114, file: !113, line: 47, baseType: !147, size: 224)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !130, line: 260, size: 224, elements: !148)
!148 = !{!149, !150, !151, !152, !168}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !147, file: !130, line: 262, baseType: !121, size: 16)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !147, file: !130, line: 263, baseType: !134, size: 16, offset: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !147, file: !130, line: 264, baseType: !98, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !147, file: !130, line: 265, baseType: !153, size: 128, offset: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !130, line: 219, size: 128, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !153, file: !130, line: 226, baseType: !156, size: 128)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !130, line: 221, size: 128, elements: !157)
!157 = !{!158, !162, !164}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !156, file: !130, line: 223, baseType: !159, size: 128)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !156, file: !130, line: 224, baseType: !163, size: 128)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, elements: !144)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !156, file: !130, line: 225, baseType: !165, size: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 4)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !147, file: !130, line: 266, baseType: !98, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !109, file: !108, line: 131, baseType: !170, size: 520, offset: 224)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 65)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !174, line: 26, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !101, line: 41, baseType: !85)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!177 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation", file: !56, line: 186, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_allocation", file: !56, line: 176, size: 141120, elements: !181)
!181 = !{!182, !183, !191, !252, !576, !578, !604, !605, !609}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !180, file: !56, line: 177, baseType: !85, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !180, file: !56, line: 178, baseType: !184, size: 96, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !18, line: 52, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 47, size: 96, elements: !186)
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !185, file: !18, line: 51, baseType: !188, size: 96)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 96, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 12)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "addr_to_perm", scope: !180, file: !56, line: 179, baseType: !192, size: 125440, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_hashtable", file: !56, line: 166, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_hashtable", file: !56, line: 164, size: 125440, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !193, file: !56, line: 165, baseType: !196, size: 125440)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 125440, elements: !144)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_array", file: !56, line: 162, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_array", file: !56, line: 158, size: 15680, elements: !199)
!199 = !{!200, !248, !249}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "main_slots", scope: !198, file: !56, line: 159, baseType: !201, size: 15552)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 15552, elements: !226)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_slot", file: !56, line: 156, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_slot", file: !56, line: 154, size: 5184, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !203, file: !56, line: 155, baseType: !206, size: 5184)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_info", file: !56, line: 152, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_info", file: !56, line: 143, size: 5184, elements: !208)
!208 = !{!209, !210, !240, !241, !242, !245, !246, !247}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !207, file: !56, line: 144, baseType: !85, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !207, file: !56, line: 145, baseType: !211, size: 4608, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map", file: !212, line: 117, baseType: !213)
!212 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map", file: !212, line: 115, size: 4608, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !213, file: !212, line: 116, baseType: !216, size: 4608)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 4608, elements: !144)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map_array", file: !212, line: 113, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map_array", file: !212, line: 107, size: 576, elements: !219)
!219 = !{!220, !228, !231, !234, !237}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "main_keys", scope: !218, file: !212, line: 108, baseType: !221, size: 192)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 192, elements: !226)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !212, line: 47, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !99, line: 27, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !101, line: 45, baseType: !225)
!225 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!226 = !{!227}
!227 = !DISubrange(count: 3)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "main_values", scope: !218, file: !212, line: 109, baseType: !229, size: 192, offset: 192)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 192, elements: !226)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !212, line: 48, baseType: !225)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !218, file: !212, line: 110, baseType: !232, size: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !233, line: 46, baseType: !225)
!233 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "extra_keys", scope: !218, file: !212, line: 111, baseType: !235, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !218, file: !212, line: 112, baseType: !238, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !207, file: !56, line: 146, baseType: !112, size: 224, offset: 4672)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !207, file: !56, line: 147, baseType: !96, size: 32, offset: 4896)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !207, file: !56, line: 148, baseType: !243, size: 64, offset: 4928)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !32, line: 122, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !207, file: !56, line: 149, baseType: !244, size: 64, offset: 4992)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !207, file: !56, line: 150, baseType: !85, size: 32, offset: 5056)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !207, file: !56, line: 151, baseType: !177, size: 64, offset: 5120)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !198, file: !56, line: 160, baseType: !232, size: 64, offset: 15552)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slots", scope: !198, file: !56, line: 161, baseType: !250, size: 64, offset: 15616)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions", scope: !180, file: !56, line: 180, baseType: !253, size: 384, offset: 125568)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 384, elements: !574)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "relay_endpoint_session", file: !56, line: 55, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 50, size: 192, elements: !256)
!256 = !{!257, !572, !573}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !255, file: !56, line: 52, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !32, line: 116, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !32, line: 115, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !262, line: 179, size: 2880, elements: !263)
!262 = !DIFile(filename: "src/server/../apps/relay/ns_ioalib_impl.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "39ae1828625a6763b6269ecb34869b6c")
!263 = !{!264, !265, !267, !268, !292, !296, !298, !299, !301, !303, !308, !309, !310, !311, !312, !313, !314, !315, !407, !410, !423, !424, !425, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !529, !530, !554, !555, !560, !561, !564, !569, !570, !571}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !261, file: !262, line: 181, baseType: !85, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parent_s", scope: !261, file: !262, line: 182, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !261, file: !262, line: 183, baseType: !98, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sockets_container", scope: !261, file: !262, line: 184, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map", file: !212, line: 183, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_addr_map", file: !212, line: 177, size: 1441856, elements: !272)
!272 = !{!273, !291}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !271, file: !212, line: 178, baseType: !274, size: 1441792)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 1441792, elements: !289)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_list_header", file: !212, line: 175, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_list_header", file: !212, line: 171, size: 1408, elements: !277)
!277 = !{!278, !286, !288}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "main_list", scope: !276, file: !212, line: 172, baseType: !279, size: 1280)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 1280, elements: !166)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_elem", file: !212, line: 169, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_elem", file: !212, line: 166, size: 320, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !281, file: !212, line: 167, baseType: !112, size: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !212, line: 168, baseType: !285, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map_value_type", file: !212, line: 161, baseType: !225)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "extra_list", scope: !276, file: !212, line: 173, baseType: !287, size: 64, offset: 1280)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !276, file: !212, line: 174, baseType: !232, size: 64, offset: 1344)
!289 = !{!290}
!290 = !DISubrange(count: 1024)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !271, file: !212, line: 179, baseType: !223, size: 64, offset: 1441792)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !261, file: !262, line: 185, baseType: !293, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferevent", file: !295, line: 113, flags: DIFlagFwdDecl)
!295 = !DIFile(filename: "/usr/include/event2/bufferevent.h", directory: "", checksumkind: CSK_MD5, checksum: "15bb43c26b2c9058b6c64d44779c7263")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "defer_nbh", scope: !261, file: !262, line: 186, baseType: !297, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !32, line: 124, baseType: !244)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !261, file: !262, line: 187, baseType: !85, size: 32, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !261, file: !262, line: 188, baseType: !300, size: 32, offset: 416)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_TYPE", file: !32, line: 98, baseType: !31)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !261, file: !262, line: 189, baseType: !302, size: 32, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_APP_TYPE", file: !32, line: 112, baseType: !44)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !261, file: !262, line: 190, baseType: !304, size: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !306, line: 184, baseType: !307)
!306 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !306, line: 184, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegs", scope: !261, file: !262, line: 191, baseType: !98, size: 32, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "in_write", scope: !261, file: !262, line: 192, baseType: !85, size: 32, offset: 608)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !261, file: !262, line: 193, baseType: !85, size: 32, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_known", scope: !261, file: !262, line: 194, baseType: !85, size: 32, offset: 672)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !261, file: !262, line: 195, baseType: !112, size: 224, offset: 704)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !261, file: !262, line: 196, baseType: !85, size: 32, offset: 928)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !261, file: !262, line: 197, baseType: !112, size: 224, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !261, file: !262, line: 198, baseType: !316, size: 64, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !32, line: 120, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !32, line: 119, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !262, line: 135, size: 536064, elements: !320)
!320 = !{!321, !326, !330, !331, !332, !337, !342, !368, !372, !373, !374, !375, !376, !377, !378, !379, !383, !385, !395, !399, !400, !401, !402, !404}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !319, file: !262, line: 137, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "super_memory_t", file: !324, line: 49, baseType: !325)
!324 = !DIFile(filename: "src/apps/relay/ns_sm.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "9025fd46a533d33a213551fd581f5b89")
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_super_memory", file: !324, line: 48, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !319, file: !262, line: 138, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !329, line: 217, flags: DIFlagFwdDecl)
!329 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!330 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate_eb", scope: !319, file: !262, line: 139, baseType: !85, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !319, file: !262, line: 140, baseType: !85, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !319, file: !262, line: 141, baseType: !333, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnipports", file: !335, line: 50, baseType: !336)
!335 = !DIFile(filename: "src/apps/relay/turn_ports.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "11983eef23ed630198ed333562550552")
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_turnipports", file: !335, line: 49, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "map_rtcp", scope: !319, file: !262, line: 142, baseType: !338, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !340, line: 46, baseType: !341)
!340 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !340, line: 45, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !319, file: !262, line: 143, baseType: !343, size: 128, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list", file: !262, line: 81, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list", file: !262, line: 78, size: 128, elements: !345)
!345 = !{!346, !367}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !344, file: !262, line: 79, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list_elem", file: !262, line: 76, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list_elem", file: !262, line: 73, size: 524288, elements: !350)
!350 = !{!351, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !262, line: 74, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !349, file: !262, line: 75, baseType: !354, size: 524224, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !355, line: 48, baseType: !356)
!355 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !355, line: 42, size: 524224, elements: !357)
!357 = !{!358, !360, !364, !365, !366}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !356, file: !355, line: 43, baseType: !359, size: 32)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 32, elements: !166)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !356, file: !355, line: 44, baseType: !361, size: 524056, offset: 32)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 524056, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 65507)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !356, file: !355, line: 45, baseType: !232, size: 64, offset: 524096)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !356, file: !355, line: 46, baseType: !135, size: 16, offset: 524160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !356, file: !355, line: 47, baseType: !103, size: 8, offset: 524176)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tsz", scope: !344, file: !262, line: 80, baseType: !232, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !319, file: !262, line: 144, baseType: !369, size: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !306, line: 185, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !306, line: 185, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !319, file: !262, line: 145, baseType: !369, size: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !319, file: !262, line: 147, baseType: !369, size: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !319, file: !262, line: 149, baseType: !369, size: 64, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !319, file: !262, line: 153, baseType: !369, size: 64, offset: 704)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !319, file: !262, line: 156, baseType: !369, size: 64, offset: 768)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !319, file: !262, line: 158, baseType: !96, size: 32, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !319, file: !262, line: 159, baseType: !243, size: 64, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg", scope: !319, file: !262, line: 160, baseType: !380, size: 524296, offset: 960)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 524296, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 65537)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timer_intervals", scope: !319, file: !262, line: 161, baseType: !384, size: 448, offset: 525280)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 448, elements: !126)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timers", scope: !319, file: !262, line: 162, baseType: !386, size: 1792, offset: 525760)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1792, elements: !126)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !388, line: 8, size: 128, elements: !389)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!389 = !{!390, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !387, file: !388, line: 14, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !101, line: 160, baseType: !392)
!392 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !387, file: !388, line: 15, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !101, line: 162, baseType: !392)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !319, file: !262, line: 164, baseType: !396, size: 8200, offset: 527552)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8200, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 1025)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !319, file: !262, line: 165, baseType: !85, size: 32, offset: 535776)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !319, file: !262, line: 166, baseType: !232, size: 64, offset: 535808)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_counter", scope: !319, file: !262, line: 167, baseType: !232, size: 64, offset: 535872)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !319, file: !262, line: 168, baseType: !403, size: 64, offset: 535936)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rch", scope: !319, file: !262, line: 169, baseType: !405, size: 64, offset: 536000)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !406, line: 45, baseType: !244)
!406 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!407 = !DIDerivedType(tag: DW_TAG_member, name: "read_event", scope: !261, file: !262, line: 199, baseType: !408, size: 64, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !329, line: 276, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !261, file: !262, line: 200, baseType: !411, size: 64, offset: 1344)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_event_handler", file: !32, line: 199, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !258, !85, !415, !244, !85}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_data", file: !32, line: 132, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_net_data", file: !32, line: 127, size: 384, elements: !418)
!418 = !{!419, !420, !421, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !417, file: !32, line: 128, baseType: !112, size: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nbh", scope: !417, file: !32, line: 129, baseType: !297, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "recv_ttl", scope: !417, file: !32, line: 130, baseType: !85, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "recv_tos", scope: !417, file: !32, line: 131, baseType: !85, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "read_ctx", scope: !261, file: !262, line: 201, baseType: !244, size: 64, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !261, file: !262, line: 202, baseType: !85, size: 32, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !261, file: !262, line: 203, baseType: !426, size: 64, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ts_ur_super_session", file: !32, line: 47, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts_ur_super_session", file: !108, line: 68, size: 152448, elements: !429)
!429 = !{!430, !431, !433, !434, !435, !436, !437, !438, !439, !440, !444, !445, !449, !454, !455, !460, !461, !462, !463, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !508, !509, !513}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !428, file: !108, line: 69, baseType: !244, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !428, file: !108, line: 70, baseType: !432, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnsession_id", file: !108, line: 62, baseType: !223)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !428, file: !108, line: 71, baseType: !96, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "client_socket", scope: !428, file: !108, line: 72, baseType: !258, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !428, file: !108, line: 73, baseType: !179, size: 141120, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_allocated_timeout_ev", scope: !428, file: !108, line: 74, baseType: !243, size: 64, offset: 141376)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !428, file: !108, line: 75, baseType: !85, size: 32, offset: 141440)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "is_tcp_relay", scope: !428, file: !108, line: 76, baseType: !85, size: 32, offset: 141472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_closed", scope: !428, file: !108, line: 77, baseType: !85, size: 32, offset: 141504)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !428, file: !108, line: 79, baseType: !441, size: 136, offset: 141536)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 136, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 17)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_expiration_time", scope: !428, file: !108, line: 80, baseType: !96, size: 32, offset: 141696)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !428, file: !108, line: 81, baseType: !446, size: 4104, offset: 141728)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 4104, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 513)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey", scope: !428, file: !108, line: 82, baseType: !450, size: 512, offset: 145832)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !18, line: 64, baseType: !451)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey_set", scope: !428, file: !108, line: 83, baseType: !85, size: 32, offset: 146368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !428, file: !108, line: 84, baseType: !456, size: 2056, offset: 146400)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !18, line: 66, baseType: !457)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2056, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 257)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "quota_used", scope: !428, file: !108, line: 85, baseType: !85, size: 32, offset: 148480)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !428, file: !108, line: 86, baseType: !85, size: 32, offset: 148512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "max_session_time_auth", scope: !428, file: !108, line: 87, baseType: !96, size: 32, offset: 148544)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "realm_options", scope: !428, file: !108, line: 89, baseType: !464, size: 1152, offset: 148608)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !32, line: 142, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !108, line: 53, size: 1152, elements: !466)
!466 = !{!467, !471}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !465, file: !108, line: 55, baseType: !468, size: 1024)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !465, file: !108, line: 57, baseType: !472, size: 128, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !108, line: 51, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !108, line: 45, size: 128, elements: !474)
!474 = !{!475, !478, !480}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !473, file: !108, line: 47, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !18, line: 67, baseType: !225)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !473, file: !108, line: 48, baseType: !479, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !97, line: 105, baseType: !85)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !473, file: !108, line: 49, baseType: !479, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "origin_set", scope: !428, file: !108, line: 90, baseType: !85, size: 32, offset: 149760)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !428, file: !108, line: 91, baseType: !468, size: 1024, offset: 149792)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !428, file: !108, line: 93, baseType: !98, size: 32, offset: 150816)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !428, file: !108, line: 94, baseType: !98, size: 32, offset: 150848)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !428, file: !108, line: 95, baseType: !98, size: 32, offset: 150880)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !428, file: !108, line: 96, baseType: !98, size: 32, offset: 150912)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_packets", scope: !428, file: !108, line: 97, baseType: !223, size: 64, offset: 150976)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_packets", scope: !428, file: !108, line: 98, baseType: !223, size: 64, offset: 151040)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_bytes", scope: !428, file: !108, line: 99, baseType: !223, size: 64, offset: 151104)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_bytes", scope: !428, file: !108, line: 100, baseType: !223, size: 64, offset: 151168)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !428, file: !108, line: 101, baseType: !223, size: 64, offset: 151232)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !428, file: !108, line: 102, baseType: !232, size: 64, offset: 151296)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !428, file: !108, line: 103, baseType: !232, size: 64, offset: 151360)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !428, file: !108, line: 104, baseType: !98, size: 32, offset: 151424)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !428, file: !108, line: 105, baseType: !98, size: 32, offset: 151456)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !428, file: !108, line: 106, baseType: !98, size: 32, offset: 151488)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !428, file: !108, line: 107, baseType: !98, size: 32, offset: 151520)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_packets", scope: !428, file: !108, line: 108, baseType: !98, size: 32, offset: 151552)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_packets", scope: !428, file: !108, line: 109, baseType: !98, size: 32, offset: 151584)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_bytes", scope: !428, file: !108, line: 110, baseType: !98, size: 32, offset: 151616)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_bytes", scope: !428, file: !108, line: 111, baseType: !98, size: 32, offset: 151648)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !428, file: !108, line: 112, baseType: !223, size: 64, offset: 151680)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !428, file: !108, line: 113, baseType: !232, size: 64, offset: 151744)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !428, file: !108, line: 114, baseType: !232, size: 64, offset: 151808)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !428, file: !108, line: 116, baseType: !85, size: 32, offset: 151872)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_id", scope: !428, file: !108, line: 117, baseType: !507, size: 64, offset: 151936)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "mobile_id_t", file: !108, line: 66, baseType: !223)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "old_mobile_id", scope: !428, file: !108, line: 118, baseType: !507, size: 64, offset: 152000)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "s_mobile_id", scope: !428, file: !108, line: 119, baseType: !510, size: 264, offset: 152064)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 33)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !428, file: !108, line: 121, baseType: !477, size: 64, offset: 152384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "current_df_relay_flag", scope: !261, file: !262, line: 204, baseType: !85, size: 32, offset: 1600)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_use_df", scope: !261, file: !262, line: 206, baseType: !85, size: 32, offset: 1632)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tobeclosed", scope: !261, file: !262, line: 207, baseType: !85, size: 32, offset: 1664)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "broken", scope: !261, file: !262, line: 208, baseType: !85, size: 32, offset: 1696)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "default_ttl", scope: !261, file: !262, line: 209, baseType: !85, size: 32, offset: 1728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "current_ttl", scope: !261, file: !262, line: 210, baseType: !85, size: 32, offset: 1760)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "default_tos", scope: !261, file: !262, line: 211, baseType: !85, size: 32, offset: 1792)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "current_tos", scope: !261, file: !262, line: 212, baseType: !85, size: 32, offset: 1824)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !261, file: !262, line: 213, baseType: !343, size: 128, offset: 1856)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !261, file: !262, line: 214, baseType: !96, size: 32, offset: 1984)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "data_traffic", scope: !261, file: !262, line: 215, baseType: !525, size: 128, offset: 2048)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "traffic_bytes", file: !262, line: 174, size: 128, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_read", scope: !525, file: !262, line: 175, baseType: !477, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_write", scope: !525, file: !262, line: 176, baseType: !477, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "control_traffic", scope: !261, file: !262, line: 216, baseType: !525, size: 128, offset: 2176)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sub_session", scope: !261, file: !262, line: 219, baseType: !531, size: 64, offset: 2304)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection", file: !32, line: 50, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection", file: !56, line: 85, size: 960, elements: !534)
!534 = !{!535, !537, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !533, file: !56, line: 87, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "TC_STATE", file: !56, line: 76, baseType: !55)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !533, file: !56, line: 88, baseType: !538, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_id", file: !56, line: 78, baseType: !98)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !533, file: !56, line: 89, baseType: !112, size: 224, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "client_s", scope: !533, file: !56, line: 90, baseType: !258, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "peer_s", scope: !533, file: !56, line: 91, baseType: !258, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "peer_conn_timeout", scope: !533, file: !56, line: 92, baseType: !243, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bind_timeout", scope: !533, file: !56, line: 93, baseType: !243, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !533, file: !56, line: 94, baseType: !184, size: 96, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !533, file: !56, line: 95, baseType: !244, size: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !533, file: !56, line: 96, baseType: !85, size: 32, offset: 768)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ub_to_client", scope: !533, file: !56, line: 97, baseType: !548, size: 128, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "unsent_buffer", file: !56, line: 83, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 80, size: 128, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !549, file: !56, line: 81, baseType: !232, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !549, file: !56, line: 82, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bev", scope: !261, file: !262, line: 221, baseType: !293, size: 64, offset: 2368)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cb", scope: !261, file: !262, line: 222, baseType: !556, size: 64, offset: 2432)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "connect_cb", file: !32, line: 135, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !85, !244}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "conn_arg", scope: !261, file: !262, line: 223, baseType: !244, size: 64, offset: 2496)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "list_ev", scope: !261, file: !262, line: 225, baseType: !562, size: 64, offset: 2560)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "evconnlistener", file: !262, line: 225, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "acb", scope: !261, file: !262, line: 226, baseType: !565, size: 64, offset: 2624)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "accept_cb", file: !32, line: 137, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !258, !244}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "acbarg", scope: !261, file: !262, line: 227, baseType: !244, size: 64, offset: 2688)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "special_session", scope: !261, file: !262, line: 229, baseType: !244, size: 64, offset: 2752)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "special_session_size", scope: !261, file: !262, line: 230, baseType: !232, size: 64, offset: 2816)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !255, file: !56, line: 53, baseType: !96, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !255, file: !56, line: 54, baseType: !243, size: 64, offset: 128)
!574 = !{!575}
!575 = !DISubrange(count: 2)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions_failure", scope: !180, file: !56, line: 181, baseType: !577, size: 64, offset: 125952)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !574)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !180, file: !56, line: 182, baseType: !579, size: 14848, offset: 126016)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map", file: !56, line: 136, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_map", file: !56, line: 134, size: 14848, elements: !581)
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !580, file: !56, line: 135, baseType: !583, size: 14848)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 14848, elements: !144)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map_array", file: !56, line: 132, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chn_map_array", file: !56, line: 128, size: 1856, elements: !586)
!586 = !{!587, !600, !601}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "main_chns", scope: !585, file: !56, line: 129, baseType: !588, size: 1728)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 1728, elements: !226)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_info", file: !56, line: 121, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_info", file: !56, line: 112, size: 576, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !590, file: !56, line: 113, baseType: !135, size: 16)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !590, file: !56, line: 114, baseType: !85, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !590, file: !56, line: 115, baseType: !135, size: 16, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !590, file: !56, line: 116, baseType: !112, size: 224, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !590, file: !56, line: 117, baseType: !96, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !590, file: !56, line: 118, baseType: !243, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !590, file: !56, line: 119, baseType: !244, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_channel", scope: !590, file: !56, line: 120, baseType: !244, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !585, file: !56, line: 130, baseType: !232, size: 64, offset: 1728)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "extra_chns", scope: !585, file: !56, line: 131, baseType: !602, size: 64, offset: 1792)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !180, file: !56, line: 183, baseType: !244, size: 64, offset: 140864)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_connections", scope: !180, file: !56, line: 184, baseType: !606, size: 64, offset: 140928)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !212, line: 43, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !212, line: 42, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tcs", scope: !180, file: !56, line: 185, baseType: !610, size: 128, offset: 140992)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_list", file: !56, line: 103, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection_list", file: !56, line: 100, size: 128, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !611, file: !56, line: 101, baseType: !232, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !611, file: !56, line: 102, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tsi_arg", file: !2, line: 419, size: 128, elements: !620)
!620 = !{!621, !663}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tsi", scope: !619, file: !2, line: 420, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "turn_session_info", file: !108, line: 134, size: 15040, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !657, !658, !659, !660, !661, !662}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !623, file: !108, line: 135, baseType: !432, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !623, file: !108, line: 136, baseType: !85, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !623, file: !108, line: 137, baseType: !96, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !623, file: !108, line: 138, baseType: !96, size: 32, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !623, file: !108, line: 139, baseType: !300, size: 32, offset: 160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "peer_protocol", scope: !623, file: !108, line: 140, baseType: !300, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tls_method", scope: !623, file: !108, line: 141, baseType: !632, size: 136, offset: 224)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !442)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cipher", scope: !623, file: !108, line: 142, baseType: !170, size: 520, offset: 360)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_data", scope: !623, file: !108, line: 143, baseType: !107, size: 768, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr_data", scope: !623, file: !108, line: 144, baseType: !107, size: 768, offset: 1664)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv4", scope: !623, file: !108, line: 145, baseType: !107, size: 768, offset: 2432)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv6", scope: !623, file: !108, line: 146, baseType: !107, size: 768, offset: 3200)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !623, file: !108, line: 147, baseType: !446, size: 4104, offset: 3968)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !623, file: !108, line: 148, baseType: !85, size: 32, offset: 8096)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !623, file: !108, line: 150, baseType: !223, size: 64, offset: 8128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !623, file: !108, line: 151, baseType: !223, size: 64, offset: 8192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !623, file: !108, line: 152, baseType: !223, size: 64, offset: 8256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !623, file: !108, line: 153, baseType: !223, size: 64, offset: 8320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !623, file: !108, line: 154, baseType: !98, size: 32, offset: 8384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !623, file: !108, line: 155, baseType: !98, size: 32, offset: 8416)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !623, file: !108, line: 156, baseType: !98, size: 32, offset: 8448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !623, file: !108, line: 157, baseType: !223, size: 64, offset: 8512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !623, file: !108, line: 158, baseType: !223, size: 64, offset: 8576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !623, file: !108, line: 159, baseType: !223, size: 64, offset: 8640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !623, file: !108, line: 160, baseType: !223, size: 64, offset: 8704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !623, file: !108, line: 161, baseType: !98, size: 32, offset: 8768)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !623, file: !108, line: 162, baseType: !98, size: 32, offset: 8800)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !623, file: !108, line: 163, baseType: !98, size: 32, offset: 8832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !623, file: !108, line: 165, baseType: !85, size: 32, offset: 8864)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_data", scope: !623, file: !108, line: 167, baseType: !656, size: 3840, offset: 8896)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 3840, elements: !10)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_size", scope: !623, file: !108, line: 168, baseType: !232, size: 64, offset: 12736)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_data", scope: !623, file: !108, line: 169, baseType: !106, size: 64, offset: 12800)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_size", scope: !623, file: !108, line: 170, baseType: !232, size: 64, offset: 12864)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !623, file: !108, line: 172, baseType: !468, size: 1024, offset: 12928)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !623, file: !108, line: 173, baseType: !468, size: 1024, offset: 13952)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !623, file: !108, line: 175, baseType: !477, size: 64, offset: 14976)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !619, file: !2, line: 421, baseType: !403, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_turnserver", file: !26, line: 99, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_turnserver", file: !26, line: 111, size: 3456, elements: !667)
!667 = !{!668, !670, !671, !672, !673, !674, !675, !676, !677, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !691, !696, !701, !703, !707, !717, !722, !727, !728, !729, !730, !731, !736, !741, !742, !743, !744, !751, !765, !766, !767, !768, !769, !770, !791, !792, !793, !794, !795, !800, !801, !802, !803, !805}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !666, file: !26, line: 113, baseType: !669, size: 8)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnserver_id", file: !26, line: 67, baseType: !103)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_counter", scope: !666, file: !26, line: 115, baseType: !432, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sessions_map", scope: !666, file: !26, line: 116, baseType: !606, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !666, file: !26, line: 118, baseType: !96, size: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !666, file: !26, line: 120, baseType: !316, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !666, file: !26, line: 121, baseType: !85, size: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !666, file: !26, line: 122, baseType: !85, size: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rfc5780", scope: !666, file: !26, line: 123, baseType: !85, size: 32, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "check_origin", scope: !666, file: !26, line: 124, baseType: !678, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "vintp", file: !97, line: 106, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "stale_nonce", scope: !666, file: !26, line: 125, baseType: !678, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "max_allocate_lifetime", scope: !666, file: !26, line: 126, baseType: !678, size: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "channel_lifetime", scope: !666, file: !26, line: 127, baseType: !678, size: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "permission_lifetime", scope: !666, file: !26, line: 128, baseType: !678, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "stun_only", scope: !666, file: !26, line: 129, baseType: !678, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "no_stun", scope: !666, file: !26, line: 130, baseType: !678, size: 64, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "no_software_attribute", scope: !666, file: !26, line: 131, baseType: !678, size: 64, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "web_admin_listen_on_workers", scope: !666, file: !26, line: 132, baseType: !678, size: 64, offset: 960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "secure_stun", scope: !666, file: !26, line: 133, baseType: !678, size: 64, offset: 1024)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !666, file: !26, line: 134, baseType: !690, size: 32, offset: 1088)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_credential_type", file: !18, line: 59, baseType: !17)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "alt_addr_cb", scope: !666, file: !26, line: 135, baseType: !692, size: 64, offset: 1152)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_alt_addr_cb", file: !26, line: 59, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!85, !403, !403}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sm_cb", scope: !666, file: !26, line: 136, baseType: !697, size: 64, offset: 1216)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_message_cb", file: !26, line: 60, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!85, !316, !297, !403, !403}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dont_fragment", scope: !666, file: !26, line: 137, baseType: !702, size: 32, offset: 1280)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "dont_fragment_option_t", file: !26, line: 96, baseType: !25)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !666, file: !26, line: 138, baseType: !704, size: 64, offset: 1344)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!85, !426}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "userkeycb", scope: !666, file: !26, line: 139, baseType: !708, size: 64, offset: 1408)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_user_key_cb", file: !26, line: 102, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!102, !669, !690, !85, !712, !102, !102, !713, !415, !223, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_username_resume_cb", file: !26, line: 101, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !85, !85, !85, !102, !102, !664, !223, !415, !102}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "chquotacb", scope: !666, file: !26, line: 140, baseType: !718, size: 64, offset: 1472)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "check_new_allocation_quota_cb", file: !26, line: 103, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!85, !102, !85, !102}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "raqcb", scope: !666, file: !26, line: 141, baseType: !723, size: 64, offset: 1536)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "release_allocation_quota_cb", file: !26, line: 104, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !102, !85, !102}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip_set", scope: !666, file: !26, line: 142, baseType: !85, size: 32, offset: 1600)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip", scope: !666, file: !26, line: 143, baseType: !112, size: 224, offset: 1632)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "allow_loopback_peers", scope: !666, file: !26, line: 144, baseType: !678, size: 64, offset: 1856)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "no_multicast_peers", scope: !666, file: !26, line: 145, baseType: !678, size: 64, offset: 1920)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "send_turn_session_info", scope: !666, file: !26, line: 146, baseType: !732, size: 64, offset: 1984)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_turn_session_info_cb", file: !26, line: 106, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!85, !622}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "send_https_socket", scope: !666, file: !26, line: 147, baseType: !737, size: 64, offset: 2048)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_https_socket_cb", file: !26, line: 107, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !258}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "no_udp_relay", scope: !666, file: !26, line: 150, baseType: !678, size: 64, offset: 2112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "no_tcp_relay", scope: !666, file: !26, line: 151, baseType: !678, size: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_relay_connections", scope: !666, file: !26, line: 152, baseType: !606, size: 64, offset: 2240)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "send_socket_to_relay", scope: !666, file: !26, line: 153, baseType: !745, size: 64, offset: 2304)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_socket_to_relay_cb", file: !26, line: 105, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!85, !669, !223, !749, !258, !85, !750, !415, !85}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "MESSAGE_TO_RELAY_TYPE", file: !26, line: 76, baseType: !64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_servers_list", scope: !666, file: !26, line: 157, baseType: !752, size: 64, offset: 2368)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_server_addrs_list_t", file: !26, line: 53, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_server_addrs_list", file: !26, line: 47, size: 256, elements: !755)
!755 = !{!756, !757, !759}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !754, file: !26, line: 48, baseType: !403, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !754, file: !26, line: 49, baseType: !758, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !232)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !754, file: !26, line: 50, baseType: !760, size: 128, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_mutex", file: !32, line: 60, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_mutex", file: !32, line: 55, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !761, file: !32, line: 56, baseType: !98, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !761, file: !32, line: 57, baseType: !244, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "as_counter", scope: !666, file: !26, line: 158, baseType: !232, size: 64, offset: 2432)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tls_alternate_servers_list", scope: !666, file: !26, line: 159, baseType: !752, size: 64, offset: 2496)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tls_as_counter", scope: !666, file: !26, line: 160, baseType: !232, size: 64, offset: 2560)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aux_servers_list", scope: !666, file: !26, line: 161, baseType: !752, size: 64, offset: 2624)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "self_udp_balance", scope: !666, file: !26, line: 162, baseType: !85, size: 32, offset: 2688)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ip_whitelist", scope: !666, file: !26, line: 165, baseType: !771, size: 64, offset: 2752)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !32, line: 159, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !32, line: 154, size: 128, elements: !774)
!774 = !{!775, !790}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !773, file: !32, line: 155, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !32, line: 152, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !32, line: 146, size: 6624, elements: !779)
!779 = !{!780, !782, !784}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !778, file: !32, line: 147, baseType: !781, size: 2056)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2056, elements: !458)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !778, file: !32, line: 148, baseType: !783, size: 4104, offset: 2056)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4104, elements: !447)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !778, file: !32, line: 149, baseType: !785, size: 448, offset: 6176)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !113, line: 53, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 50, size: 448, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !786, file: !113, line: 51, baseType: !112, size: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !786, file: !113, line: 52, baseType: !112, size: 224, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !773, file: !32, line: 156, baseType: !232, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ip_blacklist", scope: !666, file: !26, line: 166, baseType: !771, size: 64, offset: 2816)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mobility", scope: !666, file: !26, line: 169, baseType: !678, size: 64, offset: 2880)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_connections_map", scope: !666, file: !26, line: 170, baseType: !606, size: 64, offset: 2944)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "server_relay", scope: !666, file: !26, line: 173, baseType: !85, size: 32, offset: 3008)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_bps_func", scope: !666, file: !26, line: 176, baseType: !796, size: 64, offset: 3072)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocate_bps_cb", file: !26, line: 109, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!477, !477, !85}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !666, file: !26, line: 179, baseType: !85, size: 32, offset: 3136)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "oauth_server_name", scope: !666, file: !26, line: 180, baseType: !94, size: 64, offset: 3200)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "acme_redirect", scope: !666, file: !26, line: 183, baseType: !94, size: 64, offset: 3264)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "allocation_default_address_family", scope: !666, file: !26, line: 186, baseType: !804, size: 32, offset: 3328)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !26, line: 84, baseType: !71)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "log_binding", scope: !666, file: !26, line: 189, baseType: !678, size: 64, offset: 3392)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!814 = !{!0, !7, !12, !815, !817, !822, !827, !832, !837, !842, !845, !850, !855, !860, !865, !870, !872, !877, !882, !885, !890, !893, !898, !903, !908, !913, !918, !923, !926, !931, !936, !941, !943, !946, !948, !953, !955, !960, !965, !968, !973, !975, !977, !979, !981, !986, !991, !996, !999, !1004, !1009, !1011, !1016, !1021, !1023, !1025, !1027, !1029, !1031, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1053, !1055, !1058, !1063, !1065, !1067, !1069, !1074, !1076, !1078, !1080, !1082, !1087, !1089, !1094, !1099, !1102, !1107, !1109, !1114, !1119, !1124, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !1145, !1147, !1150, !1153, !1155, !1157, !1159, !1164, !1169, !1171, !1173, !1176, !1178, !1183, !1185, !1187, !1189, !1191, !1193, !1195, !1198, !1200, !1202, !1204, !1209, !1211, !1213, !1216, !1218, !1223, !1225, !1227, !1229, !1231, !1233, !1235, !1240, !1242, !1244, !1249, !1251, !1253, !1255, !1260, !1262, !1264, !1266, !1268, !1270, !1272, !1275, !1277, !1279, !1281, !1283, !1285, !1287, !1289, !1291, !1296, !1298, !1300, !1302, !1304, !1306, !1308, !1310, !1312, !1314, !1316, !1318, !1320, !1322, !1324, !1326, !1328, !1330, !1332, !1337, !1339, !1341, !1343, !1345, !1348, !1350, !1352, !1354, !1357, !1359, !1361, !1363, !1365, !1367, !1369, !1371, !1373}
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "TURN_MAX_ALLOCATE_TIMEOUT_STUN_ONLY", scope: !14, file: !2, line: 77, type: !85, isLocal: false, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !2, line: 776, type: !819, isLocal: true, isDefinition: true)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 43)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !2, line: 777, type: !824, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 18)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2458, type: !829, isLocal: true, isDefinition: true)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 13)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2458, type: !834, isLocal: true, isDefinition: true)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 360, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 45)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2503, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 47)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2549, type: !844, isLocal: true, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !160)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2556, type: !847, isLocal: true, isDefinition: true)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 11)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2561, type: !852, isLocal: true, isDefinition: true)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 51)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4160, type: !857, isLocal: true, isDefinition: true)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 216, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 27)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4183, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 832, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 104)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4195, type: !867, isLocal: true, isDefinition: true)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 67)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4211, type: !862, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4712, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 248, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 31)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4738, type: !879, isLocal: true, isDefinition: true)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 39)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4966, type: !884, isLocal: true, isDefinition: true)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !858)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !2, line: 5006, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 22)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !892, isLocal: true, isDefinition: true)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !144)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !895, isLocal: true, isDefinition: true)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 90)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 624, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 78)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !905, isLocal: true, isDefinition: true)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 760, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 95)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !910, isLocal: true, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 83)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3338, type: !915, isLocal: true, isDefinition: true)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 6)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3395, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 21)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3395, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, elements: !160)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3409, type: !928, isLocal: true, isDefinition: true)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 69)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3412, type: !933, isLocal: true, isDefinition: true)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 48)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3437, type: !938, isLocal: true, isDefinition: true)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 24)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3449, type: !879, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3480, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !189)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3486, type: !945, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3501, type: !950, isLocal: true, isDefinition: true)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 42)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3522, type: !879, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4496, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 184, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 23)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4517, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 37)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4534, type: !967, isLocal: true, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !875)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4562, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 28)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4632, type: !9, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4647, type: !915, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4649, type: !970, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4651, type: !933, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4654, type: !983, isLocal: true, isDefinition: true)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 46)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4662, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 20)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3601, type: !993, isLocal: true, isDefinition: true)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 30)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3602, type: !998, isLocal: true, isDefinition: true)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 160, elements: !989)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3622, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 44)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3666, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 29)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3684, type: !928, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3693, type: !1013, isLocal: true, isDefinition: true)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 632, elements: !1014)
!1014 = !{!1015}
!1015 = !DISubrange(count: 79)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3761, type: !1018, isLocal: true, isDefinition: true)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 9)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3773, type: !892, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3799, type: !892, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3809, type: !829, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3819, type: !824, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3838, type: !892, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3844, type: !1033, isLocal: true, isDefinition: true)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 41)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3863, type: !933, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3886, type: !9, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3896, type: !9, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3903, type: !852, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !2, line: 3913, type: !1006, isLocal: true, isDefinition: true)
