; ModuleID = '/home/raj/coturn/src/server/ns_turn_maps_rtcp.c'
source_filename = "/home/raj/coturn/src/server/ns_turn_maps_rtcp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._rtcp_map = type { i32, ptr, ptr, %struct._turn_mutex }
%struct._turn_mutex = type { i32, ptr }
%struct.rtcp_alloc_type = type { ptr, i32, i64 }
%struct.timeout_check_arg_type = type { [1024 x i64], i32, i32 }

@.str = private unnamed_addr constant [25 x i8] c"rtcp_map_timeout_handler\00", align 1, !dbg !0

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @rtcp_map_create(ptr noundef %0) #0 !dbg !78 {
  %2 = alloca ptr, align 8
  %3 = alloca ptr, align 8
  %4 = alloca ptr, align 8
  store ptr %0, ptr %3, align 8
  call void @llvm.dbg.declare(metadata ptr %3, metadata !86, metadata !DIExpression()), !dbg !87
  call void @llvm.dbg.declare(metadata ptr %4, metadata !88, metadata !DIExpression()), !dbg !89
  %5 = call noalias ptr @malloc(i64 noundef 40) #6, !dbg !90
  store ptr %5, ptr %4, align 8, !dbg !89
  %6 = load ptr, ptr %4, align 8, !dbg !91
  call void @llvm.memset.p0.i64(ptr align 8 %6, i8 0, i64 40, i1 false), !dbg !92
  %7 = load ptr, ptr %4, align 8, !dbg !93
  %8 = load ptr, ptr %3, align 8, !dbg !95
  %9 = call i32 @rtcp_map_init(ptr noundef %7, ptr noundef %8), !dbg !96
  %10 = icmp slt i32 %9, 0, !dbg !97
  br i1 %10, label %11, label %13, !dbg !98


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "46ad6688c9d86645d131cc0128a9539c")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 25)
!7 = distinct !DICompileUnit(language: DW_LANG_C11, file: !8, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !9, globals: !69, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "/home/raj/coturn/src/server/ns_turn_maps_rtcp.c", directory: "/home/raj/coturn/build", checksumkind: CSK_MD5, checksum: "46ad6688c9d86645d131cc0128a9539c")
!9 = !{!10, !36, !46, !54, !29, !55, !66}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !12, line: 46, baseType: !13)
!12 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !2, line: 44, size: 320, elements: !14)
!14 = !{!15, !21, !26, !30}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !13, file: !2, line: 45, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 26, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 42, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !13, file: !2, line: 46, baseType: !22, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !24, line: 43, baseType: !25)
!24 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !24, line: 42, flags: DIFlagFwdDecl)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !13, file: !2, line: 47, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !28, line: 122, baseType: !29)
!28 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !13, file: !2, line: 48, baseType: !31, size: 128, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_mutex", file: !28, line: 60, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_mutex", file: !28, line: 55, size: 128, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !32, file: !28, line: 56, baseType: !16, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !32, file: !28, line: 57, baseType: !29, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_alloc_type", file: !2, line: 56, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 52, size: 192, elements: !39)
!39 = !{!40, !45, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !38, file: !2, line: 53, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !28, line: 116, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !28, line: 115, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !28, line: 114, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !38, file: !2, line: 54, baseType: !46, size: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !47, line: 108, baseType: !16)
!47 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !38, file: !2, line: 55, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_token_type", file: !12, line: 43, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !24, line: 47, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 27, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 45, baseType: !53)
!53 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !24, line: 48, baseType: !53)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeout_check_arg_type", file: !2, line: 68, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 64, size: 65600, elements: !58)
!58 = !{!59, !63, !65}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tokens", scope: !57, file: !2, line: 65, baseType: !60, size: 65536)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 65536, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 1024)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tn", scope: !57, file: !2, line: 66, baseType: !64, size: 32, offset: 65536)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !57, file: !2, line: 67, baseType: !46, size: 32, offset: 65568)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !67, line: 26, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !19, line: 41, baseType: !64)
!69 = !{!0}
!70 = !{i32 7, !"Dwarf Version", i32 5}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{i32 1, !"wchar_size", i32 4}
!73 = !{i32 8, !"PIC Level", i32 2}
!74 = !{i32 7, !"PIE Level", i32 2}
!75 = !{i32 7, !"uwtable", i32 2}
!76 = !{i32 7, !"frame-pointer", i32 2}
!77 = !{!"clang version 16.0.0"}
!78 = distinct !DISubprogram(name: "rtcp_map_create", scope: !2, file: !2, line: 179, type: !79, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !85)
!79 = !DISubroutineType(types: !80)
!80 = !{!10, !81}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !28, line: 120, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !28, line: 119, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !28, line: 118, flags: DIFlagFwdDecl)
!85 = !{}
!86 = !DILocalVariable(name: "e", arg: 1, scope: !78, file: !2, line: 179, type: !81)
!87 = !DILocation(line: 179, column: 45, scope: !78)
!88 = !DILocalVariable(name: "map", scope: !78, file: !2, line: 180, type: !10)
!89 = !DILocation(line: 180, column: 13, scope: !78)
!90 = !DILocation(line: 180, column: 28, scope: !78)
!91 = !DILocation(line: 181, column: 9, scope: !78)
!92 = !DILocation(line: 181, column: 3, scope: !78)
!93 = !DILocation(line: 182, column: 20, scope: !94)
!94 = distinct !DILexicalBlock(scope: !78, file: !2, line: 182, column: 6)
!95 = !DILocation(line: 182, column: 24, scope: !94)
!96 = !DILocation(line: 182, column: 6, scope: !94)
!97 = !DILocation(line: 182, column: 26, scope: !94)
!98 = !DILocation(line: 182, column: 6, scope: !78)
!99 = !DILocation(line: 183, column: 10, scope: !100)
!100 = distinct !DILexicalBlock(scope: !94, file: !2, line: 182, column: 30)
!101 = !DILocation(line: 183, column: 5, scope: !100)
!102 = !DILocation(line: 184, column: 5, scope: !100)
!103 = !DILocation(line: 186, column: 10, scope: !78)
!104 = !DILocation(line: 186, column: 3, scope: !78)
!105 = !DILocation(line: 187, column: 1, scope: !78)
!106 = distinct !DISubprogram(name: "rtcp_map_init", scope: !2, file: !2, line: 163, type: !107, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !85)
!107 = !DISubroutineType(types: !108)
!108 = !{!64, !10, !81}
!109 = !DILocalVariable(name: "map", arg: 1, scope: !106, file: !2, line: 163, type: !10)
!110 = !DILocation(line: 163, column: 36, scope: !106)
!111 = !DILocalVariable(name: "e", arg: 2, scope: !106, file: !2, line: 163, type: !81)
!112 = !DILocation(line: 163, column: 59, scope: !106)
!113 = !DILocation(line: 164, column: 6, scope: !114)
!114 = distinct !DILexicalBlock(scope: !106, file: !2, line: 164, column: 6)
!115 = !DILocation(line: 164, column: 6, scope: !106)
!116 = !DILocation(line: 165, column: 7, scope: !117)
!117 = distinct !DILexicalBlock(scope: !118, file: !2, line: 165, column: 7)
!118 = distinct !DILexicalBlock(scope: !114, file: !2, line: 164, column: 11)
!119 = !DILocation(line: 165, column: 12, scope: !117)
!120 = !DILocation(line: 165, column: 18, scope: !117)
!121 = !DILocation(line: 165, column: 7, scope: !118)
!122 = !DILocation(line: 166, column: 4, scope: !123)
!123 = distinct !DILexicalBlock(scope: !117, file: !2, line: 165, column: 37)
!124 = !DILocation(line: 166, column: 9, scope: !123)
!125 = !DILocation(line: 166, column: 15, scope: !123)
