; ModuleID = '/home/raj/coturn/src/apps/uclient/mainuclient.c'
source_filename = "/home/raj/coturn/src/apps/uclient/mainuclient.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._oauth_key_data_raw = type { [129 x i8], [257 x i8], i64, i32, [65 x i8], [128 x i8] }
%struct._oauth_key = type { [129 x i8], [257 x i8], i64, i32, i32, i32, [257 x i8], i64, [257 x i8], i64 }
%union.ioa_addr = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._oauth_key_data = type { [129 x i8], [257 x i8], i64, i32, i32, [65 x i8] }

@clmessage_length = dso_local global i32 100, align 4, !dbg !0
@do_not_use_channel = dso_local global i32 0, align 4, !dbg !48
@c2c = dso_local global i32 0, align 4, !dbg !51
@clnet_verbose = dso_local global i32 0, align 4, !dbg !53
@use_tcp = dso_local global i32 0, align 4, !dbg !55
@use_sctp = dso_local global i32 0, align 4, !dbg !57
@use_secure = dso_local global i32 0, align 4, !dbg !59
@hang_on = dso_local global i32 0, align 4, !dbg !61
@no_rtcp = dso_local global i32 0, align 4, !dbg !63
@default_address_family = dso_local global i32 0, align 4, !dbg !65
@dont_fragment = dso_local global i32 0, align 4, !dbg !67
@g_auth_secret = dso_local global [1025 x i8] zeroinitializer, align 16, !dbg !69

!111 = distinct !DIGlobalVariable(name: "origin", scope: !2, file: !50, line: 93, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1024, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 128)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "bps", scope: !2, file: !50, line: 95, type: !31, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "dual_allocation", scope: !2, file: !50, line: 97, type: !7, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "oauth", scope: !2, file: !50, line: 99, type: !7, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !50, line: 176, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 56, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 7)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !50, line: 184, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 512, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 64)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !50, line: 199, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 4)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !50, line: 239, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 208, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 26)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !50, line: 385, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 8)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !50, line: 387, type: !133, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !50, line: 446, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 288, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 36)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !50, line: 476, type: !133, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !50, line: 478, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 48, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 6)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !50, line: 525, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 248, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 31)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !50, line: 532, type: !162, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !50, line: 538, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 240, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 30)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !50, line: 546, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 296, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 37)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "peer_addr", scope: !2, file: !50, line: 59, type: !179, isLocal: false, isDefinition: true)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !180, line: 48, baseType: !181)
!180 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !180, line: 44, size: 224, elements: !182)
!182 = !{!183, !195, !213}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !181, file: !180, line: 45, baseType: !184, size: 128)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !185, line: 180, size: 128, elements: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!186 = !{!187, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !184, file: !185, line: 182, baseType: !188, size: 16)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !189, line: 28, baseType: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!190 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !184, file: !185, line: 183, baseType: !192, size: 112, offset: 16)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 112, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 14)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !181, file: !180, line: 46, baseType: !196, size: 128)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !197, line: 245, size: 128, elements: !198)
!197 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!198 = !{!199, !200, !204, !211}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !196, file: !197, line: 247, baseType: !188, size: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !196, file: !197, line: 248, baseType: !201, size: 16, offset: 16)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !197, line: 123, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !40, line: 25, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !42, line: 40, baseType: !190)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !196, file: !197, line: 249, baseType: !205, size: 32, offset: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !197, line: 31, size: 32, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !205, file: !197, line: 33, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !197, line: 30, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !40, line: 26, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !42, line: 42, baseType: !17)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !196, file: !197, line: 252, baseType: !212, size: 64, offset: 64)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !144)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !181, file: !180, line: 47, baseType: !214, size: 224)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !197, line: 260, size: 224, elements: !215)
!215 = !{!216, !217, !218, !219, !233}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !214, file: !197, line: 262, baseType: !188, size: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !214, file: !197, line: 263, baseType: !201, size: 16, offset: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !214, file: !197, line: 264, baseType: !209, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !214, file: !197, line: 265, baseType: !220, size: 128, offset: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !197, line: 219, size: 128, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !220, file: !197, line: 226, baseType: !223, size: 128)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !220, file: !197, line: 221, size: 128, elements: !224)
!224 = !{!225, !229, !231}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !223, file: !197, line: 223, baseType: !226, size: 128)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !223, file: !197, line: 224, baseType: !230, size: 128)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !144)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !223, file: !197, line: 225, baseType: !232, size: 128)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 128, elements: !134)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !214, file: !197, line: 266, baseType: !209, size: 32, offset: 192)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "g_uname", scope: !2, file: !50, line: 63, type: !236, isLocal: false, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 4104, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 513)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "g_upwd", scope: !2, file: !50, line: 64, type: !241, isLocal: false, isDefinition: true)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !32, line: 66, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 2056, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 257)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "root_tls_ctx", scope: !2, file: !50, line: 73, type: !247, isLocal: false, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 2048, elements: !252)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !250, line: 185, baseType: !251)
!250 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !250, line: 185, flags: DIFlagFwdDecl)
!252 = !{!253}
!253 = !DISubrange(count: 32)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "okey_array", scope: !2, file: !50, line: 100, type: !256, isLocal: false, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 22848, elements: !279)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key", file: !6, line: 236, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key", file: !6, line: 223, size: 7616, elements: !259)
!259 = !{!260, !264, !266, !269, !272, !273, !275, !276, !277, !278}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !258, file: !6, line: 224, baseType: !261, size: 1032)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 1032, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 129)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !258, file: !6, line: 225, baseType: !265, size: 2056, offset: 1032)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2056, elements: !243)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key_size", scope: !258, file: !6, line: 226, baseType: !267, size: 64, offset: 3136)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !268, line: 46, baseType: !33)
!268 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !258, file: !6, line: 227, baseType: !270, size: 32, offset: 3200)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !271, line: 108, baseType: !209)
!271 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !258, file: !6, line: 228, baseType: !270, size: 32, offset: 3232)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !258, file: !6, line: 229, baseType: !274, size: 32, offset: 3264)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENC_ALG", file: !6, line: 187, baseType: !23)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_key", scope: !258, file: !6, line: 230, baseType: !265, size: 2056, offset: 3296)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_key_size", scope: !258, file: !6, line: 231, baseType: !267, size: 64, offset: 5376)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "auth_key", scope: !258, file: !6, line: 232, baseType: !265, size: 2056, offset: 5440)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "auth_key_size", scope: !258, file: !6, line: 233, baseType: !267, size: 64, offset: 7552)
!279 = !{!280}
!280 = !DISubrange(count: 3)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "okdr_array", scope: !2, file: !50, line: 102, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 14400, elements: !279)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data_raw", file: !285, line: 144, baseType: !286)
!285 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data_raw", file: !285, line: 135, size: 4800, elements: !287)
!287 = !{!288, !289, !290, !293, !294, !298}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !286, file: !285, line: 136, baseType: !261, size: 1032)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !286, file: !285, line: 137, baseType: !265, size: 2056, offset: 1032)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !286, file: !285, line: 138, baseType: !291, size: 64, offset: 3136)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 27, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !42, line: 45, baseType: !33)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !286, file: !285, line: 139, baseType: !209, size: 32, offset: 3200)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !286, file: !285, line: 140, baseType: !295, size: 520, offset: 3232)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 520, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 65)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !286, file: !285, line: 141, baseType: !112, size: 1024, offset: 3752)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "cipher_suite", scope: !2, file: !50, line: 70, type: !71, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "ca_cert_file", scope: !2, file: !50, line: 69, type: !71, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "Usage", scope: !2, file: !50, line: 110, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 17400, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 2175)
!308 = !{i32 7, !"Dwarf Version", i32 5}
!309 = !{i32 2, !"Debug Info Version", i32 3}
!310 = !{i32 1, !"wchar_size", i32 4}
!311 = !{i32 8, !"PIC Level", i32 2}
!312 = !{i32 7, !"PIE Level", i32 2}
!313 = !{i32 7, !"uwtable", i32 2}
!314 = !{i32 7, !"frame-pointer", i32 2}
!315 = !{!"clang version 16.0.0"}
!316 = distinct !DISubprogram(name: "main", scope: !50, file: !50, line: 163, type: !317, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!317 = !DISubroutineType(types: !318)
!318 = !{!7, !7, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!320 = !{}
!321 = !DILocalVariable(name: "argc", arg: 1, scope: !316, file: !50, line: 163, type: !7)
!322 = !DILocation(line: 163, column: 14, scope: !316)
!323 = !DILocalVariable(name: "argv", arg: 2, scope: !316, file: !50, line: 163, type: !319)
!324 = !DILocation(line: 163, column: 27, scope: !316)
!325 = !DILocalVariable(name: "port", scope: !316, file: !50, line: 165, type: !7)
!326 = !DILocation(line: 165, column: 6, scope: !316)
!327 = !DILocalVariable(name: "messagenumber", scope: !316, file: !50, line: 166, type: !7)
!328 = !DILocation(line: 166, column: 6, scope: !316)
!329 = !DILocalVariable(name: "local_addr", scope: !316, file: !50, line: 167, type: !330)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 256)
!333 = !DILocation(line: 167, column: 7, scope: !316)
!334 = !DILocalVariable(name: "c", scope: !316, file: !50, line: 168, type: !7)
!335 = !DILocation(line: 168, column: 6, scope: !316)
!336 = !DILocalVariable(name: "mclient", scope: !316, file: !50, line: 169, type: !7)
!337 = !DILocation(line: 169, column: 6, scope: !316)
!338 = !DILocalVariable(name: "peer_address", scope: !316, file: !50, line: 170, type: !261)
!339 = !DILocation(line: 170, column: 7, scope: !316)
!340 = !DILocalVariable(name: "peer_port", scope: !316, file: !50, line: 171, type: !7)
!341 = !DILocation(line: 171, column: 6, scope: !316)
!342 = !DILocalVariable(name: "rest_api_separator", scope: !316, file: !50, line: 173, type: !36)
!343 = !DILocation(line: 173, column: 7, scope: !316)
!344 = !DILocalVariable(name: "use_null_cipher", scope: !316, file: !50, line: 174, type: !7)
!345 = !DILocation(line: 174, column: 6, scope: !316)
!346 = !DILocation(line: 176, column: 2, scope: !316)
!347 = !DILocation(line: 178, column: 2, scope: !316)
!348 = !DILocation(line: 180, column: 2, scope: !316)
!349 = !DILocation(line: 182, column: 2, scope: !316)
!350 = !DILocation(line: 184, column: 2, scope: !316)
!351 = !DILocation(line: 184, column: 21, scope: !316)
!352 = !DILocation(line: 184, column: 27, scope: !316)
!353 = !DILocation(line: 184, column: 14, scope: !316)
!354 = !DILocation(line: 184, column: 12, scope: !316)
!355 = !DILocation(line: 184, column: 101, scope: !316)
!356 = !DILocation(line: 185, column: 11, scope: !357)
!357 = distinct !DILexicalBlock(scope: !316, file: !50, line: 184, column: 108)
!358 = !DILocation(line: 185, column: 3, scope: !357)
!359 = !DILocation(line: 188, column: 10, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !50, line: 186, column: 13)
!361 = distinct !DILexicalBlock(scope: !357, file: !50, line: 185, column: 13)
!362 = !DILocalVariable(name: "okd_array", scope: !360, file: !50, line: 190, type: !363)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 11520, elements: !279)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data", file: !6, line: 221, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data", file: !6, line: 212, size: 3840, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !365, file: !6, line: 213, baseType: !261, size: 1032)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !365, file: !6, line: 214, baseType: !265, size: 2056, offset: 1032)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key_size", scope: !365, file: !6, line: 215, baseType: !267, size: 64, offset: 3136)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !365, file: !6, line: 216, baseType: !270, size: 32, offset: 3200)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !365, file: !6, line: 217, baseType: !270, size: 32, offset: 3232)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !365, file: !6, line: 218, baseType: !295, size: 520, offset: 3264)
!373 = !DILocation(line: 190, column: 19, scope: !360)
!374 = !DILocation(line: 191, column: 48, scope: !360)
!375 = !DILocation(line: 191, column: 4, scope: !360)
!376 = !DILocation(line: 192, column: 48, scope: !360)
!377 = !DILocation(line: 192, column: 4, scope: !360)
!378 = !DILocation(line: 193, column: 48, scope: !360)
!379 = !DILocation(line: 193, column: 4, scope: !360)
!380 = !DILocalVariable(name: "err_msg", scope: !360, file: !50, line: 195, type: !71)
!381 = !DILocation(line: 195, column: 9, scope: !360)
!382 = !DILocalVariable(name: "err_msg_size", scope: !360, file: !50, line: 196, type: !267)
!383 = !DILocation(line: 196, column: 11, scope: !360)
!384 = !DILocation(line: 198, column: 32, scope: !385)
!385 = distinct !DILexicalBlock(scope: !360, file: !50, line: 198, column: 8)
!386 = !DILocation(line: 198, column: 62, scope: !385)
!387 = !DILocation(line: 198, column: 71, scope: !385)
!388 = !DILocation(line: 198, column: 8, scope: !385)
!389 = !DILocation(line: 198, column: 85, scope: !385)
!390 = !DILocation(line: 198, column: 8, scope: !360)
!391 = !DILocation(line: 199, column: 13, scope: !392)
!392 = distinct !DILexicalBlock(scope: !385, file: !50, line: 198, column: 90)
!393 = !DILocation(line: 199, column: 29, scope: !392)
!394 = !DILocation(line: 199, column: 5, scope: !392)
!395 = !DILocation(line: 200, column: 5, scope: !392)
!396 = !DILocation(line: 203, column: 32, scope: !397)
!397 = distinct !DILexicalBlock(scope: !360, file: !50, line: 203, column: 8)
!398 = !DILocation(line: 203, column: 62, scope: !397)
!399 = !DILocation(line: 203, column: 71, scope: !397)
!400 = !DILocation(line: 203, column: 8, scope: !397)
!401 = !DILocation(line: 203, column: 85, scope: !397)
!402 = !DILocation(line: 203, column: 8, scope: !360)
!403 = !DILocation(line: 204, column: 13, scope: !404)
!404 = distinct !DILexicalBlock(scope: !397, file: !50, line: 203, column: 90)
!405 = !DILocation(line: 204, column: 29, scope: !404)
!406 = !DILocation(line: 204, column: 5, scope: !404)
!407 = !DILocation(line: 205, column: 5, scope: !404)
!408 = !DILocation(line: 208, column: 32, scope: !409)
!409 = distinct !DILexicalBlock(scope: !360, file: !50, line: 208, column: 8)
!410 = !DILocation(line: 208, column: 62, scope: !409)
!411 = !DILocation(line: 208, column: 71, scope: !409)
!412 = !DILocation(line: 208, column: 8, scope: !409)
!413 = !DILocation(line: 208, column: 85, scope: !409)
!414 = !DILocation(line: 208, column: 8, scope: !360)
!415 = !DILocation(line: 209, column: 13, scope: !416)
!416 = distinct !DILexicalBlock(scope: !409, file: !50, line: 208, column: 90)
!417 = !DILocation(line: 209, column: 29, scope: !416)
!418 = !DILocation(line: 209, column: 5, scope: !416)
!419 = !DILocation(line: 210, column: 5, scope: !416)
!420 = !DILocation(line: 213, column: 4, scope: !361)
!421 = !DILocation(line: 215, column: 32, scope: !361)
!422 = !DILocation(line: 215, column: 24, scope: !361)
!423 = !DILocation(line: 215, column: 8, scope: !361)
!424 = !DILocation(line: 216, column: 4, scope: !361)
!425 = !DILocation(line: 218, column: 4, scope: !361)
!426 = !DILocation(line: 218, column: 4, scope: !427)
!427 = distinct !DILexicalBlock(scope: !428, file: !50, line: 218, column: 4)
!428 = distinct !DILexicalBlock(scope: !361, file: !50, line: 218, column: 4)
!429 = !DILocation(line: 218, column: 4, scope: !428)
!430 = !DILocalVariable(name: "szdst", scope: !431, file: !50, line: 218, type: !267)
!431 = distinct !DILexicalBlock(scope: !432, file: !50, line: 218, column: 4)
!432 = distinct !DILexicalBlock(scope: !433, file: !50, line: 218, column: 4)
!433 = distinct !DILexicalBlock(scope: !427, file: !50, line: 218, column: 4)
!434 = !DILocation(line: 218, column: 4, scope: !431)
!435 = !DILocation(line: 218, column: 4, scope: !433)
!436 = !DILocation(line: 219, column: 4, scope: !361)
