; ModuleID = '/home/raj/coturn/src/apps/uclient/uclient.c'
source_filename = "/home/raj/coturn/src/apps/uclient/uclient.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._oauth_key = type { [129 x i8], [257 x i8], i64, i32, i32, i32, [257 x i8], i64, [257 x i8], i64 }
%struct._stun_buffer = type { [4 x i8], [65507 x i8], i64, i16, i8 }
%struct.app_ur_conn_info = type { %union.ioa_addr, [129 x i8], %union.ioa_addr, [129 x i8], [129 x i8], %union.ioa_addr, %union.ioa_addr, i32, ptr, i32, [128 x i8], [128 x i8], i32, [1026 x i8], [64 x i8], i32, i32, ptr, i64, i32, [33 x i8] }
%union.ioa_addr = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.app_tcp_conn_info = type { i32, %union.ioa_addr, i32, ptr, i32 }
%struct.stun_tid = type { [12 x i8] }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }
%struct.app_ur_session = type { %struct.app_ur_conn_info, i32, i32, i16, i32, i32, i32, ptr, ptr, %struct._stun_buffer, %struct._stun_buffer, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64 }
%struct._message_info = type { i32, i64 }
%struct.timespec = type { i64, i64 }
%struct._oauth_token = type { %struct._oauth_encrypted_block }
%struct._oauth_encrypted_block = type { i16, [256 x i8], i16, [128 x i8], i64, i32 }

!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_UR_STATE", file: !39, line: 51, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "src/apps/uclient/session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "d70192ffc41ca1767f7b9531a33c3705")
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "UR_STATE_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "UR_STATE_READY", value: 1)
!43 = !DIEnumerator(name: "UR_STATE_DONE", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 54, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "src/client/ns_turn_msg.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "43c56357294df21a547ee0716fe3769d")
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "TURN_CREDENTIALS_NONE", value: 0)
!48 = !DIEnumerator(name: "TURN_CREDENTIALS_LONG_TERM", value: 1)
!49 = !DIEnumerator(name: "TURN_CREDENTIALS_SHORT_TERM", value: 2)
!50 = !DIEnumerator(name: "TURN_CREDENTIALS_UNDEFINED", value: 3)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SHATYPE", file: !52, line: 160, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "src/client/ns_turn_msg_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "4d8c44ae9e82b7a50b86805787352690")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60}
!55 = !DIEnumerator(name: "SHATYPE_ERROR", value: -1)
!56 = !DIEnumerator(name: "SHATYPE_DEFAULT", value: 0)
!57 = !DIEnumerator(name: "SHATYPE_SHA1", value: 0)
!58 = !DIEnumerator(name: "SHATYPE_SHA256", value: 1)
!59 = !DIEnumerator(name: "SHATYPE_SHA384", value: 2)
!60 = !DIEnumerator(name: "SHATYPE_SHA512", value: 3)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_TYPE", file: !62, line: 85, baseType: !7, size: 32, elements: !63)
!62 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!64 = !DIEnumerator(name: "UNKNOWN_SOCKET", value: 0)
!65 = !DIEnumerator(name: "TCP_SOCKET", value: 6)
!66 = !DIEnumerator(name: "UDP_SOCKET", value: 17)
!67 = !DIEnumerator(name: "TLS_SOCKET", value: 56)
!68 = !DIEnumerator(name: "SCTP_SOCKET", value: 132)
!69 = !DIEnumerator(name: "TLS_SCTP_SOCKET", value: 133)
!70 = !DIEnumerator(name: "DTLS_SOCKET", value: 250)
!71 = !DIEnumerator(name: "TCP_SOCKET_PROXY", value: 253)
!72 = !DIEnumerator(name: "TENTATIVE_SCTP_SOCKET", value: 254)
!73 = !DIEnumerator(name: "TENTATIVE_TCP_SOCKET", value: 255)
!74 = !{!75, !53, !77, !78, !83, !7, !85, !242, !243, !123, !244, !245, !104, !246, !239, !247, !249, !250, !252, !253, !256, !258, !260, !263, !255, !265}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !79, line: 24, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !81, line: 38, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 46, baseType: !77)
!84 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "app_ur_session", file: !39, line: 122, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 97, size: 1064768, elements: !88)
!88 = !{!89, !202, !204, !205, !206, !207, !208, !209, !213, !214, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !241}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pinfo", scope: !87, file: !39, line: 98, baseType: !90, size: 15552)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "app_ur_conn_info", file: !39, line: 95, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 71, size: 15552, elements: !92)
!92 = !{!93, !152, !156, !157, !158, !159, !160, !161, !162, !167, !168, !172, !173, !174, !178, !183, !184, !185, !196, !197, !198}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !91, file: !39, line: 72, baseType: !94, size: 224)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !95, line: 48, baseType: !96)
!95 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !95, line: 44, size: 224, elements: !97)
!97 = !{!98, !109, !129}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !96, file: !95, line: 45, baseType: !99, size: 128)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !14, line: 180, size: 128, elements: !100)
!100 = !{!101, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !99, file: !14, line: 182, baseType: !102, size: 16)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !103, line: 28, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!104 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !99, file: !14, line: 183, baseType: !106, size: 112, offset: 16)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 112, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 14)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !96, file: !95, line: 46, baseType: !110, size: 128)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !111, line: 245, size: 128, elements: !112)
!111 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!112 = !{!113, !114, !118, !125}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !110, file: !111, line: 247, baseType: !102, size: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !110, file: !111, line: 248, baseType: !115, size: 16, offset: 16)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !111, line: 123, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !79, line: 25, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !81, line: 40, baseType: !104)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !110, file: !111, line: 249, baseType: !119, size: 32, offset: 32)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !111, line: 31, size: 32, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !119, file: !111, line: 33, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !111, line: 30, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !79, line: 26, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !81, line: 42, baseType: !7)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !110, file: !111, line: 252, baseType: !126, size: 64, offset: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !96, file: !95, line: 47, baseType: !130, size: 224)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !111, line: 260, size: 224, elements: !131)
!131 = !{!132, !133, !134, !135, !151}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !130, file: !111, line: 262, baseType: !102, size: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !130, file: !111, line: 263, baseType: !115, size: 16, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !130, file: !111, line: 264, baseType: !123, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !130, file: !111, line: 265, baseType: !136, size: 128, offset: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !111, line: 219, size: 128, elements: !137)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !136, file: !111, line: 226, baseType: !139, size: 128)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !111, line: 221, size: 128, elements: !140)
!140 = !{!141, !145, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !139, file: !111, line: 223, baseType: !142, size: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !139, file: !111, line: 224, baseType: !146, size: 128)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !127)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !139, file: !111, line: 225, baseType: !148, size: 128)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 4)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !130, file: !111, line: 266, baseType: !123, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lsaddr", scope: !91, file: !39, line: 73, baseType: !153, size: 1032, offset: 224)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1032, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 129)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !91, file: !39, line: 74, baseType: !94, size: 224, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rsaddr", scope: !91, file: !39, line: 75, baseType: !153, size: 1032, offset: 1504)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !91, file: !39, line: 76, baseType: !153, size: 1032, offset: 2536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !91, file: !39, line: 77, baseType: !94, size: 224, offset: 3584)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr", scope: !91, file: !39, line: 78, baseType: !94, size: 224, offset: 3808)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !91, file: !39, line: 79, baseType: !53, size: 32, offset: 4032)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !91, file: !39, line: 80, baseType: !163, size: 64, offset: 4096)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !165, line: 184, baseType: !166)
!165 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !165, line: 184, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "broken", scope: !91, file: !39, line: 81, baseType: !53, size: 32, offset: 4160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !91, file: !39, line: 82, baseType: !169, size: 1024, offset: 4192)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1024, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !91, file: !39, line: 83, baseType: !169, size: 1024, offset: 5216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !91, file: !39, line: 85, baseType: !53, size: 32, offset: 6240)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !91, file: !39, line: 86, baseType: !175, size: 8208, offset: 6272)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 8208, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 1026)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !91, file: !39, line: 87, baseType: !179, size: 512, offset: 14480)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !45, line: 64, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 512, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "key_set", scope: !91, file: !39, line: 88, baseType: !53, size: 32, offset: 15008)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cok", scope: !91, file: !39, line: 89, baseType: !53, size: 32, offset: 15040)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_conn", scope: !91, file: !39, line: 91, baseType: !186, size: 64, offset: 15104)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "app_tcp_conn_info", file: !39, line: 69, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 61, size: 448, elements: !190)
!190 = !{!191, !192, !193, !194, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cid", scope: !189, file: !39, line: 64, baseType: !123, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_data_local_addr", scope: !189, file: !39, line: 65, baseType: !94, size: 224, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_data_fd", scope: !189, file: !39, line: 66, baseType: !53, size: 32, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_data_ssl", scope: !189, file: !39, line: 67, baseType: !163, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_data_bound", scope: !189, file: !39, line: 68, baseType: !53, size: 32, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_conn_number", scope: !91, file: !39, line: 92, baseType: !83, size: 64, offset: 15168)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "is_peer", scope: !91, file: !39, line: 93, baseType: !53, size: 32, offset: 15232)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "s_mobile_id", scope: !91, file: !39, line: 94, baseType: !199, size: 264, offset: 15264)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 264, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 33)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !87, file: !39, line: 99, baseType: !203, size: 32, offset: 15552)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "UR_STATE", file: !39, line: 57, baseType: !38)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !87, file: !39, line: 100, baseType: !7, size: 32, offset: 15584)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !87, file: !39, line: 101, baseType: !116, size: 16, offset: 15616)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cycles", scope: !87, file: !39, line: 102, baseType: !53, size: 32, offset: 15648)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "timer_cycle", scope: !87, file: !39, line: 103, baseType: !53, size: 32, offset: 15680)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "completed", scope: !87, file: !39, line: 104, baseType: !53, size: 32, offset: 15712)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "input_ev", scope: !87, file: !39, line: 105, baseType: !210, size: 64, offset: 15744)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !212, line: 276, flags: DIFlagFwdDecl)
!212 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "input_tcp_data_ev", scope: !87, file: !39, line: 106, baseType: !210, size: 64, offset: 15808)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "in_buffer", scope: !87, file: !39, line: 107, baseType: !215, size: 524224, offset: 15872)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !216, line: 48, baseType: !217)
!216 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !216, line: 42, size: 524224, elements: !218)
!218 = !{!219, !221, !225, !226, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !217, file: !216, line: 43, baseType: !220, size: 32)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 32, elements: !149)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !217, file: !216, line: 44, baseType: !222, size: 524056, offset: 32)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 524056, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 65507)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !217, file: !216, line: 45, baseType: !83, size: 64, offset: 524096)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !217, file: !216, line: 46, baseType: !116, size: 16, offset: 524160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !217, file: !216, line: 47, baseType: !78, size: 8, offset: 524176)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !87, file: !39, line: 108, baseType: !215, size: 524224, offset: 540096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "refresh_time", scope: !87, file: !39, line: 109, baseType: !123, size: 32, offset: 1064320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "finished_time", scope: !87, file: !39, line: 110, baseType: !123, size: 32, offset: 1064352)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tot_msgnum", scope: !87, file: !39, line: 112, baseType: !53, size: 32, offset: 1064384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "wmsgnum", scope: !87, file: !39, line: 113, baseType: !53, size: 32, offset: 1064416)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rmsgnum", scope: !87, file: !39, line: 114, baseType: !53, size: 32, offset: 1064448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "recvmsgnum", scope: !87, file: !39, line: 115, baseType: !53, size: 32, offset: 1064480)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "recvtimems", scope: !87, file: !39, line: 116, baseType: !123, size: 32, offset: 1064512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "to_send_timems", scope: !87, file: !39, line: 117, baseType: !123, size: 32, offset: 1064544)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "loss", scope: !87, file: !39, line: 119, baseType: !83, size: 64, offset: 1064576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !87, file: !39, line: 120, baseType: !239, size: 64, offset: 1064640)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !79, line: 27, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !81, line: 45, baseType: !77)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "jitter", scope: !87, file: !39, line: 121, baseType: !239, size: 64, offset: 1064704)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!244 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!245 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !248, line: 108, baseType: !123)
!248 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !254, line: 49, baseType: !255)
!254 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "", checksumkind: CSK_MD5, checksum: "5ab727ca201ba12ae255687119da3fa7")
!255 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !261, line: 27, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !81, line: 44, baseType: !255)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !261, line: 26, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !81, line: 41, baseType: !53)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "message_info", file: !39, line: 129, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_message_info", file: !39, line: 126, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "msgnum", scope: !267, file: !39, line: 127, baseType: !53, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mstime", scope: !267, file: !39, line: 128, baseType: !239, size: 64, offset: 64)
!271 = !{!0, !272, !275, !280, !285, !290, !295, !300, !302, !307, !312, !317, !322, !327, !332, !334, !339, !344, !347, !352, !357, !362, !365, !370, !372, !374, !379, !384, !386, !388, !393, !398, !403, !405, !407, !412, !417, !422, !424, !426, !428, !434, !436, !441, !446, !451, !456, !461, !464, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "RTP_PACKET_INTERVAL", scope: !2, file: !274, line: 75, type: !53, isLocal: false, isDefinition: true)
!274 = !DIFile(filename: "src/apps/uclient/uclient.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6b93a5fc9ea2c6947cb569a85ab9f0f2")
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !274, line: 219, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 520, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 65)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !274, line: 241, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 176, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 22)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !274, line: 261, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 240, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 30)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !274, line: 267, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 152, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 19)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !274, line: 270, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 72, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 9)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !274, line: 277, type: !199, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !274, line: 435, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 224, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 28)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !274, line: 459, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 232, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 29)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !274, line: 474, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 400, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 50)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !274, line: 629, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 560, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 70)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !274, line: 634, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 368, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 46)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1483, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 208, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 26)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1514, type: !287, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1520, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 408, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 51)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1549, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 768, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 96)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1550, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 112, elements: !107)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1559, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 336, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 42)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1565, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 384, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 48)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1578, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 216, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 27)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1580, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !181)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1583, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 480, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 60)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1587, type: !314, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1641, type: !282, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1653, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 304, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 38)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1662, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 424, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 53)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !274, line: 1694, type: !336, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "tot_send_dropped", scope: !2, file: !274, line: 54, type: !239, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !274, line: 660, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 136, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 17)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !274, line: 666, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 120, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 15)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !274, line: 712, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 472, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 59)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !274, line: 719, type: !336, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !274, line: 726, type: !367, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !274, line: 774, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 376, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 47)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !274, line: 784, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 528, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 66)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !274, line: 795, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 360, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 45)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "verbose_packets", scope: !2, file: !274, line: 44, type: !53, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "total_clients", scope: !2, file: !274, line: 66, type: !53, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "elems", scope: !2, file: !274, line: 69, type: !242, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "start_sec", scope: !430, file: !274, line: 96, type: !239, isLocal: true, isDefinition: true)
!430 = distinct !DISubprogram(name: "__turn_getMSTime", scope: !274, file: !274, line: 95, type: !431, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{null}
!433 = !{}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !274, line: 61, type: !239, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "buffer_to_send", scope: !2, file: !274, line: 64, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 524288, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 65536)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !274, line: 857, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 32)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !274, line: 896, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 320, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 40)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !274, line: 896, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 104, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 13)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !274, line: 917, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 144, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 18)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !274, line: 927, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !143)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "current_mstime", scope: !2, file: !274, line: 62, type: !239, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "tot_messages", scope: !2, file: !274, line: 49, type: !123, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "start_full_timer", scope: !2, file: !274, line: 48, type: !53, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "current_clients_number", scope: !2, file: !274, line: 46, type: !83, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "show_statistics", scope: !2, file: !274, line: 91, type: !53, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "tot_send_messages", scope: !2, file: !274, line: 50, type: !123, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "tot_recv_messages", scope: !2, file: !274, line: 52, type: !123, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "tot_send_bytes", scope: !2, file: !274, line: 51, type: !239, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "tot_recv_bytes", scope: !2, file: !274, line: 53, type: !239, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "total_loss", scope: !2, file: !274, line: 81, type: !239, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "total_latency", scope: !2, file: !274, line: 83, type: !239, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "min_latency", scope: !2, file: !274, line: 85, type: !239, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "max_latency", scope: !2, file: !274, line: 86, type: !239, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "total_jitter", scope: !2, file: !274, line: 82, type: !239, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "min_jitter", scope: !2, file: !274, line: 87, type: !239, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "max_jitter", scope: !2, file: !274, line: 88, type: !239, isLocal: true, isDefinition: true)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !212, line: 217, flags: DIFlagFwdDecl)
!498 = !{i32 7, !"Dwarf Version", i32 5}
!499 = !{i32 2, !"Debug Info Version", i32 3}
!500 = !{i32 1, !"wchar_size", i32 4}
!501 = !{i32 8, !"PIC Level", i32 2}
!502 = !{i32 7, !"PIE Level", i32 2}
!503 = !{i32 7, !"uwtable", i32 2}
!504 = !{i32 7, !"frame-pointer", i32 2}
!505 = !{!"clang version 16.0.0"}
!506 = distinct !DISubprogram(name: "send_buffer", scope: !274, file: !274, line: 191, type: !507, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !433)
!507 = !DISubroutineType(types: !508)
!508 = !{!53, !509, !510, !53, !187}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!511 = !DILocalVariable(name: "clnet_info", arg: 1, scope: !506, file: !274, line: 191, type: !509)
!512 = !DILocation(line: 191, column: 35, scope: !506)
!513 = !DILocalVariable(name: "message", arg: 2, scope: !506, file: !274, line: 191, type: !510)
!514 = !DILocation(line: 191, column: 60, scope: !506)
!515 = !DILocalVariable(name: "data_connection", arg: 3, scope: !506, file: !274, line: 191, type: !53)
!516 = !DILocation(line: 191, column: 73, scope: !506)
!517 = !DILocalVariable(name: "atc", arg: 4, scope: !506, file: !274, line: 191, type: !187)
!518 = !DILocation(line: 191, column: 109, scope: !506)
!519 = !DILocalVariable(name: "rc", scope: !506, file: !274, line: 194, type: !53)
!520 = !DILocation(line: 194, column: 6, scope: !506)
!521 = !DILocalVariable(name: "ret", scope: !506, file: !274, line: 195, type: !53)
!522 = !DILocation(line: 195, column: 6, scope: !506)
!523 = !DILocalVariable(name: "buffer", scope: !506, file: !274, line: 197, type: !75)
!524 = !DILocation(line: 197, column: 8, scope: !506)
!525 = !DILocation(line: 197, column: 26, scope: !506)
!526 = !DILocation(line: 197, column: 35, scope: !506)
!527 = !DILocation(line: 197, column: 25, scope: !506)
!528 = !DILocation(line: 199, column: 5, scope: !529)
!529 = distinct !DILexicalBlock(scope: !506, file: !274, line: 199, column: 5)
!530 = !DILocation(line: 199, column: 28, scope: !529)
!531 = !DILocation(line: 199, column: 32, scope: !529)
!532 = !DILocation(line: 199, column: 41, scope: !529)
!533 = !DILocation(line: 199, column: 44, scope: !529)
!534 = !DILocation(line: 199, column: 5, scope: !506)
!535 = !DILocation(line: 200, column: 6, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !274, line: 200, column: 6)
!537 = distinct !DILexicalBlock(scope: !529, file: !274, line: 199, column: 49)
!538 = !DILocation(line: 200, column: 14, scope: !536)
!539 = !DILocation(line: 200, column: 18, scope: !536)
!540 = !DILocation(line: 200, column: 6, scope: !537)
!541 = !DILocalVariable(name: "np", scope: !542, file: !274, line: 201, type: !53)
!542 = distinct !DILexicalBlock(scope: !536, file: !274, line: 200, column: 24)
!543 = !DILocation(line: 201, column: 8, scope: !542)
!544 = !DILocation(line: 201, column: 34, scope: !542)
!545 = !DILocation(line: 201, column: 42, scope: !542)
!546 = !DILocation(line: 201, column: 13, scope: !542)
!547 = !DILocation(line: 202, column: 4, scope: !542)
!548 = !DILocation(line: 202, column: 12, scope: !542)
!549 = !DILocation(line: 202, column: 14, scope: !542)
!550 = !DILocalVariable(name: "pos", scope: !551, file: !274, line: 203, type: !53)
!551 = distinct !DILexicalBlock(scope: !542, file: !274, line: 202, column: 18)
!552 = !DILocation(line: 203, column: 9, scope: !551)
!553 = !DILocation(line: 203, column: 36, scope: !551)
!554 = !DILocation(line: 203, column: 60, scope: !551)
!555 = !DILocation(line: 203, column: 69, scope: !551)
!556 = !DILocation(line: 203, column: 44, scope: !551)
!557 = !DILocation(line: 203, column: 15, scope: !551)
!558 = !DILocalVariable(name: "val", scope: !551, file: !274, line: 204, type: !53)
!559 = !DILocation(line: 204, column: 9, scope: !551)
!560 = !DILocation(line: 204, column: 36, scope: !551)
!561 = !DILocation(line: 204, column: 44, scope: !551)
!562 = !DILocation(line: 204, column: 15, scope: !551)
!563 = !DILocation(line: 205, column: 32, scope: !551)
!564 = !DILocation(line: 205, column: 23, scope: !551)
!565 = !DILocation(line: 205, column: 5, scope: !551)
!566 = !DILocation(line: 205, column: 14, scope: !551)
!567 = !DILocation(line: 205, column: 18, scope: !551)
!568 = !DILocation(line: 205, column: 22, scope: !551)
!569 = distinct !{!569, !547, !570, !571}
!570 = !DILocation(line: 206, column: 4, scope: !542)
!571 = !{!"llvm.loop.mustprogress"}
!572 = !DILocation(line: 207, column: 3, scope: !542)
!573 = !DILocation(line: 208, column: 2, scope: !537)
!574 = !DILocalVariable(name: "ssl", scope: !506, file: !274, line: 210, type: !163)
!575 = !DILocation(line: 210, column: 7, scope: !506)
!576 = !DILocation(line: 210, column: 13, scope: !506)
!577 = !DILocation(line: 210, column: 25, scope: !506)
!578 = !DILocalVariable(name: "fd", scope: !506, file: !274, line: 211, type: !53)
!579 = !DILocation(line: 211, column: 17, scope: !506)
!580 = !DILocation(line: 211, column: 22, scope: !506)
!581 = !DILocation(line: 211, column: 34, scope: !506)
!582 = !DILocation(line: 213, column: 5, scope: !583)
!583 = distinct !DILexicalBlock(scope: !506, file: !274, line: 213, column: 5)
!584 = !DILocation(line: 213, column: 5, scope: !506)
!585 = !DILocation(line: 214, column: 7, scope: !586)
!586 = distinct !DILexicalBlock(scope: !587, file: !274, line: 214, column: 7)
!587 = distinct !DILexicalBlock(scope: !583, file: !274, line: 213, column: 22)
!588 = !DILocation(line: 214, column: 7, scope: !587)
!589 = !DILocation(line: 215, column: 12, scope: !590)
!590 = distinct !DILexicalBlock(scope: !586, file: !274, line: 214, column: 12)
!591 = !DILocation(line: 215, column: 17, scope: !590)
!592 = !DILocation(line: 215, column: 10, scope: !590)
!593 = !DILocation(line: 216, column: 11, scope: !590)
!594 = !DILocation(line: 216, column: 16, scope: !590)
!595 = !DILocation(line: 216, column: 9, scope: !590)
!596 = !DILocation(line: 217, column: 4, scope: !590)
!597 = !DILocation(line: 217, column: 14, scope: !598)
!598 = distinct !DILexicalBlock(scope: !586, file: !274, line: 217, column: 14)
!599 = !DILocation(line: 217, column: 14, scope: !586)
!600 = !DILocation(line: 219, column: 80, scope: !601)
!601 = distinct !DILexicalBlock(scope: !598, file: !274, line: 217, column: 29)
!602 = !DILocation(line: 219, column: 89, scope: !601)
!603 = !DILocation(line: 219, column: 74, scope: !601)
!604 = !DILocation(line: 218, column: 6, scope: !601)
!605 = !DILocation(line: 220, column: 6, scope: !601)
!606 = !DILocation(line: 222, column: 2, scope: !587)
!607 = !DILocation(line: 224, column: 6, scope: !608)
!608 = distinct !DILexicalBlock(scope: !506, file: !274, line: 224, column: 6)
!609 = !DILocation(line: 224, column: 6, scope: !506)
!610 = !DILocalVariable(name: "message_sent", scope: !611, file: !274, line: 226, type: !53)
!611 = distinct !DILexicalBlock(scope: !608, file: !274, line: 224, column: 11)
!612 = !DILocation(line: 226, column: 7, scope: !611)
!613 = !DILocation(line: 227, column: 3, scope: !611)
!614 = !DILocation(line: 227, column: 11, scope: !611)
!615 = !DILocation(line: 227, column: 10, scope: !611)
!616 = !DILocation(line: 229, column: 25, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !274, line: 229, column: 8)
!618 = distinct !DILexicalBlock(scope: !611, file: !274, line: 227, column: 25)
!619 = !DILocation(line: 229, column: 8, scope: !617)
!620 = !DILocation(line: 229, column: 8, scope: !618)
!621 = !DILocation(line: 230, column: 5, scope: !622)
!622 = distinct !DILexicalBlock(scope: !617, file: !274, line: 229, column: 31)
!623 = !DILocalVariable(name: "len", scope: !618, file: !274, line: 233, type: !53)
!624 = !DILocation(line: 233, column: 8, scope: !618)
!625 = !DILocation(line: 234, column: 4, scope: !618)
!626 = !DILocation(line: 235, column: 21, scope: !627)
!627 = distinct !DILexicalBlock(scope: !618, file: !274, line: 234, column: 7)
!628 = !DILocation(line: 235, column: 26, scope: !627)
!629 = !DILocation(line: 235, column: 39, scope: !627)
!630 = !DILocation(line: 235, column: 48, scope: !627)
!631 = !DILocation(line: 235, column: 34, scope: !627)
!632 = !DILocation(line: 235, column: 11, scope: !627)
!633 = !DILocation(line: 235, column: 9, scope: !627)
!634 = !DILocation(line: 236, column: 4, scope: !627)
!635 = !DILocation(line: 236, column: 13, scope: !618)
!636 = !DILocation(line: 236, column: 17, scope: !618)
!637 = !DILocation(line: 236, column: 21, scope: !618)
!638 = !DILocation(line: 236, column: 26, scope: !618)
!639 = !DILocation(line: 236, column: 32, scope: !618)
!640 = !DILocation(line: 236, column: 42, scope: !618)
!641 = !DILocation(line: 236, column: 46, scope: !618)
!642 = !DILocation(line: 236, column: 52, scope: !618)
!643 = !DILocation(line: 0, scope: !618)
!644 = distinct !{!644, !625, !645, !571}
!645 = !DILocation(line: 236, column: 64, scope: !618)
!646 = !DILocation(line: 238, column: 7, scope: !647)
!647 = distinct !DILexicalBlock(scope: !618, file: !274, line: 238, column: 7)
!648 = !DILocation(line: 238, column: 19, scope: !647)
!649 = !DILocation(line: 238, column: 28, scope: !647)
!650 = !DILocation(line: 238, column: 14, scope: !647)
!651 = !DILocation(line: 238, column: 11, scope: !647)
!652 = !DILocation(line: 238, column: 7, scope: !618)
!653 = !DILocation(line: 239, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !274, line: 239, column: 9)
!655 = distinct !DILexicalBlock(scope: !647, file: !274, line: 238, column: 33)
!656 = !DILocation(line: 239, column: 9, scope: !655)
!657 = !DILocation(line: 241, column: 33, scope: !658)
!658 = distinct !DILexicalBlock(scope: !654, file: !274, line: 239, column: 24)
!659 = !DILocation(line: 240, column: 6, scope: !658)
!660 = !DILocation(line: 242, column: 5, scope: !658)
!661 = !DILocation(line: 244, column: 18, scope: !655)
!662 = !DILocation(line: 245, column: 11, scope: !655)
!663 = !DILocation(line: 245, column: 9, scope: !655)
!664 = !DILocation(line: 246, column: 4, scope: !655)
!665 = !DILocation(line: 247, column: 27, scope: !666)
!666 = distinct !DILexicalBlock(scope: !647, file: !274, line: 246, column: 11)
!667 = !DILocation(line: 247, column: 32, scope: !666)
!668 = !DILocation(line: 247, column: 13, scope: !666)
!669 = !DILocation(line: 247, column: 5, scope: !666)
!670 = !DILocation(line: 250, column: 6, scope: !671)
!671 = distinct !DILexicalBlock(scope: !666, file: !274, line: 247, column: 37)
!672 = !DILocation(line: 253, column: 6, scope: !671)
!673 = !DILocation(line: 256, column: 6, scope: !671)
!674 = !DILocation(line: 259, column: 6, scope: !671)
!675 = !DILocation(line: 261, column: 6, scope: !671)
!676 = !DILocation(line: 262, column: 10, scope: !677)
!677 = distinct !DILexicalBlock(scope: !671, file: !274, line: 262, column: 10)
!678 = !DILocation(line: 262, column: 10, scope: !671)
!679 = !DILocation(line: 263, column: 7, scope: !677)
!680 = !DILocation(line: 262, column: 30, scope: !677)
!681 = !DILocation(line: 267, column: 6, scope: !682)
!682 = distinct !DILexicalBlock(scope: !671, file: !274, line: 266, column: 5)
!683 = !DILocalVariable(name: "buf", scope: !682, file: !274, line: 268, type: !684)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8192, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 1024)
!687 = !DILocation(line: 268, column: 11, scope: !682)
!688 = !DILocation(line: 271, column: 24, scope: !682)
!689 = !DILocation(line: 271, column: 40, scope: !682)
!690 = !DILocation(line: 271, column: 7, scope: !682)
!691 = !DILocation(line: 272, column: 21, scope: !682)
!692 = !DILocation(line: 272, column: 26, scope: !682)
!693 = !DILocation(line: 272, column: 7, scope: !682)
!694 = !DILocation(line: 269, column: 6, scope: !682)
!695 = !DILocation(line: 273, column: 5, scope: !682)
!696 = !DILocation(line: 276, column: 6, scope: !671)
!697 = !DILocation(line: 276, column: 18, scope: !671)
!698 = !DILocation(line: 276, column: 25, scope: !671)
!699 = !DILocation(line: 277, column: 6, scope: !671)
!700 = !DILocation(line: 278, column: 6, scope: !671)
!701 = distinct !{!701, !613, !702, !571}
!702 = !DILocation(line: 281, column: 3, scope: !611)
!703 = !DILocation(line: 283, column: 2, scope: !611)
!704 = !DILocation(line: 283, column: 13, scope: !705)
!705 = distinct !DILexicalBlock(scope: !608, file: !274, line: 283, column: 13)
!706 = !DILocation(line: 283, column: 16, scope: !705)
!707 = !DILocation(line: 283, column: 13, scope: !608)
!708 = !DILocalVariable(name: "left", scope: !709, file: !274, line: 285, type: !83)
!709 = distinct !DILexicalBlock(scope: !705, file: !274, line: 283, column: 22)
!710 = !DILocation(line: 285, column: 10, scope: !709)
!711 = !DILocation(line: 285, column: 27, scope: !709)
!712 = !DILocation(line: 285, column: 36, scope: !709)
!713 = !DILocation(line: 287, column: 3, scope: !709)
!714 = !DILocation(line: 287, column: 10, scope: !709)
!715 = !DILocation(line: 287, column: 15, scope: !709)
!716 = !DILocation(line: 288, column: 4, scope: !717)
!717 = distinct !DILexicalBlock(scope: !709, file: !274, line: 287, column: 20)
!718 = !DILocation(line: 289, column: 15, scope: !719)
!719 = distinct !DILexicalBlock(scope: !717, file: !274, line: 288, column: 7)
!720 = !DILocation(line: 289, column: 19, scope: !719)
!721 = !DILocation(line: 289, column: 27, scope: !719)
!722 = !DILocation(line: 289, column: 10, scope: !719)
!723 = !DILocation(line: 289, column: 8, scope: !719)
!724 = !DILocation(line: 290, column: 4, scope: !719)
!725 = !DILocation(line: 290, column: 13, scope: !717)
!726 = !DILocation(line: 290, column: 16, scope: !717)
!727 = !DILocation(line: 290, column: 21, scope: !717)
!728 = !DILocation(line: 290, column: 26, scope: !717)
!729 = !DILocation(line: 290, column: 32, scope: !717)
!730 = !DILocation(line: 290, column: 42, scope: !717)
!731 = !DILocation(line: 290, column: 46, scope: !717)
!732 = !DILocation(line: 290, column: 52, scope: !717)
!733 = !DILocation(line: 290, column: 64, scope: !717)
!734 = !DILocation(line: 290, column: 68, scope: !717)
!735 = !DILocation(line: 290, column: 74, scope: !717)
!736 = !DILocation(line: 0, scope: !717)
!737 = distinct !{!737, !716, !738, !571}
!738 = !DILocation(line: 290, column: 85, scope: !717)
!739 = !DILocation(line: 291, column: 8, scope: !740)
!740 = distinct !DILexicalBlock(scope: !717, file: !274, line: 291, column: 8)
!741 = !DILocation(line: 291, column: 11, scope: !740)
!742 = !DILocation(line: 291, column: 8, scope: !717)
!743 = !DILocation(line: 292, column: 22, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !274, line: 291, column: 16)
!745 = !DILocation(line: 292, column: 13, scope: !744)
!746 = !DILocation(line: 292, column: 10, scope: !744)
!747 = !DILocation(line: 293, column: 15, scope: !744)
!748 = !DILocation(line: 293, column: 12, scope: !744)
!749 = !DILocation(line: 294, column: 4, scope: !744)
!750 = !DILocation(line: 295, column: 21, scope: !751)
!751 = distinct !DILexicalBlock(scope: !740, file: !274, line: 294, column: 11)
!752 = !DILocation(line: 296, column: 5, scope: !751)
!753 = distinct !{!753, !713, !754, !571}
!754 = !DILocation(line: 298, column: 3, scope: !709)
!755 = !DILocation(line: 300, column: 7, scope: !756)
!756 = distinct !DILexicalBlock(scope: !709, file: !274, line: 300, column: 7)
!757 = !DILocation(line: 300, column: 12, scope: !756)
!758 = !DILocation(line: 300, column: 7, scope: !709)
!759 = !DILocation(line: 301, column: 4, scope: !756)
!760 = !DILocation(line: 303, column: 15, scope: !709)
!761 = !DILocation(line: 303, column: 24, scope: !709)
!762 = !DILocation(line: 303, column: 9, scope: !709)
!763 = !DILocation(line: 303, column: 7, scope: !709)
!764 = !DILocation(line: 304, column: 2, scope: !709)
!765 = !DILocation(line: 306, column: 9, scope: !506)
!766 = !DILocation(line: 306, column: 2, scope: !506)
!767 = !DILocation(line: 307, column: 1, scope: !506)
!768 = distinct !DISubprogram(name: "recv_buffer", scope: !274, file: !274, line: 359, type: !769, scopeLine: 359, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !433)
!769 = !DISubroutineType(types: !770)
!770 = !{!53, !509, !510, !53, !53, !187, !510}
!771 = !DILocalVariable(name: "clnet_info", arg: 1, scope: !768, file: !274, line: 359, type: !509)
!772 = !DILocation(line: 359, column: 35, scope: !768)
!773 = !DILocalVariable(name: "message", arg: 2, scope: !768, file: !274, line: 359, type: !510)
!774 = !DILocation(line: 359, column: 60, scope: !768)
!775 = !DILocalVariable(name: "sync", arg: 3, scope: !768, file: !274, line: 359, type: !53)
!776 = !DILocation(line: 359, column: 73, scope: !768)
!777 = !DILocalVariable(name: "data_connection", arg: 4, scope: !768, file: !274, line: 359, type: !53)
!778 = !DILocation(line: 359, column: 83, scope: !768)
!779 = !DILocalVariable(name: "atc", arg: 5, scope: !768, file: !274, line: 359, type: !187)
!780 = !DILocation(line: 359, column: 119, scope: !768)
!781 = !DILocalVariable(name: "request_message", arg: 6, scope: !768, file: !274, line: 359, type: !510)
!782 = !DILocation(line: 359, column: 137, scope: !768)
!783 = !DILocalVariable(name: "rc", scope: !768, file: !274, line: 361, type: !53)
!784 = !DILocation(line: 361, column: 6, scope: !768)
!785 = !DILocalVariable(name: "tid", scope: !768, file: !274, line: 363, type: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !45, line: 52, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 47, size: 96, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !787, file: !45, line: 51, baseType: !790, size: 96)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 96, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 12)
!793 = !DILocation(line: 363, column: 11, scope: !768)
!794 = !DILocalVariable(name: "method", scope: !768, file: !274, line: 364, type: !116)
!795 = !DILocation(line: 364, column: 11, scope: !768)
!796 = !DILocation(line: 366, column: 5, scope: !797)
!797 = distinct !DILexicalBlock(scope: !768, file: !274, line: 366, column: 5)
!798 = !DILocation(line: 366, column: 5, scope: !768)
!799 = !DILocation(line: 367, column: 25, scope: !800)
!800 = distinct !DILexicalBlock(scope: !797, file: !274, line: 366, column: 22)
!801 = !DILocation(line: 367, column: 3, scope: !800)
!802 = !DILocation(line: 368, column: 28, scope: !800)
!803 = !DILocation(line: 368, column: 12, scope: !800)
!804 = !DILocation(line: 368, column: 10, scope: !800)
!805 = !DILocation(line: 369, column: 2, scope: !800)
!806 = !DILocalVariable(name: "fd", scope: !768, file: !274, line: 371, type: !53)
!807 = !DILocation(line: 371, column: 17, scope: !768)
!808 = !DILocation(line: 371, column: 22, scope: !768)
!809 = !DILocation(line: 371, column: 34, scope: !768)
!810 = !DILocation(line: 372, column: 6, scope: !811)
!811 = distinct !DILexicalBlock(scope: !768, file: !274, line: 372, column: 6)
!812 = !DILocation(line: 372, column: 6, scope: !768)
!813 = !DILocation(line: 373, column: 8, scope: !811)
!814 = !DILocation(line: 373, column: 13, scope: !811)
!815 = !DILocation(line: 373, column: 6, scope: !811)
!816 = !DILocation(line: 373, column: 3, scope: !811)
!817 = !DILocalVariable(name: "ssl", scope: !768, file: !274, line: 375, type: !163)
!818 = !DILocation(line: 375, column: 7, scope: !768)
!819 = !DILocation(line: 375, column: 13, scope: !768)
!820 = !DILocation(line: 375, column: 25, scope: !768)
!821 = !DILocation(line: 376, column: 6, scope: !822)
!822 = distinct !DILexicalBlock(scope: !768, file: !274, line: 376, column: 6)
!823 = !DILocation(line: 376, column: 6, scope: !768)
!824 = !DILocation(line: 377, column: 9, scope: !822)
!825 = !DILocation(line: 377, column: 14, scope: !822)
!826 = !DILocation(line: 377, column: 7, scope: !822)
!827 = !DILocation(line: 377, column: 3, scope: !822)
!828 = !DILabel(scope: !768, name: "recv_again", file: !274, line: 379)
!829 = !DILocation(line: 379, column: 2, scope: !768)
!830 = !DILocation(line: 381, column: 6, scope: !831)
!831 = distinct !DILexicalBlock(scope: !768, file: !274, line: 381, column: 5)
!832 = !DILocation(line: 381, column: 14, scope: !831)
!833 = !DILocation(line: 381, column: 17, scope: !831)
!834 = !DILocation(line: 381, column: 22, scope: !831)
!835 = !DILocation(line: 381, column: 25, scope: !831)
!836 = !DILocation(line: 381, column: 41, scope: !831)
!837 = !DILocation(line: 381, column: 45, scope: !831)
!838 = !DILocation(line: 381, column: 47, scope: !831)
!839 = !DILocation(line: 381, column: 5, scope: !768)
!840 = !DILocalVariable(name: "cycle", scope: !841, file: !274, line: 383, type: !7)
!841 = distinct !DILexicalBlock(scope: !831, file: !274, line: 381, column: 53)
!842 = !DILocation(line: 383, column: 16, scope: !841)
!843 = !DILocation(line: 384, column: 3, scope: !841)
!844 = !DILocation(line: 384, column: 9, scope: !841)
!845 = !DILocation(line: 384, column: 15, scope: !841)
!846 = !DILocalVariable(name: "serc", scope: !847, file: !274, line: 385, type: !53)
!847 = distinct !DILexicalBlock(scope: !841, file: !274, line: 384, column: 45)
!848 = !DILocation(line: 385, column: 8, scope: !847)
!849 = !DILocation(line: 385, column: 23, scope: !847)
!850 = !DILocation(line: 385, column: 26, scope: !847)
!851 = !DILocation(line: 385, column: 15, scope: !847)
!852 = !DILocation(line: 386, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !847, file: !274, line: 386, column: 7)
!854 = !DILocation(line: 386, column: 11, scope: !853)
!855 = !DILocation(line: 386, column: 7, scope: !847)
!856 = !DILocation(line: 387, column: 5, scope: !853)
!857 = !DILocation(line: 388, column: 7, scope: !858)
!858 = distinct !DILexicalBlock(scope: !847, file: !274, line: 388, column: 7)
!859 = !DILocation(line: 388, column: 11, scope: !858)
!860 = !DILocation(line: 388, column: 7, scope: !847)
!861 = !DILocation(line: 389, column: 5, scope: !862)
!862 = distinct !DILexicalBlock(scope: !858, file: !274, line: 388, column: 15)
!863 = !DILocation(line: 391, column: 19, scope: !864)
!864 = distinct !DILexicalBlock(scope: !847, file: !274, line: 391, column: 7)
!865 = !DILocation(line: 391, column: 31, scope: !864)
!866 = !DILocation(line: 391, column: 48, scope: !864)
!867 = !DILocation(line: 391, column: 65, scope: !864)
!868 = !DILocation(line: 391, column: 7, scope: !864)
!869 = !DILocation(line: 391, column: 69, scope: !864)
!870 = !DILocation(line: 391, column: 7, scope: !847)
!871 = !DILocation(line: 392, column: 5, scope: !864)
!872 = !DILocation(line: 393, column: 4, scope: !847)
!873 = distinct !{!873, !843, !874, !571}
!874 = !DILocation(line: 394, column: 3, scope: !841)
!875 = !DILocation(line: 395, column: 2, scope: !841)
!876 = !DILocation(line: 397, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !768, file: !274, line: 397, column: 6)
!878 = !DILocation(line: 397, column: 18, scope: !877)
!879 = !DILocation(line: 397, column: 22, scope: !877)
!880 = !DILocation(line: 397, column: 30, scope: !877)
!881 = !DILocation(line: 397, column: 33, scope: !877)
!882 = !DILocation(line: 397, column: 36, scope: !877)
!883 = !DILocation(line: 397, column: 6, scope: !768)
!884 = !DILocation(line: 401, column: 3, scope: !885)
!885 = distinct !DILexicalBlock(scope: !877, file: !274, line: 397, column: 42)
!886 = !DILocation(line: 402, column: 14, scope: !887)
!887 = distinct !DILexicalBlock(scope: !885, file: !274, line: 401, column: 6)
!888 = !DILocation(line: 402, column: 18, scope: !887)
!889 = !DILocation(line: 402, column: 27, scope: !887)
!890 = !DILocation(line: 402, column: 9, scope: !887)
!891 = !DILocation(line: 402, column: 7, scope: !887)
!892 = !DILocation(line: 403, column: 8, scope: !893)
!893 = distinct !DILexicalBlock(scope: !887, file: !274, line: 403, column: 8)
!894 = !DILocation(line: 403, column: 11, scope: !893)
!895 = !DILocation(line: 403, column: 15, scope: !893)
!896 = !DILocation(line: 403, column: 18, scope: !893)
!897 = !DILocation(line: 403, column: 24, scope: !893)
!898 = !DILocation(line: 403, column: 34, scope: !893)
!899 = !DILocation(line: 403, column: 37, scope: !893)
!900 = !DILocation(line: 403, column: 8, scope: !887)
!901 = !DILocation(line: 404, column: 5, scope: !893)
!902 = !DILocation(line: 404, column: 11, scope: !893)
!903 = !DILocation(line: 405, column: 3, scope: !887)
!904 = !DILocation(line: 405, column: 12, scope: !885)
!905 = !DILocation(line: 405, column: 15, scope: !885)
!906 = !DILocation(line: 405, column: 19, scope: !885)
!907 = !DILocation(line: 405, column: 23, scope: !885)
!908 = !DILocation(line: 405, column: 29, scope: !885)
!909 = !DILocation(line: 0, scope: !885)
!910 = distinct !{!910, !884, !911, !571}
!911 = !DILocation(line: 405, column: 38, scope: !885)
!912 = !DILocation(line: 407, column: 7, scope: !913)
!913 = distinct !DILexicalBlock(scope: !885, file: !274, line: 407, column: 7)
!914 = !DILocation(line: 407, column: 10, scope: !913)
!915 = !DILocation(line: 407, column: 7, scope: !885)
!916 = !DILocation(line: 408, column: 4, scope: !917)
!917 = distinct !DILexicalBlock(scope: !913, file: !274, line: 407, column: 15)
!918 = !DILocation(line: 411, column: 18, scope: !885)
!919 = !DILocation(line: 411, column: 3, scope: !885)
!920 = !DILocation(line: 411, column: 12, scope: !885)
!921 = !DILocation(line: 411, column: 16, scope: !885)
!922 = !DILocation(line: 413, column: 2, scope: !885)
!923 = !DILocation(line: 413, column: 13, scope: !924)
!924 = distinct !DILexicalBlock(scope: !877, file: !274, line: 413, column: 13)
!925 = !DILocation(line: 413, column: 24, scope: !924)
!926 = !DILocation(line: 413, column: 28, scope: !924)
!927 = !DILocation(line: 413, column: 36, scope: !924)
!928 = !DILocation(line: 413, column: 39, scope: !924)
!929 = !DILocation(line: 413, column: 43, scope: !924)
!930 = !DILocation(line: 413, column: 48, scope: !924)
!931 = !DILocation(line: 413, column: 60, scope: !924)
!932 = !DILocation(line: 413, column: 47, scope: !924)
!933 = !DILocation(line: 413, column: 13, scope: !877)
!934 = !DILocalVariable(name: "message_received", scope: !935, file: !274, line: 417, type: !53)
!935 = distinct !DILexicalBlock(scope: !924, file: !274, line: 413, column: 69)
!936 = !DILocation(line: 417, column: 7, scope: !935)
!937 = !DILocalVariable(name: "cycle", scope: !935, file: !274, line: 418, type: !53)
!938 = !DILocation(line: 418, column: 7, scope: !935)
!939 = !DILocation(line: 419, column: 3, scope: !935)
!940 = !DILocation(line: 419, column: 11, scope: !935)
!941 = !DILocation(line: 419, column: 28, scope: !935)
!942 = !DILocation(line: 419, column: 36, scope: !935)
!943 = !DILocation(line: 419, column: 39, scope: !935)
!944 = !DILocation(line: 0, scope: !935)
!945 = !DILocation(line: 421, column: 25, scope: !946)
!946 = distinct !DILexicalBlock(scope: !947, file: !274, line: 421, column: 8)
!947 = distinct !DILexicalBlock(scope: !935, file: !274, line: 419, column: 46)
!948 = !DILocation(line: 421, column: 8, scope: !946)
!949 = !DILocation(line: 421, column: 8, scope: !947)
!950 = !DILocation(line: 422, column: 5, scope: !946)
!951 = !DILocation(line: 424, column: 7, scope: !947)
!952 = !DILocation(line: 425, column: 4, scope: !947)
!953 = !DILocation(line: 426, column: 19, scope: !954)
!954 = distinct !DILexicalBlock(scope: !947, file: !274, line: 425, column: 7)
!955 = !DILocation(line: 426, column: 24, scope: !954)
!956 = !DILocation(line: 426, column: 33, scope: !954)
!957 = !DILocation(line: 426, column: 10, scope: !954)
!958 = !DILocation(line: 426, column: 8, scope: !954)
!959 = !DILocation(line: 427, column: 9, scope: !960)
!960 = distinct !DILexicalBlock(scope: !954, file: !274, line: 427, column: 9)
!961 = !DILocation(line: 427, column: 12, scope: !960)
!962 = !DILocation(line: 427, column: 16, scope: !960)
!963 = !DILocation(line: 427, column: 19, scope: !960)
!964 = !DILocation(line: 427, column: 25, scope: !960)
!965 = !DILocation(line: 427, column: 35, scope: !960)
!966 = !DILocation(line: 427, column: 38, scope: !960)
!967 = !DILocation(line: 427, column: 9, scope: !954)
!968 = !DILocation(line: 428, column: 6, scope: !960)
!969 = !DILocation(line: 429, column: 4, scope: !954)
!970 = !DILocation(line: 429, column: 13, scope: !947)
!971 = !DILocation(line: 429, column: 16, scope: !947)
!972 = !DILocation(line: 429, column: 20, scope: !947)
!973 = !DILocation(line: 429, column: 24, scope: !947)
!974 = !DILocation(line: 429, column: 30, scope: !947)
!975 = !DILocation(line: 0, scope: !947)
!976 = distinct !{!976, !952, !977, !571}
!977 = !DILocation(line: 429, column: 39, scope: !947)
!978 = !DILocation(line: 431, column: 8, scope: !979)
!979 = distinct !DILexicalBlock(scope: !947, file: !274, line: 431, column: 8)
!980 = !DILocation(line: 431, column: 11, scope: !979)
!981 = !DILocation(line: 431, column: 8, scope: !947)
!982 = !DILocation(line: 433, column: 9, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !274, line: 433, column: 9)
!984 = distinct !DILexicalBlock(scope: !979, file: !274, line: 431, column: 16)
!985 = !DILocation(line: 433, column: 9, scope: !984)
!986 = !DILocation(line: 435, column: 40, scope: !987)
!987 = distinct !DILexicalBlock(scope: !983, file: !274, line: 433, column: 24)
!988 = !DILocation(line: 434, column: 6, scope: !987)
!989 = !DILocation(line: 436, column: 5, scope: !987)
!990 = !DILocation(line: 437, column: 20, scope: !984)
!991 = !DILocation(line: 437, column: 5, scope: !984)
!992 = !DILocation(line: 437, column: 14, scope: !984)
!993 = !DILocation(line: 437, column: 18, scope: !984)
!994 = !DILocation(line: 438, column: 22, scope: !984)
!995 = !DILocation(line: 440, column: 4, scope: !984)
!996 = !DILocalVariable(name: "sslerr", scope: !997, file: !274, line: 442, type: !53)
!997 = distinct !DILexicalBlock(scope: !979, file: !274, line: 440, column: 11)
!998 = !DILocation(line: 442, column: 9, scope: !997)
!999 = !DILocation(line: 442, column: 32, scope: !997)
!1000 = !DILocation(line: 442, column: 37, scope: !997)
!1001 = !DILocation(line: 442, column: 18, scope: !997)
!1002 = !DILocation(line: 444, column: 13, scope: !997)
!1003 = !DILocation(line: 444, column: 5, scope: !997)
!1004 = !DILocation(line: 447, column: 6, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !997, file: !274, line: 444, column: 21)
!1006 = !DILocation(line: 450, column: 6, scope: !1005)
!1007 = !DILocation(line: 453, column: 6, scope: !1005)
!1008 = !DILocation(line: 456, column: 6, scope: !1005)
!1009 = !DILocation(line: 458, column: 6, scope: !1005)
!1010 = !DILocation(line: 460, column: 10, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1005, file: !274, line: 460, column: 10)
!1012 = !DILocation(line: 460, column: 10, scope: !1005)
!1013 = !DILocation(line: 461, column: 7, scope: !1011)
!1014 = !DILocation(line: 460, column: 30, scope: !1011)
!1015 = !DILocation(line: 464, column: 6, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1005, file: !274, line: 463, column: 25)
!1017 = !DILocalVariable(name: "buf", scope: !1016, file: !274, line: 465, type: !684)
!1018 = !DILocation(line: 465, column: 11, scope: !1016)
!1019 = !DILocation(line: 467, column: 25, scope: !1016)
!1020 = !DILocation(line: 467, column: 42, scope: !1016)
!1021 = !DILocation(line: 467, column: 8, scope: !1016)
!1022 = !DILocation(line: 468, column: 22, scope: !1016)
!1023 = !DILocation(line: 468, column: 27, scope: !1016)
!1024 = !DILocation(line: 468, column: 8, scope: !1016)
!1025 = !DILocation(line: 466, column: 6, scope: !1016)
!1026 = !DILocation(line: 469, column: 5, scope: !1016)
!1027 = !DILocation(line: 472, column: 6, scope: !1005)
!1028 = !DILocation(line: 472, column: 18, scope: !1005)
!1029 = !DILocation(line: 472, column: 25, scope: !1005)
!1030 = !DILocation(line: 475, column: 8, scope: !1005)
!1031 = !DILocation(line: 475, column: 12, scope: !1005)
!1032 = !DILocation(line: 473, column: 6, scope: !1005)
!1033 = !DILocation(line: 476, column: 6, scope: !1005)
!1034 = !DILocation(line: 479, column: 10, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !997, file: !274, line: 479, column: 9)
!1036 = !DILocation(line: 479, column: 9, scope: !997)
!1037 = !DILocation(line: 480, column: 6, scope: !1035)
!1038 = distinct !{!1038, !939, !1039, !571}
!1039 = !DILocation(line: 482, column: 3, scope: !935)
!1040 = !DILocation(line: 484, column: 2, scope: !935)
!1041 = !DILocation(line: 484, column: 13, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !924, file: !274, line: 484, column: 13)
!1043 = !DILocation(line: 484, column: 24, scope: !1042)
!1044 = !DILocation(line: 484, column: 27, scope: !1042)
!1045 = !DILocation(line: 484, column: 35, scope: !1042)
!1046 = !DILocation(line: 484, column: 38, scope: !1042)
!1047 = !DILocation(line: 484, column: 42, scope: !1042)
!1048 = !DILocation(line: 484, column: 47, scope: !1042)
!1049 = !DILocation(line: 484, column: 59, scope: !1042)
!1050 = !DILocation(line: 484, column: 46, scope: !1042)
!1051 = !DILocation(line: 484, column: 13, scope: !924)
!1052 = !DILocalVariable(name: "message_received", scope: !1053, file: !274, line: 488, type: !53)
!1053 = distinct !DILexicalBlock(scope: !1042, file: !274, line: 484, column: 68)
!1054 = !DILocation(line: 488, column: 7, scope: !1053)
!1055 = !DILocalVariable(name: "cycle", scope: !1053, file: !274, line: 489, type: !53)
!1056 = !DILocation(line: 489, column: 7, scope: !1053)
!1057 = !DILocation(line: 490, column: 3, scope: !1053)
!1058 = !DILocation(line: 490, column: 11, scope: !1053)
!1059 = !DILocation(line: 490, column: 28, scope: !1053)
!1060 = !DILocation(line: 490, column: 36, scope: !1053)
!1061 = !DILocation(line: 490, column: 39, scope: !1053)
!1062 = !DILocation(line: 0, scope: !1053)
!1063 = !DILocation(line: 492, column: 25, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !274, line: 492, column: 8)
!1065 = distinct !DILexicalBlock(scope: !1053, file: !274, line: 490, column: 46)
!1066 = !DILocation(line: 492, column: 8, scope: !1064)
!1067 = !DILocation(line: 492, column: 8, scope: !1065)
!1068 = !DILocation(line: 493, column: 5, scope: !1064)
!1069 = !DILocation(line: 494, column: 7, scope: !1065)
!1070 = !DILocation(line: 495, column: 4, scope: !1065)
!1071 = !DILocation(line: 496, column: 19, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1065, file: !274, line: 495, column: 7)
!1073 = !DILocation(line: 496, column: 24, scope: !1072)
!1074 = !DILocation(line: 496, column: 33, scope: !1072)
!1075 = !DILocation(line: 496, column: 10, scope: !1072)
!1076 = !DILocation(line: 496, column: 8, scope: !1072)
!1077 = !DILocation(line: 497, column: 9, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1072, file: !274, line: 497, column: 9)
!1079 = !DILocation(line: 497, column: 12, scope: !1078)
!1080 = !DILocation(line: 497, column: 16, scope: !1078)
!1081 = !DILocation(line: 497, column: 19, scope: !1078)
!1082 = !DILocation(line: 497, column: 25, scope: !1078)
!1083 = !DILocation(line: 497, column: 35, scope: !1078)
!1084 = !DILocation(line: 497, column: 38, scope: !1078)
!1085 = !DILocation(line: 497, column: 9, scope: !1072)
!1086 = !DILocation(line: 498, column: 6, scope: !1078)
!1087 = !DILocation(line: 499, column: 4, scope: !1072)
!1088 = !DILocation(line: 499, column: 13, scope: !1065)
!1089 = !DILocation(line: 499, column: 16, scope: !1065)
!1090 = !DILocation(line: 499, column: 20, scope: !1065)
!1091 = !DILocation(line: 499, column: 24, scope: !1065)
!1092 = !DILocation(line: 499, column: 30, scope: !1065)
!1093 = !DILocation(line: 0, scope: !1065)
!1094 = distinct !{!1094, !1070, !1095, !571}
!1095 = !DILocation(line: 499, column: 39, scope: !1065)
!1096 = !DILocation(line: 501, column: 8, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1065, file: !274, line: 501, column: 8)
!1098 = !DILocation(line: 501, column: 11, scope: !1097)
!1099 = !DILocation(line: 501, column: 8, scope: !1065)
!1100 = !DILocation(line: 503, column: 9, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !274, line: 503, column: 9)
!1102 = distinct !DILexicalBlock(scope: !1097, file: !274, line: 501, column: 16)
!1103 = !DILocation(line: 503, column: 9, scope: !1102)
!1104 = !DILocation(line: 505, column: 40, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1101, file: !274, line: 503, column: 24)
!1106 = !DILocation(line: 504, column: 6, scope: !1105)
!1107 = !DILocation(line: 506, column: 5, scope: !1105)
!1108 = !DILocation(line: 507, column: 20, scope: !1102)
!1109 = !DILocation(line: 507, column: 5, scope: !1102)
!1110 = !DILocation(line: 507, column: 14, scope: !1102)
!1111 = !DILocation(line: 507, column: 18, scope: !1102)
!1112 = !DILocation(line: 508, column: 22, scope: !1102)
!1113 = !DILocation(line: 510, column: 4, scope: !1102)
!1114 = !DILocalVariable(name: "sslerr", scope: !1115, file: !274, line: 512, type: !53)
!1115 = distinct !DILexicalBlock(scope: !1097, file: !274, line: 510, column: 11)
!1116 = !DILocation(line: 512, column: 8, scope: !1115)
!1117 = !DILocation(line: 512, column: 31, scope: !1115)
!1118 = !DILocation(line: 512, column: 36, scope: !1115)
!1119 = !DILocation(line: 512, column: 17, scope: !1115)
!1120 = !DILocation(line: 514, column: 13, scope: !1115)
!1121 = !DILocation(line: 514, column: 5, scope: !1115)
!1122 = !DILocation(line: 517, column: 6, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1115, file: !274, line: 514, column: 21)
!1124 = !DILocation(line: 520, column: 6, scope: !1123)
!1125 = !DILocation(line: 523, column: 6, scope: !1123)
!1126 = !DILocation(line: 526, column: 6, scope: !1123)
!1127 = !DILocation(line: 528, column: 6, scope: !1123)
!1128 = !DILocation(line: 530, column: 10, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1123, file: !274, line: 530, column: 10)
!1130 = !DILocation(line: 530, column: 10, scope: !1123)
!1131 = !DILocation(line: 531, column: 7, scope: !1129)
!1132 = !DILocation(line: 530, column: 30, scope: !1129)
!1133 = !DILocation(line: 534, column: 6, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1123, file: !274, line: 533, column: 25)
!1135 = !DILocalVariable(name: "buf", scope: !1134, file: !274, line: 535, type: !684)
!1136 = !DILocation(line: 535, column: 11, scope: !1134)
!1137 = !DILocation(line: 537, column: 25, scope: !1134)
!1138 = !DILocation(line: 537, column: 42, scope: !1134)
!1139 = !DILocation(line: 537, column: 8, scope: !1134)
!1140 = !DILocation(line: 538, column: 22, scope: !1134)
!1141 = !DILocation(line: 538, column: 27, scope: !1134)
!1142 = !DILocation(line: 538, column: 8, scope: !1134)
!1143 = !DILocation(line: 536, column: 6, scope: !1134)
!1144 = !DILocation(line: 539, column: 5, scope: !1134)
!1145 = !DILocation(line: 542, column: 6, scope: !1123)
!1146 = !DILocation(line: 542, column: 18, scope: !1123)
!1147 = !DILocation(line: 542, column: 25, scope: !1123)
!1148 = !DILocation(line: 545, column: 8, scope: !1123)
!1149 = !DILocation(line: 545, column: 12, scope: !1123)
!1150 = !DILocation(line: 543, column: 6, scope: !1123)
!1151 = !DILocation(line: 546, column: 6, scope: !1123)
!1152 = !DILocation(line: 549, column: 10, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1115, file: !274, line: 549, column: 9)
!1154 = !DILocation(line: 549, column: 9, scope: !1115)
!1155 = !DILocation(line: 550, column: 6, scope: !1153)
!1156 = distinct !{!1156, !1057, !1157, !571}
!1157 = !DILocation(line: 552, column: 3, scope: !1053)
!1158 = !DILocation(line: 554, column: 2, scope: !1053)
!1159 = !DILocation(line: 554, column: 14, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1042, file: !274, line: 554, column: 13)
!1161 = !DILocation(line: 554, column: 25, scope: !1160)
!1162 = !DILocation(line: 554, column: 28, scope: !1160)
!1163 = !DILocation(line: 554, column: 36, scope: !1160)
!1164 = !DILocation(line: 554, column: 39, scope: !1160)
!1165 = !DILocation(line: 554, column: 42, scope: !1160)
!1166 = !DILocation(line: 554, column: 13, scope: !1042)
!1167 = !DILocation(line: 558, column: 3, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1160, file: !274, line: 554, column: 48)
!1169 = !DILocation(line: 559, column: 14, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1168, file: !274, line: 558, column: 6)
!1171 = !DILocation(line: 559, column: 18, scope: !1170)
!1172 = !DILocation(line: 559, column: 27, scope: !1170)
!1173 = !DILocation(line: 559, column: 9, scope: !1170)
!1174 = !DILocation(line: 559, column: 7, scope: !1170)
!1175 = !DILocation(line: 560, column: 9, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1170, file: !274, line: 560, column: 8)
!1177 = !DILocation(line: 560, column: 12, scope: !1176)
!1178 = !DILocation(line: 560, column: 17, scope: !1176)
!1179 = !DILocation(line: 560, column: 21, scope: !1176)
!1180 = !DILocation(line: 560, column: 27, scope: !1176)
!1181 = !DILocation(line: 560, column: 38, scope: !1176)
!1182 = !DILocation(line: 560, column: 41, scope: !1176)
!1183 = !DILocation(line: 560, column: 8, scope: !1170)
!1184 = !DILocation(line: 561, column: 5, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1176, file: !274, line: 560, column: 47)
!1186 = !DILocation(line: 561, column: 11, scope: !1185)
!1187 = !DILocation(line: 562, column: 4, scope: !1185)
!1188 = !DILocation(line: 563, column: 3, scope: !1170)
!1189 = !DILocation(line: 563, column: 12, scope: !1168)
!1190 = !DILocation(line: 563, column: 15, scope: !1168)
!1191 = !DILocation(line: 563, column: 19, scope: !1168)
!1192 = !DILocation(line: 563, column: 23, scope: !1168)
!1193 = !DILocation(line: 563, column: 29, scope: !1168)
!1194 = !DILocation(line: 0, scope: !1168)
!1195 = distinct !{!1195, !1167, !1196, !571}
!1196 = !DILocation(line: 563, column: 38, scope: !1168)
!1197 = !DILocation(line: 565, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1168, file: !274, line: 565, column: 7)
!1199 = !DILocation(line: 565, column: 10, scope: !1198)
!1200 = !DILocation(line: 565, column: 7, scope: !1168)
!1201 = !DILocalVariable(name: "mlen", scope: !1202, file: !274, line: 566, type: !53)
!1202 = distinct !DILexicalBlock(scope: !1198, file: !274, line: 565, column: 15)
!1203 = !DILocation(line: 566, column: 8, scope: !1202)
!1204 = !DILocation(line: 566, column: 15, scope: !1202)
!1205 = !DILocalVariable(name: "app_msg_len", scope: !1202, file: !274, line: 567, type: !83)
!1206 = !DILocation(line: 567, column: 11, scope: !1202)
!1207 = !DILocation(line: 567, column: 34, scope: !1202)
!1208 = !DILocation(line: 567, column: 25, scope: !1202)
!1209 = !DILocation(line: 568, column: 9, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1202, file: !274, line: 568, column: 8)
!1211 = !DILocation(line: 568, column: 8, scope: !1202)
!1212 = !DILocation(line: 569, column: 37, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1210, file: !274, line: 568, column: 14)
!1214 = !DILocation(line: 569, column: 46, scope: !1213)
!1215 = !DILocation(line: 569, column: 51, scope: !1213)
!1216 = !DILocation(line: 569, column: 12, scope: !1213)
!1217 = !DILocation(line: 569, column: 10, scope: !1213)
!1218 = !DILocation(line: 571, column: 4, scope: !1213)
!1219 = !DILocation(line: 572, column: 10, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !274, line: 572, column: 9)
!1221 = distinct !DILexicalBlock(scope: !1210, file: !274, line: 571, column: 11)
!1222 = !DILocation(line: 572, column: 9, scope: !1221)
!1223 = !DILocation(line: 573, column: 13, scope: !1220)
!1224 = !DILocation(line: 573, column: 11, scope: !1220)
!1225 = !DILocation(line: 573, column: 6, scope: !1220)
!1226 = !DILocation(line: 575, column: 9, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1221, file: !274, line: 575, column: 9)
!1228 = !DILocation(line: 575, column: 16, scope: !1227)
!1229 = !DILocation(line: 575, column: 14, scope: !1227)
!1230 = !DILocation(line: 575, column: 9, scope: !1221)
!1231 = !DILocation(line: 576, column: 13, scope: !1227)
!1232 = !DILocation(line: 576, column: 11, scope: !1227)
!1233 = !DILocation(line: 576, column: 6, scope: !1227)
!1234 = !DILocation(line: 578, column: 28, scope: !1221)
!1235 = !DILocation(line: 578, column: 19, scope: !1221)
!1236 = !DILocation(line: 578, column: 17, scope: !1221)
!1237 = !DILocation(line: 581, column: 8, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1202, file: !274, line: 581, column: 8)
!1239 = !DILocation(line: 581, column: 13, scope: !1238)
!1240 = !DILocation(line: 581, column: 8, scope: !1202)
!1241 = !DILocalVariable(name: "rcr", scope: !1242, file: !274, line: 583, type: !53)
!1242 = distinct !DILexicalBlock(scope: !1238, file: !274, line: 581, column: 18)
!1243 = !DILocation(line: 583, column: 9, scope: !1242)
!1244 = !DILocalVariable(name: "rsf", scope: !1242, file: !274, line: 584, type: !53)
!1245 = !DILocation(line: 584, column: 9, scope: !1242)
!1246 = !DILocalVariable(name: "cycle", scope: !1242, file: !274, line: 585, type: !53)
!1247 = !DILocation(line: 585, column: 9, scope: !1242)
!1248 = !DILocation(line: 586, column: 5, scope: !1242)
!1249 = !DILocation(line: 586, column: 12, scope: !1242)
!1250 = !DILocation(line: 586, column: 18, scope: !1242)
!1251 = !DILocation(line: 586, column: 16, scope: !1242)
!1252 = !DILocation(line: 586, column: 23, scope: !1242)
!1253 = !DILocation(line: 586, column: 31, scope: !1242)
!1254 = !DILocation(line: 586, column: 34, scope: !1242)
!1255 = !DILocation(line: 0, scope: !1242)
!1256 = !DILocation(line: 587, column: 6, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1242, file: !274, line: 586, column: 41)
!1258 = !DILocation(line: 588, column: 18, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1257, file: !274, line: 587, column: 9)
!1260 = !DILocation(line: 588, column: 22, scope: !1259)
!1261 = !DILocation(line: 588, column: 31, scope: !1259)
!1262 = !DILocation(line: 588, column: 37, scope: !1259)
!1263 = !DILocation(line: 588, column: 35, scope: !1259)
!1264 = !DILocation(line: 589, column: 18, scope: !1259)
!1265 = !DILocation(line: 589, column: 9, scope: !1259)
!1266 = !DILocation(line: 589, column: 34, scope: !1259)
!1267 = !DILocation(line: 589, column: 25, scope: !1259)
!1268 = !DILocation(line: 589, column: 23, scope: !1259)
!1269 = !DILocation(line: 588, column: 13, scope: !1259)
!1270 = !DILocation(line: 588, column: 11, scope: !1259)
!1271 = !DILocation(line: 590, column: 11, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1259, file: !274, line: 590, column: 11)
!1273 = !DILocation(line: 590, column: 15, scope: !1272)
!1274 = !DILocation(line: 590, column: 19, scope: !1272)
!1275 = !DILocation(line: 590, column: 22, scope: !1272)
!1276 = !DILocation(line: 590, column: 28, scope: !1272)
!1277 = !DILocation(line: 590, column: 38, scope: !1272)
!1278 = !DILocation(line: 590, column: 41, scope: !1272)
!1279 = !DILocation(line: 590, column: 11, scope: !1259)
!1280 = !DILocation(line: 591, column: 8, scope: !1272)
!1281 = !DILocation(line: 591, column: 14, scope: !1272)
!1282 = !DILocation(line: 592, column: 6, scope: !1259)
!1283 = !DILocation(line: 592, column: 15, scope: !1257)
!1284 = !DILocation(line: 592, column: 19, scope: !1257)
!1285 = !DILocation(line: 592, column: 23, scope: !1257)
!1286 = !DILocation(line: 592, column: 27, scope: !1257)
!1287 = !DILocation(line: 592, column: 33, scope: !1257)
!1288 = !DILocation(line: 0, scope: !1257)
!1289 = distinct !{!1289, !1256, !1290, !571}
!1290 = !DILocation(line: 592, column: 42, scope: !1257)
!1291 = !DILocation(line: 594, column: 10, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1257, file: !274, line: 594, column: 10)
!1293 = !DILocation(line: 594, column: 14, scope: !1292)
!1294 = !DILocation(line: 594, column: 10, scope: !1257)
!1295 = !DILocation(line: 595, column: 14, scope: !1292)
!1296 = !DILocation(line: 595, column: 11, scope: !1292)
!1297 = !DILocation(line: 595, column: 7, scope: !1292)
!1298 = distinct !{!1298, !1248, !1299, !571}
!1299 = !DILocation(line: 597, column: 5, scope: !1242)
!1300 = !DILocation(line: 599, column: 9, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1242, file: !274, line: 599, column: 9)
!1302 = !DILocation(line: 599, column: 13, scope: !1301)
!1303 = !DILocation(line: 599, column: 9, scope: !1242)
!1304 = !DILocation(line: 600, column: 6, scope: !1301)
!1305 = !DILocation(line: 602, column: 9, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1242, file: !274, line: 602, column: 9)
!1307 = !DILocation(line: 602, column: 21, scope: !1306)
!1308 = !DILocation(line: 602, column: 15, scope: !1306)
!1309 = !DILocation(line: 602, column: 13, scope: !1306)
!1310 = !DILocation(line: 602, column: 9, scope: !1242)
!1311 = !DILocation(line: 603, column: 20, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !274, line: 603, column: 10)
!1313 = distinct !DILexicalBlock(scope: !1306, file: !274, line: 602, column: 34)
!1314 = !DILocation(line: 603, column: 43, scope: !1312)
!1315 = !DILocation(line: 603, column: 34, scope: !1312)
!1316 = !DILocation(line: 603, column: 32, scope: !1312)
!1317 = !DILocation(line: 603, column: 61, scope: !1312)
!1318 = !DILocation(line: 603, column: 51, scope: !1312)
!1319 = !DILocation(line: 603, column: 48, scope: !1312)
!1320 = !DILocation(line: 604, column: 11, scope: !1312)
!1321 = !DILocation(line: 604, column: 8, scope: !1312)
!1322 = !DILocation(line: 603, column: 10, scope: !1313)
!1323 = !DILocation(line: 605, column: 7, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1312, file: !274, line: 604, column: 24)
!1325 = !DILocation(line: 607, column: 5, scope: !1313)
!1326 = !DILocation(line: 609, column: 20, scope: !1242)
!1327 = !DILocation(line: 609, column: 5, scope: !1242)
!1328 = !DILocation(line: 609, column: 14, scope: !1242)
!1329 = !DILocation(line: 609, column: 18, scope: !1242)
!1330 = !DILocation(line: 611, column: 10, scope: !1242)
!1331 = !DILocation(line: 611, column: 8, scope: !1242)
!1332 = !DILocation(line: 613, column: 4, scope: !1242)
!1333 = !DILocation(line: 614, column: 8, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1238, file: !274, line: 613, column: 11)
!1335 = !DILocation(line: 616, column: 3, scope: !1202)
!1336 = !DILocation(line: 617, column: 2, scope: !1168)
!1337 = !DILocation(line: 619, column: 5, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !768, file: !274, line: 619, column: 5)
!1339 = !DILocation(line: 619, column: 7, scope: !1338)
!1340 = !DILocation(line: 619, column: 5, scope: !768)
!1341 = !DILocation(line: 620, column: 6, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1343, file: !274, line: 620, column: 6)
!1343 = distinct !DILexicalBlock(scope: !1338, file: !274, line: 619, column: 11)
!1344 = !DILocation(line: 620, column: 6, scope: !1343)
!1345 = !DILocalVariable(name: "recv_tid", scope: !1346, file: !274, line: 622, type: !786)
!1346 = distinct !DILexicalBlock(scope: !1342, file: !274, line: 620, column: 23)
!1347 = !DILocation(line: 622, column: 13, scope: !1346)
!1348 = !DILocalVariable(name: "recv_method", scope: !1346, file: !274, line: 623, type: !116)
!1349 = !DILocation(line: 623, column: 13, scope: !1346)
!1350 = !DILocation(line: 625, column: 26, scope: !1346)
!1351 = !DILocation(line: 625, column: 4, scope: !1346)
!1352 = !DILocation(line: 626, column: 34, scope: !1346)
!1353 = !DILocation(line: 626, column: 18, scope: !1346)
!1354 = !DILocation(line: 626, column: 16, scope: !1346)
!1355 = !DILocation(line: 628, column: 7, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1346, file: !274, line: 628, column: 7)
!1357 = !DILocation(line: 628, column: 17, scope: !1356)
!1358 = !DILocation(line: 628, column: 14, scope: !1356)
!1359 = !DILocation(line: 628, column: 7, scope: !1346)
!1360 = !DILocation(line: 629, column: 127, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1356, file: !274, line: 628, column: 30)
!1362 = !DILocation(line: 629, column: 113, scope: !1361)
!1363 = !DILocation(line: 629, column: 153, scope: !1361)
!1364 = !DILocation(line: 629, column: 139, scope: !1361)
!1365 = !DILocation(line: 629, column: 5, scope: !1361)
!1366 = !DILocation(line: 630, column: 5, scope: !1361)
!1367 = !DILocation(line: 633, column: 18, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1346, file: !274, line: 633, column: 7)
!1369 = !DILocation(line: 633, column: 14, scope: !1368)
!1370 = !DILocation(line: 633, column: 34, scope: !1368)
!1371 = !DILocation(line: 633, column: 25, scope: !1368)
!1372 = !DILocation(line: 633, column: 7, scope: !1368)
!1373 = !DILocation(line: 633, column: 7, scope: !1346)
!1374 = !DILocation(line: 634, column: 5, scope: !1375)
!1375 = distinct !DILexicalBlock(scope: !1368, file: !274, line: 633, column: 57)
!1376 = !DILocation(line: 635, column: 5, scope: !1375)
!1377 = !DILocation(line: 637, column: 3, scope: !1346)
!1378 = !DILocation(line: 638, column: 2, scope: !1343)
!1379 = !DILocation(line: 640, column: 9, scope: !768)
!1380 = !DILocation(line: 640, column: 2, scope: !768)
!1381 = !DILocation(line: 641, column: 1, scope: !768)
!1382 = distinct !DISubprogram(name: "wait_fd", scope: !274, file: !274, line: 309, type: !1383, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !433)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!53, !53, !7}
!1385 = !DILocalVariable(name: "fd", arg: 1, scope: !1382, file: !274, line: 309, type: !53)
!1386 = !DILocation(line: 309, column: 24, scope: !1382)
!1387 = !DILocalVariable(name: "cycle", arg: 2, scope: !1382, file: !274, line: 309, type: !7)
!1388 = !DILocation(line: 309, column: 41, scope: !1382)
!1389 = !DILocation(line: 311, column: 5, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1382, file: !274, line: 311, column: 5)
!1391 = !DILocation(line: 311, column: 7, scope: !1390)
!1392 = !DILocation(line: 311, column: 5, scope: !1382)
!1393 = !DILocation(line: 312, column: 3, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1390, file: !274, line: 311, column: 26)
!1395 = !DILocalVariable(name: "fds", scope: !1396, file: !274, line: 314, type: !1397)
!1396 = distinct !DILexicalBlock(scope: !1390, file: !274, line: 313, column: 9)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !254, line: 70, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 59, size: 1024, elements: !1399)
!1399 = !{!1400}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !1398, file: !254, line: 64, baseType: !1401, size: 1024)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 1024, elements: !143)
!1402 = !DILocation(line: 314, column: 10, scope: !1396)
!1403 = !DILocation(line: 315, column: 3, scope: !1396)
!1404 = !DILocalVariable(name: "__i", scope: !1405, file: !274, line: 315, type: !7)
!1405 = distinct !DILexicalBlock(scope: !1396, file: !274, line: 315, column: 3)
!1406 = !DILocation(line: 315, column: 3, scope: !1405)
!1407 = !DILocalVariable(name: "__arr", scope: !1405, file: !274, line: 315, type: !1408)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1409 = !DILocation(line: 315, column: 3, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1405, file: !274, line: 315, column: 3)
!1411 = !DILocation(line: 315, column: 3, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1410, file: !274, line: 315, column: 3)
!1413 = distinct !{!1413, !1409, !1409, !571}
!1414 = !DILocation(line: 316, column: 3, scope: !1396)
!1415 = !DILocation(line: 318, column: 6, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1396, file: !274, line: 318, column: 6)
!1417 = !DILocation(line: 318, column: 10, scope: !1416)
!1418 = !DILocation(line: 318, column: 13, scope: !1416)
!1419 = !DILocation(line: 318, column: 18, scope: !1416)
!1420 = !DILocation(line: 318, column: 6, scope: !1396)
!1421 = !DILocation(line: 319, column: 4, scope: !1416)
!1422 = !DILocalVariable(name: "start_time", scope: !1396, file: !274, line: 321, type: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1424, line: 8, size: 128, elements: !1425)
!1424 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!1425 = !{!1426, !1428}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1423, file: !1424, line: 14, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !81, line: 160, baseType: !255)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1423, file: !1424, line: 15, baseType: !1429, size: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !81, line: 162, baseType: !255)
!1430 = !DILocation(line: 321, column: 18, scope: !1396)
!1431 = !DILocalVariable(name: "ctime", scope: !1396, file: !274, line: 322, type: !1423)
!1432 = !DILocation(line: 322, column: 18, scope: !1396)
!1433 = !DILocation(line: 323, column: 3, scope: !1396)
!1434 = !DILocation(line: 325, column: 29, scope: !1396)
!1435 = !DILocation(line: 325, column: 9, scope: !1396)
!1436 = !DILocation(line: 325, column: 16, scope: !1396)
!1437 = !DILocation(line: 326, column: 30, scope: !1396)
!1438 = !DILocation(line: 326, column: 9, scope: !1396)
!1439 = !DILocation(line: 326, column: 17, scope: !1396)
!1440 = !DILocalVariable(name: "rc", scope: !1396, file: !274, line: 328, type: !53)
!1441 = !DILocation(line: 328, column: 7, scope: !1396)
!1442 = !DILocation(line: 330, column: 3, scope: !1396)
!1443 = !DILocalVariable(name: "timeout", scope: !1444, file: !274, line: 331, type: !1423)
!1444 = distinct !DILexicalBlock(scope: !1396, file: !274, line: 330, column: 6)
!1445 = !DILocation(line: 331, column: 19, scope: !1444)
!1446 = !DILocation(line: 332, column: 7, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1444, file: !274, line: 332, column: 7)
!1448 = !DILocation(line: 332, column: 13, scope: !1447)
