; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm ".text"
module asm "\09.p2align 4"
module asm "\09.globl coro_swapcontext"
module asm "\09coro_swapcontext:"
module asm "\09mov    %rbx,0(%rdi)"
module asm "\09mov    %rbp,8(%rdi)"
module asm "\09mov    %r12,16(%rdi)"
module asm "\09mov    %r13,24(%rdi)"
module asm "\09mov    %r14,32(%rdi)"
module asm "\09mov    %r15,40(%rdi)"
module asm "\09mov    %rdi,48(%rdi)"
module asm "\09mov    %rsi,56(%rdi)"
module asm "\09mov    (%rsp),%rcx"
module asm "\09mov    %rcx,64(%rdi)"
module asm "\09lea    0x8(%rsp),%rcx"
module asm "\09mov    %rcx,72(%rdi)"
module asm "\09mov    72(%rsi),%rsp"
module asm "\09mov    0(%rsi),%rbx"
module asm "\09mov    8(%rsi),%rbp"
module asm "\09mov    16(%rsi),%r12"
module asm "\09mov    24(%rsi),%r13"
module asm "\09mov    32(%rsi),%r14"
module asm "\09mov    40(%rsi),%r15"
module asm "\09mov    48(%rsi),%rdi"
module asm "\09mov    64(%rsi),%rcx"
module asm "\09mov    56(%rsi),%rsi"
module asm "\09jmp    *%rcx"
module asm "\09"

%struct.list_head = type { %struct.list_node }
%struct.list_node = type { ptr, ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.list_node }
%struct.timespec = type { i64, i64 }

!240 = distinct !DIGlobalVariable(scope: null, file: !225, line: 257, type: !115, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !225, line: 267, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 240, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 30)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !225, line: 276, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 200, elements: !214)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !225, line: 291, type: !166, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !225, line: 291, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 464, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 58)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "realm_password_cache", scope: !258, file: !327, line: 35, type: !529, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C11, file: !259, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !306, globals: !335, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "/home/raj/lwan/common/lwan-http-authorize.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "a818272e04294763324aa9ca395ad814")
!260 = !{!261, !274, !282, !300}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 145, baseType: !37, size: 32, elements: !263)
!262 = !DIFile(filename: "common/lwan.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "56f65bbbfce1c5452d6905964ca2b84f")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!264 = !DIEnumerator(name: "REQUEST_ALL_FLAGS", value: -1)
!265 = !DIEnumerator(name: "REQUEST_METHOD_GET", value: 1)
!266 = !DIEnumerator(name: "REQUEST_METHOD_HEAD", value: 2)
!267 = !DIEnumerator(name: "REQUEST_METHOD_POST", value: 4)
!268 = !DIEnumerator(name: "REQUEST_ACCEPT_DEFLATE", value: 8)
!269 = !DIEnumerator(name: "REQUEST_ACCEPT_GZIP", value: 16)
!270 = !DIEnumerator(name: "REQUEST_IS_HTTP_1_0", value: 32)
!271 = !DIEnumerator(name: "RESPONSE_SENT_HEADERS", value: 64)
!272 = !DIEnumerator(name: "RESPONSE_CHUNKED_ENCODING", value: 128)
!273 = !DIEnumerator(name: "RESPONSE_NO_CONTENT_LENGTH", value: 256)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 158, baseType: !37, size: 32, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DIEnumerator(name: "CONN_MASK", value: -1)
!277 = !DIEnumerator(name: "CONN_KEEP_ALIVE", value: 1)
!278 = !DIEnumerator(name: "CONN_IS_ALIVE", value: 2)
!279 = !DIEnumerator(name: "CONN_SHOULD_RESUME_CORO", value: 4)
!280 = !DIEnumerator(name: "CONN_WRITE_EVENTS", value: 8)
!281 = !DIEnumerator(name: "CONN_MUST_READ", value: 16)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 114, baseType: !28, size: 32, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!284 = !DIEnumerator(name: "HTTP_OK", value: 200)
!285 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!286 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!287 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!288 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!289 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!290 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!291 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!292 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!293 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!294 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!295 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!296 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!297 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!298 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!299 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 35, baseType: !28, size: 32, elements: !302)
!301 = !DIFile(filename: "common/lwan-config.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "7586af514a363878312816f8ee308270")
!302 = !{!303, !304, !305}
!303 = !DIEnumerator(name: "CONFIG_LINE_TYPE_LINE", value: 0)
!304 = !DIEnumerator(name: "CONFIG_LINE_TYPE_SECTION", value: 1)
!305 = !DIEnumerator(name: "CONFIG_LINE_TYPE_SECTION_END", value: 2)
!306 = !{!5, !307, !325, !334}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_entry_t", file: !309, line: 27, size: 320, elements: !310)
!309 = !DIFile(filename: "common/lwan-cache.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "f48e19cadb0735f737f22aa65af51f83")
!310 = !{!311, !318, !319, !320, !321}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !308, file: !309, line: 28, baseType: !312, size: 128)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !313, line: 191, size: 128, elements: !314)
!313 = !DIFile(filename: "common/list.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "c0dffb77b1bbbbb179ef8d69b9e1dd8c")
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !313, line: 193, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !313, line: 193, baseType: !316, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !308, file: !309, line: 29, baseType: !61, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !308, file: !309, line: 30, baseType: !28, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !308, file: !309, line: 31, baseType: !28, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !308, file: !309, line: 32, baseType: !322, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !323, line: 10, baseType: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !69, line: 160, baseType: !40)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "realm_password_file_t", file: !327, line: 30, size: 384, elements: !328)
!327 = !DIFile(filename: "common/lwan-http-authorize.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "a818272e04294763324aa9ca395ad814")
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !326, file: !327, line: 31, baseType: !308, size: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !326, file: !327, line: 32, baseType: !331, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !333, line: 6, flags: DIFlagFwdDecl)
!333 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!335 = !{!336, !501, !503, !508, !510, !515, !517, !519, !524, !256}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "authenticate_tmpl", scope: !338, file: !327, line: 189, type: !155, isLocal: true, isDefinition: true)
!338 = distinct !DISubprogram(name: "lwan_http_authorize", scope: !327, file: !327, line: 184, type: !339, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !258, retainedNodes: !74)
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !342, !500, !480, !480}
!341 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !262, line: 106, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !262, line: 206, size: 1280, elements: !345)
!345 = !{!346, !348, !349, !355, !356, !441, !452, !453, !465}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !262, line: 207, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !262, line: 156, baseType: !261)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !344, file: !262, line: 208, baseType: !37, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !344, file: !262, line: 209, baseType: !350, size: 128, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !262, line: 110, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !262, line: 191, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !351, file: !262, line: 192, baseType: !61, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !351, file: !262, line: 193, baseType: !6, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !344, file: !262, line: 210, baseType: !350, size: 128, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !344, file: !262, line: 211, baseType: !357, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !262, line: 112, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !262, line: 196, size: 256, elements: !360)
!360 = !{!361, !363, !364, !369, !439, !440}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !359, file: !262, line: 199, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !262, line: 165, baseType: !274)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !359, file: !262, line: 200, baseType: !28, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !359, file: !262, line: 201, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !367, line: 34, baseType: !368)
!367 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !367, line: 34, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !359, file: !262, line: 202, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !262, line: 108, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !262, line: 253, size: 832, elements: !373)
!373 = !{!374, !426, !433, !434, !436}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !372, file: !262, line: 254, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !262, line: 103, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !262, line: 275, size: 640, elements: !378)
!378 = !{!379, !406, !407, !414, !415, !425}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !377, file: !262, line: 276, baseType: !380, size: 128)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !381, line: 25, baseType: !382)
!381 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !381, line: 41, size: 128, elements: !383)
!383 = !{!384, !402}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !382, file: !381, line: 42, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !381, line: 26, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !381, line: 29, size: 640, elements: !388)
!388 = !{!389, !393, !401}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !381, line: 30, baseType: !390, size: 512)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 512, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !387, file: !381, line: 31, baseType: !394, size: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !381, line: 27, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !381, line: 35, size: 192, elements: !397)
!397 = !{!398, !399, !400}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !396, file: !381, line: 36, baseType: !61, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !381, line: 37, baseType: !5, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !396, file: !381, line: 38, baseType: !394, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !387, file: !381, line: 32, baseType: !37, size: 32, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !382, file: !381, line: 43, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !5}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !377, file: !262, line: 277, baseType: !357, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !377, file: !262, line: 283, baseType: !408, size: 128, offset: 192)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !262, line: 279, size: 128, elements: !409)
!409 = !{!410, !411, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !408, file: !262, line: 280, baseType: !370, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !408, file: !262, line: 281, baseType: !28, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !408, file: !262, line: 282, baseType: !413, size: 16, offset: 96)
!413 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !377, file: !262, line: 285, baseType: !331, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !377, file: !262, line: 286, baseType: !416, size: 192, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !262, line: 111, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !262, line: 266, size: 192, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !417, file: !262, line: 267, baseType: !61, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !417, file: !262, line: 268, baseType: !413, size: 16, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !417, file: !262, line: 269, baseType: !341, size: 8, offset: 80)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !417, file: !262, line: 270, baseType: !341, size: 8, offset: 88)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !417, file: !262, line: 271, baseType: !28, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !417, file: !262, line: 272, baseType: !413, size: 16, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !377, file: !262, line: 287, baseType: !37, size: 32, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !372, file: !262, line: 259, baseType: !427, size: 576, offset: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !372, file: !262, line: 255, size: 576, elements: !428)
!428 = !{!429, !431, !432}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !427, file: !262, line: 256, baseType: !430, size: 240)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 240, elements: !244)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !427, file: !262, line: 257, baseType: !430, size: 240, offset: 240)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !427, file: !262, line: 258, baseType: !322, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !372, file: !262, line: 261, baseType: !37, size: 32, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !372, file: !262, line: 262, baseType: !435, size: 64, offset: 672)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !189)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !372, file: !262, line: 263, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !438, line: 27, baseType: !8)
!438 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !359, file: !262, line: 203, baseType: !37, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !262, line: 203, baseType: !37, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !344, file: !262, line: 216, baseType: !442, size: 128, offset: 384)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !262, line: 213, size: 128, elements: !443)
!443 = !{!444, !451}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !262, line: 214, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !262, line: 105, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !262, line: 173, size: 128, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !447, file: !262, line: 174, baseType: !61, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !447, file: !262, line: 175, baseType: !61, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !442, file: !262, line: 215, baseType: !6, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !344, file: !262, line: 216, baseType: !442, size: 128, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !344, file: !262, line: 223, baseType: !454, size: 192, offset: 640)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !262, line: 217, size: 192, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !454, file: !262, line: 218, baseType: !322, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !454, file: !262, line: 222, baseType: !458, size: 128, offset: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !454, file: !262, line: 219, size: 128, elements: !459)
!459 = !{!460, !464}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !458, file: !262, line: 220, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !462, line: 85, baseType: !463)
!462 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !40)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !458, file: !262, line: 221, baseType: !461, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !344, file: !262, line: 224, baseType: !466, size: 448, offset: 832)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !262, line: 107, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !262, line: 178, size: 448, elements: !468)
!468 = !{!469, !487, !488, !489, !490}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !467, file: !262, line: 179, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !472, line: 25, baseType: !473)
!472 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !472, line: 27, size: 256, elements: !474)
!474 = !{!475, !481, !486}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !473, file: !472, line: 31, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !473, file: !472, line: 28, size: 64, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !476, file: !472, line: 29, baseType: !61, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !476, file: !472, line: 30, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !473, file: !472, line: 34, baseType: !482, size: 128, offset: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !472, line: 32, size: 128, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !482, file: !472, line: 33, baseType: !6, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !482, file: !472, line: 33, baseType: !6, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !472, line: 35, baseType: !28, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !467, file: !262, line: 180, baseType: !480, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !467, file: !262, line: 181, baseType: !6, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !467, file: !262, line: 182, baseType: !445, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !467, file: !262, line: 188, baseType: !491, size: 192, offset: 256)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !467, file: !262, line: 184, size: 192, elements: !492)
!492 = !{!493, !498, !499}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !491, file: !262, line: 185, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !342, !5}
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !262, line: 131, baseType: !282)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !491, file: !262, line: 186, baseType: !5, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !491, file: !262, line: 187, baseType: !5, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "basic_len", scope: !338, file: !327, line: 190, type: !73, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !327, line: 196, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 56, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 7)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !327, line: 207, type: !103, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !327, line: 87, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 352, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 44)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !327, line: 87, type: !176, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !327, line: 87, type: !125, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !327, line: 96, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 232, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 29)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !327, line: 102, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 328, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 41)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "cache_t", file: !309, line: 40, flags: DIFlagFwdDecl)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !533, line: 240, type: !526, isLocal: true, isDefinition: true)
!533 = !DIFile(filename: "common/lwan-io-wrappers.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "df65fc501e2089d1c77356ebe44cff47")
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !533, line: 240, type: !120, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !533, line: 240, type: !152, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !533, line: 179, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 160, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 20)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !533, line: 179, type: !110, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "running", scope: !547, file: !558, line: 41, type: !341, isLocal: true, isDefinition: true)
!547 = distinct !DICompileUnit(language: DW_LANG_C11, file: !548, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !549, globals: !555, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/home/raj/lwan/common/lwan-job.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "37f1591a76c3166f23ef5ae3b94f9151")
!549 = !{!5, !550, !61}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !313, line: 191, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !313, line: 193, baseType: !550, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !551, file: !313, line: 193, baseType: !550, size: 64, offset: 64)
!555 = !{!556, !562, !567, !570, !573, !576, !581, !583, !585, !587, !589, !591, !596, !599, !601, !604, !606, !608, !545, !613}
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !558, line: 77, type: !559, isLocal: true, isDefinition: true)
!558 = !DIFile(filename: "common/lwan-job.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "37f1591a76c3166f23ef5ae3b94f9151")
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 72, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 9)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !558, line: 77, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 264, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 33)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !558, line: 77, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !182)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !558, line: 79, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 168, elements: !237)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !558, line: 79, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 296, elements: !116)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !558, line: 85, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 120, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 15)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !558, line: 92, type: !158, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !558, line: 98, type: !248, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !558, line: 98, type: !213, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !558, line: 108, type: !46, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !558, line: 115, type: !193, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !558, line: 115, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 360, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 45)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !558, line: 119, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 104, elements: !48)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !558, line: 119, type: !505, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !558, line: 128, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !148)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !558, line: 137, type: !593, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "self", scope: !547, file: !558, line: 39, type: !437, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "jobs", scope: !547, file: !558, line: 42, type: !610, isLocal: true, isDefinition: true)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !313, line: 208, size: 128, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !610, file: !313, line: 210, baseType: !551, size: 128)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "queue_mutex", scope: !547, file: !558, line: 40, type: !615, isLocal: true, isDefinition: true)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !438, line: 72, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !438, line: 67, size: 320, elements: !617)
!617 = !{!618, !638, !639}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !616, file: !438, line: 69, baseType: !619, size: 320)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !620, line: 22, size: 320, elements: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!621 = !{!622, !623, !624, !625, !626, !627, !629, !630}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !619, file: !620, line: 24, baseType: !37, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !619, file: !620, line: 25, baseType: !28, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !619, file: !620, line: 26, baseType: !37, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !619, file: !620, line: 28, baseType: !28, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !619, file: !620, line: 32, baseType: !37, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !619, file: !620, line: 34, baseType: !628, size: 16, offset: 160)
!628 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !619, file: !620, line: 35, baseType: !628, size: 16, offset: 176)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !619, file: !620, line: 36, baseType: !631, size: 128, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !632, line: 55, baseType: !633)
!632 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !632, line: 51, size: 128, elements: !634)
!634 = !{!635, !637}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !633, file: !632, line: 53, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !633, file: !632, line: 54, baseType: !636, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !616, file: !438, line: 70, baseType: !82, size: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !616, file: !438, line: 71, baseType: !40, size: 64)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !642, line: 253, type: !521, isLocal: true, isDefinition: true)
!642 = !DIFile(filename: "common/lwan.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "b45b64bdafc0e6707cec9025aee73c17")
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !642, line: 253, type: !155, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !642, line: 253, type: !208, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !642, line: 308, type: !578, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !642, line: 315, type: !651, isLocal: true, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, elements: !391)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !642, line: 322, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 80, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 10)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "default_config", scope: !659, file: !642, line: 44, type: !1109, isLocal: true, isDefinition: true)
!659 = distinct !DICompileUnit(language: DW_LANG_C11, file: !660, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !661, retainedTypes: !926, globals: !933, splitDebugInlining: false, nameTableKind: None)
!660 = !DIFile(filename: "/home/raj/lwan/common/lwan.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "b45b64bdafc0e6707cec9025aee73c17")
!661 = !{!274, !282, !261, !662, !672, !300, !684, !904}
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 133, baseType: !28, size: 32, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671}
!664 = !DIEnumerator(name: "HANDLER_PARSE_QUERY_STRING", value: 1)
!665 = !DIEnumerator(name: "HANDLER_PARSE_IF_MODIFIED_SINCE", value: 2)
!666 = !DIEnumerator(name: "HANDLER_PARSE_RANGE", value: 4)
!667 = !DIEnumerator(name: "HANDLER_PARSE_ACCEPT_ENCODING", value: 8)
!668 = !DIEnumerator(name: "HANDLER_PARSE_POST_DATA", value: 16)
!669 = !DIEnumerator(name: "HANDLER_MUST_AUTHORIZE", value: 32)
!670 = !DIEnumerator(name: "HANDLER_REMOVE_LEADING_SLASH", value: 64)
!671 = !DIEnumerator(name: "HANDLER_PARSE_MASK", value: 31)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !673, line: 24, baseType: !28, size: 32, elements: !674)
!673 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "0d4e972fdeb3da9a5bc94fa41144e9f8")
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683}
!675 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!676 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!677 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!678 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!679 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!680 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!681 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!682 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!683 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 71, baseType: !28, size: 32, elements: !686)
!685 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!687 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0)
!688 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1)
!689 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2)
!690 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3)
!691 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4)
!692 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5)
!693 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6)
!694 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7)
!695 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8)
!696 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9)
!697 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10)
!698 = !DIEnumerator(name: "_SC_TIMERS", value: 11)
!699 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12)
!700 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13)
!701 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14)
!702 = !DIEnumerator(name: "_SC_FSYNC", value: 15)
!703 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16)
!704 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17)
!705 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18)
!706 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19)
!707 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20)
!708 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21)
!709 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22)
!710 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23)
!711 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24)
!712 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25)
!713 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26)
!714 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27)
!715 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28)
!716 = !DIEnumerator(name: "_SC_VERSION", value: 29)
!717 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30)
!718 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31)
!719 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32)
!720 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33)
!721 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34)
!722 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35)
!723 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36)
!724 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37)
!725 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38)
!726 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39)
!727 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40)
!728 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41)
!729 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42)
!730 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43)
!731 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44)
!732 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45)
!733 = !DIEnumerator(name: "_SC_2_VERSION", value: 46)
!734 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47)
!735 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48)
!736 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49)
!737 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50)
!738 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51)
!739 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52)
!740 = !DIEnumerator(name: "_SC_PII", value: 53)
!741 = !DIEnumerator(name: "_SC_PII_XTI", value: 54)
!742 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55)
!743 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56)
!744 = !DIEnumerator(name: "_SC_PII_OSI", value: 57)
!745 = !DIEnumerator(name: "_SC_POLL", value: 58)
!746 = !DIEnumerator(name: "_SC_SELECT", value: 59)
!747 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60)
!748 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60)
!749 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61)
!750 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62)
!751 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63)
!752 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64)
!753 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65)
!754 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66)
!755 = !DIEnumerator(name: "_SC_THREADS", value: 67)
!756 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68)
!757 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69)
!758 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70)
!759 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71)
!760 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72)
!761 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73)
!762 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74)
!763 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75)
!764 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76)
!765 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77)
!766 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78)
!767 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79)
!768 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80)
!769 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81)
!770 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82)
!771 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83)
!772 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84)
!773 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85)
!774 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86)
!775 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87)
!776 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88)
!777 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89)
!778 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90)
!779 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91)
!780 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92)
!781 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93)
!782 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94)
!783 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95)
!784 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96)
!785 = !DIEnumerator(name: "_SC_2_UPE", value: 97)
!786 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98)
!787 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99)
!788 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100)
!789 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101)
!790 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102)
!791 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103)
!792 = !DIEnumerator(name: "_SC_INT_MAX", value: 104)
!793 = !DIEnumerator(name: "_SC_INT_MIN", value: 105)
!794 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106)
!795 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107)
!796 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108)
!797 = !DIEnumerator(name: "_SC_NZERO", value: 109)
!798 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110)
!799 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111)
!800 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112)
!801 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113)
!802 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114)
!803 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115)
!804 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116)
!805 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117)
!806 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118)
!807 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119)
!808 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120)
!809 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121)
!810 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122)
!811 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123)
!812 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124)
!813 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125)
!814 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!815 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!816 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!817 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!818 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!819 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!820 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!821 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!822 = !DIEnumerator(name: "_SC_BASE", value: 134)
!823 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!824 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!825 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!826 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!827 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!828 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!829 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!830 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!831 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!832 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!833 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!834 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!835 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!836 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!837 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!838 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!839 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!840 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!841 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!842 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!843 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!844 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!845 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!846 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!847 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!848 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!849 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!850 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!851 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!852 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!853 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!854 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!855 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!856 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!857 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!858 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!859 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!860 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!861 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!862 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!863 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!864 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!865 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!866 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!867 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!868 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!869 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!870 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!871 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!872 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!873 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!874 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!875 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!876 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!877 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!878 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!879 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!880 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!881 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!882 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!883 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!884 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!885 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!886 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!887 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!888 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!889 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!890 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!891 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!892 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!893 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!894 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!895 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!896 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!897 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!898 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!899 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!900 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!901 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!902 = !DIEnumerator(name: "_SC_MINSIGSTKSZ", value: 249)
!903 = !DIEnumerator(name: "_SC_SIGSTKSZ", value: 250)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !905, line: 31, baseType: !28, size: 32, elements: !906)
!905 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "bb0bdc9e7ae341ef435e98e05276a863")
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!907 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!908 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!909 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!910 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!911 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!912 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!913 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!914 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!915 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!916 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!917 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!918 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!919 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!920 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!921 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!922 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!923 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!924 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!925 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!926 = !{!6, !28, !927, !5, !61, !413, !932}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !928, line: 72, baseType: !929)
!928 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !37}
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !69, line: 157, baseType: !8)
!933 = !{!640, !643, !645, !647, !649, !652, !934, !937, !942, !944, !949, !951, !953, !958, !961, !963, !966, !968, !970, !972, !974, !979, !982, !987, !657, !989, !991, !993, !995, !997, !999, !1001, !1003, !1008, !1010, !1015, !1017, !1019, !1021, !1023, !1025, !1027, !1032, !1034, !1036, !1038, !1040, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1068, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1084, !1087, !1092, !1095, !1097, !1099, !1101, !1103}
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !642, line: 473, type: !936, isLocal: true, isDefinition: true)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 176, elements: !159)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !642, line: 473, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 344, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 43)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !642, line: 477, type: !521, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !642, line: 491, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 384, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 48)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !642, line: 505, type: !120, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !642, line: 505, type: !152, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !642, line: 513, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 216, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 27)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !642, line: 561, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 144, elements: !177)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !642, line: 561, type: !243, isLocal: true, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !642, line: 564, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 120, elements: !579)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !642, line: 564, type: !521, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !642, line: 566, type: !578, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !642, line: 572, type: !505, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(scope: null, file: !642, line: 577, type: !430, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !642, line: 579, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 312, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 39)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !642, line: 111, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 96, elements: !53)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !642, line: 111, type: !984, isLocal: true, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 184, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 23)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !642, line: 45, type: !578, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !642, line: 56, type: !155, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !642, line: 56, type: !521, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !642, line: 69, type: !572, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !642, line: 69, type: !213, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !642, line: 71, type: !603, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !642, line: 334, type: !176, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !642, line: 334, type: !218, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !642, line: 345, type: !1005, isLocal: true, isDefinition: true)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 152, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 19)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !642, line: 348, type: !110, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !642, line: 351, type: !1012, isLocal: true, isDefinition: true)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 88, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 11)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !642, line: 354, type: !651, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !642, line: 357, type: !651, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !642, line: 360, type: !430, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !642, line: 364, type: !984, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !642, line: 369, type: !559, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !642, line: 372, type: !213, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !642, line: 374, type: !1029, isLocal: true, isDefinition: true)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 224, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 28)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !642, line: 378, type: !984, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !642, line: 383, type: !976, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !642, line: 278, type: !213, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !642, line: 281, type: !505, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !642, line: 286, type: !1042, isLocal: true, isDefinition: true)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 360, elements: !594)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !642, line: 298, type: !1042, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !642, line: 178, type: !505, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !642, line: 180, type: !213, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !642, line: 185, type: !955, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !642, line: 188, type: !651, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !642, line: 191, type: !1029, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !642, line: 200, type: !152, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !642, line: 203, type: !955, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !642, line: 213, type: !939, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !642, line: 218, type: !208, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !642, line: 222, type: !1065, isLocal: true, isDefinition: true)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 336, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 42)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !642, line: 239, type: !88, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(scope: null, file: !642, line: 125, type: !110, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(scope: null, file: !642, line: 126, type: !93, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !642, line: 135, type: !110, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !642, line: 138, type: !152, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !642, line: 145, type: !984, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !642, line: 150, type: !166, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !642, line: 152, type: !559, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !642, line: 427, type: !1086, isLocal: true, isDefinition: true)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 152, elements: !1006)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !642, line: 427, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 416, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 52)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !642, line: 398, type: !1094, isLocal: true, isDefinition: true)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 232, elements: !522)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !642, line: 398, type: !654, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !642, line: 409, type: !654, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !642, line: 419, type: !572, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !642, line: 419, type: !505, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "main_socket", scope: !659, file: !642, line: 547, type: !1105, isLocal: true, isDefinition: true)
!1105 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !1107, line: 8, baseType: !1108)
!1107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !69, line: 215, baseType: !37)
!1109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !262, line: 111, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !262, line: 266, size: 192, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1111, file: !262, line: 267, baseType: !61, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !1111, file: !262, line: 268, baseType: !413, size: 16, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !1111, file: !262, line: 269, baseType: !341, size: 8, offset: 80)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !1111, file: !262, line: 270, baseType: !341, size: 8, offset: 88)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1111, file: !262, line: 271, baseType: !28, size: 32, offset: 96)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !1111, file: !262, line: 272, baseType: !413, size: 16, offset: 128)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(name: "redirect_module", scope: !1121, file: !1122, line: 64, type: !1126, isLocal: true, isDefinition: true)
!1121 = distinct !DISubprogram(name: "lwan_module_redirect", scope: !1122, file: !1122, line: 62, type: !1123, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1284, retainedNodes: !74)
!1122 = !DIFile(filename: "common/lwan-redirect.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1614b421dd87198cc4b34905c0f8dd7e")
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_module_t", file: !262, line: 104, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_module_t_", file: !262, line: 227, size: 384, elements: !1129)
!1129 = !{!1130, !1131, !1135, !1141, !1142, !1282}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1128, file: !262, line: 228, baseType: !480, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1128, file: !262, line: 229, baseType: !1132, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!5, !5}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "init_from_hash", scope: !1128, file: !262, line: 230, baseType: !1136, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!5, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !1128, file: !262, line: 231, baseType: !403, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1128, file: !262, line: 232, baseType: !1143, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!497, !1146, !1281, !5}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !262, line: 106, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !262, line: 206, size: 1280, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1158, !1159, !1228, !1239, !1240, !1249}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !262, line: 207, baseType: !347, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1148, file: !262, line: 208, baseType: !37, size: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1148, file: !262, line: 209, baseType: !1153, size: 128, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !262, line: 110, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !262, line: 191, size: 128, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1154, file: !262, line: 192, baseType: !61, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1154, file: !262, line: 193, baseType: !6, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !1148, file: !262, line: 210, baseType: !1153, size: 128, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !1148, file: !262, line: 211, baseType: !1160, size: 64, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !262, line: 112, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !262, line: 196, size: 256, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1226, !1227}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1162, file: !262, line: 199, baseType: !362, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !1162, file: !262, line: 200, baseType: !28, size: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !1162, file: !262, line: 201, baseType: !365, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1162, file: !262, line: 202, baseType: !1168, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !262, line: 108, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !262, line: 253, size: 832, elements: !1171)
!1171 = !{!1172, !1217, !1223, !1224, !1225}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !1170, file: !262, line: 254, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !262, line: 103, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !262, line: 275, size: 640, elements: !1176)
!1176 = !{!1177, !1198, !1199, !1205, !1206, !1216}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !1175, file: !262, line: 276, baseType: !1178, size: 128)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !381, line: 25, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !381, line: 41, size: 128, elements: !1180)
!1180 = !{!1181, !1197}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1179, file: !381, line: 42, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !381, line: 26, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !381, line: 29, size: 640, elements: !1185)
!1185 = !{!1186, !1188, !1196}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1184, file: !381, line: 30, baseType: !1187, size: 512)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 512, elements: !391)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !1184, file: !381, line: 31, baseType: !1189, size: 64, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !381, line: 27, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !381, line: 35, size: 192, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1191, file: !381, line: 36, baseType: !61, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !381, line: 37, baseType: !5, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1191, file: !381, line: 38, baseType: !1189, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !1184, file: !381, line: 32, baseType: !37, size: 32, offset: 576)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !1179, file: !381, line: 43, baseType: !403, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !1175, file: !262, line: 277, baseType: !1160, size: 64, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1175, file: !262, line: 283, baseType: !1200, size: 128, offset: 192)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1175, file: !262, line: 279, size: 128, elements: !1201)
!1201 = !{!1202, !1203, !1204}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !1200, file: !262, line: 280, baseType: !1168, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !1200, file: !262, line: 281, baseType: !28, size: 32, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1200, file: !262, line: 282, baseType: !413, size: 16, offset: 96)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !1175, file: !262, line: 285, baseType: !331, size: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1175, file: !262, line: 286, baseType: !1207, size: 192, offset: 384)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !262, line: 111, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !262, line: 266, size: 192, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !1208, file: !262, line: 267, baseType: !61, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !1208, file: !262, line: 268, baseType: !413, size: 16, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !1208, file: !262, line: 269, baseType: !341, size: 8, offset: 80)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !1208, file: !262, line: 270, baseType: !341, size: 8, offset: 88)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1208, file: !262, line: 271, baseType: !28, size: 32, offset: 96)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !1208, file: !262, line: 272, baseType: !413, size: 16, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !1175, file: !262, line: 287, baseType: !37, size: 32, offset: 576)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !1170, file: !262, line: 259, baseType: !1218, size: 576, offset: 64)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1170, file: !262, line: 255, size: 576, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !1218, file: !262, line: 256, baseType: !430, size: 240)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1218, file: !262, line: 257, baseType: !430, size: 240, offset: 240)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1218, file: !262, line: 258, baseType: !322, size: 64, offset: 512)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !1170, file: !262, line: 261, baseType: !37, size: 32, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !1170, file: !262, line: 262, baseType: !435, size: 64, offset: 672)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !1170, file: !262, line: 263, baseType: !437, size: 64, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1162, file: !262, line: 203, baseType: !37, size: 32, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1162, file: !262, line: 203, baseType: !37, size: 32, offset: 224)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !1148, file: !262, line: 216, baseType: !1229, size: 128, offset: 384)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1148, file: !262, line: 213, size: 128, elements: !1230)
!1230 = !{!1231, !1238}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1229, file: !262, line: 214, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !262, line: 105, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !262, line: 173, size: 128, elements: !1235)
!1235 = !{!1236, !1237}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1234, file: !262, line: 174, baseType: !61, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1234, file: !262, line: 175, baseType: !61, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1229, file: !262, line: 215, baseType: !6, size: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !1148, file: !262, line: 216, baseType: !1229, size: 128, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1148, file: !262, line: 223, baseType: !1241, size: 192, offset: 640)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1148, file: !262, line: 217, size: 192, elements: !1242)
!1242 = !{!1243, !1244}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !1241, file: !262, line: 218, baseType: !322, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1241, file: !262, line: 222, baseType: !1245, size: 128, offset: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1241, file: !262, line: 219, size: 128, elements: !1246)
!1246 = !{!1247, !1248}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1245, file: !262, line: 220, baseType: !461, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !1245, file: !262, line: 221, baseType: !461, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !1148, file: !262, line: 224, baseType: !1250, size: 448, offset: 832)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !262, line: 107, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !262, line: 178, size: 448, elements: !1252)
!1252 = !{!1253, !1269, !1270, !1271, !1272}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1251, file: !262, line: 179, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !472, line: 25, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !472, line: 27, size: 256, elements: !1257)
!1257 = !{!1258, !1263, !1268}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1256, file: !472, line: 31, baseType: !1259, size: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1256, file: !472, line: 28, size: 64, elements: !1260)
!1260 = !{!1261, !1262}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1259, file: !472, line: 29, baseType: !61, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !1259, file: !472, line: 30, baseType: !480, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1256, file: !472, line: 34, baseType: !1264, size: 128, offset: 64)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1256, file: !472, line: 32, size: 128, elements: !1265)
!1265 = !{!1266, !1267}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1264, file: !472, line: 33, baseType: !6, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1264, file: !472, line: 33, baseType: !6, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1256, file: !472, line: 35, baseType: !28, size: 32, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1251, file: !262, line: 180, baseType: !480, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !1251, file: !262, line: 181, baseType: !6, size: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1251, file: !262, line: 182, baseType: !1232, size: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1251, file: !262, line: 188, baseType: !1273, size: 192, offset: 256)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1251, file: !262, line: 184, size: 192, elements: !1274)
!1274 = !{!1275, !1279, !1280}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1273, file: !262, line: 185, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!497, !1146, !5}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1273, file: !262, line: 186, baseType: !5, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !1273, file: !262, line: 187, baseType: !5, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !262, line: 233, baseType: !1283, size: 32, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_handler_flags_t", file: !262, line: 143, baseType: !662)
!1284 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1285, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1286, globals: !1287, splitDebugInlining: false, nameTableKind: None)
!1285 = !DIFile(filename: "/home/raj/lwan/common/lwan-redirect.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "1614b421dd87198cc4b34905c0f8dd7e")
!1286 = !{!282, !261, !274, !662}
!1287 = !{!1288, !1119, !1290, !1292}
!1288 = !DIGlobalVariableExpression(var: !1289, expr: !DIExpression())
!1289 = distinct !DIGlobalVariable(scope: null, file: !1122, line: 65, type: !559, isLocal: true, isDefinition: true)
!1290 = !DIGlobalVariableExpression(var: !1291, expr: !DIExpression())
!1291 = distinct !DIGlobalVariable(scope: null, file: !1122, line: 57, type: !193, isLocal: true, isDefinition: true)
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(scope: null, file: !1122, line: 38, type: !559, isLocal: true, isDefinition: true)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(scope: null, file: !1296, line: 576, type: !166, isLocal: true, isDefinition: true)
!1296 = !DIFile(filename: "common/lwan-request.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "02ac00895b73c156aad4cf5abf728f5f")
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(scope: null, file: !1296, line: 582, type: !137, isLocal: true, isDefinition: true)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(name: "sizes", scope: !1301, file: !1296, line: 91, type: !1573, isLocal: true, isDefinition: true)
!1301 = distinct !DISubprogram(name: "identify_http_method", scope: !1296, file: !1296, line: 88, type: !1302, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1439, retainedNodes: !74)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!61, !1304, !61}
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !262, line: 106, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !262, line: 206, size: 1280, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1316, !1317, !1386, !1397, !1398, !1407}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1306, file: !262, line: 207, baseType: !347, size: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1306, file: !262, line: 208, baseType: !37, size: 32, offset: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1306, file: !262, line: 209, baseType: !1311, size: 128, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !262, line: 110, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !262, line: 191, size: 128, elements: !1313)
!1313 = !{!1314, !1315}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1312, file: !262, line: 192, baseType: !61, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1312, file: !262, line: 193, baseType: !6, size: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !1306, file: !262, line: 210, baseType: !1311, size: 128, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !1306, file: !262, line: 211, baseType: !1318, size: 64, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !262, line: 112, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !262, line: 196, size: 256, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1384, !1385}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1320, file: !262, line: 199, baseType: !362, size: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !1320, file: !262, line: 200, baseType: !28, size: 32, offset: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !1320, file: !262, line: 201, baseType: !365, size: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1320, file: !262, line: 202, baseType: !1326, size: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !262, line: 108, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !262, line: 253, size: 832, elements: !1329)
!1329 = !{!1330, !1375, !1381, !1382, !1383}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !1328, file: !262, line: 254, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !262, line: 103, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !262, line: 275, size: 640, elements: !1334)
!1334 = !{!1335, !1356, !1357, !1363, !1364, !1374}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !1333, file: !262, line: 276, baseType: !1336, size: 128)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !381, line: 25, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !381, line: 41, size: 128, elements: !1338)
!1338 = !{!1339, !1355}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1337, file: !381, line: 42, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !381, line: 26, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !381, line: 29, size: 640, elements: !1343)
!1343 = !{!1344, !1346, !1354}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1342, file: !381, line: 30, baseType: !1345, size: 512)
