; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lwan_url_map_t_ = type { ptr, ptr, ptr, i64, i32, ptr, ptr, %struct.db }
%struct.db = type { ptr, ptr }
%struct.lwan_var_descriptor_t_ = type { ptr, i64, ptr, ptr, ptr, ptr }
%struct.db_row = type { %union.anon, i8, i64 }
%union.anon = type { ptr }
%struct.array = type { ptr, i64, i64, i64 }
%struct.db_mysql = type { %struct.db, ptr }
%struct.db_stmt_mysql = type { %struct.db_stmt, ptr, ptr, ptr, i8 }
%struct.db_stmt = type { ptr, ptr, ptr }
%struct.MYSQL_BIND = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, i64, i32, i32, i32, i8, i8, i8, i8, ptr }
%struct.db_stmt_sqlite = type { %struct.db_stmt, ptr }
%struct.JsonNode = type { ptr, ptr, ptr, ptr, i32, %union.anon.0 }
%union.anon.0 = type { %struct.db }
%struct.lwan_t_ = type { %struct.db, ptr, %struct.anon, ptr, %struct.lwan_config_t_, i32 }
%struct.anon = type { ptr, i32, i16 }
%struct.lwan_config_t_ = type { ptr, i16, i8, i8, i32, i16 }
%struct.lwan_response_t_ = type { ptr, ptr, i64, ptr, %struct.db_stmt }
%struct.Fortune = type { %struct.anon.10 }
%struct.anon.10 = type { ptr, i32, ptr }

@.str = private unnamed_addr constant [9 x i8] c"step > 0\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"/home/raj/lwan/techempower/array.c\00", align 1, !dbg !7

!236 = distinct !DICompileUnit(language: DW_LANG_C11, file: !237, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !238, retainedTypes: !298, globals: !320, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "/home/raj/lwan/techempower/techempower.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "862c10ebb5d5d09bd221596387c59720")
!238 = !{!239, !259, !271, !279, !289}
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 114, baseType: !241, size: 32, elements: !242)
!240 = !DIFile(filename: "common/lwan.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "56f65bbbfce1c5452d6905964ca2b84f")
!241 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!243 = !DIEnumerator(name: "HTTP_OK", value: 200)
!244 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!245 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!246 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!247 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!248 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!249 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!250 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!251 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!252 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!253 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!254 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!255 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!256 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!257 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!258 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 145, baseType: !235, size: 32, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!261 = !DIEnumerator(name: "REQUEST_ALL_FLAGS", value: -1)
!262 = !DIEnumerator(name: "REQUEST_METHOD_GET", value: 1)
!263 = !DIEnumerator(name: "REQUEST_METHOD_HEAD", value: 2)
!264 = !DIEnumerator(name: "REQUEST_METHOD_POST", value: 4)
!265 = !DIEnumerator(name: "REQUEST_ACCEPT_DEFLATE", value: 8)
!266 = !DIEnumerator(name: "REQUEST_ACCEPT_GZIP", value: 16)
!267 = !DIEnumerator(name: "REQUEST_IS_HTTP_1_0", value: 32)
!268 = !DIEnumerator(name: "RESPONSE_SENT_HEADERS", value: 64)
!269 = !DIEnumerator(name: "RESPONSE_CHUNKED_ENCODING", value: 128)
!270 = !DIEnumerator(name: "RESPONSE_NO_CONTENT_LENGTH", value: 256)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 158, baseType: !235, size: 32, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278}
!273 = !DIEnumerator(name: "CONN_MASK", value: -1)
!274 = !DIEnumerator(name: "CONN_KEEP_ALIVE", value: 1)
!275 = !DIEnumerator(name: "CONN_IS_ALIVE", value: 2)
!276 = !DIEnumerator(name: "CONN_SHOULD_RESUME_CORO", value: 4)
!277 = !DIEnumerator(name: "CONN_WRITE_EVENTS", value: 8)
!278 = !DIEnumerator(name: "CONN_MUST_READ", value: 16)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !240, line: 133, baseType: !241, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288}
!281 = !DIEnumerator(name: "HANDLER_PARSE_QUERY_STRING", value: 1)
!282 = !DIEnumerator(name: "HANDLER_PARSE_IF_MODIFIED_SINCE", value: 2)
!283 = !DIEnumerator(name: "HANDLER_PARSE_RANGE", value: 4)
!284 = !DIEnumerator(name: "HANDLER_PARSE_ACCEPT_ENCODING", value: 8)
!285 = !DIEnumerator(name: "HANDLER_PARSE_POST_DATA", value: 16)
!286 = !DIEnumerator(name: "HANDLER_MUST_AUTHORIZE", value: 32)
!287 = !DIEnumerator(name: "HANDLER_REMOVE_LEADING_SLASH", value: 64)
!288 = !DIEnumerator(name: "HANDLER_PARSE_MASK", value: 31)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 29, baseType: !241, size: 32, elements: !291)
!290 = !DIFile(filename: "techempower/json.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "90532975aa76ecb9e0e0525c7677d9b7")
!291 = !{!292, !293, !294, !295, !296, !297}
!292 = !DIEnumerator(name: "JSON_NULL", value: 0)
!293 = !DIEnumerator(name: "JSON_BOOL", value: 1)
!294 = !DIEnumerator(name: "JSON_STRING", value: 2)
!295 = !DIEnumerator(name: "JSON_NUMBER", value: 3)
!296 = !DIEnumerator(name: "JSON_ARRAY", value: 4)
!297 = !DIEnumerator(name: "JSON_OBJECT", value: 5)
!298 = !{!241, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Fortune", file: !232, line: 34, size: 192, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !302, file: !232, line: 40, baseType: !305, size: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !232, line: 35, size: 192, elements: !306)
!306 = !{!307, !317, !318}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !305, file: !232, line: 36, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_list_generator_t", file: !309, line: 28, baseType: !310)
!309 = !DIFile(filename: "common/lwan-template.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1f1d0e1deded933cc0657e991f0859fe")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!235, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !315, line: 34, baseType: !316)
!315 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !315, line: 34, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !232, line: 38, baseType: !235, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !305, file: !232, line: 39, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!320 = !{!321, !323, !328, !330, !335, !229, !340, !342, !344, !346, !348, !350, !352, !355, !360, !362, !364, !366, !371, !373, !375, !380, !382, !384, !389, !394, !399, !404, !406, !409, !411, !416, !418, !420, !422, !427, !429, !477, !481, !483, !485, !487}
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !232, line: 307, type: !155, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !232, line: 308, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 4)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !232, line: 309, type: !3, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !232, line: 310, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 11)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !232, line: 311, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 10)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !232, line: 320, type: !337, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !232, line: 321, type: !332, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !232, line: 322, type: !332, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !232, line: 323, type: !332, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !232, line: 324, type: !3, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !232, line: 327, type: !123, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !232, line: 327, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 40, elements: !22)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !232, line: 327, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 23)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !232, line: 329, type: !52, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !232, line: 331, type: !52, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !232, line: 333, type: !52, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !232, line: 338, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 26)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !232, line: 339, type: !42, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !232, line: 340, type: !94, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !232, line: 343, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 15)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !232, line: 347, type: !32, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !232, line: 351, type: !118, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "database", scope: !236, file: !232, line: 70, type: !386, isLocal: true, isDefinition: true)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "db", file: !388, line: 24, flags: DIFlagFwdDecl)
!388 = !DIFile(filename: "techempower/database.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "b5199ce24ba11b1ee7482ccc6d0952b7")
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "fortune_tpl", scope: !236, file: !232, line: 71, type: !391, isLocal: true, isDefinition: true)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_t", file: !309, line: 25, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_tpl_t_", file: !309, line: 25, flags: DIFlagFwdDecl)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !232, line: 100, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 8)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "hello_world", scope: !236, file: !232, line: 31, type: !401, isLocal: true, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 112, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 14)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !232, line: 87, type: !219, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "random_number_query", scope: !236, file: !232, line: 32, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 336, elements: !80)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !232, line: 123, type: !183, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !232, line: 124, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 13)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !232, line: 156, type: !396, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !232, line: 204, type: !332, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !232, line: 299, type: !27, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "fortunes_template_str", scope: !236, file: !232, line: 43, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1608, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 201)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !232, line: 65, type: !21, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "fortune_desc", scope: !236, file: !232, line: 64, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 768, elements: !193)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_var_descriptor_t", file: !309, line: 26, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_var_descriptor_t_", file: !309, line: 30, size: 384, elements: !435)
!435 = !{!436, !438, !445, !469, !474, !475}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !434, file: !309, line: 31, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !434, file: !309, line: 32, baseType: !439, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !441, line: 85, baseType: !442)
!441 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !443, line: 152, baseType: !444)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!444 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "append_to_strbuf", scope: !434, file: !309, line: 34, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !449, !468}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !451, line: 25, baseType: !452)
!451 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !451, line: 27, size: 256, elements: !453)
!453 = !{!454, !459, !467}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !452, file: !451, line: 31, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !452, file: !451, line: 28, size: 64, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !455, file: !451, line: 29, baseType: !319, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !455, file: !451, line: 30, baseType: !437, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !452, file: !451, line: 34, baseType: !460, size: 128, offset: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !451, line: 32, size: 128, elements: !461)
!461 = !{!462, !466}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !460, file: !451, line: 33, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !464, line: 46, baseType: !465)
!464 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!465 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !460, file: !451, line: 33, baseType: !463, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !452, file: !451, line: 35, baseType: !241, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "get_is_empty", scope: !434, file: !309, line: 35, baseType: !470, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !468}
!473 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !434, file: !309, line: 37, baseType: !308, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "list_desc", scope: !434, file: !309, line: 38, baseType: !476, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "fortune_query", scope: !479, file: !232, line: 245, type: !147, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "fortune_list_generator", scope: !232, file: !232, line: 243, type: !311, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !236, retainedNodes: !480)
!480 = !{}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !232, line: 269, type: !79, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !232, line: 59, type: !396, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !232, line: 60, type: !413, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "fortune_item_desc", scope: !236, file: !232, line: 58, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 1152, elements: !184)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 3456, elements: !156)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_url_map_t", file: !240, line: 109, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_url_map_t_", file: !240, line: 236, size: 576, elements: !494)
!494 = !{!495, !637, !638, !639, !640, !642, !662, !663}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !493, file: !240, line: 237, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!499, !500, !636, !468}
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !240, line: 131, baseType: !239)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !240, line: 106, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !240, line: 206, size: 1280, elements: !503)
!503 = !{!504, !506, !507, !513, !514, !598, !609, !610, !619}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !240, line: 207, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !240, line: 156, baseType: !259)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !502, file: !240, line: 208, baseType: !235, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !502, file: !240, line: 209, baseType: !508, size: 128, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !240, line: 110, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !240, line: 191, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !509, file: !240, line: 192, baseType: !319, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !509, file: !240, line: 193, baseType: !463, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !502, file: !240, line: 210, baseType: !508, size: 128, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !502, file: !240, line: 211, baseType: !515, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !240, line: 112, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !240, line: 196, size: 256, elements: !518)
!518 = !{!519, !521, !522, !523, !596, !597}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !517, file: !240, line: 199, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !240, line: 165, baseType: !271)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !517, file: !240, line: 200, baseType: !241, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !517, file: !240, line: 201, baseType: !313, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !517, file: !240, line: 202, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !240, line: 108, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !240, line: 253, size: 832, elements: !527)
!527 = !{!528, !581, !590, !591, !593}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !526, file: !240, line: 254, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !240, line: 103, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !240, line: 275, size: 640, elements: !532)
!532 = !{!533, !558, !559, !566, !570, !580}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !531, file: !240, line: 276, baseType: !534, size: 128)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !535, line: 25, baseType: !536)
!535 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !535, line: 41, size: 128, elements: !537)
!537 = !{!538, !554}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !536, file: !535, line: 42, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !535, line: 26, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !535, line: 29, size: 640, elements: !542)
!542 = !{!543, !545, !553}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !535, line: 30, baseType: !544, size: 512)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 512, elements: !397)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !541, file: !535, line: 31, baseType: !546, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !535, line: 27, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !535, line: 35, size: 192, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !548, file: !535, line: 36, baseType: !319, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !548, file: !535, line: 37, baseType: !468, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !535, line: 38, baseType: !546, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !541, file: !535, line: 32, baseType: !235, size: 32, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !536, file: !535, line: 43, baseType: !555, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !468}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !531, file: !240, line: 277, baseType: !515, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !531, file: !240, line: 283, baseType: !560, size: 128, offset: 192)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !531, file: !240, line: 279, size: 128, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !560, file: !240, line: 280, baseType: !524, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !560, file: !240, line: 281, baseType: !241, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !560, file: !240, line: 282, baseType: !565, size: 16, offset: 96)
!565 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !531, file: !240, line: 285, baseType: !567, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !569, line: 6, flags: DIFlagFwdDecl)
!569 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!570 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !531, file: !240, line: 286, baseType: !571, size: 192, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !240, line: 111, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !240, line: 266, size: 192, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !572, file: !240, line: 267, baseType: !319, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !572, file: !240, line: 268, baseType: !565, size: 16, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !572, file: !240, line: 269, baseType: !473, size: 8, offset: 80)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !572, file: !240, line: 270, baseType: !473, size: 8, offset: 88)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !572, file: !240, line: 271, baseType: !241, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !572, file: !240, line: 272, baseType: !565, size: 16, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !531, file: !240, line: 287, baseType: !235, size: 32, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !526, file: !240, line: 259, baseType: !582, size: 576, offset: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !240, line: 255, size: 576, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !582, file: !240, line: 256, baseType: !94, size: 240)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !582, file: !240, line: 257, baseType: !94, size: 240, offset: 240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !582, file: !240, line: 258, baseType: !587, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !588, line: 10, baseType: !589)
!588 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !443, line: 160, baseType: !444)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !526, file: !240, line: 261, baseType: !235, size: 32, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !526, file: !240, line: 262, baseType: !592, size: 64, offset: 672)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 64, elements: !193)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !526, file: !240, line: 263, baseType: !594, size: 64, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !595, line: 27, baseType: !465)
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!596 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !517, file: !240, line: 203, baseType: !235, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !517, file: !240, line: 203, baseType: !235, size: 32, offset: 224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !502, file: !240, line: 216, baseType: !599, size: 128, offset: 384)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !502, file: !240, line: 213, size: 128, elements: !600)
!600 = !{!601, !608}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !599, file: !240, line: 214, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !240, line: 105, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !240, line: 173, size: 128, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !604, file: !240, line: 174, baseType: !319, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !604, file: !240, line: 175, baseType: !319, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !599, file: !240, line: 215, baseType: !463, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !502, file: !240, line: 216, baseType: !599, size: 128, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !502, file: !240, line: 223, baseType: !611, size: 192, offset: 640)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !502, file: !240, line: 217, size: 192, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !611, file: !240, line: 218, baseType: !587, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !611, file: !240, line: 222, baseType: !615, size: 128, offset: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !240, line: 219, size: 128, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !615, file: !240, line: 220, baseType: !440, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !615, file: !240, line: 221, baseType: !440, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !502, file: !240, line: 224, baseType: !620, size: 448, offset: 832)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !240, line: 107, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !240, line: 178, size: 448, elements: !622)
!622 = !{!623, !624, !625, !626, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !621, file: !240, line: 179, baseType: !449, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !621, file: !240, line: 180, baseType: !437, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !621, file: !240, line: 181, baseType: !463, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !621, file: !240, line: 182, baseType: !602, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !621, file: !240, line: 188, baseType: !628, size: 192, offset: 256)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !621, file: !240, line: 184, size: 192, elements: !629)
!629 = !{!630, !634, !635}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !628, file: !240, line: 185, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!499, !500, !468}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !628, file: !240, line: 186, baseType: !468, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !628, file: !240, line: 187, baseType: !468, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !493, file: !240, line: 238, baseType: !468, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !493, file: !240, line: 240, baseType: !437, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_len", scope: !493, file: !240, line: 241, baseType: !463, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !493, file: !240, line: 242, baseType: !641, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_handler_flags_t", file: !240, line: 143, baseType: !279)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !493, file: !240, line: 244, baseType: !643, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_module_t", file: !240, line: 104, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_module_t_", file: !240, line: 227, size: 384, elements: !647)
!647 = !{!648, !649, !653, !659, !660, !661}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !240, line: 228, baseType: !437, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !646, file: !240, line: 229, baseType: !650, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!468, !468}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "init_from_hash", scope: !646, file: !240, line: 230, baseType: !654, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!468, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !646, file: !240, line: 231, baseType: !555, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !646, file: !240, line: 232, baseType: !496, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !646, file: !240, line: 233, baseType: !641, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !493, file: !240, line: 245, baseType: !468, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !493, file: !240, line: 250, baseType: !664, size: 128, offset: 448)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !240, line: 247, size: 128, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !664, file: !240, line: 248, baseType: !319, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "password_file", scope: !664, file: !240, line: 249, baseType: !319, size: 64, offset: 64)
!668 = distinct !DICompileUnit(language: DW_LANG_C11, file: !669, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !670, globals: !671, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "/home/raj/lwan/techempower/array.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "79cde9f1ffc1fe5a96c4d9e5d598c54f")
!670 = !{!468, !235}
!671 = !{!0, !7, !12}
!672 = distinct !DICompileUnit(language: DW_LANG_C11, file: !673, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, retainedTypes: !730, globals: !1069, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "/home/raj/lwan/techempower/database.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "b1863d3de4d8cddd800a4bd2ab6539b0")
!674 = !{!675, !712, !719, !724}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "enum_field_types", file: !676, line: 53, baseType: !241, size: 32, elements: !677)
!676 = !DIFile(filename: "/usr/include/mysql/field_types.h", directory: "", checksumkind: CSK_MD5, checksum: "1dac89ddf305112c87b3c4620861815a")
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!678 = !DIEnumerator(name: "MYSQL_TYPE_DECIMAL", value: 0)
!679 = !DIEnumerator(name: "MYSQL_TYPE_TINY", value: 1)
!680 = !DIEnumerator(name: "MYSQL_TYPE_SHORT", value: 2)
!681 = !DIEnumerator(name: "MYSQL_TYPE_LONG", value: 3)
!682 = !DIEnumerator(name: "MYSQL_TYPE_FLOAT", value: 4)
!683 = !DIEnumerator(name: "MYSQL_TYPE_DOUBLE", value: 5)
!684 = !DIEnumerator(name: "MYSQL_TYPE_NULL", value: 6)
!685 = !DIEnumerator(name: "MYSQL_TYPE_TIMESTAMP", value: 7)
!686 = !DIEnumerator(name: "MYSQL_TYPE_LONGLONG", value: 8)
!687 = !DIEnumerator(name: "MYSQL_TYPE_INT24", value: 9)
!688 = !DIEnumerator(name: "MYSQL_TYPE_DATE", value: 10)
!689 = !DIEnumerator(name: "MYSQL_TYPE_TIME", value: 11)
!690 = !DIEnumerator(name: "MYSQL_TYPE_DATETIME", value: 12)
!691 = !DIEnumerator(name: "MYSQL_TYPE_YEAR", value: 13)
!692 = !DIEnumerator(name: "MYSQL_TYPE_NEWDATE", value: 14)
!693 = !DIEnumerator(name: "MYSQL_TYPE_VARCHAR", value: 15)
!694 = !DIEnumerator(name: "MYSQL_TYPE_BIT", value: 16)
!695 = !DIEnumerator(name: "MYSQL_TYPE_TIMESTAMP2", value: 17)
!696 = !DIEnumerator(name: "MYSQL_TYPE_DATETIME2", value: 18)
!697 = !DIEnumerator(name: "MYSQL_TYPE_TIME2", value: 19)
!698 = !DIEnumerator(name: "MYSQL_TYPE_TYPED_ARRAY", value: 20)
!699 = !DIEnumerator(name: "MYSQL_TYPE_INVALID", value: 243)
!700 = !DIEnumerator(name: "MYSQL_TYPE_BOOL", value: 244)
!701 = !DIEnumerator(name: "MYSQL_TYPE_JSON", value: 245)
!702 = !DIEnumerator(name: "MYSQL_TYPE_NEWDECIMAL", value: 246)
!703 = !DIEnumerator(name: "MYSQL_TYPE_ENUM", value: 247)
!704 = !DIEnumerator(name: "MYSQL_TYPE_SET", value: 248)
!705 = !DIEnumerator(name: "MYSQL_TYPE_TINY_BLOB", value: 249)
!706 = !DIEnumerator(name: "MYSQL_TYPE_MEDIUM_BLOB", value: 250)
!707 = !DIEnumerator(name: "MYSQL_TYPE_LONG_BLOB", value: 251)
!708 = !DIEnumerator(name: "MYSQL_TYPE_BLOB", value: 252)
!709 = !DIEnumerator(name: "MYSQL_TYPE_VAR_STRING", value: 253)
!710 = !DIEnumerator(name: "MYSQL_TYPE_STRING", value: 254)
!711 = !DIEnumerator(name: "MYSQL_TYPE_GEOMETRY", value: 255)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mysql_status", file: !713, line: 256, baseType: !241, size: 32, elements: !714)
!713 = !DIFile(filename: "/usr/include/mysql/mysql.h", directory: "", checksumkind: CSK_MD5, checksum: "1247b3d6239b685fabf3391bf8ffe6e9")
!714 = !{!715, !716, !717, !718}
!715 = !DIEnumerator(name: "MYSQL_STATUS_READY", value: 0)
!716 = !DIEnumerator(name: "MYSQL_STATUS_GET_RESULT", value: 1)
!717 = !DIEnumerator(name: "MYSQL_STATUS_USE_RESULT", value: 2)
!718 = !DIEnumerator(name: "MYSQL_STATUS_STATEMENT_GET_RESULT", value: 3)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "enum_resultset_metadata", file: !720, line: 1024, baseType: !241, size: 32, elements: !721)
!720 = !DIFile(filename: "/usr/include/mysql/mysql_com.h", directory: "", checksumkind: CSK_MD5, checksum: "948b54ebe3c9fc7d454d9a6494ddab54")
!721 = !{!722, !723}
!722 = !DIEnumerator(name: "RESULTSET_METADATA_NONE", value: 0)
!723 = !DIEnumerator(name: "RESULTSET_METADATA_FULL", value: 1)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "enum_mysql_stmt_state", file: !713, line: 586, baseType: !241, size: 32, elements: !725)
!725 = !{!726, !727, !728, !729}
!726 = !DIEnumerator(name: "MYSQL_STMT_INIT_DONE", value: 1)
!727 = !DIEnumerator(name: "MYSQL_STMT_PREPARE_DONE", value: 2)
!728 = !DIEnumerator(name: "MYSQL_STMT_EXECUTE_DONE", value: 3)
!729 = !DIEnumerator(name: "MYSQL_STMT_FETCH_DONE", value: 4)
!730 = !{!731, !468, !772, !951, !742, !953, !1048, !1057, !235, !1059, !319, !1068}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db", file: !20, line: 33, size: 128, elements: !733)
!733 = !{!734, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !732, file: !20, line: 34, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !731}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !732, file: !20, line: 35, baseType: !739, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !769, !437, !771}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_stmt", file: !20, line: 27, size: 192, elements: !744)
!744 = !{!745, !761, !765}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bind", scope: !743, file: !20, line: 28, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!473, !749, !751, !463}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_row", file: !388, line: 27, size: 192, elements: !753)
!753 = !{!754, !759, !760}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !752, file: !388, line: 31, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !752, file: !388, line: 28, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !755, file: !388, line: 29, baseType: !319, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !755, file: !388, line: 30, baseType: !235, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !752, file: !388, line: 32, baseType: !4, size: 8, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !752, file: !388, line: 33, baseType: !463, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !743, file: !20, line: 29, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!473, !749, !751}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !743, file: !20, line: 30, baseType: !766, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !742}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_mysql", file: !20, line: 40, size: 192, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !773, file: !20, line: 41, baseType: !732, size: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "con", scope: !773, file: !20, line: 42, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL", file: !713, line: 337, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL", file: !713, line: 299, size: 9280, elements: !780)
!780 = !{!781, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !833, !859, !862, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !925, !926, !927, !928, !929, !933, !943, !947, !948, !950}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "net", scope: !779, file: !713, line: 300, baseType: !782, size: 5312)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET", file: !720, line: 947, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET", file: !720, line: 914, size: 5312, elements: !784)
!784 = !{!785, !788, !791, !792, !793, !794, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !810, !811, !812, !813, !814, !815, !819, !820}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "vio", scope: !783, file: !720, line: 915, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vio", file: !720, line: 894, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !783, file: !720, line: 916, baseType: !789, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "buff_end", scope: !783, file: !720, line: 916, baseType: !789, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !783, file: !720, line: 916, baseType: !789, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !783, file: !720, line: 916, baseType: !789, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !783, file: !720, line: 917, baseType: !795, size: 32, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_socket", file: !713, line: 65, baseType: !235)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "remain_in_buf", scope: !783, file: !720, line: 923, baseType: !465, size: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !783, file: !720, line: 923, baseType: !465, size: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "buf_length", scope: !783, file: !720, line: 923, baseType: !465, size: 64, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "where_b", scope: !783, file: !720, line: 923, baseType: !465, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet", scope: !783, file: !720, line: 924, baseType: !465, size: 64, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !783, file: !720, line: 924, baseType: !465, size: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_nr", scope: !783, file: !720, line: 925, baseType: !241, size: 32, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "compress_pkt_nr", scope: !783, file: !720, line: 925, baseType: !241, size: 32, offset: 800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "write_timeout", scope: !783, file: !720, line: 926, baseType: !241, size: 32, offset: 832)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !783, file: !720, line: 926, baseType: !241, size: 32, offset: 864)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !783, file: !720, line: 926, baseType: !241, size: 32, offset: 896)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fcntl", scope: !783, file: !720, line: 927, baseType: !235, size: 32, offset: 928)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "return_status", scope: !783, file: !720, line: 928, baseType: !809, size: 64, offset: 960)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reading_or_writing", scope: !783, file: !720, line: 929, baseType: !790, size: 8, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "save_char", scope: !783, file: !720, line: 930, baseType: !790, size: 8, offset: 1032)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !783, file: !720, line: 931, baseType: !473, size: 8, offset: 1040)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "last_errno", scope: !783, file: !720, line: 932, baseType: !241, size: 32, offset: 1056)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !783, file: !720, line: 933, baseType: !790, size: 8, offset: 1088)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !783, file: !720, line: 935, baseType: !816, size: 4096, offset: 1096)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4096, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sqlstate", scope: !783, file: !720, line: 937, baseType: !155, size: 48, offset: 5192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !783, file: !720, line: 946, baseType: !468, size: 64, offset: 5248)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "connector_fd", scope: !779, file: !713, line: 301, baseType: !789, size: 64, offset: 5312)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !779, file: !713, line: 302, baseType: !319, size: 64, offset: 5376)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !779, file: !713, line: 302, baseType: !319, size: 64, offset: 5440)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !779, file: !713, line: 302, baseType: !319, size: 64, offset: 5504)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !779, file: !713, line: 302, baseType: !319, size: 64, offset: 5568)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "server_version", scope: !779, file: !713, line: 302, baseType: !319, size: 64, offset: 5632)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "host_info", scope: !779, file: !713, line: 302, baseType: !319, size: 64, offset: 5696)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !779, file: !713, line: 303, baseType: !319, size: 64, offset: 5760)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !779, file: !713, line: 303, baseType: !319, size: 64, offset: 5824)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !779, file: !713, line: 304, baseType: !831, size: 64, offset: 5888)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "CHARSET_INFO", file: !713, line: 304, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !779, file: !713, line: 305, baseType: !834, size: 64, offset: 5952)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_FIELD", file: !713, line: 143, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_FIELD", file: !713, line: 121, size: 1024, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !713, line: 122, baseType: !319, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "org_name", scope: !836, file: !713, line: 123, baseType: !319, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !836, file: !713, line: 124, baseType: !319, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "org_table", scope: !836, file: !713, line: 125, baseType: !319, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !836, file: !713, line: 126, baseType: !319, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !836, file: !713, line: 127, baseType: !319, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !836, file: !713, line: 128, baseType: !319, size: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !836, file: !713, line: 129, baseType: !465, size: 64, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !836, file: !713, line: 130, baseType: !465, size: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name_length", scope: !836, file: !713, line: 131, baseType: !241, size: 32, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "org_name_length", scope: !836, file: !713, line: 132, baseType: !241, size: 32, offset: 608)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "table_length", scope: !836, file: !713, line: 133, baseType: !241, size: 32, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "org_table_length", scope: !836, file: !713, line: 134, baseType: !241, size: 32, offset: 672)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "db_length", scope: !836, file: !713, line: 135, baseType: !241, size: 32, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "catalog_length", scope: !836, file: !713, line: 136, baseType: !241, size: 32, offset: 736)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "def_length", scope: !836, file: !713, line: 137, baseType: !241, size: 32, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !836, file: !713, line: 138, baseType: !241, size: 32, offset: 800)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "decimals", scope: !836, file: !713, line: 139, baseType: !241, size: 32, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "charsetnr", scope: !836, file: !713, line: 140, baseType: !241, size: 32, offset: 864)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !836, file: !713, line: 141, baseType: !675, size: 32, offset: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !836, file: !713, line: 142, baseType: !468, size: 64, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "field_alloc", scope: !779, file: !713, line: 306, baseType: !860, size: 64, offset: 6016)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_ROOT", file: !713, line: 161, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "affected_rows", scope: !779, file: !713, line: 307, baseType: !863, size: 64, offset: 6080)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !864, line: 27, baseType: !865)
!864 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !443, line: 45, baseType: !465)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "insert_id", scope: !779, file: !713, line: 308, baseType: !863, size: 64, offset: 6144)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "extra_info", scope: !779, file: !713, line: 309, baseType: !863, size: 64, offset: 6208)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !779, file: !713, line: 310, baseType: !465, size: 64, offset: 6272)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !779, file: !713, line: 311, baseType: !465, size: 64, offset: 6336)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !779, file: !713, line: 312, baseType: !241, size: 32, offset: 6400)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "client_flag", scope: !779, file: !713, line: 313, baseType: !465, size: 64, offset: 6464)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "server_capabilities", scope: !779, file: !713, line: 313, baseType: !465, size: 64, offset: 6528)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !779, file: !713, line: 314, baseType: !241, size: 32, offset: 6592)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !779, file: !713, line: 315, baseType: !241, size: 32, offset: 6624)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "server_status", scope: !779, file: !713, line: 316, baseType: !241, size: 32, offset: 6656)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "server_language", scope: !779, file: !713, line: 317, baseType: !241, size: 32, offset: 6688)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "warning_count", scope: !779, file: !713, line: 318, baseType: !241, size: 32, offset: 6720)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !779, file: !713, line: 319, baseType: !879, size: 1920, offset: 6784)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "st_mysql_options", file: !713, line: 225, size: 1920, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !915, !919, !920, !921, !922}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "connect_timeout", scope: !879, file: !713, line: 226, baseType: !241, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !879, file: !713, line: 226, baseType: !241, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "write_timeout", scope: !879, file: !713, line: 226, baseType: !241, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !879, file: !713, line: 227, baseType: !241, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !879, file: !713, line: 227, baseType: !241, size: 32, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "client_flag", scope: !879, file: !713, line: 228, baseType: !465, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !879, file: !713, line: 229, baseType: !319, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !879, file: !713, line: 229, baseType: !319, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !879, file: !713, line: 229, baseType: !319, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !879, file: !713, line: 229, baseType: !319, size: 64, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !879, file: !713, line: 229, baseType: !319, size: 64, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "init_commands", scope: !879, file: !713, line: 230, baseType: !893, size: 64, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Init_commands_array", file: !713, line: 230, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "my_cnf_file", scope: !879, file: !713, line: 231, baseType: !319, size: 64, offset: 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "my_cnf_group", scope: !879, file: !713, line: 231, baseType: !319, size: 64, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "charset_dir", scope: !879, file: !713, line: 231, baseType: !319, size: 64, offset: 768)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "charset_name", scope: !879, file: !713, line: 231, baseType: !319, size: 64, offset: 832)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_key", scope: !879, file: !713, line: 232, baseType: !319, size: 64, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_cert", scope: !879, file: !713, line: 233, baseType: !319, size: 64, offset: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ca", scope: !879, file: !713, line: 234, baseType: !319, size: 64, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_capath", scope: !879, file: !713, line: 235, baseType: !319, size: 64, offset: 1088)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_cipher", scope: !879, file: !713, line: 236, baseType: !319, size: 64, offset: 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory_base_name", scope: !879, file: !713, line: 237, baseType: !319, size: 64, offset: 1216)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "max_allowed_packet", scope: !879, file: !713, line: 238, baseType: !465, size: 64, offset: 1280)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !879, file: !713, line: 239, baseType: !473, size: 8, offset: 1344)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "named_pipe", scope: !879, file: !713, line: 239, baseType: !473, size: 8, offset: 1352)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "bind_address", scope: !879, file: !713, line: 243, baseType: !319, size: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "report_data_truncation", scope: !879, file: !713, line: 245, baseType: !473, size: 8, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_init", scope: !879, file: !713, line: 248, baseType: !911, size: 64, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!235, !914, !437, !468}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_read", scope: !879, file: !713, line: 249, baseType: !916, size: 64, offset: 1600)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!235, !468, !319, !241}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_end", scope: !879, file: !713, line: 250, baseType: !555, size: 64, offset: 1664)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_error", scope: !879, file: !713, line: 251, baseType: !916, size: 64, offset: 1728)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_userdata", scope: !879, file: !713, line: 252, baseType: !468, size: 64, offset: 1792)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !879, file: !713, line: 253, baseType: !923, size: 64, offset: 1856)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "st_mysql_options_extention", file: !713, line: 223, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !779, file: !713, line: 320, baseType: !712, size: 32, offset: 8704)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "resultset_metadata", scope: !779, file: !713, line: 321, baseType: !719, size: 32, offset: 8736)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !779, file: !713, line: 322, baseType: !473, size: 8, offset: 8768)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect", scope: !779, file: !713, line: 323, baseType: !473, size: 8, offset: 8776)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "scramble", scope: !779, file: !713, line: 326, baseType: !930, size: 168, offset: 8784)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 21)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stmts", scope: !779, file: !713, line: 328, baseType: !934, size: 64, offset: 8960)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST", file: !936, line: 39, baseType: !937)
!936 = !DIFile(filename: "/usr/include/mysql/my_list.h", directory: "", checksumkind: CSK_MD5, checksum: "2c916b19e4f514cea577a95404bf2fb6")
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LIST", file: !936, line: 36, size: 192, elements: !938)
!938 = !{!939, !941, !942}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !937, file: !936, line: 37, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !936, line: 37, baseType: !940, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !937, file: !936, line: 38, baseType: !468, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !779, file: !713, line: 329, baseType: !944, size: 64, offset: 9024)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_METHODS", file: !713, line: 296, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "thd", scope: !779, file: !713, line: 330, baseType: !468, size: 64, offset: 9088)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "unbuffered_fetch_owner", scope: !779, file: !713, line: 335, baseType: !949, size: 64, offset: 9152)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !779, file: !713, line: 336, baseType: !468, size: 64, offset: 9216)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_stmt_mysql", file: !20, line: 45, size: 448, elements: !955)
!955 = !{!956, !957, !1045, !1046, !1047}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !954, file: !20, line: 46, baseType: !743, size: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !954, file: !20, line: 47, baseType: !958, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_STMT", file: !713, line: 726, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_STMT", file: !713, line: 683, size: 5632, elements: !961)
!961 = !{!962, !963, !964, !965, !999, !1000, !1001, !1019, !1020, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "mem_root", scope: !960, file: !713, line: 684, baseType: !860, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !960, file: !713, line: 685, baseType: !935, size: 192, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "mysql", scope: !960, file: !713, line: 686, baseType: !777, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !960, file: !713, line: 687, baseType: !966, size: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_BIND", file: !713, line: 678, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_BIND", file: !713, line: 656, size: 896, elements: !969)
!969 = !{!970, !972, !973, !974, !975, !976, !982, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !968, file: !713, line: 657, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "is_null", scope: !968, file: !713, line: 658, baseType: !949, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !968, file: !713, line: 659, baseType: !468, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !968, file: !713, line: 661, baseType: !949, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "row_ptr", scope: !968, file: !713, line: 662, baseType: !789, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "store_param_func", scope: !968, file: !713, line: 663, baseType: !977, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !980, !981}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_result", scope: !968, file: !713, line: 664, baseType: !983, size: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !981, !834, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "skip_result", scope: !968, file: !713, line: 665, baseType: !983, size: 64, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !968, file: !713, line: 667, baseType: !465, size: 64, offset: 512)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !968, file: !713, line: 668, baseType: !465, size: 64, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "length_value", scope: !968, file: !713, line: 669, baseType: !465, size: 64, offset: 640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "param_number", scope: !968, file: !713, line: 670, baseType: !241, size: 32, offset: 704)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pack_length", scope: !968, file: !713, line: 671, baseType: !241, size: 32, offset: 736)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_type", scope: !968, file: !713, line: 672, baseType: !675, size: 32, offset: 768)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "error_value", scope: !968, file: !713, line: 673, baseType: !473, size: 8, offset: 800)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "is_unsigned", scope: !968, file: !713, line: 674, baseType: !473, size: 8, offset: 808)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "long_data_used", scope: !968, file: !713, line: 675, baseType: !473, size: 8, offset: 816)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "is_null_value", scope: !968, file: !713, line: 676, baseType: !473, size: 8, offset: 824)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !968, file: !713, line: 677, baseType: !468, size: 64, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "bind", scope: !960, file: !713, line: 688, baseType: !966, size: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !960, file: !713, line: 689, baseType: !834, size: 64, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !960, file: !713, line: 690, baseType: !1002, size: 256, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_DATA", file: !713, line: 168, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_DATA", file: !713, line: 163, size: 256, elements: !1004)
!1004 = !{!1005, !1016, !1017, !1018}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1003, file: !713, line: 164, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_ROWS", file: !713, line: 157, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_ROWS", file: !713, line: 153, size: 192, elements: !1009)
!1009 = !{!1010, !1012, !1015}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1008, file: !713, line: 154, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1008, file: !713, line: 155, baseType: !1013, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_ROW", file: !713, line: 145, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1008, file: !713, line: 156, baseType: !465, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1003, file: !713, line: 165, baseType: !860, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1003, file: !713, line: 166, baseType: !863, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !1003, file: !713, line: 167, baseType: !241, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "data_cursor", scope: !960, file: !713, line: 691, baseType: !1006, size: 64, offset: 768)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_func", scope: !960, file: !713, line: 696, baseType: !1021, size: 64, offset: 832)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!235, !1024, !986}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "affected_rows", scope: !960, file: !713, line: 698, baseType: !863, size: 64, offset: 896)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "insert_id", scope: !960, file: !713, line: 699, baseType: !863, size: 64, offset: 960)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_id", scope: !960, file: !713, line: 700, baseType: !465, size: 64, offset: 1024)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !960, file: !713, line: 701, baseType: !465, size: 64, offset: 1088)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "prefetch_rows", scope: !960, file: !713, line: 702, baseType: !465, size: 64, offset: 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "server_status", scope: !960, file: !713, line: 707, baseType: !241, size: 32, offset: 1216)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "last_errno", scope: !960, file: !713, line: 708, baseType: !241, size: 32, offset: 1248)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !960, file: !713, line: 709, baseType: !241, size: 32, offset: 1280)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !960, file: !713, line: 710, baseType: !241, size: 32, offset: 1312)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !960, file: !713, line: 711, baseType: !724, size: 32, offset: 1344)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !960, file: !713, line: 712, baseType: !816, size: 4096, offset: 1376)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "sqlstate", scope: !960, file: !713, line: 713, baseType: !155, size: 48, offset: 5472)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "send_types_to_server", scope: !960, file: !713, line: 715, baseType: !473, size: 8, offset: 5520)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "bind_param_done", scope: !960, file: !713, line: 716, baseType: !473, size: 8, offset: 5528)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "bind_result_done", scope: !960, file: !713, line: 717, baseType: !790, size: 8, offset: 5536)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "unbuffered_fetch_cancelled", scope: !960, file: !713, line: 719, baseType: !473, size: 8, offset: 5544)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "update_max_length", scope: !960, file: !713, line: 724, baseType: !473, size: 8, offset: 5552)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !960, file: !713, line: 725, baseType: !1043, size: 64, offset: 5568)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_STMT_EXT", file: !713, line: 680, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "param_bind", scope: !954, file: !20, line: 48, baseType: !966, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "result_bind", scope: !954, file: !20, line: 49, baseType: !966, size: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "must_execute_again", scope: !954, file: !20, line: 50, baseType: !473, size: 8, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_sqlite", file: !20, line: 219, size: 192, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1049, file: !20, line: 220, baseType: !732, size: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "sqlite", scope: !1049, file: !20, line: 221, baseType: !1053, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3", file: !1055, line: 272, baseType: !1056)
!1055 = !DIFile(filename: "/usr/include/sqlite3.h", directory: "", checksumkind: CSK_MD5, checksum: "a588c4681dc2c3e9f3424818d7f39d50")
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", file: !1055, line: 272, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "db_stmt_sqlite", file: !20, line: 224, size: 256, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1061, file: !20, line: 225, baseType: !743, size: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sqlite", scope: !1061, file: !20, line: 226, baseType: !1065, size: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !1055, line: 3892, baseType: !1067)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !1055, line: 3892, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1069 = !{!18}
!1070 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1071, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1072, retainedTypes: !1073, globals: !1103, splitDebugInlining: false, nameTableKind: None)
!1071 = !DIFile(filename: "/home/raj/lwan/techempower/json.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "d64628e550f4ff405dab1a8e75d14b8c")
!1072 = !{!289}
!1073 = !{!468, !235, !319, !463, !1074, !4, !1096, !1098, !789, !790, !1101}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "JsonNode", file: !290, line: 38, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JsonNode", file: !290, line: 40, size: 448, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1084}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1076, file: !290, line: 43, baseType: !1074, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1076, file: !290, line: 44, baseType: !1074, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1076, file: !290, line: 44, baseType: !1074, size: 64, offset: 128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1076, file: !290, line: 47, baseType: !319, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1076, file: !290, line: 49, baseType: !1083, size: 32, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "JsonTag", file: !290, line: 36, baseType: !289)
!1084 = !DIDerivedType(tag: DW_TAG_member, scope: !1076, file: !290, line: 50, baseType: !1085, size: 128, offset: 320)
!1085 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1076, file: !290, line: 50, size: 128, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1091}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "bool_", scope: !1085, file: !290, line: 52, baseType: !473, size: 8)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "string_", scope: !1085, file: !290, line: 55, baseType: !319, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "number_", scope: !1085, file: !290, line: 58, baseType: !1090, size: 64)
!1090 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1085, file: !290, line: 64, baseType: !1092, size: 128)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1085, file: !290, line: 62, size: 128, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1092, file: !290, line: 63, baseType: !1074, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1092, file: !290, line: 63, baseType: !1074, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !864, line: 25, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !443, line: 40, baseType: !565)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar_t", file: !26, line: 127, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !864, line: 26, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !443, line: 42, baseType: !241)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!1103 = !{!24, !30, !35, !40, !45, !50, !55, !60, !65, !70, !72, !77, !82, !87, !92, !97, !99, !104, !106, !111, !116, !121, !126, !131, !133, !138, !140, !145, !148, !151, !153, !158, !160, !165, !170, !172, !174, !176, !181, !186, !188, !190, !195, !197, !199, !201, !206, !208, !210, !212, !217, !222, !224}
!1104 = !{!"clang version 16.0.0"}
!1105 = !{i32 7, !"Dwarf Version", i32 5}
!1106 = !{i32 2, !"Debug Info Version", i32 3}
!1107 = !{i32 1, !"wchar_size", i32 4}
!1108 = !{i32 8, !"PIC Level", i32 2}
!1109 = !{i32 7, !"PIE Level", i32 2}
!1110 = !{i32 7, !"uwtable", i32 2}
!1111 = !{i32 7, !"frame-pointer", i32 2}
!1112 = distinct !DISubprogram(name: "array_init", scope: !2, file: !2, line: 43, type: !1113, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !668, retainedNodes: !480)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !1115, !463}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "array", file: !1117, line: 9, size: 256, elements: !1118)
!1117 = !DIFile(filename: "techempower/array.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "e322a465531025820950d0b6769ca0f7")
!1118 = !{!1119, !1120, !1121, !1122}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1116, file: !1117, line: 10, baseType: !914, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1116, file: !1117, line: 11, baseType: !463, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1116, file: !1117, line: 12, baseType: !463, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1116, file: !1117, line: 13, baseType: !463, size: 64, offset: 192)
!1123 = !DILocalVariable(name: "array", arg: 1, scope: !1112, file: !2, line: 43, type: !1115)
!1124 = !DILocation(line: 43, column: 31, scope: !1112)
!1125 = !DILocalVariable(name: "step", arg: 2, scope: !1112, file: !2, line: 43, type: !463)
!1126 = !DILocation(line: 43, column: 45, scope: !1112)
!1127 = !DILocation(line: 45, column: 2, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !2, line: 45, column: 2)
!1129 = distinct !DILexicalBlock(scope: !1112, file: !2, line: 45, column: 2)
!1130 = !DILocation(line: 45, column: 2, scope: !1129)
!1131 = !DILocation(line: 46, column: 2, scope: !1112)
!1132 = !DILocation(line: 46, column: 9, scope: !1112)
!1133 = !DILocation(line: 46, column: 15, scope: !1112)
!1134 = !DILocation(line: 47, column: 2, scope: !1112)
!1135 = !DILocation(line: 47, column: 9, scope: !1112)
!1136 = !DILocation(line: 47, column: 15, scope: !1112)
!1137 = !DILocation(line: 48, column: 2, scope: !1112)
!1138 = !DILocation(line: 48, column: 9, scope: !1112)
!1139 = !DILocation(line: 48, column: 15, scope: !1112)
!1140 = !DILocation(line: 49, column: 16, scope: !1112)
!1141 = !DILocation(line: 49, column: 2, scope: !1112)
!1142 = !DILocation(line: 49, column: 9, scope: !1112)
!1143 = !DILocation(line: 49, column: 14, scope: !1112)
!1144 = !DILocation(line: 50, column: 1, scope: !1112)
!1145 = distinct !DISubprogram(name: "array_append", scope: !2, file: !2, line: 52, type: !1146, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !668, retainedNodes: !480)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!235, !1115, !1148}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1150 = !DILocalVariable(name: "array", arg: 1, scope: !1145, file: !2, line: 52, type: !1115)
!1151 = !DILocation(line: 52, column: 32, scope: !1145)
!1152 = !DILocalVariable(name: "element", arg: 2, scope: !1145, file: !2, line: 52, type: !1148)
!1153 = !DILocation(line: 52, column: 51, scope: !1145)
!1154 = !DILocalVariable(name: "idx", scope: !1145, file: !2, line: 54, type: !463)
!1155 = !DILocation(line: 54, column: 9, scope: !1145)
!1156 = !DILocation(line: 56, column: 6, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 56, column: 6)
!1158 = !DILocation(line: 56, column: 13, scope: !1157)
!1159 = !DILocation(line: 56, column: 19, scope: !1157)
!1160 = !DILocation(line: 56, column: 26, scope: !1157)
!1161 = !DILocation(line: 56, column: 33, scope: !1157)
!1162 = !DILocation(line: 56, column: 23, scope: !1157)
!1163 = !DILocation(line: 56, column: 6, scope: !1145)
!1164 = !DILocalVariable(name: "r", scope: !1165, file: !2, line: 57, type: !235)
!1165 = distinct !DILexicalBlock(scope: !1157, file: !2, line: 56, column: 40)
!1166 = !DILocation(line: 57, column: 7, scope: !1165)
!1167 = !DILocation(line: 57, column: 25, scope: !1165)
!1168 = !DILocation(line: 57, column: 32, scope: !1165)
!1169 = !DILocation(line: 57, column: 39, scope: !1165)
!1170 = !DILocation(line: 57, column: 47, scope: !1165)
!1171 = !DILocation(line: 57, column: 54, scope: !1165)
!1172 = !DILocation(line: 57, column: 45, scope: !1165)
!1173 = !DILocation(line: 57, column: 11, scope: !1165)
!1174 = !DILocation(line: 58, column: 7, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1165, file: !2, line: 58, column: 7)
!1176 = !DILocation(line: 58, column: 9, scope: !1175)
!1177 = !DILocation(line: 58, column: 7, scope: !1165)
!1178 = !DILocation(line: 59, column: 11, scope: !1175)
!1179 = !DILocation(line: 59, column: 4, scope: !1175)
!1180 = !DILocation(line: 60, column: 2, scope: !1165)
!1181 = !DILocation(line: 61, column: 8, scope: !1145)
!1182 = !DILocation(line: 61, column: 15, scope: !1145)
!1183 = !DILocation(line: 61, column: 6, scope: !1145)
!1184 = !DILocation(line: 62, column: 30, scope: !1145)
!1185 = !DILocation(line: 62, column: 2, scope: !1145)
!1186 = !DILocation(line: 62, column: 9, scope: !1145)
!1187 = !DILocation(line: 62, column: 15, scope: !1145)
!1188 = !DILocation(line: 62, column: 20, scope: !1145)
!1189 = !DILocation(line: 63, column: 2, scope: !1145)
!1190 = !DILocation(line: 63, column: 9, scope: !1145)
!1191 = !DILocation(line: 63, column: 14, scope: !1145)
!1192 = !DILocation(line: 64, column: 14, scope: !1145)
!1193 = !DILocation(line: 64, column: 9, scope: !1145)
!1194 = !DILocation(line: 64, column: 2, scope: !1145)
!1195 = !DILocation(line: 65, column: 1, scope: !1145)
!1196 = distinct !DISubprogram(name: "array_realloc", scope: !2, file: !2, line: 33, type: !1197, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !668, retainedNodes: !480)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!235, !1115, !463}
!1199 = !DILocalVariable(name: "array", arg: 1, scope: !1196, file: !2, line: 33, type: !1115)
!1200 = !DILocation(line: 33, column: 40, scope: !1196)
!1201 = !DILocalVariable(name: "new_total", arg: 2, scope: !1196, file: !2, line: 33, type: !463)
!1202 = !DILocation(line: 33, column: 54, scope: !1196)
!1203 = !DILocalVariable(name: "tmp", scope: !1196, file: !2, line: 35, type: !468)
!1204 = !DILocation(line: 35, column: 8, scope: !1196)
!1205 = !DILocation(line: 35, column: 27, scope: !1196)
!1206 = !DILocation(line: 35, column: 34, scope: !1196)
!1207 = !DILocation(line: 35, column: 57, scope: !1196)
!1208 = !DILocation(line: 35, column: 14, scope: !1196)
!1209 = !DILocation(line: 36, column: 6, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1196, file: !2, line: 36, column: 6)
!1211 = !DILocation(line: 36, column: 10, scope: !1210)
!1212 = !DILocation(line: 36, column: 6, scope: !1196)
!1213 = !DILocation(line: 37, column: 3, scope: !1210)
!1214 = !DILocation(line: 38, column: 17, scope: !1196)
!1215 = !DILocation(line: 38, column: 2, scope: !1196)
!1216 = !DILocation(line: 38, column: 9, scope: !1196)
!1217 = !DILocation(line: 38, column: 15, scope: !1196)
!1218 = !DILocation(line: 39, column: 17, scope: !1196)
!1219 = !DILocation(line: 39, column: 2, scope: !1196)
!1220 = !DILocation(line: 39, column: 9, scope: !1196)
!1221 = !DILocation(line: 39, column: 15, scope: !1196)
!1222 = !DILocation(line: 40, column: 2, scope: !1196)
!1223 = !DILocation(line: 41, column: 1, scope: !1196)
!1224 = distinct !DISubprogram(name: "array_append_unique", scope: !2, file: !2, line: 67, type: !1146, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !668, retainedNodes: !480)
!1225 = !DILocalVariable(name: "array", arg: 1, scope: !1224, file: !2, line: 67, type: !1115)
!1226 = !DILocation(line: 67, column: 39, scope: !1224)
!1227 = !DILocalVariable(name: "element", arg: 2, scope: !1224, file: !2, line: 67, type: !1148)
!1228 = !DILocation(line: 67, column: 58, scope: !1224)
!1229 = !DILocalVariable(name: "itr", scope: !1224, file: !2, line: 69, type: !914)
!1230 = !DILocation(line: 69, column: 9, scope: !1224)
!1231 = !DILocation(line: 69, column: 15, scope: !1224)
!1232 = !DILocation(line: 69, column: 22, scope: !1224)
!1233 = !DILocalVariable(name: "itr_end", scope: !1224, file: !2, line: 70, type: !914)
!1234 = !DILocation(line: 70, column: 9, scope: !1224)
!1235 = !DILocation(line: 70, column: 19, scope: !1224)
!1236 = !DILocation(line: 70, column: 25, scope: !1224)
!1237 = !DILocation(line: 70, column: 32, scope: !1224)
!1238 = !DILocation(line: 70, column: 23, scope: !1224)
!1239 = !DILocation(line: 71, column: 2, scope: !1224)
!1240 = !DILocation(line: 71, column: 9, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 71, column: 2)
!1242 = distinct !DILexicalBlock(scope: !1224, file: !2, line: 71, column: 2)
!1243 = !DILocation(line: 71, column: 15, scope: !1241)
!1244 = !DILocation(line: 71, column: 13, scope: !1241)
!1245 = !DILocation(line: 71, column: 2, scope: !1242)
!1246 = !DILocation(line: 72, column: 8, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1241, file: !2, line: 72, column: 7)
!1248 = !DILocation(line: 72, column: 7, scope: !1247)
!1249 = !DILocation(line: 72, column: 15, scope: !1247)
!1250 = !DILocation(line: 72, column: 12, scope: !1247)
!1251 = !DILocation(line: 72, column: 7, scope: !1241)
!1252 = !DILocation(line: 73, column: 4, scope: !1247)
!1253 = !DILocation(line: 71, column: 27, scope: !1241)
!1254 = !DILocation(line: 71, column: 2, scope: !1241)
!1255 = distinct !{!1255, !1245, !1256, !1257}
!1256 = !DILocation(line: 73, column: 12, scope: !1242)
!1257 = !{!"llvm.loop.mustprogress"}
!1258 = !DILocation(line: 74, column: 22, scope: !1224)
!1259 = !DILocation(line: 74, column: 29, scope: !1224)
!1260 = !DILocation(line: 74, column: 9, scope: !1224)
!1261 = !DILocation(line: 74, column: 2, scope: !1224)
!1262 = !DILocation(line: 75, column: 1, scope: !1224)
!1263 = distinct !DISubprogram(name: "array_pop", scope: !2, file: !2, line: 77, type: !1264, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !668, retainedNodes: !480)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !1115}
!1266 = !DILocalVariable(name: "array", arg: 1, scope: !1263, file: !2, line: 77, type: !1115)
!1267 = !DILocation(line: 77, column: 30, scope: !1263)
!1268 = !DILocation(line: 78, column: 2, scope: !1263)
!1269 = !DILocation(line: 78, column: 9, scope: !1263)
!1270 = !DILocation(line: 78, column: 14, scope: !1263)
!1271 = !DILocation(line: 79, column: 6, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1263, file: !2, line: 79, column: 6)
!1273 = !DILocation(line: 79, column: 13, scope: !1272)
!1274 = !DILocation(line: 79, column: 21, scope: !1272)
!1275 = !DILocation(line: 79, column: 28, scope: !1272)
!1276 = !DILocation(line: 79, column: 19, scope: !1272)
!1277 = !DILocation(line: 79, column: 35, scope: !1272)
!1278 = !DILocation(line: 79, column: 42, scope: !1272)
!1279 = !DILocation(line: 79, column: 33, scope: !1272)
!1280 = !DILocation(line: 79, column: 6, scope: !1263)
!1281 = !DILocalVariable(name: "r", scope: !1282, file: !2, line: 80, type: !235)
!1282 = distinct !DILexicalBlock(scope: !1272, file: !2, line: 79, column: 49)
!1283 = !DILocation(line: 80, column: 7, scope: !1282)
