; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm ".text"
module asm "\09.p2align 4"
module asm "\09.globl coro_swapcontext"
module asm "\09coro_swapcontext:"
module asm "\09mov    %rbx,0(%rdi)"
module asm "\09mov    %rbp,8(%rdi)"
module asm "\09mov    %r12,16(%rdi)"
module asm "\09mov    %r13,24(%rdi)"
module asm "\09mov    %r14,32(%rdi)"
module asm "\09mov    %r15,40(%rdi)"
module asm "\09mov    %rdi,48(%rdi)"
module asm "\09mov    %rsi,56(%rdi)"
module asm "\09mov    (%rsp),%rcx"
module asm "\09mov    %rcx,64(%rdi)"
module asm "\09lea    0x8(%rsp),%rcx"
module asm "\09mov    %rcx,72(%rdi)"
module asm "\09mov    72(%rsi),%rsp"
module asm "\09mov    0(%rsi),%rbx"
module asm "\09mov    8(%rsi),%rbp"
module asm "\09mov    16(%rsi),%r12"
module asm "\09mov    24(%rsi),%r13"
module asm "\09mov    32(%rsi),%r14"
module asm "\09mov    40(%rsi),%r15"
module asm "\09mov    48(%rsi),%rdi"
module asm "\09mov    64(%rsi),%rcx"
module asm "\09mov    56(%rsi),%rsi"
module asm "\09jmp    *%rcx"
module asm "\09"

%struct.lwan_key_value_t_ = type { ptr, ptr }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.list_head = type { %struct.lwan_key_value_t_ }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.lwan_key_value_t_ }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "gif_beacon_data", scope: !2, file: !3, line: 43, type: !430, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "gif_beacon", scope: !3, file: !3, line: 35, type: !4, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !226, retainedNodes: !286)
!3 = !DIFile(filename: "lwan/main.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "c78d74bc8fb67729c69c747f37941a1b")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !27, !225, !111}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !7, line: 131, baseType: !8)
!7 = !DIFile(filename: "common/lwan.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "56f65bbbfce1c5452d6905964ca2b84f")
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 114, baseType: !9, size: 32, elements: !10)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !{!11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!11 = !DIEnumerator(name: "HTTP_OK", value: 200)
!12 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!13 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!14 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!15 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!16 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!17 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!18 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!19 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!20 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!21 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!22 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!23 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!24 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!25 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!26 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !7, line: 106, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !7, line: 206, size: 1280, elements: !30)
!30 = !{!31, !46, !47, !58, !59, !166, !177, !178, !190}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !7, line: 207, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !7, line: 156, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 145, baseType: !34, size: 32, elements: !35)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!36 = !DIEnumerator(name: "REQUEST_ALL_FLAGS", value: -1)
!37 = !DIEnumerator(name: "REQUEST_METHOD_GET", value: 1)
!38 = !DIEnumerator(name: "REQUEST_METHOD_HEAD", value: 2)
!39 = !DIEnumerator(name: "REQUEST_METHOD_POST", value: 4)
!40 = !DIEnumerator(name: "REQUEST_ACCEPT_DEFLATE", value: 8)
!41 = !DIEnumerator(name: "REQUEST_ACCEPT_GZIP", value: 16)
!42 = !DIEnumerator(name: "REQUEST_IS_HTTP_1_0", value: 32)
!43 = !DIEnumerator(name: "RESPONSE_SENT_HEADERS", value: 64)
!44 = !DIEnumerator(name: "RESPONSE_CHUNKED_ENCODING", value: 128)
!45 = !DIEnumerator(name: "RESPONSE_NO_CONTENT_LENGTH", value: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !29, file: !7, line: 208, baseType: !34, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !29, file: !7, line: 209, baseType: !48, size: 128, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !7, line: 110, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !7, line: 191, size: 128, elements: !50)
!50 = !{!51, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !49, file: !7, line: 192, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !7, line: 193, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!57 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !29, file: !7, line: 210, baseType: !48, size: 128, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !29, file: !7, line: 211, baseType: !60, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !7, line: 112, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !7, line: 196, size: 256, elements: !63)
!63 = !{!64, !74, !75, !80, !164, !165}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !62, file: !7, line: 199, baseType: !65, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !7, line: 165, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 158, baseType: !34, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIEnumerator(name: "CONN_MASK", value: -1)
!69 = !DIEnumerator(name: "CONN_KEEP_ALIVE", value: 1)
!70 = !DIEnumerator(name: "CONN_IS_ALIVE", value: 2)
!71 = !DIEnumerator(name: "CONN_SHOULD_RESUME_CORO", value: 4)
!72 = !DIEnumerator(name: "CONN_WRITE_EVENTS", value: 8)
!73 = !DIEnumerator(name: "CONN_MUST_READ", value: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !62, file: !7, line: 200, baseType: !9, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !62, file: !7, line: 201, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !78, line: 34, baseType: !79)
!78 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !78, line: 34, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !62, file: !7, line: 202, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !7, line: 108, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !7, line: 253, size: 832, elements: !84)
!84 = !{!85, !142, !156, !157, !161}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !83, file: !7, line: 254, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !7, line: 103, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !7, line: 275, size: 640, elements: !89)
!89 = !{!90, !118, !119, !126, !130, !141}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !88, file: !7, line: 276, baseType: !91, size: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !92, line: 25, baseType: !93)
!92 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !92, line: 41, size: 128, elements: !94)
!94 = !{!95, !114}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !93, file: !92, line: 42, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !92, line: 26, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !92, line: 29, size: 640, elements: !99)
!99 = !{!100, !104, !113}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !92, line: 30, baseType: !101, size: 512)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 512, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !98, file: !92, line: 31, baseType: !105, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !92, line: 27, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !92, line: 35, size: 192, elements: !108)
!108 = !{!109, !110, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !107, file: !92, line: 36, baseType: !52, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !92, line: 37, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !107, file: !92, line: 38, baseType: !105, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !98, file: !92, line: 32, baseType: !34, size: 32, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !93, file: !92, line: 43, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !111}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !88, file: !7, line: 277, baseType: !60, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !88, file: !7, line: 283, baseType: !120, size: 128, offset: 192)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !7, line: 279, size: 128, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !120, file: !7, line: 280, baseType: !81, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !120, file: !7, line: 281, baseType: !9, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !120, file: !7, line: 282, baseType: !125, size: 16, offset: 96)
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !88, file: !7, line: 285, baseType: !127, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !129, line: 6, flags: DIFlagFwdDecl)
!129 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !88, file: !7, line: 286, baseType: !131, size: 192, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !7, line: 111, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !7, line: 266, size: 192, elements: !133)
!133 = !{!134, !135, !136, !138, !139, !140}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !132, file: !7, line: 267, baseType: !52, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !132, file: !7, line: 268, baseType: !125, size: 16, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !132, file: !7, line: 269, baseType: !137, size: 8, offset: 80)
!137 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !132, file: !7, line: 270, baseType: !137, size: 8, offset: 88)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !132, file: !7, line: 271, baseType: !9, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !132, file: !7, line: 272, baseType: !125, size: 16, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !88, file: !7, line: 287, baseType: !34, size: 32, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !83, file: !7, line: 259, baseType: !143, size: 576, offset: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !7, line: 255, size: 576, elements: !144)
!144 = !{!145, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !143, file: !7, line: 256, baseType: !146, size: 240)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 240, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 30)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !143, file: !7, line: 257, baseType: !146, size: 240, offset: 240)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !143, file: !7, line: 258, baseType: !151, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !152, line: 10, baseType: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !154, line: 160, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!155 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !83, file: !7, line: 261, baseType: !34, size: 32, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !83, file: !7, line: 262, baseType: !158, size: 64, offset: 672)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 2)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !83, file: !7, line: 263, baseType: !162, size: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !163, line: 27, baseType: !57)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !62, file: !7, line: 203, baseType: !34, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !7, line: 203, baseType: !34, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !29, file: !7, line: 216, baseType: !167, size: 128, offset: 384)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !29, file: !7, line: 213, size: 128, elements: !168)
!168 = !{!169, !176}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !7, line: 214, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !7, line: 105, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !7, line: 173, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !172, file: !7, line: 174, baseType: !52, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !172, file: !7, line: 175, baseType: !52, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !167, file: !7, line: 215, baseType: !55, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !29, file: !7, line: 216, baseType: !167, size: 128, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !29, file: !7, line: 223, baseType: !179, size: 192, offset: 640)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !29, file: !7, line: 217, size: 192, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !179, file: !7, line: 218, baseType: !151, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !179, file: !7, line: 222, baseType: !183, size: 128, offset: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !179, file: !7, line: 219, size: 128, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !183, file: !7, line: 220, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !187, line: 85, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !154, line: 152, baseType: !155)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !183, file: !7, line: 221, baseType: !186, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !29, file: !7, line: 224, baseType: !191, size: 448, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !7, line: 107, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !7, line: 178, size: 448, elements: !193)
!193 = !{!194, !213, !214, !215, !216}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !192, file: !7, line: 179, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !197, line: 25, baseType: !198)
!197 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !197, line: 27, size: 256, elements: !199)
!199 = !{!200, !207, !212}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !198, file: !197, line: 31, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !197, line: 28, size: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !201, file: !197, line: 29, baseType: !52, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !201, file: !197, line: 30, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !198, file: !197, line: 34, baseType: !208, size: 128, offset: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !197, line: 32, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !208, file: !197, line: 33, baseType: !55, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !208, file: !197, line: 33, baseType: !55, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !197, line: 35, baseType: !9, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !192, file: !7, line: 180, baseType: !205, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !192, file: !7, line: 181, baseType: !55, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !192, file: !7, line: 182, baseType: !170, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !192, file: !7, line: 188, baseType: !217, size: 192, offset: 256)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !7, line: 184, size: 192, elements: !218)
!218 = !{!219, !223, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !217, file: !7, line: 185, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!6, !27, !111}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !7, line: 186, baseType: !111, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !217, file: !7, line: 187, baseType: !111, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!226 = distinct !DICompileUnit(language: DW_LANG_C11, file: !227, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !228, retainedTypes: !244, globals: !245, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "/home/raj/lwan/lwan/main.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "c78d74bc8fb67729c69c747f37941a1b")
!228 = !{!8, !33, !66, !229, !234}
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "args", file: !3, line: 28, baseType: !9, size: 32, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIEnumerator(name: "ARGS_FAILED", value: 0)
!232 = !DIEnumerator(name: "ARGS_USE_CONFIG", value: 1)
!233 = !DIEnumerator(name: "ARGS_SERVE_FILES", value: 2)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 133, baseType: !9, size: 32, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243}
!236 = !DIEnumerator(name: "HANDLER_PARSE_QUERY_STRING", value: 1)
!237 = !DIEnumerator(name: "HANDLER_PARSE_IF_MODIFIED_SINCE", value: 2)
!238 = !DIEnumerator(name: "HANDLER_PARSE_RANGE", value: 4)
!239 = !DIEnumerator(name: "HANDLER_PARSE_ACCEPT_ENCODING", value: 8)
!240 = !DIEnumerator(name: "HANDLER_PARSE_POST_DATA", value: 16)
!241 = !DIEnumerator(name: "HANDLER_MUST_AUTHORIZE", value: 32)
!242 = !DIEnumerator(name: "HANDLER_REMOVE_LEADING_SLASH", value: 64)
!243 = !DIEnumerator(name: "HANDLER_PARSE_MASK", value: 31)
!244 = !{!52}
!245 = !{!0, !246, !251, !256, !261, !266, !271, !273, !276, !278, !283, !288, !293, !295, !300, !302, !307, !312, !314, !319, !321, !326, !331, !334, !339, !342, !344, !346, !348, !367, !372, !377, !382, !384, !389, !394, !396, !401, !406, !411, !413, !415, !420, !425}
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !3, line: 50, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 80, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 10)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !3, line: 63, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 88, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 11)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !3, line: 65, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 312, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 39)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !3, line: 69, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 20)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !3, line: 73, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 12)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !3, line: 87, type: !263, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !3, line: 88, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 64, elements: !102)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !3, line: 100, type: !258, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !3, line: 100, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 24, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 3)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "headers", scope: !285, file: !3, line: 99, type: !287, isLocal: true, isDefinition: true)
!285 = distinct !DISubprogram(name: "hello_world", scope: !3, file: !3, line: 95, type: !4, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !226, retainedNodes: !286)
!286 = !{}
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 256, elements: !159)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !3, line: 106, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 40, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 5)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !3, line: 108, type: !253, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !3, line: 110, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 112, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 14)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !3, line: 112, type: !248, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !3, line: 116, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 208, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 26)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !3, line: 117, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 200, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 25)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !3, line: 122, type: !304, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !3, line: 127, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 104, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 13)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !3, line: 128, type: !268, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !3, line: 199, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 56, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 7)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !3, line: 203, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 216, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 27)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !3, line: 203, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 40, elements: !291)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !3, line: 203, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 176, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 22)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !3, line: 207, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 16, elements: !159)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !3, line: 142, type: !290, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !3, line: 143, type: !323, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !3, line: 144, type: !290, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "opts", scope: !350, file: !3, line: 141, type: !355, isLocal: true, isDefinition: true)
!350 = distinct !DISubprogram(name: "parse_args", scope: !3, file: !3, line: 139, type: !351, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !226, retainedNodes: !286)
!351 = !DISubroutineType(types: !352)
!352 = !{!229, !34, !353, !354, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 1024, elements: !365)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !358, line: 50, size: 256, elements: !359)
!358 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!359 = !{!360, !361, !362, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !358, line: 52, baseType: !205, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !357, file: !358, line: 55, baseType: !34, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !357, file: !358, line: 56, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !357, file: !358, line: 57, baseType: !34, size: 32, offset: 192)
!365 = !{!366}
!366 = !DISubrange(count: 4)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !3, line: 150, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 6)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !3, line: 165, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 304, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 38)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !3, line: 169, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 488, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 61)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !3, line: 170, type: !316, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !3, line: 171, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 224, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 28)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !3, line: 172, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 648, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 81)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !3, line: 173, type: !248, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !3, line: 174, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 536, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 67)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !3, line: 175, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 336, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 42)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !3, line: 176, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 192, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 24)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !3, line: 177, type: !341, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !3, line: 178, type: !253, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !3, line: 179, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 456, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 57)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !3, line: 180, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 408, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 51)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !3, line: 182, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 416, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 52)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 328, elements: !433)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!433 = !{!434}
!434 = !DISubrange(count: 41)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "base64_table", scope: !437, file: !443, line: 14, type: !447, isLocal: true, isDefinition: true)
!437 = distinct !DICompileUnit(language: DW_LANG_C11, file: !438, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !439, globals: !440, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "/home/raj/lwan/common/base64.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "8a87452d79d8a8f0198bc14a71930268")
!439 = !{!111, !55, !432}
!440 = !{!435, !441}
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "base64_decode_table", scope: !437, file: !443, line: 24, type: !444, isLocal: true, isDefinition: true)
!443 = !DIFile(filename: "common/base64.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a87452d79d8a8f0198bc14a71930268")
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 2048, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 256)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 520, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 65)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "odd_constant", scope: !452, file: !456, line: 41, type: !9, isLocal: true, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C11, file: !453, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !454, retainedTypes: !461, globals: !469, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "/home/raj/lwan/common/hash.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "00f74057e2e6dbf32d12ddc7b3b22e35")
!454 = !{!455}
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !456, line: 36, baseType: !9, size: 32, elements: !457)
!456 = !DIFile(filename: "common/hash.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "00f74057e2e6dbf32d12ddc7b3b22e35")
!457 = !{!458, !459, !460}
!458 = !DIEnumerator(name: "n_buckets", value: 512)
!459 = !DIEnumerator(name: "steps", value: 64)
!460 = !DIEnumerator(name: "default_odd_constant", value: 668265261)
!461 = !{!462, !111, !55, !9, !155, !34, !467}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!34, !465, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !468, line: 87, baseType: !155)
!468 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!469 = !{!470, !472, !450}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !456, line: 73, type: !316, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !456, line: 75, type: !268, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "digits", scope: !476, file: !477, line: 34, type: !491, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "uint_to_string", scope: !477, file: !477, line: 24, type: !478, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !481, retainedNodes: !286)
!477 = !DIFile(filename: "common/int-to-str.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "16271f9060fa745dc9ad2afb6239c6d5")
!478 = !DISubroutineType(types: !479)
!479 = !{!52, !55, !52, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!481 = distinct !DICompileUnit(language: DW_LANG_C11, file: !482, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !483, globals: !487, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/home/raj/lwan/common/int-to-str.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "16271f9060fa745dc9ad2afb6239c6d5")
!483 = !{!484, !53, !55}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !485, line: 26, baseType: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !154, line: 42, baseType: !9)
!487 = !{!488, !474}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "length", scope: !476, file: !477, line: 32, type: !490, isLocal: true, isDefinition: true)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 1608, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 201)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !496, line: 41, type: !497, isLocal: true, isDefinition: true)
!496 = !DIFile(filename: "common/list.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "0a5860268a1418537132a40f402b0afc")
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 320, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 40)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !502, line: 104, type: !503, isLocal: true, isDefinition: true)
!502 = !DIFile(filename: "common/lwan-cache.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "f1aa9dd4cc8594b027bd5599ddc2fec4")
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 16)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !502, line: 104, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 280, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 35)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !502, line: 104, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 704, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 88)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !502, line: 105, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 136, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 17)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !502, line: 106, type: !518, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !502, line: 146, type: !369, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !502, line: 146, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 296, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 37)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !502, line: 149, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 112, elements: !298)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !502, line: 149, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 368, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 46)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !502, line: 175, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 680, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 85)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !502, line: 176, type: !369, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !502, line: 177, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !365)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !502, line: 251, type: !369, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !502, line: 251, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 520, elements: !448)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !502, line: 94, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 192, elements: !409)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !502, line: 94, type: !297, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !502, line: 287, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 136, elements: !519)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !502, line: 287, type: !336, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !502, line: 312, type: !336, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !567, line: 43, type: !290, isLocal: true, isDefinition: true)
!567 = !DIFile(filename: "common/lwan-config.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "199ccadf79b83965963cdf65e7c49914")
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !567, line: 53, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 288, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 36)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !567, line: 53, type: !575, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 144, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 18)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !567, line: 53, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 256, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 32)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !567, line: 68, type: !290, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !567, line: 68, type: !341, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !567, line: 69, type: !280, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !567, line: 69, type: !547, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !567, line: 72, type: !369, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !567, line: 72, type: !341, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !567, line: 73, type: !547, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !567, line: 73, type: !280, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !567, line: 203, type: !304, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !567, line: 214, type: !309, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !567, line: 218, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 248, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 31)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !567, line: 232, type: !280, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !612, line: 230, type: !290, isLocal: true, isDefinition: true)
!612 = !DIFile(filename: "common/lwan-coro.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "f10099f62b8fec41343042e41e9eba52")
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !612, line: 230, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 272, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 34)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !612, line: 230, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 208, elements: !305)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !612, line: 231, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 168, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 21)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !612, line: 257, type: !527, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !612, line: 267, type: !630, isLocal: true, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 240, elements: !147)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !612, line: 276, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 200, elements: !310)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !612, line: 291, type: !290, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !612, line: 291, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 464, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 58)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "realm_password_cache", scope: !643, file: !670, line: 35, type: !840, isLocal: true, isDefinition: true)
!643 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !645, retainedTypes: !652, globals: !675, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "/home/raj/lwan/common/lwan-http-authorize.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "a818272e04294763324aa9ca395ad814")
!645 = !{!33, !66, !8, !646}
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !647, line: 35, baseType: !9, size: 32, elements: !648)
!647 = !DIFile(filename: "common/lwan-config.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "7586af514a363878312816f8ee308270")
!648 = !{!649, !650, !651}
!649 = !DIEnumerator(name: "CONFIG_LINE_TYPE_LINE", value: 0)
!650 = !DIEnumerator(name: "CONFIG_LINE_TYPE_SECTION", value: 1)
!651 = !DIEnumerator(name: "CONFIG_LINE_TYPE_SECTION_END", value: 2)
!652 = !{!111, !653, !668, !674}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_entry_t", file: !655, line: 27, size: 320, elements: !656)
!655 = !DIFile(filename: "common/lwan-cache.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "f48e19cadb0735f737f22aa65af51f83")
!656 = !{!657, !664, !665, !666, !667}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !654, file: !655, line: 28, baseType: !658, size: 128)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !659, line: 191, size: 128, elements: !660)
!659 = !DIFile(filename: "common/list.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "c0dffb77b1bbbbb179ef8d69b9e1dd8c")
!660 = !{!661, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !658, file: !659, line: 193, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !658, file: !659, line: 193, baseType: !662, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !654, file: !655, line: 29, baseType: !52, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !654, file: !655, line: 30, baseType: !9, size: 32, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !654, file: !655, line: 31, baseType: !9, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !654, file: !655, line: 32, baseType: !151, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "realm_password_file_t", file: !670, line: 30, size: 384, elements: !671)
!670 = !DIFile(filename: "common/lwan-http-authorize.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "a818272e04294763324aa9ca395ad814")
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !669, file: !670, line: 31, baseType: !654, size: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !669, file: !670, line: 32, baseType: !127, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!675 = !{!676, !817, !819, !821, !823, !828, !830, !832, !837, !641}
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "authenticate_tmpl", scope: !678, file: !670, line: 189, type: !560, isLocal: true, isDefinition: true)
!678 = distinct !DISubprogram(name: "lwan_http_authorize", scope: !670, file: !670, line: 184, type: !679, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !643, retainedNodes: !286)
!679 = !DISubroutineType(types: !680)
!680 = !{!137, !681, !816, !205, !205}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !7, line: 106, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !7, line: 206, size: 1280, elements: !684)
!684 = !{!685, !686, !687, !693, !694, !763, !774, !775, !784}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !683, file: !7, line: 207, baseType: !32, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !683, file: !7, line: 208, baseType: !34, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !683, file: !7, line: 209, baseType: !688, size: 128, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !7, line: 110, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !7, line: 191, size: 128, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !689, file: !7, line: 192, baseType: !52, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !689, file: !7, line: 193, baseType: !55, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !683, file: !7, line: 210, baseType: !688, size: 128, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !683, file: !7, line: 211, baseType: !695, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !7, line: 112, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !7, line: 196, size: 256, elements: !698)
!698 = !{!699, !700, !701, !702, !761, !762}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !697, file: !7, line: 199, baseType: !65, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !697, file: !7, line: 200, baseType: !9, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !697, file: !7, line: 201, baseType: !76, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !697, file: !7, line: 202, baseType: !703, size: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !7, line: 108, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !7, line: 253, size: 832, elements: !706)
!706 = !{!707, !752, !758, !759, !760}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !705, file: !7, line: 254, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !7, line: 103, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !7, line: 275, size: 640, elements: !711)
!711 = !{!712, !733, !734, !740, !741, !751}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !710, file: !7, line: 276, baseType: !713, size: 128)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !92, line: 25, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !92, line: 41, size: 128, elements: !715)
!715 = !{!716, !732}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !714, file: !92, line: 42, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !92, line: 26, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !92, line: 29, size: 640, elements: !720)
!720 = !{!721, !723, !731}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !719, file: !92, line: 30, baseType: !722, size: 512)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 512, elements: !102)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !719, file: !92, line: 31, baseType: !724, size: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !92, line: 27, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !92, line: 35, size: 192, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !726, file: !92, line: 36, baseType: !52, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !726, file: !92, line: 37, baseType: !111, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !92, line: 38, baseType: !724, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !719, file: !92, line: 32, baseType: !34, size: 32, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !714, file: !92, line: 43, baseType: !115, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !710, file: !7, line: 277, baseType: !695, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !710, file: !7, line: 283, baseType: !735, size: 128, offset: 192)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !7, line: 279, size: 128, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !735, file: !7, line: 280, baseType: !703, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !735, file: !7, line: 281, baseType: !9, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !735, file: !7, line: 282, baseType: !125, size: 16, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !710, file: !7, line: 285, baseType: !127, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !710, file: !7, line: 286, baseType: !742, size: 192, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !7, line: 111, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !7, line: 266, size: 192, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !743, file: !7, line: 267, baseType: !52, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !743, file: !7, line: 268, baseType: !125, size: 16, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !743, file: !7, line: 269, baseType: !137, size: 8, offset: 80)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !743, file: !7, line: 270, baseType: !137, size: 8, offset: 88)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !743, file: !7, line: 271, baseType: !9, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !743, file: !7, line: 272, baseType: !125, size: 16, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !710, file: !7, line: 287, baseType: !34, size: 32, offset: 576)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !705, file: !7, line: 259, baseType: !753, size: 576, offset: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !7, line: 255, size: 576, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !753, file: !7, line: 256, baseType: !146, size: 240)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !753, file: !7, line: 257, baseType: !146, size: 240, offset: 240)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !753, file: !7, line: 258, baseType: !151, size: 64, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !705, file: !7, line: 261, baseType: !34, size: 32, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !705, file: !7, line: 262, baseType: !158, size: 64, offset: 672)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !705, file: !7, line: 263, baseType: !162, size: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !7, line: 203, baseType: !34, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !7, line: 203, baseType: !34, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !683, file: !7, line: 216, baseType: !764, size: 128, offset: 384)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !7, line: 213, size: 128, elements: !765)
!765 = !{!766, !773}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !764, file: !7, line: 214, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !7, line: 105, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !7, line: 173, size: 128, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !769, file: !7, line: 174, baseType: !52, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !769, file: !7, line: 175, baseType: !52, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !764, file: !7, line: 215, baseType: !55, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !683, file: !7, line: 216, baseType: !764, size: 128, offset: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !683, file: !7, line: 223, baseType: !776, size: 192, offset: 640)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !7, line: 217, size: 192, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !776, file: !7, line: 218, baseType: !151, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !776, file: !7, line: 222, baseType: !780, size: 128, offset: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !776, file: !7, line: 219, size: 128, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !780, file: !7, line: 220, baseType: !186, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !780, file: !7, line: 221, baseType: !186, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !683, file: !7, line: 224, baseType: !785, size: 448, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !7, line: 107, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !7, line: 178, size: 448, elements: !787)
!787 = !{!788, !804, !805, !806, !807}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !786, file: !7, line: 179, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !197, line: 25, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !197, line: 27, size: 256, elements: !792)
!792 = !{!793, !798, !803}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !791, file: !197, line: 31, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !791, file: !197, line: 28, size: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !794, file: !197, line: 29, baseType: !52, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !794, file: !197, line: 30, baseType: !205, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !791, file: !197, line: 34, baseType: !799, size: 128, offset: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !197, line: 32, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !799, file: !197, line: 33, baseType: !55, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !799, file: !197, line: 33, baseType: !55, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !791, file: !197, line: 35, baseType: !9, size: 32, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !786, file: !7, line: 180, baseType: !205, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !786, file: !7, line: 181, baseType: !55, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !786, file: !7, line: 182, baseType: !767, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !786, file: !7, line: 188, baseType: !808, size: 192, offset: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !786, file: !7, line: 184, size: 192, elements: !809)
!809 = !{!810, !814, !815}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !808, file: !7, line: 185, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!6, !681, !111}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !7, line: 186, baseType: !111, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !808, file: !7, line: 187, baseType: !111, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "basic_len", scope: !678, file: !670, line: 190, type: !490, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !670, line: 196, type: !323, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !670, line: 207, type: !518, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !670, line: 87, type: !825, isLocal: true, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 352, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 44)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !670, line: 87, type: !575, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !670, line: 87, type: !535, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !670, line: 96, type: !834, isLocal: true, isDefinition: true)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 232, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 29)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !670, line: 102, type: !839, isLocal: true, isDefinition: true)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 328, elements: !433)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "cache_t", file: !655, line: 40, flags: DIFlagFwdDecl)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !844, line: 240, type: !839, isLocal: true, isDefinition: true)
!844 = !DIFile(filename: "common/lwan-io-wrappers.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "df65fc501e2089d1c77356ebe44cff47")
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !844, line: 240, type: !532, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !844, line: 240, type: !297, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !844, line: 179, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 160, elements: !264)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !844, line: 179, type: !369, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "running", scope: !856, file: !867, line: 41, type: !137, isLocal: true, isDefinition: true)
!856 = distinct !DICompileUnit(language: DW_LANG_C11, file: !857, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !858, globals: !864, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "/home/raj/lwan/common/lwan-job.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "37f1591a76c3166f23ef5ae3b94f9151")
!858 = !{!111, !859, !52}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !659, line: 191, size: 128, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !860, file: !659, line: 193, baseType: !859, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !860, file: !659, line: 193, baseType: !859, size: 64, offset: 64)
!864 = !{!865, !871, !876, !879, !882, !885, !890, !892, !894, !896, !898, !900, !905, !908, !910, !912, !914, !916, !854, !921}
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !867, line: 77, type: !868, isLocal: true, isDefinition: true)
!867 = !DIFile(filename: "common/lwan-job.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "37f1591a76c3166f23ef5ae3b94f9151")
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 72, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 9)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !867, line: 77, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 264, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 33)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !867, line: 77, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !581)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !867, line: 79, type: !881, isLocal: true, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 168, elements: !624)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(scope: null, file: !867, line: 79, type: !884, isLocal: true, isDefinition: true)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 296, elements: !528)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !867, line: 85, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 120, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 15)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !867, line: 92, type: !336, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !867, line: 98, type: !633, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !867, line: 98, type: !309, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !867, line: 108, type: !316, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !867, line: 115, type: !280, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !867, line: 115, type: !902, isLocal: true, isDefinition: true)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 360, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 45)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !867, line: 119, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 104, elements: !317)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !867, line: 119, type: !323, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !867, line: 128, type: !408, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !867, line: 137, type: !902, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "self", scope: !856, file: !867, line: 39, type: !162, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "jobs", scope: !856, file: !867, line: 42, type: !918, isLocal: true, isDefinition: true)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !659, line: 208, size: 128, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !918, file: !659, line: 210, baseType: !860, size: 128)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "queue_mutex", scope: !856, file: !867, line: 40, type: !923, isLocal: true, isDefinition: true)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !163, line: 72, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !163, line: 67, size: 320, elements: !925)
!925 = !{!926, !946, !947}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !924, file: !163, line: 69, baseType: !927, size: 320)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !928, line: 22, size: 320, elements: !929)
!928 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!929 = !{!930, !931, !932, !933, !934, !935, !937, !938}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !927, file: !928, line: 24, baseType: !34, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !927, file: !928, line: 25, baseType: !9, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !927, file: !928, line: 26, baseType: !34, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !927, file: !928, line: 28, baseType: !9, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !927, file: !928, line: 32, baseType: !34, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !927, file: !928, line: 34, baseType: !936, size: 16, offset: 160)
!936 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !927, file: !928, line: 35, baseType: !936, size: 16, offset: 176)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !927, file: !928, line: 36, baseType: !939, size: 128, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !940, line: 55, baseType: !941)
!940 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !940, line: 51, size: 128, elements: !942)
!942 = !{!943, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !941, file: !940, line: 53, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !941, file: !940, line: 54, baseType: !944, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !924, file: !163, line: 70, baseType: !497, size: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !924, file: !163, line: 71, baseType: !155, size: 64)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !950, line: 253, type: !834, isLocal: true, isDefinition: true)
!950 = !DIFile(filename: "common/lwan.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "b45b64bdafc0e6707cec9025aee73c17")
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !950, line: 253, type: !560, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !950, line: 253, type: !304, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !950, line: 308, type: !887, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !950, line: 315, type: !275, isLocal: true, isDefinition: true)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !950, line: 322, type: !248, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "default_config", scope: !963, file: !950, line: 44, type: !1385, isLocal: true, isDefinition: true)
!963 = distinct !DICompileUnit(language: DW_LANG_C11, file: !964, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !965, retainedTypes: !1220, globals: !1227, splitDebugInlining: false, nameTableKind: None)
!964 = !DIFile(filename: "/home/raj/lwan/common/lwan.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "b45b64bdafc0e6707cec9025aee73c17")
!965 = !{!66, !8, !33, !234, !966, !646, !978, !1198}
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !967, line: 24, baseType: !9, size: 32, elements: !968)
!967 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "0d4e972fdeb3da9a5bc94fa41144e9f8")
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977}
!969 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!970 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!971 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!972 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!973 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!974 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!975 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!976 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!977 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!978 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !979, line: 71, baseType: !9, size: 32, elements: !980)
!979 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197}
!981 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0)
!982 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1)
!983 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2)
!984 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3)
!985 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4)
!986 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5)
!987 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6)
!988 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7)
!989 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8)
!990 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9)
!991 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10)
!992 = !DIEnumerator(name: "_SC_TIMERS", value: 11)
!993 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12)
!994 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13)
!995 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14)
!996 = !DIEnumerator(name: "_SC_FSYNC", value: 15)
!997 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16)
!998 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17)
!999 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18)
!1000 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19)
!1001 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20)
!1002 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21)
!1003 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22)
!1004 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23)
!1005 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24)
!1006 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25)
!1007 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26)
!1008 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27)
!1009 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28)
!1010 = !DIEnumerator(name: "_SC_VERSION", value: 29)
!1011 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30)
!1012 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31)
!1013 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32)
!1014 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33)
!1015 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34)
!1016 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35)
!1017 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36)
!1018 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37)
!1019 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38)
!1020 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39)
!1021 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40)
!1022 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41)
!1023 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42)
!1024 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43)
!1025 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44)
!1026 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45)
!1027 = !DIEnumerator(name: "_SC_2_VERSION", value: 46)
!1028 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47)
!1029 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48)
!1030 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49)
!1031 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50)
!1032 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51)
!1033 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52)
!1034 = !DIEnumerator(name: "_SC_PII", value: 53)
!1035 = !DIEnumerator(name: "_SC_PII_XTI", value: 54)
!1036 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55)
!1037 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56)
!1038 = !DIEnumerator(name: "_SC_PII_OSI", value: 57)
!1039 = !DIEnumerator(name: "_SC_POLL", value: 58)
!1040 = !DIEnumerator(name: "_SC_SELECT", value: 59)
!1041 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60)
!1042 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60)
!1043 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61)
!1044 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62)
!1045 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63)
!1046 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64)
!1047 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65)
!1048 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66)
!1049 = !DIEnumerator(name: "_SC_THREADS", value: 67)
!1050 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68)
!1051 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69)
!1052 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70)
!1053 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71)
!1054 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72)
!1055 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73)
!1056 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74)
!1057 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75)
!1058 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76)
!1059 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77)
!1060 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78)
!1061 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79)
!1062 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80)
!1063 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81)
!1064 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82)
!1065 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83)
!1066 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84)
!1067 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85)
!1068 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86)
!1069 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87)
!1070 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88)
!1071 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89)
!1072 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90)
!1073 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91)
!1074 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92)
!1075 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93)
!1076 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94)
!1077 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95)
!1078 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96)
!1079 = !DIEnumerator(name: "_SC_2_UPE", value: 97)
!1080 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98)
!1081 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99)
!1082 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100)
!1083 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101)
!1084 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102)
!1085 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103)
!1086 = !DIEnumerator(name: "_SC_INT_MAX", value: 104)
!1087 = !DIEnumerator(name: "_SC_INT_MIN", value: 105)
!1088 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106)
!1089 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107)
!1090 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108)
!1091 = !DIEnumerator(name: "_SC_NZERO", value: 109)
!1092 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110)
!1093 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111)
!1094 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112)
!1095 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113)
!1096 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114)
!1097 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115)
!1098 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116)
!1099 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117)
!1100 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118)
!1101 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119)
!1102 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120)
!1103 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121)
!1104 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122)
!1105 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123)
!1106 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124)
!1107 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125)
!1108 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!1109 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!1110 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!1111 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!1112 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!1113 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!1114 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!1115 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!1116 = !DIEnumerator(name: "_SC_BASE", value: 134)
!1117 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!1118 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!1119 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!1120 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!1121 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!1122 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!1123 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!1124 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!1125 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!1126 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!1127 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!1128 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!1129 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!1130 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!1131 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!1132 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!1133 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!1134 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!1135 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!1136 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!1137 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!1138 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!1139 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!1140 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!1141 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!1142 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
