; ModuleID = '/home/raj/lwan/common/lwan.c'
source_filename = "/home/raj/lwan/common/lwan.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lwan_config_t_ = type { ptr, i16, i8, i8, i32, i16 }
%struct.lwan_t_ = type { %struct.lwan_trie_t_, ptr, %struct.anon.0, ptr, %struct.lwan_config_t_, i32 }
%struct.lwan_trie_t_ = type { ptr, ptr }
%struct.anon.0 = type { ptr, i32, i16 }
%struct.lwan_url_map_t_ = type { ptr, ptr, ptr, i64, i32, ptr, ptr, %struct.anon.6 }
%struct.anon.6 = type { ptr, ptr }
%struct.lwan_module_t_ = type { ptr, ptr, ptr, ptr, ptr, i32 }
%struct.config_t_ = type { ptr, i32, ptr }
%struct.config_line_t_ = type { %union.anon.8, i32, [1024 x i8] }
%union.anon.8 = type { %struct.anon.9 }
%struct.anon.9 = type { ptr, ptr }
%struct.anon.10 = type { ptr, ptr }
%struct.rlimit = type { i64, i64 }
%union.__SOCKADDR_ARG = type { ptr }
%struct.lwan_thread_t_ = type { ptr, %struct.anon, i32, [2 x i32], i64 }
%struct.anon = type { [30 x i8], [30 x i8], i64 }

@.str = private unnamed_addr constant [29 x i8] c"/home/raj/lwan/common/lwan.c\00", align 1, !dbg !0
@__FUNCTION__.lwan_set_url_map = private unnamed_addr constant [17 x i8] c"lwan_set_url_map\00", align 1, !dbg !7
@.str.1 = private unnamed_addr constant [26 x i8] c"Could not initialize trie\00", align 1, !dbg !13
@.str.2 = private unnamed_addr constant [15 x i8] c"/proc/self/exe\00", align 1, !dbg !18

!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !25, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 191, type: !495, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !388, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 203, type: !391, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !371, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 218, type: !15, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 42)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 239, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 16)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 125, type: !470, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 35)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 135, type: !470, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 138, type: !388, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !431, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 5)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !488, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 152, elements: !466)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 52)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 398, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 232, elements: !5)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 398, type: !30, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !30, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !442, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !413, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "main_socket", scope: !35, file: !2, line: 547, type: !582, isLocal: true, isDefinition: true)
!582 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !584, line: 8, baseType: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !362, line: 215, baseType: !40)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !39, line: 111, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !39, line: 266, size: 192, elements: !589)
!589 = !{!590, !591, !592, !594, !595, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !588, file: !39, line: 267, baseType: !359, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !588, file: !39, line: 268, baseType: !360, size: 16, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !588, file: !39, line: 269, baseType: !593, size: 8, offset: 80)
!593 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !588, file: !39, line: 270, baseType: !593, size: 8, offset: 88)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !588, file: !39, line: 271, baseType: !49, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !588, file: !39, line: 272, baseType: !360, size: 16, offset: 128)
!597 = !{i32 7, !"Dwarf Version", i32 5}
!598 = !{i32 2, !"Debug Info Version", i32 3}
!599 = !{i32 1, !"wchar_size", i32 4}
!600 = !{i32 8, !"PIC Level", i32 2}
!601 = !{i32 7, !"PIE Level", i32 2}
!602 = !{i32 7, !"uwtable", i32 2}
!603 = !{i32 7, !"frame-pointer", i32 2}
!604 = !{!"clang version 16.0.0"}
!605 = distinct !DISubprogram(name: "lwan_set_url_map", scope: !2, file: !2, line: 249, type: !606, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !803)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !608, !688}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !39, line: 103, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !39, line: 275, size: 640, elements: !611)
!611 = !{!612, !637, !676, !682, !686, !687}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !610, file: !39, line: 276, baseType: !613, size: 128)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !614, line: 25, baseType: !615)
!614 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !614, line: 41, size: 128, elements: !616)
!616 = !{!617, !633}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !615, file: !614, line: 42, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !614, line: 26, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !614, line: 29, size: 640, elements: !621)
!621 = !{!622, !624, !632}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !614, line: 30, baseType: !623, size: 512)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 512, elements: !26)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !620, file: !614, line: 31, baseType: !625, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !614, line: 27, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !614, line: 35, size: 192, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !627, file: !614, line: 36, baseType: !359, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !627, file: !614, line: 37, baseType: !358, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !614, line: 38, baseType: !625, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !620, file: !614, line: 32, baseType: !40, size: 32, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !615, file: !614, line: 43, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !358}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !610, file: !39, line: 277, baseType: !638, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !39, line: 112, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !39, line: 196, size: 256, elements: !641)
!641 = !{!642, !644, !645, !650, !674, !675}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !640, file: !39, line: 199, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !39, line: 165, baseType: !38)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !640, file: !39, line: 200, baseType: !49, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !640, file: !39, line: 201, baseType: !646, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !648, line: 34, baseType: !649)
!648 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !648, line: 34, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !640, file: !39, line: 202, baseType: !651, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !39, line: 108, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !39, line: 253, size: 832, elements: !654)
!654 = !{!655, !656, !666, !667, !671}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !653, file: !39, line: 254, baseType: !608, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !653, file: !39, line: 259, baseType: !657, size: 576, offset: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !653, file: !39, line: 255, size: 576, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !657, file: !39, line: 256, baseType: !418, size: 240)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !657, file: !39, line: 257, baseType: !418, size: 240, offset: 240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !657, file: !39, line: 258, baseType: !662, size: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !663, line: 10, baseType: !664)
!663 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !362, line: 160, baseType: !665)
!665 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !653, file: !39, line: 261, baseType: !40, size: 32, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !653, file: !39, line: 262, baseType: !668, size: 64, offset: 672)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 2)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !653, file: !39, line: 263, baseType: !672, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !673, line: 27, baseType: !352)
!673 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !39, line: 203, baseType: !40, size: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !39, line: 203, baseType: !40, size: 32, offset: 224)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !610, file: !39, line: 283, baseType: !677, size: 128, offset: 192)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !610, file: !39, line: 279, size: 128, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !677, file: !39, line: 280, baseType: !651, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !677, file: !39, line: 281, baseType: !49, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !677, file: !39, line: 282, baseType: !360, size: 16, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !610, file: !39, line: 285, baseType: !683, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !685, line: 6, flags: DIFlagFwdDecl)
!685 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !610, file: !39, line: 286, baseType: !587, size: 192, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !610, file: !39, line: 287, baseType: !40, size: 32, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_url_map_t", file: !39, line: 109, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_url_map_t_", file: !39, line: 236, size: 576, elements: !692)
!692 = !{!693, !772, !773, !774, !775, !777, !797, !798}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !691, file: !39, line: 237, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !698, !771, !358}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !39, line: 131, baseType: !48)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !39, line: 106, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !39, line: 206, size: 1280, elements: !701)
!701 = !{!702, !704, !705, !711, !712, !713, !724, !725, !737}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !700, file: !39, line: 207, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !39, line: 156, baseType: !67)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !700, file: !39, line: 208, baseType: !40, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !700, file: !39, line: 209, baseType: !706, size: 128, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !39, line: 110, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !39, line: 191, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !707, file: !39, line: 192, baseType: !359, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !707, file: !39, line: 193, baseType: !350, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !700, file: !39, line: 210, baseType: !706, size: 128, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !700, file: !39, line: 211, baseType: !638, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !700, file: !39, line: 216, baseType: !714, size: 128, offset: 384)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !39, line: 213, size: 128, elements: !715)
!715 = !{!716, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !714, file: !39, line: 214, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !39, line: 105, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !39, line: 173, size: 128, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !719, file: !39, line: 174, baseType: !359, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !719, file: !39, line: 175, baseType: !359, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !714, file: !39, line: 215, baseType: !350, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !700, file: !39, line: 216, baseType: !714, size: 128, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !700, file: !39, line: 223, baseType: !726, size: 192, offset: 640)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !39, line: 217, size: 192, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !726, file: !39, line: 218, baseType: !662, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !726, file: !39, line: 222, baseType: !730, size: 128, offset: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !39, line: 219, size: 128, elements: !731)
!731 = !{!732, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !730, file: !39, line: 220, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !734, line: 243, baseType: !735)
!734 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !362, line: 152, baseType: !665)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !730, file: !39, line: 221, baseType: !733, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !700, file: !39, line: 224, baseType: !738, size: 448, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !39, line: 107, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !39, line: 178, size: 448, elements: !740)
!740 = !{!741, !759, !760, !761, !762}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !739, file: !39, line: 179, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !744, line: 25, baseType: !745)
!744 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !744, line: 27, size: 256, elements: !746)
!746 = !{!747, !753, !758}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !745, file: !744, line: 31, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !745, file: !744, line: 28, size: 64, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !748, file: !744, line: 29, baseType: !359, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !748, file: !744, line: 30, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !745, file: !744, line: 34, baseType: !754, size: 128, offset: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !745, file: !744, line: 32, size: 128, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !754, file: !744, line: 33, baseType: !350, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !754, file: !744, line: 33, baseType: !350, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !744, line: 35, baseType: !49, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !739, file: !39, line: 180, baseType: !752, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !739, file: !39, line: 181, baseType: !350, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !739, file: !39, line: 182, baseType: !717, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !739, file: !39, line: 188, baseType: !763, size: 192, offset: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !739, file: !39, line: 184, size: 192, elements: !764)
!764 = !{!765, !769, !770}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !763, file: !39, line: 185, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!697, !698, !358}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !763, file: !39, line: 186, baseType: !358, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !763, file: !39, line: 187, baseType: !358, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !691, file: !39, line: 238, baseType: !358, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !691, file: !39, line: 240, baseType: !752, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_len", scope: !691, file: !39, line: 241, baseType: !350, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !691, file: !39, line: 242, baseType: !776, size: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_handler_flags_t", file: !39, line: 143, baseType: !79)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !691, file: !39, line: 244, baseType: !778, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_module_t", file: !39, line: 104, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_module_t_", file: !39, line: 227, size: 384, elements: !782)
!782 = !{!783, !784, !788, !794, !795, !796}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !781, file: !39, line: 228, baseType: !752, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !781, file: !39, line: 229, baseType: !785, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!358, !358}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "init_from_hash", scope: !781, file: !39, line: 230, baseType: !789, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!358, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !781, file: !39, line: 231, baseType: !634, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !781, file: !39, line: 232, baseType: !694, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !39, line: 233, baseType: !776, size: 32, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !691, file: !39, line: 245, baseType: !358, size: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "authorization", scope: !691, file: !39, line: 250, baseType: !799, size: 128, offset: 448)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !39, line: 247, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !799, file: !39, line: 248, baseType: !359, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "password_file", scope: !799, file: !39, line: 249, baseType: !359, size: 64, offset: 64)
!803 = !{}
!804 = !DILocalVariable(name: "l", arg: 1, scope: !605, file: !2, line: 249, type: !608)
!805 = !DILocation(line: 249, column: 31, scope: !605)
!806 = !DILocalVariable(name: "map", arg: 2, scope: !605, file: !2, line: 249, type: !688)
!807 = !DILocation(line: 249, column: 56, scope: !605)
!808 = !DILocation(line: 251, column: 24, scope: !605)
!809 = !DILocation(line: 251, column: 27, scope: !605)
!810 = !DILocation(line: 251, column: 5, scope: !605)
!811 = !DILocation(line: 252, column: 9, scope: !812)
!812 = distinct !DILexicalBlock(scope: !605, file: !2, line: 252, column: 9)
!813 = !DILocation(line: 252, column: 9, scope: !605)
!814 = !DILocation(line: 253, column: 9, scope: !812)
!815 = !DILocation(line: 255, column: 5, scope: !605)
!816 = !DILocation(line: 255, column: 12, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !2, line: 255, column: 5)
!818 = distinct !DILexicalBlock(scope: !605, file: !2, line: 255, column: 5)
!819 = !DILocation(line: 255, column: 17, scope: !817)
!820 = !DILocation(line: 255, column: 5, scope: !818)
!821 = !DILocalVariable(name: "copy", scope: !822, file: !2, line: 256, type: !823)
!822 = distinct !DILexicalBlock(scope: !817, file: !2, line: 255, column: 32)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!824 = !DILocation(line: 256, column: 25, scope: !822)
!825 = !DILocation(line: 256, column: 45, scope: !822)
!826 = !DILocation(line: 256, column: 48, scope: !822)
!827 = !DILocation(line: 256, column: 68, scope: !822)
!828 = !DILocation(line: 256, column: 32, scope: !822)
!829 = !DILocation(line: 258, column: 13, scope: !830)
!830 = distinct !DILexicalBlock(scope: !822, file: !2, line: 258, column: 13)
!831 = !DILocation(line: 258, column: 13, scope: !822)
!832 = !DILocation(line: 259, column: 13, scope: !830)
!833 = !DILocation(line: 261, column: 13, scope: !834)
!834 = distinct !DILexicalBlock(scope: !822, file: !2, line: 261, column: 13)
!835 = !DILocation(line: 261, column: 19, scope: !834)
!836 = !DILocation(line: 261, column: 26, scope: !834)
!837 = !DILocation(line: 261, column: 29, scope: !834)
!838 = !DILocation(line: 261, column: 35, scope: !834)
!839 = !DILocation(line: 261, column: 43, scope: !834)
!840 = !DILocation(line: 261, column: 13, scope: !822)
!841 = !DILocation(line: 262, column: 26, scope: !842)
!842 = distinct !DILexicalBlock(scope: !834, file: !2, line: 261, column: 49)
!843 = !DILocation(line: 262, column: 32, scope: !842)
!844 = !DILocation(line: 262, column: 40, scope: !842)
!845 = !DILocation(line: 262, column: 45, scope: !842)
!846 = !DILocation(line: 262, column: 51, scope: !842)
!847 = !DILocation(line: 262, column: 13, scope: !842)
!848 = !DILocation(line: 262, column: 19, scope: !842)
!849 = !DILocation(line: 262, column: 24, scope: !842)
!850 = !DILocation(line: 263, column: 27, scope: !842)
!851 = !DILocation(line: 263, column: 33, scope: !842)
!852 = !DILocation(line: 263, column: 41, scope: !842)
!853 = !DILocation(line: 263, column: 13, scope: !842)
!854 = !DILocation(line: 263, column: 19, scope: !842)
!855 = !DILocation(line: 263, column: 25, scope: !842)
!856 = !DILocation(line: 264, column: 29, scope: !842)
!857 = !DILocation(line: 264, column: 35, scope: !842)
!858 = !DILocation(line: 264, column: 43, scope: !842)
!859 = !DILocation(line: 264, column: 13, scope: !842)
!860 = !DILocation(line: 264, column: 19, scope: !842)
!861 = !DILocation(line: 264, column: 27, scope: !842)
!862 = !DILocation(line: 265, column: 9, scope: !842)
!863 = !DILocation(line: 266, column: 13, scope: !864)
!864 = distinct !DILexicalBlock(scope: !834, file: !2, line: 265, column: 16)
!865 = !DILocation(line: 266, column: 19, scope: !864)
!866 = !DILocation(line: 266, column: 25, scope: !864)
!867 = !DILocation(line: 268, column: 5, scope: !822)
!868 = !DILocation(line: 255, column: 28, scope: !817)
!869 = !DILocation(line: 255, column: 5, scope: !817)
!870 = distinct !{!870, !820, !871, !872}
!871 = !DILocation(line: 268, column: 5, scope: !818)
!872 = !{!"llvm.loop.mustprogress"}
!873 = !DILocation(line: 269, column: 1, scope: !605)
!874 = distinct !DISubprogram(name: "destroy_urlmap", scope: !2, file: !2, line: 88, type: !635, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!875 = !DILocalVariable(name: "data", arg: 1, scope: !874, file: !2, line: 88, type: !358)
!876 = !DILocation(line: 88, column: 34, scope: !874)
!877 = !DILocalVariable(name: "url_map", scope: !874, file: !2, line: 90, type: !823)
!878 = !DILocation(line: 90, column: 21, scope: !874)
!879 = !DILocation(line: 90, column: 31, scope: !874)
!880 = !DILocation(line: 92, column: 9, scope: !881)
!881 = distinct !DILexicalBlock(scope: !874, file: !2, line: 92, column: 9)
!882 = !DILocation(line: 92, column: 18, scope: !881)
!883 = !DILocation(line: 92, column: 9, scope: !874)
!884 = !DILocalVariable(name: "module", scope: !885, file: !2, line: 93, type: !778)
!885 = distinct !DILexicalBlock(scope: !881, file: !2, line: 92, column: 26)
!886 = !DILocation(line: 93, column: 30, scope: !885)
!887 = !DILocation(line: 93, column: 39, scope: !885)
!888 = !DILocation(line: 93, column: 48, scope: !885)
!889 = !DILocation(line: 94, column: 13, scope: !890)
!890 = distinct !DILexicalBlock(scope: !885, file: !2, line: 94, column: 13)
!891 = !DILocation(line: 94, column: 21, scope: !890)
!892 = !DILocation(line: 94, column: 13, scope: !885)
!893 = !DILocation(line: 95, column: 13, scope: !890)
!894 = !DILocation(line: 95, column: 21, scope: !890)
!895 = !DILocation(line: 95, column: 30, scope: !890)
!896 = !DILocation(line: 95, column: 39, scope: !890)
!897 = !DILocation(line: 96, column: 5, scope: !885)
!898 = !DILocation(line: 96, column: 16, scope: !899)
!899 = distinct !DILexicalBlock(scope: !881, file: !2, line: 96, column: 16)
!900 = !DILocation(line: 96, column: 25, scope: !899)
!901 = !DILocation(line: 96, column: 16, scope: !881)
!902 = !DILocation(line: 97, column: 19, scope: !903)
!903 = distinct !DILexicalBlock(scope: !899, file: !2, line: 96, column: 31)
!904 = !DILocation(line: 97, column: 28, scope: !903)
!905 = !DILocation(line: 97, column: 9, scope: !903)
!906 = !DILocation(line: 98, column: 5, scope: !903)
!907 = !DILocation(line: 100, column: 10, scope: !874)
!908 = !DILocation(line: 100, column: 19, scope: !874)
!909 = !DILocation(line: 100, column: 33, scope: !874)
!910 = !DILocation(line: 100, column: 5, scope: !874)
!911 = !DILocation(line: 101, column: 10, scope: !874)
!912 = !DILocation(line: 101, column: 19, scope: !874)
!913 = !DILocation(line: 101, column: 33, scope: !874)
!914 = !DILocation(line: 101, column: 5, scope: !874)
!915 = !DILocation(line: 102, column: 18, scope: !874)
!916 = !DILocation(line: 102, column: 27, scope: !874)
!917 = !DILocation(line: 102, column: 5, scope: !874)
!918 = !DILocation(line: 103, column: 10, scope: !874)
!919 = !DILocation(line: 103, column: 5, scope: !874)
!920 = !DILocation(line: 104, column: 1, scope: !874)
!921 = distinct !DISubprogram(name: "add_url_map", scope: !2, file: !2, line: 106, type: !922, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!922 = !DISubroutineType(types: !923)
!923 = !{!823, !924, !752, !688}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!925 = !DILocalVariable(name: "t", arg: 1, scope: !921, file: !2, line: 106, type: !924)
!926 = !DILocation(line: 106, column: 49, scope: !921)
!927 = !DILocalVariable(name: "prefix", arg: 2, scope: !921, file: !2, line: 106, type: !752)
!928 = !DILocation(line: 106, column: 64, scope: !921)
!929 = !DILocalVariable(name: "map", arg: 3, scope: !921, file: !2, line: 106, type: !688)
!930 = !DILocation(line: 106, column: 94, scope: !921)
!931 = !DILocalVariable(name: "copy", scope: !921, file: !2, line: 108, type: !823)
!932 = !DILocation(line: 108, column: 21, scope: !921)
!933 = !DILocation(line: 108, column: 28, scope: !921)
!934 = !DILocation(line: 110, column: 10, scope: !935)
!935 = distinct !DILexicalBlock(scope: !921, file: !2, line: 110, column: 9)
!936 = !DILocation(line: 110, column: 9, scope: !921)
!937 = !DILocation(line: 111, column: 9, scope: !935)
!938 = !DILocation(line: 113, column: 12, scope: !921)
!939 = !DILocation(line: 113, column: 18, scope: !921)
!940 = !DILocation(line: 113, column: 5, scope: !921)
!941 = !DILocation(line: 115, column: 27, scope: !921)
!942 = !DILocation(line: 115, column: 36, scope: !921)
!943 = !DILocation(line: 115, column: 45, scope: !921)
!944 = !DILocation(line: 115, column: 51, scope: !921)
!945 = !DILocation(line: 115, column: 20, scope: !921)
!946 = !DILocation(line: 115, column: 5, scope: !921)
!947 = !DILocation(line: 115, column: 11, scope: !921)
!948 = !DILocation(line: 115, column: 18, scope: !921)
!949 = !DILocation(line: 116, column: 31, scope: !921)
!950 = !DILocation(line: 116, column: 37, scope: !921)
!951 = !DILocation(line: 116, column: 24, scope: !921)
!952 = !DILocation(line: 116, column: 5, scope: !921)
!953 = !DILocation(line: 116, column: 11, scope: !921)
!954 = !DILocation(line: 116, column: 22, scope: !921)
!955 = !DILocation(line: 117, column: 19, scope: !921)
!956 = !DILocation(line: 117, column: 22, scope: !921)
!957 = !DILocation(line: 117, column: 28, scope: !921)
!958 = !DILocation(line: 117, column: 36, scope: !921)
!959 = !DILocation(line: 117, column: 5, scope: !921)
!960 = !DILocation(line: 119, column: 12, scope: !921)
!961 = !DILocation(line: 119, column: 5, scope: !921)
!962 = distinct !DISubprogram(name: "get_config_path", scope: !2, file: !2, line: 301, type: !963, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !803)
!963 = !DISubroutineType(types: !964)
!964 = !{!752, !359}
!965 = !DILocalVariable(name: "path_buf", arg: 1, scope: !962, file: !2, line: 301, type: !359)
!966 = !DILocation(line: 301, column: 35, scope: !962)
!967 = !DILocalVariable(name: "path", scope: !962, file: !2, line: 303, type: !359)
!968 = !DILocation(line: 303, column: 11, scope: !962)
!969 = !DILocalVariable(name: "path_len", scope: !962, file: !2, line: 304, type: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !734, line: 220, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !362, line: 194, baseType: !665)
!972 = !DILocation(line: 304, column: 13, scope: !962)
!973 = !DILocation(line: 308, column: 43, scope: !962)
!974 = !DILocation(line: 308, column: 16, scope: !962)
!975 = !DILocation(line: 308, column: 14, scope: !962)
!976 = !DILocation(line: 309, column: 9, scope: !977)
!977 = distinct !DILexicalBlock(scope: !962, file: !2, line: 309, column: 9)
!978 = !DILocation(line: 309, column: 18, scope: !977)
!979 = !DILocation(line: 309, column: 9, scope: !962)
!980 = !DILocation(line: 310, column: 9, scope: !977)
!981 = !DILocation(line: 311, column: 5, scope: !962)
!982 = !DILocation(line: 311, column: 14, scope: !962)
!983 = !DILocation(line: 311, column: 24, scope: !962)
!984 = !DILocation(line: 312, column: 20, scope: !962)
!985 = !DILocation(line: 312, column: 12, scope: !962)
!986 = !DILocation(line: 312, column: 10, scope: !962)
!987 = !DILocation(line: 313, column: 10, scope: !988)
!988 = distinct !DILexicalBlock(scope: !962, file: !2, line: 313, column: 9)
!989 = !DILocation(line: 313, column: 9, scope: !962)
!990 = !DILocation(line: 314, column: 9, scope: !988)
!991 = !DILocalVariable(name: "ret", scope: !962, file: !2, line: 315, type: !40)
!992 = !DILocation(line: 315, column: 9, scope: !962)
!993 = !DILocation(line: 315, column: 24, scope: !962)
!994 = !DILocation(line: 315, column: 55, scope: !962)
!995 = !DILocation(line: 315, column: 60, scope: !962)
!996 = !DILocation(line: 315, column: 15, scope: !962)
!997 = !DILocation(line: 316, column: 9, scope: !998)
!998 = distinct !DILexicalBlock(scope: !962, file: !2, line: 316, column: 9)
!999 = !DILocation(line: 316, column: 13, scope: !998)
!1000 = !DILocation(line: 316, column: 17, scope: !998)
!1001 = !DILocation(line: 316, column: 20, scope: !998)
!1002 = !DILocation(line: 316, column: 24, scope: !998)
!1003 = !DILocation(line: 316, column: 9, scope: !962)
!1004 = !DILocation(line: 317, column: 9, scope: !998)
!1005 = !DILocation(line: 319, column: 12, scope: !962)
!1006 = !DILocation(line: 319, column: 5, scope: !962)
!1007 = !DILabel(scope: !962, name: "out", file: !2, line: 321)
!1008 = !DILocation(line: 321, column: 1, scope: !962)
!1009 = !DILocation(line: 322, column: 5, scope: !962)
!1010 = !DILocation(line: 323, column: 1, scope: !962)
!1011 = distinct !DISubprogram(name: "lwan_init", scope: !2, file: !2, line: 434, type: !1012, scopeLine: 435, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{null, !608}
!1014 = !DILocalVariable(name: "l", arg: 1, scope: !1011, file: !2, line: 434, type: !608)
!1015 = !DILocation(line: 434, column: 19, scope: !1011)
!1016 = !DILocation(line: 436, column: 27, scope: !1011)
!1017 = !DILocation(line: 436, column: 5, scope: !1011)
!1018 = !DILocation(line: 437, column: 1, scope: !1011)
!1019 = distinct !DISubprogram(name: "lwan_init_with_config", scope: !2, file: !2, line: 446, type: !1020, scopeLine: 447, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !608, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!1023 = !DILocalVariable(name: "l", arg: 1, scope: !1019, file: !2, line: 446, type: !608)
!1024 = !DILocation(line: 446, column: 31, scope: !1019)
!1025 = !DILocalVariable(name: "config", arg: 2, scope: !1019, file: !2, line: 446, type: !1022)
!1026 = !DILocation(line: 446, column: 55, scope: !1019)
!1027 = !DILocation(line: 449, column: 12, scope: !1019)
!1028 = !DILocation(line: 449, column: 5, scope: !1019)
!1029 = !DILocation(line: 450, column: 13, scope: !1019)
!1030 = !DILocation(line: 450, column: 16, scope: !1019)
!1031 = !DILocation(line: 450, column: 24, scope: !1019)
!1032 = !DILocation(line: 450, column: 5, scope: !1019)
!1033 = !DILocation(line: 454, column: 22, scope: !1019)
!1034 = !DILocation(line: 454, column: 5, scope: !1019)
!1035 = !DILocation(line: 459, column: 5, scope: !1019)
!1036 = !DILocation(line: 460, column: 5, scope: !1019)
!1037 = !DILocation(line: 461, column: 5, scope: !1019)
!1038 = !DILocation(line: 463, column: 22, scope: !1019)
!1039 = !DILocation(line: 463, column: 5, scope: !1019)
!1040 = !DILocation(line: 464, column: 26, scope: !1019)
!1041 = !DILocation(line: 464, column: 29, scope: !1019)
!1042 = !DILocation(line: 464, column: 5, scope: !1019)
!1043 = !DILocation(line: 465, column: 26, scope: !1019)
!1044 = !DILocation(line: 465, column: 29, scope: !1019)
!1045 = !DILocation(line: 465, column: 5, scope: !1019)
!1046 = !DILocation(line: 471, column: 9, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 471, column: 9)
!1048 = !DILocation(line: 471, column: 16, scope: !1047)
!1049 = !DILocation(line: 471, column: 9, scope: !1019)
!1050 = !DILocation(line: 472, column: 32, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 472, column: 13)
!1052 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 471, column: 36)
!1053 = !DILocation(line: 472, column: 14, scope: !1051)
!1054 = !DILocation(line: 472, column: 13, scope: !1052)
!1055 = !DILocation(line: 473, column: 13, scope: !1051)
!1056 = !DILocation(line: 474, column: 5, scope: !1052)
!1057 = !DILocation(line: 477, column: 5, scope: !1019)
!1058 = !DILocation(line: 479, column: 10, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 479, column: 9)
!1060 = !DILocation(line: 479, column: 13, scope: !1059)
!1061 = !DILocation(line: 479, column: 20, scope: !1059)
!1062 = !DILocation(line: 479, column: 9, scope: !1019)
!1063 = !DILocation(line: 480, column: 27, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 479, column: 31)
!1065 = !DILocation(line: 480, column: 9, scope: !1064)
!1066 = !DILocation(line: 480, column: 12, scope: !1064)
!1067 = !DILocation(line: 480, column: 19, scope: !1064)
!1068 = !DILocation(line: 480, column: 25, scope: !1064)
!1069 = !DILocation(line: 481, column: 13, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1064, file: !2, line: 481, column: 13)
!1071 = !DILocation(line: 481, column: 16, scope: !1070)
!1072 = !DILocation(line: 481, column: 23, scope: !1070)
!1073 = !DILocation(line: 481, column: 29, scope: !1070)
!1074 = !DILocation(line: 481, column: 13, scope: !1064)
!1075 = !DILocation(line: 482, column: 13, scope: !1070)
!1076 = !DILocation(line: 482, column: 16, scope: !1070)
!1077 = !DILocation(line: 482, column: 23, scope: !1070)
!1078 = !DILocation(line: 482, column: 29, scope: !1070)
!1079 = !DILocation(line: 483, column: 5, scope: !1064)
!1080 = !DILocation(line: 484, column: 27, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 483, column: 12)
!1082 = !DILocation(line: 484, column: 30, scope: !1081)
!1083 = !DILocation(line: 484, column: 37, scope: !1081)
!1084 = !DILocation(line: 484, column: 9, scope: !1081)
!1085 = !DILocation(line: 484, column: 12, scope: !1081)
!1086 = !DILocation(line: 484, column: 19, scope: !1081)
!1087 = !DILocation(line: 484, column: 25, scope: !1081)
!1088 = !DILocalVariable(name: "max_open_files", scope: !1019, file: !2, line: 487, type: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !328, line: 131, baseType: !361)
!1090 = !DILocation(line: 487, column: 12, scope: !1019)
!1091 = !DILocation(line: 487, column: 29, scope: !1019)
!1092 = !DILocation(line: 488, column: 26, scope: !1019)
!1093 = !DILocation(line: 488, column: 37, scope: !1019)
!1094 = !DILocation(line: 488, column: 5, scope: !1019)
!1095 = !DILocation(line: 490, column: 34, scope: !1019)
!1096 = !DILocation(line: 490, column: 24, scope: !1019)
!1097 = !DILocation(line: 490, column: 61, scope: !1019)
!1098 = !DILocation(line: 490, column: 64, scope: !1019)
!1099 = !DILocation(line: 490, column: 71, scope: !1019)
!1100 = !DILocation(line: 490, column: 51, scope: !1019)
!1101 = !DILocation(line: 490, column: 49, scope: !1019)
!1102 = !DILocation(line: 490, column: 5, scope: !1019)
!1103 = !DILocation(line: 490, column: 8, scope: !1019)
!1104 = !DILocation(line: 490, column: 15, scope: !1019)
!1105 = !DILocation(line: 490, column: 22, scope: !1019)
!1106 = !DILocation(line: 491, column: 5, scope: !1019)
!1107 = !DILocation(line: 494, column: 5, scope: !1019)
!1108 = !DILocation(line: 495, column: 5, scope: !1019)
!1109 = !DILocation(line: 497, column: 22, scope: !1019)
!1110 = !DILocation(line: 497, column: 5, scope: !1019)
!1111 = !DILocation(line: 498, column: 22, scope: !1019)
!1112 = !DILocation(line: 498, column: 5, scope: !1019)
!1113 = !DILocation(line: 499, column: 5, scope: !1019)
!1114 = !DILocation(line: 500, column: 1, scope: !1019)
!1115 = distinct !DISubprogram(name: "lwan_get_default_config", scope: !2, file: !2, line: 440, type: !1116, scopeLine: 441, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!1022}
!1118 = !DILocation(line: 442, column: 5, scope: !1115)
!1119 = distinct !DISubprogram(name: "lwan_module_init", scope: !2, file: !2, line: 53, type: !1012, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1120 = !DILocalVariable(name: "l", arg: 1, scope: !1119, file: !2, line: 53, type: !608)
!1121 = !DILocation(line: 53, column: 38, scope: !1119)
!1122 = !DILocation(line: 55, column: 10, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 55, column: 9)
!1124 = !DILocation(line: 55, column: 13, scope: !1123)
!1125 = !DILocation(line: 55, column: 9, scope: !1119)
!1126 = !DILocation(line: 56, column: 9, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1123, file: !2, line: 55, column: 30)
!1128 = !DILocation(line: 57, column: 30, scope: !1127)
!1129 = !DILocation(line: 57, column: 9, scope: !1127)
!1130 = !DILocation(line: 57, column: 12, scope: !1127)
!1131 = !DILocation(line: 57, column: 28, scope: !1127)
!1132 = !DILocation(line: 58, column: 5, scope: !1127)
!1133 = !DILocation(line: 59, column: 1, scope: !1119)
!1134 = distinct !DISubprogram(name: "lwan_module_register", scope: !2, file: !2, line: 66, type: !1135, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{null, !608, !778}
!1137 = !DILocalVariable(name: "l", arg: 1, scope: !1134, file: !2, line: 66, type: !608)
!1138 = !DILocation(line: 66, column: 42, scope: !1134)
!1139 = !DILocalVariable(name: "module", arg: 2, scope: !1134, file: !2, line: 66, type: !778)
!1140 = !DILocation(line: 66, column: 66, scope: !1134)
!1141 = !DILocation(line: 68, column: 10, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 68, column: 9)
!1143 = !DILocation(line: 68, column: 18, scope: !1142)
!1144 = !DILocation(line: 68, column: 9, scope: !1134)
!1145 = !DILocation(line: 69, column: 9, scope: !1142)
!1146 = !DILocation(line: 71, column: 5, scope: !1134)
!1147 = !DILocation(line: 72, column: 14, scope: !1134)
!1148 = !DILocation(line: 72, column: 17, scope: !1134)
!1149 = !DILocation(line: 72, column: 34, scope: !1134)
!1150 = !DILocation(line: 72, column: 42, scope: !1134)
!1151 = !DILocation(line: 72, column: 48, scope: !1134)
!1152 = !DILocation(line: 72, column: 5, scope: !1134)
!1153 = !DILocation(line: 73, column: 1, scope: !1134)
!1154 = distinct !DISubprogram(name: "setup_from_config", scope: !2, file: !2, line: 325, type: !1155, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!593, !608}
!1157 = !DILocalVariable(name: "lwan", arg: 1, scope: !1154, file: !2, line: 325, type: !608)
!1158 = !DILocation(line: 325, column: 39, scope: !1154)
!1159 = !DILocalVariable(name: "conf", scope: !1154, file: !2, line: 327, type: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_t", file: !102, line: 32, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_t_", file: !102, line: 41, size: 192, elements: !1162)
!1162 = !{!1163, !1216, !1217}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1161, file: !102, line: 42, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1166, line: 7, baseType: !1167)
!1166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1168, line: 49, size: 1728, elements: !1169)
!1168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1185, !1187, !1188, !1189, !1190, !1191, !1193, !1197, !1200, !1202, !1205, !1208, !1209, !1210, !1211, !1212}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1167, file: !1168, line: 51, baseType: !40, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1167, file: !1168, line: 54, baseType: !359, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1167, file: !1168, line: 55, baseType: !359, size: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1167, file: !1168, line: 56, baseType: !359, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1167, file: !1168, line: 57, baseType: !359, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1167, file: !1168, line: 58, baseType: !359, size: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1167, file: !1168, line: 59, baseType: !359, size: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1167, file: !1168, line: 60, baseType: !359, size: 64, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1167, file: !1168, line: 61, baseType: !359, size: 64, offset: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1167, file: !1168, line: 64, baseType: !359, size: 64, offset: 576)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1167, file: !1168, line: 65, baseType: !359, size: 64, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1167, file: !1168, line: 66, baseType: !359, size: 64, offset: 704)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1167, file: !1168, line: 68, baseType: !1183, size: 64, offset: 768)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1168, line: 36, flags: DIFlagFwdDecl)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1167, file: !1168, line: 70, baseType: !1186, size: 64, offset: 832)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1167, file: !1168, line: 72, baseType: !40, size: 32, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1167, file: !1168, line: 73, baseType: !40, size: 32, offset: 928)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1167, file: !1168, line: 74, baseType: !735, size: 64, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1167, file: !1168, line: 77, baseType: !360, size: 16, offset: 1024)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1167, file: !1168, line: 78, baseType: !1192, size: 8, offset: 1040)
!1192 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1167, file: !1168, line: 79, baseType: !1194, size: 8, offset: 1048)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 1)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1167, file: !1168, line: 81, baseType: !1198, size: 64, offset: 1088)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1168, line: 43, baseType: null)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1167, file: !1168, line: 89, baseType: !1201, size: 64, offset: 1152)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !362, line: 153, baseType: !665)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1167, file: !1168, line: 91, baseType: !1203, size: 64, offset: 1216)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1168, line: 37, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1167, file: !1168, line: 92, baseType: !1206, size: 64, offset: 1280)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1168, line: 38, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1167, file: !1168, line: 93, baseType: !1186, size: 64, offset: 1344)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1167, file: !1168, line: 94, baseType: !358, size: 64, offset: 1408)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1167, file: !1168, line: 95, baseType: !350, size: 64, offset: 1472)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1167, file: !1168, line: 96, baseType: !40, size: 32, offset: 1536)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1167, file: !1168, line: 98, baseType: !1213, size: 160, offset: 1568)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !1214)
!1214 = !{!1215}
!1215 = !DISubrange(count: 20)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1161, file: !102, line: 43, baseType: !40, size: 32, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "error_message", scope: !1161, file: !102, line: 44, baseType: !359, size: 64, offset: 128)
!1218 = !DILocation(line: 327, column: 14, scope: !1154)
!1219 = !DILocalVariable(name: "line", scope: !1154, file: !2, line: 328, type: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_line_t", file: !102, line: 33, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_line_t_", file: !102, line: 47, size: 8384, elements: !1222)
!1222 = !{!1223, !1236, !1238}
!1223 = !DIDerivedType(tag: DW_TAG_member, scope: !1221, file: !102, line: 48, baseType: !1224, size: 128)
!1224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1221, file: !102, line: 48, size: 128, elements: !1225)
!1225 = !{!1226, !1231}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !1224, file: !102, line: 51, baseType: !1227, size: 128)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1224, file: !102, line: 49, size: 128, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1227, file: !102, line: 50, baseType: !359, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1227, file: !102, line: 50, baseType: !359, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1224, file: !102, line: 54, baseType: !1232, size: 128)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1224, file: !102, line: 52, size: 128, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1232, file: !102, line: 53, baseType: !359, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1232, file: !102, line: 53, baseType: !359, size: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1221, file: !102, line: 56, baseType: !1237, size: 32, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_line_type_t", file: !102, line: 39, baseType: !101)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1221, file: !102, line: 57, baseType: !1239, size: 8192, offset: 160)
!1239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1240)
!1240 = !{!1241}
!1241 = !DISubrange(count: 1024)
!1242 = !DILocation(line: 328, column: 19, scope: !1154)
!1243 = !DILocalVariable(name: "has_listener", scope: !1154, file: !2, line: 329, type: !593)
!1244 = !DILocation(line: 329, column: 10, scope: !1154)
!1245 = !DILocalVariable(name: "path_buf", scope: !1154, file: !2, line: 330, type: !1246)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1247)
!1247 = !{!1248}
!1248 = !DISubrange(count: 4096)
!1249 = !DILocation(line: 330, column: 10, scope: !1154)
!1250 = !DILocalVariable(name: "path", scope: !1154, file: !2, line: 331, type: !752)
!1251 = !DILocation(line: 331, column: 17, scope: !1154)
!1252 = !DILocation(line: 333, column: 28, scope: !1154)
!1253 = !DILocation(line: 333, column: 12, scope: !1154)
!1254 = !DILocation(line: 333, column: 10, scope: !1154)
!1255 = !DILocation(line: 334, column: 5, scope: !1154)
!1256 = !DILocation(line: 336, column: 26, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 336, column: 9)
!1258 = !DILocation(line: 336, column: 32, scope: !1257)
!1259 = !DILocation(line: 336, column: 10, scope: !1257)
!1260 = !DILocation(line: 336, column: 9, scope: !1154)
!1261 = !DILocation(line: 337, column: 9, scope: !1257)
!1262 = !DILocation(line: 339, column: 29, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 339, column: 9)
!1264 = !DILocation(line: 339, column: 10, scope: !1263)
!1265 = !DILocation(line: 339, column: 9, scope: !1154)
!1266 = !DILocation(line: 340, column: 9, scope: !1263)
!1267 = !DILocation(line: 342, column: 5, scope: !1154)
!1268 = !DILocation(line: 342, column: 12, scope: !1154)
!1269 = !DILocation(line: 343, column: 22, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 342, column: 44)
!1271 = !DILocation(line: 343, column: 9, scope: !1270)
!1272 = !DILocation(line: 345, column: 30, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 345, column: 17)
!1274 = distinct !DILexicalBlock(scope: !1270, file: !2, line: 343, column: 28)
!1275 = !DILocation(line: 345, column: 35, scope: !1273)
!1276 = !DILocation(line: 345, column: 18, scope: !1273)
!1277 = !DILocation(line: 345, column: 17, scope: !1274)
!1278 = !DILocation(line: 346, column: 83, scope: !1273)
!1279 = !DILocation(line: 346, column: 88, scope: !1273)
!1280 = !DILocation(line: 347, column: 44, scope: !1273)
!1281 = !DILocation(line: 347, column: 29, scope: !1273)
!1282 = !DILocation(line: 346, column: 67, scope: !1273)
!1283 = !DILocation(line: 346, column: 51, scope: !1273)
!1284 = !DILocation(line: 346, column: 17, scope: !1273)
!1285 = !DILocation(line: 346, column: 23, scope: !1273)
!1286 = !DILocation(line: 346, column: 30, scope: !1273)
!1287 = !DILocation(line: 346, column: 49, scope: !1273)
!1288 = !DILocation(line: 348, column: 35, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1273, file: !2, line: 348, column: 22)
!1290 = !DILocation(line: 348, column: 40, scope: !1289)
!1291 = !DILocation(line: 348, column: 23, scope: !1289)
!1292 = !DILocation(line: 348, column: 22, scope: !1273)
!1293 = !DILocation(line: 349, column: 54, scope: !1289)
!1294 = !DILocation(line: 349, column: 59, scope: !1289)
!1295 = !DILocation(line: 350, column: 44, scope: !1289)
!1296 = !DILocation(line: 349, column: 38, scope: !1289)
!1297 = !DILocation(line: 349, column: 17, scope: !1289)
!1298 = !DILocation(line: 349, column: 23, scope: !1289)
!1299 = !DILocation(line: 349, column: 30, scope: !1289)
!1300 = !DILocation(line: 349, column: 36, scope: !1289)
!1301 = !DILocation(line: 351, column: 35, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1289, file: !2, line: 351, column: 22)
!1303 = !DILocation(line: 351, column: 40, scope: !1302)
!1304 = !DILocation(line: 351, column: 23, scope: !1302)
!1305 = !DILocation(line: 351, column: 22, scope: !1289)
!1306 = !DILocation(line: 352, column: 59, scope: !1302)
!1307 = !DILocation(line: 352, column: 64, scope: !1302)
!1308 = !DILocation(line: 353, column: 44, scope: !1302)
!1309 = !DILocation(line: 352, column: 43, scope: !1302)
!1310 = !DILocation(line: 352, column: 17, scope: !1302)
!1311 = !DILocation(line: 352, column: 23, scope: !1302)
!1312 = !DILocation(line: 352, column: 30, scope: !1302)
!1313 = !DILocation(line: 352, column: 41, scope: !1302)
!1314 = !DILocation(line: 354, column: 35, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1302, file: !2, line: 354, column: 22)
!1316 = !DILocation(line: 354, column: 40, scope: !1315)
!1317 = !DILocation(line: 354, column: 23, scope: !1315)
!1318 = !DILocation(line: 354, column: 22, scope: !1302)
!1319 = !DILocation(line: 355, column: 63, scope: !1315)
!1320 = !DILocation(line: 355, column: 68, scope: !1315)
!1321 = !DILocation(line: 356, column: 44, scope: !1315)
!1322 = !DILocation(line: 355, column: 40, scope: !1315)
!1323 = !DILocation(line: 355, column: 17, scope: !1315)
!1324 = !DILocation(line: 355, column: 23, scope: !1315)
!1325 = !DILocation(line: 355, column: 30, scope: !1315)
!1326 = !DILocation(line: 355, column: 38, scope: !1315)
!1327 = !DILocation(line: 357, column: 35, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !1315, file: !2, line: 357, column: 22)
!1329 = !DILocation(line: 357, column: 40, scope: !1328)
!1330 = !DILocation(line: 357, column: 23, scope: !1328)
!1331 = !DILocation(line: 357, column: 22, scope: !1315)
!1332 = !DILocalVariable(name: "n_threads", scope: !1333, file: !2, line: 358, type: !665)
!1333 = distinct !DILexicalBlock(scope: !1328, file: !2, line: 357, column: 57)
!1334 = !DILocation(line: 358, column: 22, scope: !1333)
!1335 = !DILocation(line: 358, column: 50, scope: !1333)
!1336 = !DILocation(line: 358, column: 55, scope: !1333)
!1337 = !DILocation(line: 358, column: 77, scope: !1333)
!1338 = !DILocation(line: 358, column: 62, scope: !1333)
!1339 = !DILocation(line: 358, column: 34, scope: !1333)
!1340 = !DILocation(line: 359, column: 21, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1333, file: !2, line: 359, column: 21)
!1342 = !DILocation(line: 359, column: 31, scope: !1341)
!1343 = !DILocation(line: 359, column: 21, scope: !1333)
!1344 = !DILocation(line: 360, column: 74, scope: !1341)
!1345 = !DILocation(line: 360, column: 21, scope: !1341)
!1346 = !DILocation(line: 361, column: 62, scope: !1333)
!1347 = !DILocation(line: 361, column: 42, scope: !1333)
!1348 = !DILocation(line: 361, column: 17, scope: !1333)
!1349 = !DILocation(line: 361, column: 23, scope: !1333)
!1350 = !DILocation(line: 361, column: 30, scope: !1333)
!1351 = !DILocation(line: 361, column: 40, scope: !1333)
!1352 = !DILocation(line: 362, column: 13, scope: !1333)
!1353 = !DILocation(line: 364, column: 68, scope: !1328)
!1354 = !DILocation(line: 364, column: 73, scope: !1328)
!1355 = !DILocation(line: 364, column: 17, scope: !1328)
!1356 = !DILocation(line: 365, column: 13, scope: !1274)
!1357 = !DILocation(line: 367, column: 18, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 367, column: 17)
!1359 = !DILocation(line: 367, column: 17, scope: !1274)
!1360 = !DILocation(line: 368, column: 30, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1358, file: !2, line: 367, column: 32)
!1362 = !DILocation(line: 369, column: 34, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1361, file: !2, line: 369, column: 21)
!1364 = !DILocation(line: 369, column: 42, scope: !1363)
!1365 = !DILocation(line: 369, column: 22, scope: !1363)
!1366 = !DILocation(line: 369, column: 21, scope: !1361)
!1367 = !DILocation(line: 370, column: 50, scope: !1363)
!1368 = !DILocation(line: 370, column: 21, scope: !1363)
!1369 = !DILocation(line: 372, column: 74, scope: !1363)
!1370 = !DILocation(line: 372, column: 82, scope: !1363)
!1371 = !DILocation(line: 372, column: 21, scope: !1363)
!1372 = !DILocation(line: 373, column: 13, scope: !1361)
!1373 = !DILocation(line: 374, column: 17, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1358, file: !2, line: 373, column: 20)
!1375 = !DILocation(line: 376, column: 13, scope: !1274)
!1376 = !DILocation(line: 378, column: 13, scope: !1274)
!1377 = !DILocation(line: 379, column: 9, scope: !1274)
!1378 = distinct !{!1378, !1267, !1379, !872}
!1379 = !DILocation(line: 380, column: 5, scope: !1154)
!1380 = !DILocation(line: 382, column: 14, scope: !1381)
!1381 = distinct !DILexicalBlock(scope: !1154, file: !2, line: 382, column: 9)
!1382 = !DILocation(line: 382, column: 9, scope: !1381)
!1383 = !DILocation(line: 382, column: 9, scope: !1154)
!1384 = !DILocation(line: 383, column: 9, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1381, file: !2, line: 382, column: 29)
!1386 = !DILocation(line: 387, column: 5, scope: !1154)
!1387 = !DILocation(line: 389, column: 5, scope: !1154)
!1388 = !DILocation(line: 390, column: 1, scope: !1154)
!1389 = distinct !DISubprogram(name: "get_number_of_cpus", scope: !2, file: !2, line: 423, type: !1390, scopeLine: 424, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!360}
!1392 = !DILocalVariable(name: "n_online_cpus", scope: !1389, file: !2, line: 425, type: !665)
!1393 = !DILocation(line: 425, column: 10, scope: !1389)
!1394 = !DILocation(line: 425, column: 26, scope: !1389)
!1395 = !DILocation(line: 426, column: 9, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !1389, file: !2, line: 426, column: 9)
!1397 = !DILocation(line: 426, column: 9, scope: !1389)
!1398 = !DILocation(line: 427, column: 9, scope: !1399)
!1399 = distinct !DILexicalBlock(scope: !1396, file: !2, line: 426, column: 38)
!1400 = !DILocation(line: 428, column: 9, scope: !1399)
!1401 = !DILocation(line: 430, column: 32, scope: !1389)
!1402 = !DILocation(line: 430, column: 12, scope: !1389)
!1403 = !DILocation(line: 430, column: 5, scope: !1389)
!1404 = !DILocation(line: 431, column: 1, scope: !1389)
!1405 = distinct !DISubprogram(name: "setup_open_file_count_limits", scope: !2, file: !2, line: 393, type: !1406, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!1089}
!1408 = !DILocalVariable(name: "r", scope: !1405, file: !2, line: 395, type: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !328, line: 139, size: 128, elements: !1410)
!1410 = !{!1411, !1412}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !1409, file: !328, line: 142, baseType: !1089, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !1409, file: !328, line: 144, baseType: !1089, size: 64, offset: 64)
!1413 = !DILocation(line: 395, column: 19, scope: !1405)
!1414 = !DILocation(line: 397, column: 9, scope: !1415)
!1415 = distinct !DILexicalBlock(scope: !1405, file: !2, line: 397, column: 9)
!1416 = !DILocation(line: 397, column: 38, scope: !1415)
!1417 = !DILocation(line: 397, column: 9, scope: !1405)
!1418 = !DILocation(line: 398, column: 9, scope: !1415)
!1419 = !DILocation(line: 400, column: 11, scope: !1420)
!1420 = distinct !DILexicalBlock(scope: !1405, file: !2, line: 400, column: 9)
!1421 = !DILocation(line: 400, column: 25, scope: !1420)
!1422 = !DILocation(line: 400, column: 20, scope: !1420)
!1423 = !DILocation(line: 400, column: 9, scope: !1405)
!1424 = !DILocation(line: 401, column: 18, scope: !1420)
!1425 = !DILocation(line: 401, column: 9, scope: !1420)
!1426 = !DILocation(line: 403, column: 11, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1405, file: !2, line: 403, column: 9)
!1428 = !DILocation(line: 403, column: 20, scope: !1427)
!1429 = !DILocation(line: 403, column: 9, scope: !1405)
!1430 = !DILocation(line: 404, column: 11, scope: !1427)
!1431 = !DILocation(line: 404, column: 20, scope: !1427)
!1432 = !DILocation(line: 404, column: 9, scope: !1427)
!1433 = !DILocation(line: 405, column: 16, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1427, file: !2, line: 405, column: 14)
!1435 = !DILocation(line: 405, column: 29, scope: !1434)
!1436 = !DILocation(line: 405, column: 25, scope: !1434)
!1437 = !DILocation(line: 405, column: 14, scope: !1427)
!1438 = !DILocation(line: 406, column: 24, scope: !1434)
!1439 = !DILocation(line: 406, column: 11, scope: !1434)
!1440 = !DILocation(line: 406, column: 20, scope: !1434)
!1441 = !DILocation(line: 406, column: 9, scope: !1434)
!1442 = !DILocation(line: 408, column: 9, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1405, file: !2, line: 408, column: 9)
!1444 = !DILocation(line: 408, column: 38, scope: !1443)
!1445 = !DILocation(line: 408, column: 9, scope: !1405)
!1446 = !DILocation(line: 409, column: 9, scope: !1443)
!1447 = !DILocation(line: 411, column: 14, scope: !1405)
!1448 = !DILocation(line: 411, column: 5, scope: !1405)
!1449 = !DILocation(line: 412, column: 1, scope: !1405)
!1450 = distinct !DISubprogram(name: "allocate_connections", scope: !2, file: !2, line: 415, type: !1451, scopeLine: 416, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{null, !608, !350}
!1453 = !DILocalVariable(name: "l", arg: 1, scope: !1450, file: !2, line: 415, type: !608)
!1454 = !DILocation(line: 415, column: 30, scope: !1450)
!1455 = !DILocalVariable(name: "max_open_files", arg: 2, scope: !1450, file: !2, line: 415, type: !350)
!1456 = !DILocation(line: 415, column: 40, scope: !1450)
!1457 = !DILocation(line: 417, column: 23, scope: !1450)
!1458 = !DILocation(line: 417, column: 16, scope: !1450)
!1459 = !DILocation(line: 417, column: 5, scope: !1450)
!1460 = !DILocation(line: 417, column: 8, scope: !1450)
!1461 = !DILocation(line: 417, column: 14, scope: !1450)
!1462 = !DILocation(line: 418, column: 10, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1450, file: !2, line: 418, column: 9)
!1464 = !DILocation(line: 418, column: 13, scope: !1463)
!1465 = !DILocation(line: 418, column: 9, scope: !1450)
!1466 = !DILocation(line: 419, column: 9, scope: !1463)
!1467 = !DILocation(line: 420, column: 1, scope: !1450)
!1468 = distinct !DISubprogram(name: "lwan_shutdown", scope: !2, file: !2, line: 503, type: !1012, scopeLine: 504, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !803)
!1469 = !DILocalVariable(name: "l", arg: 1, scope: !1468, file: !2, line: 503, type: !608)
!1470 = !DILocation(line: 503, column: 23, scope: !1468)
!1471 = !DILocation(line: 505, column: 5, scope: !1468)
