; ModuleID = '/home/raj/lwan/common/lwan-serve-files.c'
source_filename = "/home/raj/lwan/common/lwan-serve-files.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lwan_module_t_ = type { ptr, ptr, ptr, ptr, ptr, i32 }
%struct.lwan_var_descriptor_t_ = type { ptr, i64, ptr, ptr, ptr, ptr }
%struct.cache_funcs_t_ = type { ptr, ptr, ptr, i64 }
%struct.lwan_serve_files_settings_t = type { ptr, ptr, i8 }
%struct.serve_files_priv_t_ = type { ptr, %struct.anon.6, i32, ptr, ptr, i8 }
%struct.anon.6 = type { ptr, i64, i32 }
%struct.lwan_request_t_ = type { i32, i32, %struct.lwan_value_t_, %struct.lwan_value_t_, ptr, %struct.anon.1, %struct.anon.1, %struct.anon.2, %struct.lwan_response_t_ }
%struct.lwan_value_t_ = type { ptr, i64 }
%struct.anon.1 = type { ptr, i64 }
%struct.anon.2 = type { i64, %struct.anon.3 }
%struct.anon.3 = type { i64, i64 }
%struct.lwan_response_t_ = type { ptr, ptr, i64, ptr, %struct.anon.5 }
%struct.anon.5 = type { ptr, ptr, ptr }
%struct.lwan_connection_t_ = type { i32, i32, ptr, ptr, i32, i32 }
%struct.file_cache_entry_t_ = type { %struct.cache_entry_t, %struct.anon.7, ptr, ptr }
%struct.cache_entry_t = type { %struct.list_node, ptr, i32, i32, i64 }
%struct.list_node = type { ptr, ptr }
%struct.anon.7 = type { [31 x i8], i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "serve_files", scope: !2, file: !3, line: 1011, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "lwan_module_serve_files", scope: !3, file: !3, line: 1009, type: !4, scopeLine: 1010, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !259, retainedNodes: !519)
!3 = !DIFile(filename: "common/lwan-serve-files.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "800b7015121bf02dbd7f42c60f7a26e9")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_module_t", file: !9, line: 104, baseType: !10)
!9 = !DIFile(filename: "common/lwan.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "56f65bbbfce1c5452d6905964ca2b84f")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_module_t_", file: !9, line: 227, size: 384, elements: !11)
!11 = !{!12, !16, !21, !29, !33, !247}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !10, file: !9, line: 228, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !10, file: !9, line: 229, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "init_from_hash", scope: !10, file: !9, line: 230, baseType: !22, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!20, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !28, line: 6, flags: DIFlagFwdDecl)
!28 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!29 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !10, file: !9, line: 231, baseType: !30, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !20}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !10, file: !9, line: 232, baseType: !34, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !57, !246, !20}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !9, line: 131, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 114, baseType: !39, size: 32, elements: !40)
!39 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!41 = !DIEnumerator(name: "HTTP_OK", value: 200)
!42 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!43 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!44 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!45 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!46 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!47 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!48 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!49 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!50 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!51 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!52 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!53 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!54 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!55 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!56 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !9, line: 106, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !9, line: 206, size: 1280, elements: !60)
!60 = !{!61, !76, !77, !87, !88, !189, !200, !201, !213}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !59, file: !9, line: 207, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !9, line: 156, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 145, baseType: !64, size: 32, elements: !65)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!66 = !DIEnumerator(name: "REQUEST_ALL_FLAGS", value: -1)
!67 = !DIEnumerator(name: "REQUEST_METHOD_GET", value: 1)
!68 = !DIEnumerator(name: "REQUEST_METHOD_HEAD", value: 2)
!69 = !DIEnumerator(name: "REQUEST_METHOD_POST", value: 4)
!70 = !DIEnumerator(name: "REQUEST_ACCEPT_DEFLATE", value: 8)
!71 = !DIEnumerator(name: "REQUEST_ACCEPT_GZIP", value: 16)
!72 = !DIEnumerator(name: "REQUEST_IS_HTTP_1_0", value: 32)
!73 = !DIEnumerator(name: "RESPONSE_SENT_HEADERS", value: 64)
!74 = !DIEnumerator(name: "RESPONSE_CHUNKED_ENCODING", value: 128)
!75 = !DIEnumerator(name: "RESPONSE_NO_CONTENT_LENGTH", value: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !59, file: !9, line: 208, baseType: !64, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !59, file: !9, line: 209, baseType: !78, size: 128, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !9, line: 110, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !9, line: 191, size: 128, elements: !80)
!80 = !{!81, !83}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !9, line: 192, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !79, file: !9, line: 193, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!86 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !59, file: !9, line: 210, baseType: !78, size: 128, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !59, file: !9, line: 211, baseType: !89, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !9, line: 112, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !9, line: 196, size: 256, elements: !92)
!92 = !{!93, !103, !104, !109, !187, !188}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !9, line: 199, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !9, line: 165, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 158, baseType: !64, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102}
!97 = !DIEnumerator(name: "CONN_MASK", value: -1)
!98 = !DIEnumerator(name: "CONN_KEEP_ALIVE", value: 1)
!99 = !DIEnumerator(name: "CONN_IS_ALIVE", value: 2)
!100 = !DIEnumerator(name: "CONN_SHOULD_RESUME_CORO", value: 4)
!101 = !DIEnumerator(name: "CONN_WRITE_EVENTS", value: 8)
!102 = !DIEnumerator(name: "CONN_MUST_READ", value: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !91, file: !9, line: 200, baseType: !39, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !91, file: !9, line: 201, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !107, line: 34, baseType: !108)
!107 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !107, line: 34, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !91, file: !9, line: 202, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !9, line: 108, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !9, line: 253, size: 832, elements: !113)
!113 = !{!114, !165, !179, !180, !184}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !112, file: !9, line: 254, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !9, line: 103, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !9, line: 275, size: 640, elements: !118)
!118 = !{!119, !143, !144, !151, !153, !164}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !117, file: !9, line: 276, baseType: !120, size: 128)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !121, line: 25, baseType: !122)
!121 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !121, line: 41, size: 128, elements: !123)
!123 = !{!124, !142}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !122, file: !121, line: 42, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !121, line: 26, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !121, line: 29, size: 640, elements: !128)
!128 = !{!129, !133, !141}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !121, line: 30, baseType: !130, size: 512)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 512, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !127, file: !121, line: 31, baseType: !134, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !121, line: 27, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !121, line: 35, size: 192, elements: !137)
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !136, file: !121, line: 36, baseType: !82, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !121, line: 37, baseType: !20, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !136, file: !121, line: 38, baseType: !134, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !127, file: !121, line: 32, baseType: !64, size: 32, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !122, file: !121, line: 43, baseType: !30, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !117, file: !9, line: 277, baseType: !89, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !117, file: !9, line: 283, baseType: !145, size: 128, offset: 192)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !117, file: !9, line: 279, size: 128, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !145, file: !9, line: 280, baseType: !110, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !145, file: !9, line: 281, baseType: !39, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !145, file: !9, line: 282, baseType: !150, size: 16, offset: 96)
!150 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !117, file: !9, line: 285, baseType: !152, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !9, line: 286, baseType: !154, size: 192, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !9, line: 111, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !9, line: 266, size: 192, elements: !156)
!156 = !{!157, !158, !159, !161, !162, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !155, file: !9, line: 267, baseType: !82, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !155, file: !9, line: 268, baseType: !150, size: 16, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !155, file: !9, line: 269, baseType: !160, size: 8, offset: 80)
!160 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !155, file: !9, line: 270, baseType: !160, size: 8, offset: 88)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !155, file: !9, line: 271, baseType: !39, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !155, file: !9, line: 272, baseType: !150, size: 16, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !117, file: !9, line: 287, baseType: !64, size: 32, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !112, file: !9, line: 259, baseType: !166, size: 576, offset: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !112, file: !9, line: 255, size: 576, elements: !167)
!167 = !{!168, !172, !173}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !166, file: !9, line: 256, baseType: !169, size: 240)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 240, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 30)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !166, file: !9, line: 257, baseType: !169, size: 240, offset: 240)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !166, file: !9, line: 258, baseType: !174, size: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !175, line: 10, baseType: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !177, line: 160, baseType: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!178 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !112, file: !9, line: 261, baseType: !64, size: 32, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !112, file: !9, line: 262, baseType: !181, size: 64, offset: 672)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 2)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !112, file: !9, line: 263, baseType: !185, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !186, line: 27, baseType: !86)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !91, file: !9, line: 203, baseType: !64, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !9, line: 203, baseType: !64, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !59, file: !9, line: 216, baseType: !190, size: 128, offset: 384)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !59, file: !9, line: 213, size: 128, elements: !191)
!191 = !{!192, !199}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !190, file: !9, line: 214, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !9, line: 105, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !9, line: 173, size: 128, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !195, file: !9, line: 174, baseType: !82, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !195, file: !9, line: 175, baseType: !82, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !190, file: !9, line: 215, baseType: !84, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !59, file: !9, line: 216, baseType: !190, size: 128, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !59, file: !9, line: 223, baseType: !202, size: 192, offset: 640)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !59, file: !9, line: 217, size: 192, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !202, file: !9, line: 218, baseType: !174, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !202, file: !9, line: 222, baseType: !206, size: 128, offset: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !9, line: 219, size: 128, elements: !207)
!207 = !{!208, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !206, file: !9, line: 220, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !210, line: 56, baseType: !211)
!210 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !177, line: 152, baseType: !178)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !206, file: !9, line: 221, baseType: !209, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !59, file: !9, line: 224, baseType: !214, size: 448, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !9, line: 107, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !9, line: 178, size: 448, elements: !216)
!216 = !{!217, !234, !235, !236, !237}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !215, file: !9, line: 179, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !220, line: 25, baseType: !221)
!220 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !220, line: 27, size: 256, elements: !222)
!222 = !{!223, !228, !233}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !221, file: !220, line: 31, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !221, file: !220, line: 28, size: 64, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !224, file: !220, line: 29, baseType: !82, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !224, file: !220, line: 30, baseType: !13, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !221, file: !220, line: 34, baseType: !229, size: 128, offset: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !221, file: !220, line: 32, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !229, file: !220, line: 33, baseType: !84, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !229, file: !220, line: 33, baseType: !84, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !221, file: !220, line: 35, baseType: !39, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !215, file: !9, line: 180, baseType: !13, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !215, file: !9, line: 181, baseType: !84, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !215, file: !9, line: 182, baseType: !193, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !215, file: !9, line: 188, baseType: !238, size: 192, offset: 256)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !9, line: 184, size: 192, elements: !239)
!239 = !{!240, !244, !245}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !238, file: !9, line: 185, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!37, !57, !20}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !9, line: 186, baseType: !20, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !238, file: !9, line: 187, baseType: !20, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !10, file: !9, line: 233, baseType: !248, size: 32, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_handler_flags_t", file: !9, line: 143, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 133, baseType: !39, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258}
!251 = !DIEnumerator(name: "HANDLER_PARSE_QUERY_STRING", value: 1)
!252 = !DIEnumerator(name: "HANDLER_PARSE_IF_MODIFIED_SINCE", value: 2)
!253 = !DIEnumerator(name: "HANDLER_PARSE_RANGE", value: 4)
!254 = !DIEnumerator(name: "HANDLER_PARSE_ACCEPT_ENCODING", value: 8)
!255 = !DIEnumerator(name: "HANDLER_PARSE_POST_DATA", value: 16)
!256 = !DIEnumerator(name: "HANDLER_MUST_AUTHORIZE", value: 32)
!257 = !DIEnumerator(name: "HANDLER_REMOVE_LEADING_SLASH", value: 64)
!258 = !DIEnumerator(name: "HANDLER_PARSE_MASK", value: 31)
!259 = distinct !DICompileUnit(language: DW_LANG_C11, file: !260, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !261, retainedTypes: !287, globals: !417, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "/home/raj/lwan/common/lwan-serve-files.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "800b7015121bf02dbd7f42c60f7a26e9")
!261 = !{!38, !63, !95, !249, !262}
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !263, line: 202, baseType: !39, size: 32, elements: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!265 = !DIEnumerator(name: "MSG_OOB", value: 1)
!266 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!267 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!268 = !DIEnumerator(name: "MSG_TRYHARD", value: 4)
!269 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!270 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!271 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!272 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!273 = !DIEnumerator(name: "MSG_EOR", value: 128)
!274 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!275 = !DIEnumerator(name: "MSG_FIN", value: 512)
!276 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!277 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!278 = !DIEnumerator(name: "MSG_RST", value: 4096)
!279 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!280 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!281 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!282 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!283 = !DIEnumerator(name: "MSG_BATCH", value: 262144)
!284 = !DIEnumerator(name: "MSG_ZEROCOPY", value: 67108864)
!285 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!286 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!287 = !{!20, !288, !82, !303, !308, !218, !313, !84, !323, !209, !333, !64}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_entry_t", file: !290, line: 27, size: 320, elements: !291)
!290 = !DIFile(filename: "common/lwan-cache.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "f48e19cadb0735f737f22aa65af51f83")
!291 = !{!292, !299, !300, !301, !302}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !289, file: !290, line: 28, baseType: !293, size: 128)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !294, line: 191, size: 128, elements: !295)
!294 = !DIFile(filename: "common/list.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "c0dffb77b1bbbbb179ef8d69b9e1dd8c")
!295 = !{!296, !298}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !294, line: 193, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !293, file: !294, line: 193, baseType: !297, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !289, file: !290, line: 29, baseType: !82, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !289, file: !290, line: 30, baseType: !39, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !290, line: 31, baseType: !39, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !289, file: !290, line: 32, baseType: !174, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "redir_cache_data_t", file: !3, line: 55, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redir_cache_data_t_", file: !3, line: 110, size: 64, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "redir_to", scope: !305, file: !3, line: 111, baseType: !82, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "dir_list_cache_data_t", file: !3, line: 54, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_list_cache_data_t_", file: !3, line: 106, size: 64, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rendered", scope: !310, file: !3, line: 107, baseType: !218, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mmap_cache_data_t", file: !3, line: 52, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mmap_cache_data_t_", file: !3, line: 85, size: 256, elements: !316)
!316 = !{!317, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !315, file: !3, line: 90, baseType: !318, size: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !315, file: !3, line: 86, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !318, file: !3, line: 87, baseType: !20, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !3, line: 89, baseType: !86, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed", scope: !315, file: !3, line: 90, baseType: !318, size: 128, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sendfile_cache_data_t", file: !3, line: 53, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sendfile_cache_data_t_", file: !3, line: 93, size: 256, elements: !326)
!326 = !{!327, !332}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "compressed", scope: !325, file: !3, line: 103, baseType: !328, size: 128)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !325, file: !3, line: 100, size: 128, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !328, file: !3, line: 101, baseType: !82, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !328, file: !3, line: 102, baseType: !84, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed", scope: !325, file: !3, line: 103, baseType: !328, size: 128, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_cache_entry_t", file: !3, line: 50, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_cache_entry_t_", file: !3, line: 114, size: 768, elements: !336)
!336 = !{!337, !338, !346, !347}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !335, file: !3, line: 115, baseType: !289, size: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "last_modified", scope: !335, file: !3, line: 120, baseType: !339, size: 320, offset: 320)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !335, file: !3, line: 117, size: 320, elements: !340)
!340 = !{!341, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !339, file: !3, line: 118, baseType: !342, size: 248)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 248, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 31)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !339, file: !3, line: 119, baseType: !174, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !335, file: !3, line: 122, baseType: !13, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !335, file: !3, line: 123, baseType: !348, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_funcs_t", file: !3, line: 51, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_funcs_t_", file: !3, line: 74, size: 256, elements: !352)
!352 = !{!353, !354, !415, !416}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "serve", scope: !351, file: !3, line: 75, baseType: !241, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !351, file: !3, line: 77, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!160, !333, !358, !13, !379}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "serve_files_priv_t", file: !3, line: 49, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "serve_files_priv_t_", file: !3, line: 57, size: 512, elements: !361)
!361 = !{!362, !365, !371, !372, !373, !378}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !360, file: !3, line: 58, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "cache_t", file: !290, line: 40, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !360, file: !3, line: 64, baseType: !366, size: 192, offset: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !3, line: 60, size: 192, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !366, file: !3, line: 61, baseType: !82, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "path_len", scope: !366, file: !3, line: 62, baseType: !84, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !366, file: !3, line: 63, baseType: !64, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "open_mode", scope: !360, file: !3, line: 66, baseType: !64, size: 32, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "index_html", scope: !360, file: !3, line: 67, baseType: !13, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "directory_list_tpl", scope: !360, file: !3, line: 69, baseType: !374, size: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_t", file: !376, line: 25, baseType: !377)
!376 = !DIFile(filename: "common/lwan-template.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1f1d0e1deded933cc0657e991f0859fe")
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_tpl_t_", file: !376, line: 25, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "serve_precompressed_files", scope: !360, file: !3, line: 71, baseType: !160, size: 8, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !381, line: 26, size: 1152, elements: !382)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!382 = !{!383, !385, !387, !389, !391, !393, !395, !396, !397, !398, !400, !402, !409, !410, !411}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !380, file: !381, line: 31, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !177, line: 145, baseType: !86)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !380, file: !381, line: 36, baseType: !386, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !177, line: 148, baseType: !86)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !380, file: !381, line: 44, baseType: !388, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !177, line: 151, baseType: !86)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !380, file: !381, line: 45, baseType: !390, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !177, line: 150, baseType: !39)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !380, file: !381, line: 47, baseType: !392, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !177, line: 146, baseType: !39)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !380, file: !381, line: 48, baseType: !394, size: 32, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !177, line: 147, baseType: !39)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !380, file: !381, line: 50, baseType: !64, size: 32, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !380, file: !381, line: 52, baseType: !384, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !380, file: !381, line: 57, baseType: !211, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !380, file: !381, line: 61, baseType: !399, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !177, line: 175, baseType: !178)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !380, file: !381, line: 63, baseType: !401, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !177, line: 180, baseType: !178)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !380, file: !381, line: 74, baseType: !403, size: 128, offset: 576)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !404, line: 11, size: 128, elements: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !403, file: !404, line: 16, baseType: !176, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !403, file: !404, line: 21, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !177, line: 197, baseType: !178)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !380, file: !381, line: 75, baseType: !403, size: 128, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !380, file: !381, line: 76, baseType: !403, size: 128, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !380, file: !381, line: 89, baseType: !412, size: 192, offset: 960)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 192, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 3)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !351, file: !3, line: 81, baseType: !30, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "struct_size", scope: !351, file: !3, line: 82, baseType: !84, size: 64, offset: 192)
!417 = !{!418, !0, !423, !428, !433, !438, !443, !445, !450, !455, !460, !465, !470, !472, !477, !482, !484, !486, !491, !494, !496, !501, !503, !506, !508, !511, !513, !520, !522, !524, !526, !531, !536, !538, !540, !542, !544, !569, !571, !573, !575, !577, !579, !582, !584, !586, !588, !593, !598, !600, !602, !604, !606, !609, !611, !613, !618, !623}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1012, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 96, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 12)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !3, line: 646, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 328, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 41)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !3, line: 646, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 136, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 17)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !3, line: 646, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 24)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !3, line: 652, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 280, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 35)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !3, line: 659, type: !169, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !3, line: 666, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 56, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 7)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !3, line: 673, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 176, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 22)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !3, line: 680, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 336, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 42)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !3, line: 688, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 88, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 11)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !3, line: 474, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 40, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 5)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "redir_funcs", scope: !259, file: !3, line: 183, type: !349, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !3, line: 962, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 72, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 9)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !3, line: 446, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 4)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !3, line: 449, type: !462, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "dirlist_funcs", scope: !259, file: !3, line: 176, type: !349, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !3, line: 754, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 112, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 14)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !3, line: 757, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 136, elements: !431)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "compression_none", scope: !259, file: !3, line: 45, type: !13, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !3, line: 433, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 80, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 10)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "mmap_funcs", scope: !259, file: !3, line: 162, type: !349, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !3, line: 47, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !131)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "compression_deflate", scope: !259, file: !3, line: 47, type: !13, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !3, line: 361, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 80, elements: !499)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !3, line: 361, type: !505, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "deflated_header_size", scope: !515, file: !3, line: 311, type: !518, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "is_compression_worthy", scope: !3, file: !3, line: 308, type: !516, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!516 = !DISubroutineType(types: !517)
!517 = !{!160, !518, !518}
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!519 = !{}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "sendfile_funcs", scope: !259, file: !3, line: 169, type: !349, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !3, line: 46, type: !467, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "compression_gzip", scope: !259, file: !3, line: 46, type: !13, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !3, line: 393, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 48, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 6)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !3, line: 208, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 6104, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 763)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "directory_list_tpl_str", scope: !259, file: !3, line: 208, type: !13, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !3, line: 201, type: !498, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !3, line: 202, type: !474, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !3, line: 203, type: !498, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "file_list_desc", scope: !259, file: !3, line: 200, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 1536, elements: !480)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_var_descriptor_t", file: !376, line: 26, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_var_descriptor_t_", file: !376, line: 30, size: 384, elements: !550)
!550 = !{!551, !552, !554, !558, !562, !567}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !549, file: !376, line: 31, baseType: !13, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !549, file: !376, line: 32, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "append_to_strbuf", scope: !549, file: !376, line: 34, baseType: !555, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !218, !20}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "get_is_empty", scope: !549, file: !376, line: 35, baseType: !559, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!160, !20}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !549, file: !376, line: 37, baseType: !563, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_list_generator_t", file: !376, line: 28, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!64, !105}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "list_desc", scope: !549, file: !376, line: 38, baseType: !568, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !3, line: 271, type: !447, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !3, line: 272, type: !479, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !3, line: 273, type: !498, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !3, line: 275, type: !467, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !3, line: 276, type: !467, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !3, line: 284, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16, elements: !182)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !3, line: 287, type: !479, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !3, line: 290, type: !479, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !3, line: 293, type: !479, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !3, line: 191, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 120, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 15)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !3, line: 192, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 152, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 19)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !3, line: 193, type: !590, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !3, line: 194, type: !590, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !3, line: 195, type: !590, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !3, line: 196, type: !590, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "file_list_item_desc", scope: !259, file: !3, line: 190, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 2688, elements: !448)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !3, line: 709, type: !467, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !3, line: 710, type: !462, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !3, line: 712, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 208, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 26)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !3, line: 723, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 168, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 21)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !3, line: 723, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 20)
!628 = !{i32 7, !"Dwarf Version", i32 5}
!629 = !{i32 2, !"Debug Info Version", i32 3}
!630 = !{i32 1, !"wchar_size", i32 4}
!631 = !{i32 8, !"PIC Level", i32 2}
!632 = !{i32 7, !"PIE Level", i32 2}
!633 = !{i32 7, !"uwtable", i32 2}
!634 = !{i32 7, !"frame-pointer", i32 2}
!635 = !{!"clang version 16.0.0"}
!636 = !DILocation(line: 1023, column: 5, scope: !2)
!637 = distinct !DISubprogram(name: "serve_files_init", scope: !3, file: !3, line: 637, type: !18, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!638 = !DILocalVariable(name: "args", arg: 1, scope: !637, file: !3, line: 637, type: !20)
!639 = !DILocation(line: 637, column: 24, scope: !637)
!640 = !DILocalVariable(name: "settings", scope: !637, file: !3, line: 639, type: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_serve_files_settings_t", file: !643, line: 28, size: 192, elements: !644)
!643 = !DIFile(filename: "common/lwan-serve-files.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "605079e730f5b74778523d0897dc40c2")
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "root_path", scope: !642, file: !643, line: 29, baseType: !13, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "index_html", scope: !642, file: !643, line: 30, baseType: !13, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "serve_precompressed_files", scope: !642, file: !643, line: 31, baseType: !160, size: 8, offset: 128)
!648 = !DILocation(line: 639, column: 41, scope: !637)
!649 = !DILocation(line: 639, column: 52, scope: !637)
!650 = !DILocalVariable(name: "canonical_root", scope: !637, file: !3, line: 640, type: !82)
!651 = !DILocation(line: 640, column: 11, scope: !637)
!652 = !DILocalVariable(name: "root_fd", scope: !637, file: !3, line: 641, type: !64)
!653 = !DILocation(line: 641, column: 9, scope: !637)
!654 = !DILocalVariable(name: "priv", scope: !637, file: !3, line: 642, type: !358)
!655 = !DILocation(line: 642, column: 25, scope: !637)
!656 = !DILocalVariable(name: "open_mode", scope: !637, file: !3, line: 643, type: !64)
!657 = !DILocation(line: 643, column: 9, scope: !637)
!658 = !DILocation(line: 645, column: 10, scope: !659)
!659 = distinct !DILexicalBlock(scope: !637, file: !3, line: 645, column: 9)
!660 = !DILocation(line: 645, column: 20, scope: !659)
!661 = !DILocation(line: 645, column: 9, scope: !637)
!662 = !DILocation(line: 646, column: 9, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !3, line: 645, column: 31)
!664 = !DILocation(line: 647, column: 9, scope: !663)
!665 = !DILocation(line: 650, column: 31, scope: !637)
!666 = !DILocation(line: 650, column: 41, scope: !637)
!667 = !DILocation(line: 650, column: 22, scope: !637)
!668 = !DILocation(line: 650, column: 20, scope: !637)
!669 = !DILocation(line: 651, column: 10, scope: !670)
!670 = distinct !DILexicalBlock(scope: !637, file: !3, line: 651, column: 9)
!671 = !DILocation(line: 651, column: 9, scope: !637)
!672 = !DILocation(line: 652, column: 9, scope: !673)
!673 = distinct !DILexicalBlock(scope: !670, file: !3, line: 651, column: 26)
!674 = !DILocation(line: 654, column: 9, scope: !673)
!675 = !DILocation(line: 657, column: 34, scope: !637)
!676 = !DILocation(line: 657, column: 15, scope: !637)
!677 = !DILocation(line: 657, column: 13, scope: !637)
!678 = !DILocation(line: 658, column: 9, scope: !679)
!679 = distinct !DILexicalBlock(scope: !637, file: !3, line: 658, column: 9)
!680 = !DILocation(line: 658, column: 17, scope: !679)
!681 = !DILocation(line: 658, column: 9, scope: !637)
!682 = !DILocation(line: 659, column: 9, scope: !683)
!683 = distinct !DILexicalBlock(scope: !679, file: !3, line: 658, column: 22)
!684 = !DILocation(line: 661, column: 9, scope: !683)
!685 = !DILocation(line: 664, column: 12, scope: !637)
!686 = !DILocation(line: 664, column: 10, scope: !637)
!687 = !DILocation(line: 665, column: 10, scope: !688)
!688 = distinct !DILexicalBlock(scope: !637, file: !3, line: 665, column: 9)
!689 = !DILocation(line: 665, column: 9, scope: !637)
!690 = !DILocation(line: 666, column: 9, scope: !691)
!691 = distinct !DILexicalBlock(scope: !688, file: !3, line: 665, column: 16)
!692 = !DILocation(line: 667, column: 9, scope: !691)
!693 = !DILocation(line: 671, column: 17, scope: !637)
!694 = !DILocation(line: 670, column: 19, scope: !637)
!695 = !DILocation(line: 670, column: 5, scope: !637)
!696 = !DILocation(line: 670, column: 11, scope: !637)
!697 = !DILocation(line: 670, column: 17, scope: !637)
!698 = !DILocation(line: 672, column: 10, scope: !699)
!699 = distinct !DILexicalBlock(scope: !637, file: !3, line: 672, column: 9)
!700 = !DILocation(line: 672, column: 16, scope: !699)
!701 = !DILocation(line: 672, column: 9, scope: !637)
!702 = !DILocation(line: 673, column: 9, scope: !703)
!703 = distinct !DILexicalBlock(scope: !699, file: !3, line: 672, column: 23)
!704 = !DILocation(line: 674, column: 9, scope: !703)
!705 = !DILocation(line: 678, column: 17, scope: !637)
!706 = !DILocation(line: 677, column: 32, scope: !637)
!707 = !DILocation(line: 677, column: 5, scope: !637)
!708 = !DILocation(line: 677, column: 11, scope: !637)
!709 = !DILocation(line: 677, column: 30, scope: !637)
!710 = !DILocation(line: 679, column: 10, scope: !711)
!711 = distinct !DILexicalBlock(scope: !637, file: !3, line: 679, column: 9)
!712 = !DILocation(line: 679, column: 16, scope: !711)
!713 = !DILocation(line: 679, column: 9, scope: !637)
!714 = !DILocation(line: 680, column: 9, scope: !715)
!715 = distinct !DILexicalBlock(scope: !711, file: !3, line: 679, column: 36)
!716 = !DILocation(line: 681, column: 9, scope: !715)
!717 = !DILocation(line: 684, column: 23, scope: !637)
!718 = !DILocation(line: 684, column: 5, scope: !637)
!719 = !DILocation(line: 684, column: 11, scope: !637)
!720 = !DILocation(line: 684, column: 16, scope: !637)
!721 = !DILocation(line: 684, column: 21, scope: !637)
!722 = !DILocation(line: 685, column: 34, scope: !637)
!723 = !DILocation(line: 685, column: 27, scope: !637)
!724 = !DILocation(line: 685, column: 5, scope: !637)
!725 = !DILocation(line: 685, column: 11, scope: !637)
!726 = !DILocation(line: 685, column: 16, scope: !637)
!727 = !DILocation(line: 685, column: 25, scope: !637)
!728 = !DILocation(line: 686, column: 21, scope: !637)
!729 = !DILocation(line: 686, column: 5, scope: !637)
!730 = !DILocation(line: 686, column: 11, scope: !637)
!731 = !DILocation(line: 686, column: 16, scope: !637)
!732 = !DILocation(line: 686, column: 19, scope: !637)
!733 = !DILocation(line: 687, column: 23, scope: !637)
!734 = !DILocation(line: 687, column: 5, scope: !637)
!735 = !DILocation(line: 687, column: 11, scope: !637)
!736 = !DILocation(line: 687, column: 21, scope: !637)
!737 = !DILocation(line: 688, column: 24, scope: !637)
!738 = !DILocation(line: 688, column: 34, scope: !637)
!739 = !DILocation(line: 688, column: 47, scope: !637)
!740 = !DILocation(line: 688, column: 57, scope: !637)
!741 = !DILocation(line: 688, column: 5, scope: !637)
!742 = !DILocation(line: 688, column: 11, scope: !637)
!743 = !DILocation(line: 688, column: 22, scope: !637)
!744 = !DILocation(line: 689, column: 39, scope: !637)
!745 = !DILocation(line: 689, column: 49, scope: !637)
!746 = !DILocation(line: 689, column: 5, scope: !637)
!747 = !DILocation(line: 689, column: 11, scope: !637)
!748 = !DILocation(line: 689, column: 37, scope: !637)
!749 = !DILocation(line: 691, column: 12, scope: !637)
!750 = !DILocation(line: 691, column: 5, scope: !637)
!751 = !DILabel(scope: !637, name: "out_tpl_compile", file: !3, line: 693)
!752 = !DILocation(line: 693, column: 1, scope: !637)
!753 = !DILocation(line: 694, column: 19, scope: !637)
!754 = !DILocation(line: 694, column: 25, scope: !637)
!755 = !DILocation(line: 694, column: 5, scope: !637)
!756 = !DILabel(scope: !637, name: "out_cache_create", file: !3, line: 695)
!757 = !DILocation(line: 695, column: 1, scope: !637)
!758 = !DILocation(line: 696, column: 10, scope: !637)
!759 = !DILocation(line: 696, column: 5, scope: !637)
!760 = !DILabel(scope: !637, name: "out_malloc", file: !3, line: 697)
!761 = !DILocation(line: 697, column: 1, scope: !637)
!762 = !DILocation(line: 698, column: 11, scope: !637)
!763 = !DILocation(line: 698, column: 5, scope: !637)
!764 = !DILabel(scope: !637, name: "out_open", file: !3, line: 699)
!765 = !DILocation(line: 699, column: 1, scope: !637)
!766 = !DILocation(line: 700, column: 10, scope: !637)
!767 = !DILocation(line: 700, column: 5, scope: !637)
!768 = !DILabel(scope: !637, name: "out_realpath", file: !3, line: 701)
!769 = !DILocation(line: 701, column: 1, scope: !637)
!770 = !DILocation(line: 702, column: 5, scope: !637)
!771 = !DILocation(line: 703, column: 1, scope: !637)
!772 = distinct !DISubprogram(name: "serve_files_init_from_hash", scope: !3, file: !3, line: 706, type: !23, scopeLine: 707, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!773 = !DILocalVariable(name: "hash", arg: 1, scope: !772, file: !3, line: 706, type: !25)
!774 = !DILocation(line: 706, column: 47, scope: !772)
!775 = !DILocalVariable(name: "settings", scope: !772, file: !3, line: 708, type: !642)
!776 = !DILocation(line: 708, column: 40, scope: !772)
!777 = !DILocation(line: 708, column: 51, scope: !772)
!778 = !DILocation(line: 709, column: 32, scope: !772)
!779 = !DILocation(line: 709, column: 22, scope: !772)
!780 = !DILocation(line: 710, column: 33, scope: !772)
!781 = !DILocation(line: 710, column: 23, scope: !772)
!782 = !DILocation(line: 712, column: 34, scope: !772)
!783 = !DILocation(line: 712, column: 24, scope: !772)
!784 = !DILocation(line: 712, column: 13, scope: !772)
!785 = !DILocation(line: 714, column: 12, scope: !772)
!786 = !DILocation(line: 714, column: 5, scope: !772)
!787 = distinct !DISubprogram(name: "serve_files_shutdown", scope: !3, file: !3, line: 718, type: !31, scopeLine: 719, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!788 = !DILocalVariable(name: "data", arg: 1, scope: !787, file: !3, line: 718, type: !20)
!789 = !DILocation(line: 718, column: 28, scope: !787)
!790 = !DILocalVariable(name: "priv", scope: !787, file: !3, line: 720, type: !358)
!791 = !DILocation(line: 720, column: 25, scope: !787)
!792 = !DILocation(line: 720, column: 32, scope: !787)
!793 = !DILocation(line: 722, column: 10, scope: !794)
!794 = distinct !DILexicalBlock(scope: !787, file: !3, line: 722, column: 9)
!795 = !DILocation(line: 722, column: 9, scope: !787)
!796 = !DILocation(line: 723, column: 9, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !3, line: 722, column: 16)
!798 = !DILocation(line: 724, column: 9, scope: !797)
!799 = !DILocation(line: 727, column: 19, scope: !787)
!800 = !DILocation(line: 727, column: 25, scope: !787)
!801 = !DILocation(line: 727, column: 5, scope: !787)
!802 = !DILocation(line: 728, column: 19, scope: !787)
!803 = !DILocation(line: 728, column: 25, scope: !787)
!804 = !DILocation(line: 728, column: 5, scope: !787)
!805 = !DILocation(line: 729, column: 11, scope: !787)
!806 = !DILocation(line: 729, column: 17, scope: !787)
!807 = !DILocation(line: 729, column: 22, scope: !787)
!808 = !DILocation(line: 729, column: 5, scope: !787)
!809 = !DILocation(line: 730, column: 10, scope: !787)
!810 = !DILocation(line: 730, column: 16, scope: !787)
!811 = !DILocation(line: 730, column: 21, scope: !787)
!812 = !DILocation(line: 730, column: 5, scope: !787)
!813 = !DILocation(line: 731, column: 10, scope: !787)
!814 = !DILocation(line: 731, column: 5, scope: !787)
!815 = !DILocation(line: 732, column: 1, scope: !787)
!816 = distinct !DISubprogram(name: "serve_files_handle_cb", scope: !3, file: !3, line: 981, type: !35, scopeLine: 982, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!817 = !DILocalVariable(name: "request", arg: 1, scope: !816, file: !3, line: 981, type: !57)
!818 = !DILocation(line: 981, column: 39, scope: !816)
!819 = !DILocalVariable(name: "response", arg: 2, scope: !816, file: !3, line: 981, type: !246)
!820 = !DILocation(line: 981, column: 65, scope: !816)
!821 = !DILocalVariable(name: "data", arg: 3, scope: !816, file: !3, line: 981, type: !20)
!822 = !DILocation(line: 981, column: 81, scope: !816)
!823 = !DILocalVariable(name: "return_status", scope: !816, file: !3, line: 983, type: !37)
!824 = !DILocation(line: 983, column: 24, scope: !816)
!825 = !DILocalVariable(name: "priv", scope: !816, file: !3, line: 984, type: !358)
!826 = !DILocation(line: 984, column: 25, scope: !816)
!827 = !DILocation(line: 984, column: 32, scope: !816)
!828 = !DILocalVariable(name: "ce", scope: !816, file: !3, line: 985, type: !288)
!829 = !DILocation(line: 985, column: 27, scope: !816)
!830 = !DILocation(line: 987, column: 9, scope: !831)
!831 = distinct !DILexicalBlock(scope: !816, file: !3, line: 987, column: 9)
!832 = !DILocation(line: 987, column: 9, scope: !816)
!833 = !DILocation(line: 988, column: 23, scope: !834)
!834 = distinct !DILexicalBlock(scope: !831, file: !3, line: 987, column: 26)
!835 = !DILocation(line: 989, column: 9, scope: !834)
!836 = !DILocation(line: 992, column: 39, scope: !816)
!837 = !DILocation(line: 992, column: 45, scope: !816)
!838 = !DILocation(line: 992, column: 52, scope: !816)
!839 = !DILocation(line: 992, column: 61, scope: !816)
!840 = !DILocation(line: 992, column: 67, scope: !816)
!841 = !DILocation(line: 993, column: 17, scope: !816)
!842 = !DILocation(line: 993, column: 26, scope: !816)
!843 = !DILocation(line: 993, column: 30, scope: !816)
!844 = !DILocation(line: 992, column: 10, scope: !816)
!845 = !DILocation(line: 992, column: 8, scope: !816)
!846 = !DILocation(line: 994, column: 9, scope: !847)
!847 = distinct !DILexicalBlock(scope: !816, file: !3, line: 994, column: 9)
!848 = !DILocation(line: 994, column: 9, scope: !816)
!849 = !DILocalVariable(name: "fce", scope: !850, file: !3, line: 995, type: !333)
!850 = distinct !DILexicalBlock(scope: !847, file: !3, line: 994, column: 21)
!851 = !DILocation(line: 995, column: 29, scope: !850)
!852 = !DILocation(line: 995, column: 57, scope: !850)
!853 = !DILocation(line: 996, column: 31, scope: !850)
!854 = !DILocation(line: 996, column: 36, scope: !850)
!855 = !DILocation(line: 996, column: 9, scope: !850)
!856 = !DILocation(line: 996, column: 19, scope: !850)
!857 = !DILocation(line: 996, column: 29, scope: !850)
!858 = !DILocation(line: 997, column: 37, scope: !850)
!859 = !DILocation(line: 997, column: 42, scope: !850)
!860 = !DILocation(line: 997, column: 49, scope: !850)
!861 = !DILocation(line: 997, column: 9, scope: !850)
!862 = !DILocation(line: 997, column: 19, scope: !850)
!863 = !DILocation(line: 997, column: 26, scope: !850)
!864 = !DILocation(line: 997, column: 35, scope: !850)
!865 = !DILocation(line: 998, column: 33, scope: !850)
!866 = !DILocation(line: 998, column: 9, scope: !850)
!867 = !DILocation(line: 998, column: 19, scope: !850)
!868 = !DILocation(line: 998, column: 26, scope: !850)
!869 = !DILocation(line: 998, column: 31, scope: !850)
!870 = !DILocation(line: 999, column: 33, scope: !850)
!871 = !DILocation(line: 999, column: 9, scope: !850)
!872 = !DILocation(line: 999, column: 19, scope: !850)
!873 = !DILocation(line: 999, column: 26, scope: !850)
!874 = !DILocation(line: 999, column: 31, scope: !850)
!875 = !DILocation(line: 1001, column: 9, scope: !850)
!876 = !DILabel(scope: !816, name: "fail", file: !3, line: 1004)
!877 = !DILocation(line: 1004, column: 1, scope: !816)
!878 = !DILocation(line: 1005, column: 5, scope: !816)
!879 = !DILocation(line: 1005, column: 15, scope: !816)
!880 = !DILocation(line: 1005, column: 22, scope: !816)
!881 = !DILocation(line: 1005, column: 31, scope: !816)
!882 = !DILocation(line: 1006, column: 12, scope: !816)
!883 = !DILocation(line: 1006, column: 5, scope: !816)
!884 = !DILocation(line: 1007, column: 1, scope: !816)
!885 = distinct !DISubprogram(name: "try_open_directory", scope: !3, file: !3, line: 605, type: !886, scopeLine: 606, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!886 = !DISubroutineType(types: !887)
!887 = !{!64, !13, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!889 = !DILocalVariable(name: "path", arg: 1, scope: !885, file: !3, line: 605, type: !13)
!890 = !DILocation(line: 605, column: 32, scope: !885)
!891 = !DILocalVariable(name: "open_mode", arg: 2, scope: !885, file: !3, line: 605, type: !888)
!892 = !DILocation(line: 605, column: 43, scope: !885)
!893 = !DILocalVariable(name: "fd", scope: !885, file: !3, line: 607, type: !64)
!894 = !DILocation(line: 607, column: 9, scope: !885)
!895 = !DILocation(line: 609, column: 6, scope: !885)
!896 = !DILocation(line: 609, column: 16, scope: !885)
!897 = !DILocation(line: 611, column: 15, scope: !885)
!898 = !DILocation(line: 611, column: 22, scope: !885)
!899 = !DILocation(line: 611, column: 21, scope: !885)
!900 = !DILocation(line: 611, column: 32, scope: !885)
!901 = !DILocation(line: 611, column: 10, scope: !885)
!902 = !DILocation(line: 611, column: 8, scope: !885)
!903 = !DILocation(line: 612, column: 9, scope: !904)
!904 = distinct !DILexicalBlock(scope: !885, file: !3, line: 612, column: 9)
!905 = !DILocation(line: 612, column: 12, scope: !904)
!906 = !DILocation(line: 612, column: 9, scope: !885)
!907 = !DILocation(line: 614, column: 10, scope: !908)
!908 = distinct !DILexicalBlock(scope: !904, file: !3, line: 612, column: 17)
!909 = !DILocation(line: 614, column: 20, scope: !908)
!910 = !DILocation(line: 616, column: 19, scope: !908)
!911 = !DILocation(line: 616, column: 26, scope: !908)
!912 = !DILocation(line: 616, column: 25, scope: !908)
!913 = !DILocation(line: 616, column: 36, scope: !908)
!914 = !DILocation(line: 616, column: 14, scope: !908)
!915 = !DILocation(line: 616, column: 12, scope: !908)
!916 = !DILocation(line: 617, column: 13, scope: !917)
!917 = distinct !DILexicalBlock(scope: !908, file: !3, line: 617, column: 13)
!918 = !DILocation(line: 617, column: 16, scope: !917)
!919 = !DILocation(line: 617, column: 13, scope: !908)
!920 = !DILocation(line: 619, column: 14, scope: !921)
!921 = distinct !DILexicalBlock(scope: !917, file: !3, line: 617, column: 21)
!922 = !DILocation(line: 619, column: 24, scope: !921)
!923 = !DILocation(line: 621, column: 23, scope: !921)
!924 = !DILocation(line: 621, column: 30, scope: !921)
!925 = !DILocation(line: 621, column: 29, scope: !921)
!926 = !DILocation(line: 621, column: 40, scope: !921)
!927 = !DILocation(line: 621, column: 18, scope: !921)
!928 = !DILocation(line: 621, column: 16, scope: !921)
!929 = !DILocation(line: 622, column: 9, scope: !921)
!930 = !DILocation(line: 623, column: 5, scope: !908)
!931 = !DILocation(line: 625, column: 9, scope: !932)
!932 = distinct !DILexicalBlock(scope: !885, file: !3, line: 625, column: 9)
!933 = !DILocation(line: 625, column: 12, scope: !932)
!934 = !DILocation(line: 625, column: 9, scope: !885)
!935 = !DILocation(line: 626, column: 9, scope: !932)
!936 = !DILocation(line: 632, column: 11, scope: !885)
!937 = !DILocation(line: 632, column: 5, scope: !885)
!938 = !DILocation(line: 633, column: 17, scope: !885)
!939 = !DILocation(line: 633, column: 24, scope: !885)
!940 = !DILocation(line: 633, column: 23, scope: !885)
!941 = !DILocation(line: 633, column: 34, scope: !885)
!942 = !DILocation(line: 633, column: 48, scope: !885)
!943 = !DILocation(line: 633, column: 12, scope: !885)
!944 = !DILocation(line: 633, column: 5, scope: !885)
!945 = !DILocation(line: 634, column: 1, scope: !885)
!946 = distinct !DISubprogram(name: "create_cache_entry", scope: !3, file: !3, line: 532, type: !947, scopeLine: 533, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!947 = !DISubroutineType(types: !948)
!948 = !{!288, !13, !20}
!949 = !DILocalVariable(name: "key", arg: 1, scope: !946, file: !3, line: 532, type: !13)
!950 = !DILocation(line: 532, column: 32, scope: !946)
!951 = !DILocalVariable(name: "context", arg: 2, scope: !946, file: !3, line: 532, type: !20)
!952 = !DILocation(line: 532, column: 43, scope: !946)
!953 = !DILocalVariable(name: "priv", scope: !946, file: !3, line: 534, type: !358)
!954 = !DILocation(line: 534, column: 25, scope: !946)
!955 = !DILocation(line: 534, column: 32, scope: !946)
!956 = !DILocalVariable(name: "fce", scope: !946, file: !3, line: 535, type: !333)
!957 = !DILocation(line: 535, column: 25, scope: !946)
!958 = !DILocalVariable(name: "st", scope: !946, file: !3, line: 536, type: !380)
!959 = !DILocation(line: 536, column: 17, scope: !946)
!960 = !DILocalVariable(name: "funcs", scope: !946, file: !3, line: 537, type: !348)
!961 = !DILocation(line: 537, column: 26, scope: !946)
!962 = !DILocalVariable(name: "full_path", scope: !946, file: !3, line: 538, type: !963)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32768, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 4096)
!966 = !DILocation(line: 538, column: 10, scope: !946)
!967 = !DILocation(line: 540, column: 9, scope: !968)
!968 = distinct !DILexicalBlock(scope: !946, file: !3, line: 540, column: 9)
!969 = !DILocation(line: 540, column: 9, scope: !946)
!970 = !DILocation(line: 542, column: 9, scope: !968)
!971 = !DILocation(line: 544, column: 9, scope: !972)
!972 = distinct !DILexicalBlock(scope: !946, file: !3, line: 544, column: 9)
!973 = !DILocation(line: 544, column: 9, scope: !946)
!974 = !DILocation(line: 545, column: 9, scope: !972)
!975 = !DILocation(line: 547, column: 23, scope: !946)
!976 = !DILocation(line: 547, column: 29, scope: !946)
!977 = !DILocation(line: 547, column: 34, scope: !946)
!978 = !DILocation(line: 547, column: 13, scope: !946)
!979 = !DILocation(line: 547, column: 11, scope: !946)
!980 = !DILocation(line: 548, column: 9, scope: !981)
!981 = distinct !DILexicalBlock(scope: !946, file: !3, line: 548, column: 9)
!982 = !DILocation(line: 548, column: 9, scope: !946)
!983 = !DILocation(line: 549, column: 9, scope: !981)
!984 = !DILocation(line: 551, column: 41, scope: !946)
!985 = !DILocation(line: 551, column: 47, scope: !946)
!986 = !DILocation(line: 551, column: 63, scope: !946)
!987 = !DILocation(line: 551, column: 11, scope: !946)
!988 = !DILocation(line: 551, column: 9, scope: !946)
!989 = !DILocation(line: 552, column: 9, scope: !990)
!990 = distinct !DILexicalBlock(scope: !946, file: !3, line: 552, column: 9)
!991 = !DILocation(line: 552, column: 9, scope: !946)
!992 = !DILocation(line: 553, column: 9, scope: !990)
!993 = !DILocation(line: 555, column: 29, scope: !946)
!994 = !DILocation(line: 555, column: 39, scope: !946)
!995 = !DILocation(line: 555, column: 44, scope: !946)
!996 = !DILocation(line: 555, column: 58, scope: !946)
!997 = !DILocation(line: 555, column: 5, scope: !946)
!998 = !DILocation(line: 556, column: 37, scope: !946)
!999 = !DILocation(line: 556, column: 5, scope: !946)
!1000 = !DILocation(line: 556, column: 10, scope: !946)
!1001 = !DILocation(line: 556, column: 24, scope: !946)
!1002 = !DILocation(line: 556, column: 32, scope: !946)
!1003 = !DILocation(line: 558, column: 36, scope: !946)
!1004 = !DILocation(line: 558, column: 5, scope: !946)
!1005 = !DILocation(line: 559, column: 1, scope: !946)
!1006 = distinct !DISubprogram(name: "destroy_cache_entry", scope: !3, file: !3, line: 596, type: !1007, scopeLine: 597, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !288, !20}
!1009 = !DILocalVariable(name: "entry", arg: 1, scope: !1006, file: !3, line: 596, type: !288)
!1010 = !DILocation(line: 596, column: 43, scope: !1006)
!1011 = !DILocalVariable(name: "context", arg: 2, scope: !1006, file: !3, line: 596, type: !20)
!1012 = !DILocation(line: 596, column: 56, scope: !1006)
!1013 = !DILocalVariable(name: "fce", scope: !1006, file: !3, line: 598, type: !333)
!1014 = !DILocation(line: 598, column: 25, scope: !1006)
!1015 = !DILocation(line: 598, column: 53, scope: !1006)
!1016 = !DILocation(line: 600, column: 5, scope: !1006)
!1017 = !DILocation(line: 600, column: 10, scope: !1006)
!1018 = !DILocation(line: 600, column: 17, scope: !1006)
!1019 = !DILocation(line: 600, column: 22, scope: !1006)
!1020 = !DILocation(line: 600, column: 26, scope: !1006)
!1021 = !DILocation(line: 601, column: 10, scope: !1006)
!1022 = !DILocation(line: 601, column: 5, scope: !1006)
!1023 = !DILocation(line: 602, column: 1, scope: !1006)
!1024 = distinct !DISubprogram(name: "get_funcs", scope: !3, file: !3, line: 454, type: !1025, scopeLine: 456, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!348, !358, !13, !82, !379}
!1027 = !DILocalVariable(name: "priv", arg: 1, scope: !1024, file: !3, line: 454, type: !358)
!1028 = !DILocation(line: 454, column: 31, scope: !1024)
!1029 = !DILocalVariable(name: "key", arg: 2, scope: !1024, file: !3, line: 454, type: !13)
!1030 = !DILocation(line: 454, column: 49, scope: !1024)
!1031 = !DILocalVariable(name: "full_path", arg: 3, scope: !1024, file: !3, line: 454, type: !82)
!1032 = !DILocation(line: 454, column: 60, scope: !1024)
!1033 = !DILocalVariable(name: "st", arg: 4, scope: !1024, file: !3, line: 455, type: !379)
!1034 = !DILocation(line: 455, column: 18, scope: !1024)
!1035 = !DILocalVariable(name: "index_html_path_buf", scope: !1024, file: !3, line: 457, type: !963)
!1036 = !DILocation(line: 457, column: 10, scope: !1024)
!1037 = !DILocalVariable(name: "index_html_path", scope: !1024, file: !3, line: 458, type: !82)
!1038 = !DILocation(line: 458, column: 11, scope: !1024)
!1039 = !DILocation(line: 458, column: 29, scope: !1024)
!1040 = !DILocation(line: 460, column: 9, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 460, column: 9)
!1042 = !DILocation(line: 460, column: 9, scope: !1024)
!1043 = !DILocation(line: 464, column: 14, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 464, column: 13)
!1045 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 460, column: 31)
!1046 = !DILocation(line: 464, column: 13, scope: !1044)
!1047 = !DILocation(line: 464, column: 18, scope: !1044)
!1048 = !DILocation(line: 464, column: 13, scope: !1045)
!1049 = !DILocation(line: 465, column: 39, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 464, column: 27)
!1051 = !DILocation(line: 465, column: 45, scope: !1050)
!1052 = !DILocation(line: 465, column: 29, scope: !1050)
!1053 = !DILocation(line: 466, column: 9, scope: !1050)
!1054 = !DILocalVariable(name: "key_end", scope: !1055, file: !3, line: 470, type: !13)
!1055 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 466, column: 16)
!1056 = !DILocation(line: 470, column: 25, scope: !1055)
!1057 = !DILocation(line: 470, column: 45, scope: !1055)
!1058 = !DILocation(line: 470, column: 35, scope: !1055)
!1059 = !DILocation(line: 471, column: 19, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 471, column: 17)
!1061 = !DILocation(line: 471, column: 27, scope: !1060)
!1062 = !DILocation(line: 471, column: 17, scope: !1060)
!1063 = !DILocation(line: 471, column: 32, scope: !1060)
!1064 = !DILocation(line: 471, column: 17, scope: !1055)
!1065 = !DILocation(line: 472, column: 17, scope: !1060)
!1066 = !DILocalVariable(name: "ret", scope: !1055, file: !3, line: 474, type: !64)
!1067 = !DILocation(line: 474, column: 17, scope: !1055)
!1068 = !DILocation(line: 474, column: 32, scope: !1055)
!1069 = !DILocation(line: 474, column: 67, scope: !1055)
!1070 = !DILocation(line: 474, column: 72, scope: !1055)
!1071 = !DILocation(line: 474, column: 78, scope: !1055)
!1072 = !DILocation(line: 474, column: 23, scope: !1055)
!1073 = !DILocation(line: 475, column: 17, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 475, column: 17)
!1075 = !DILocation(line: 475, column: 17, scope: !1055)
!1076 = !DILocation(line: 476, column: 17, scope: !1074)
!1077 = !DILocation(line: 480, column: 21, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 480, column: 13)
!1079 = !DILocation(line: 480, column: 27, scope: !1078)
!1080 = !DILocation(line: 480, column: 32, scope: !1078)
!1081 = !DILocation(line: 480, column: 36, scope: !1078)
!1082 = !DILocation(line: 480, column: 53, scope: !1078)
!1083 = !DILocation(line: 480, column: 13, scope: !1078)
!1084 = !DILocation(line: 480, column: 60, scope: !1078)
!1085 = !DILocation(line: 480, column: 13, scope: !1045)
!1086 = !DILocation(line: 481, column: 17, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 481, column: 17)
!1088 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 480, column: 65)
!1089 = !DILocation(line: 481, column: 17, scope: !1088)
!1090 = !DILocation(line: 482, column: 17, scope: !1087)
!1091 = !DILocation(line: 485, column: 13, scope: !1088)
!1092 = !DILocation(line: 491, column: 13, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 491, column: 13)
!1094 = !DILocation(line: 491, column: 13, scope: !1045)
!1095 = !DILocation(line: 493, column: 13, scope: !1093)
!1096 = !DILocation(line: 495, column: 9, scope: !1045)
!1097 = !DILocation(line: 495, column: 19, scope: !1045)
!1098 = !DILocation(line: 495, column: 25, scope: !1045)
!1099 = !DILocation(line: 495, column: 30, scope: !1045)
!1100 = !DILocation(line: 495, column: 40, scope: !1045)
!1101 = !DILocation(line: 496, column: 17, scope: !1045)
!1102 = !DILocation(line: 496, column: 29, scope: !1045)
!1103 = !DILocation(line: 496, column: 35, scope: !1045)
!1104 = !DILocation(line: 496, column: 40, scope: !1045)
!1105 = !DILocation(line: 496, column: 27, scope: !1045)
!1106 = !DILocation(line: 496, column: 49, scope: !1045)
!1107 = !DILocation(line: 496, column: 54, scope: !1045)
!1108 = !DILocation(line: 497, column: 32, scope: !1045)
!1109 = !DILocation(line: 497, column: 38, scope: !1045)
!1110 = !DILocation(line: 497, column: 43, scope: !1045)
!1111 = !DILocation(line: 497, column: 30, scope: !1045)
!1112 = !DILocation(line: 497, column: 52, scope: !1045)
!1113 = !DILocation(line: 496, column: 9, scope: !1045)
!1114 = !DILocation(line: 498, column: 5, scope: !1045)
!1115 = !DILocation(line: 502, column: 9, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 502, column: 9)
!1117 = !DILocation(line: 502, column: 13, scope: !1116)
!1118 = !DILocation(line: 502, column: 21, scope: !1116)
!1119 = !DILocation(line: 502, column: 9, scope: !1024)
!1120 = !DILocation(line: 503, column: 9, scope: !1116)
!1121 = !DILocation(line: 505, column: 5, scope: !1024)
!1122 = !DILocation(line: 506, column: 1, scope: !1024)
!1123 = distinct !DISubprogram(name: "create_cache_entry_from_funcs", scope: !3, file: !3, line: 509, type: !1124, scopeLine: 511, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!333, !358, !13, !379, !348}
!1126 = !DILocalVariable(name: "priv", arg: 1, scope: !1123, file: !3, line: 509, type: !358)
!1127 = !DILocation(line: 509, column: 51, scope: !1123)
!1128 = !DILocalVariable(name: "full_path", arg: 2, scope: !1123, file: !3, line: 509, type: !13)
!1129 = !DILocation(line: 509, column: 69, scope: !1123)
!1130 = !DILocalVariable(name: "st", arg: 3, scope: !1123, file: !3, line: 510, type: !379)
!1131 = !DILocation(line: 510, column: 18, scope: !1123)
!1132 = !DILocalVariable(name: "funcs", arg: 4, scope: !1123, file: !3, line: 510, type: !348)
!1133 = !DILocation(line: 510, column: 43, scope: !1123)
!1134 = !DILocalVariable(name: "fce", scope: !1123, file: !3, line: 512, type: !333)
!1135 = !DILocation(line: 512, column: 25, scope: !1123)
!1136 = !DILocation(line: 514, column: 33, scope: !1123)
!1137 = !DILocation(line: 514, column: 40, scope: !1123)
!1138 = !DILocation(line: 514, column: 31, scope: !1123)
!1139 = !DILocation(line: 514, column: 11, scope: !1123)
!1140 = !DILocation(line: 514, column: 9, scope: !1123)
!1141 = !DILocation(line: 515, column: 9, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 515, column: 9)
!1143 = !DILocation(line: 515, column: 9, scope: !1123)
!1144 = !DILocation(line: 516, column: 9, scope: !1142)
!1145 = !DILocation(line: 518, column: 9, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 518, column: 9)
!1147 = !DILocation(line: 518, column: 9, scope: !1123)
!1148 = !DILocation(line: 519, column: 22, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 518, column: 56)
!1150 = !DILocation(line: 519, column: 9, scope: !1149)
!1151 = !DILocation(line: 519, column: 14, scope: !1149)
!1152 = !DILocation(line: 519, column: 20, scope: !1149)
!1153 = !DILocation(line: 520, column: 16, scope: !1149)
!1154 = !DILocation(line: 520, column: 9, scope: !1149)
!1155 = !DILocation(line: 523, column: 10, scope: !1123)
!1156 = !DILocation(line: 523, column: 5, scope: !1123)
!1157 = !DILocation(line: 525, column: 9, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 525, column: 9)
!1159 = !DILocation(line: 525, column: 15, scope: !1158)
!1160 = !DILocation(line: 525, column: 9, scope: !1123)
!1161 = !DILocation(line: 526, column: 9, scope: !1158)
!1162 = !DILocation(line: 528, column: 42, scope: !1123)
!1163 = !DILocation(line: 528, column: 48, scope: !1123)
!1164 = !DILocation(line: 528, column: 59, scope: !1123)
!1165 = !DILocation(line: 528, column: 12, scope: !1123)
!1166 = !DILocation(line: 528, column: 5, scope: !1123)
!1167 = !DILocation(line: 529, column: 1, scope: !1123)
!1168 = distinct !DISubprogram(name: "redir_serve", scope: !3, file: !3, line: 951, type: !242, scopeLine: 952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!1169 = !DILocalVariable(name: "request", arg: 1, scope: !1168, file: !3, line: 951, type: !57)
!1170 = !DILocation(line: 951, column: 29, scope: !1168)
!1171 = !DILocalVariable(name: "data", arg: 2, scope: !1168, file: !3, line: 951, type: !20)
!1172 = !DILocation(line: 951, column: 44, scope: !1168)
!1173 = !DILocalVariable(name: "fce", scope: !1168, file: !3, line: 953, type: !333)
!1174 = !DILocation(line: 953, column: 25, scope: !1168)
!1175 = !DILocation(line: 953, column: 31, scope: !1168)
!1176 = !DILocalVariable(name: "rd", scope: !1168, file: !3, line: 954, type: !303)
!1177 = !DILocation(line: 954, column: 25, scope: !1168)
!1178 = !DILocation(line: 954, column: 53, scope: !1168)
!1179 = !DILocation(line: 954, column: 57, scope: !1168)
!1180 = !DILocalVariable(name: "header_buf", scope: !1168, file: !3, line: 955, type: !963)
!1181 = !DILocation(line: 955, column: 10, scope: !1168)
!1182 = !DILocalVariable(name: "header_buf_size", scope: !1168, file: !3, line: 956, type: !84)
!1183 = !DILocation(line: 956, column: 12, scope: !1168)
!1184 = !DILocalVariable(name: "headers", scope: !1168, file: !3, line: 957, type: !1185)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 256, elements: !182)
!1186 = !DILocation(line: 957, column: 22, scope: !1168)
!1187 = !DILocation(line: 959, column: 33, scope: !1168)
!1188 = !DILocation(line: 959, column: 5, scope: !1168)
!1189 = !DILocation(line: 959, column: 14, scope: !1168)
!1190 = !DILocation(line: 959, column: 23, scope: !1168)
!1191 = !DILocation(line: 959, column: 31, scope: !1168)
!1192 = !DILocation(line: 960, column: 47, scope: !1168)
!1193 = !DILocation(line: 960, column: 51, scope: !1168)
!1194 = !DILocation(line: 960, column: 40, scope: !1168)
!1195 = !DILocation(line: 960, column: 5, scope: !1168)
!1196 = !DILocation(line: 960, column: 14, scope: !1168)
!1197 = !DILocation(line: 960, column: 23, scope: !1168)
!1198 = !DILocation(line: 960, column: 38, scope: !1168)
!1199 = !DILocation(line: 962, column: 5, scope: !1168)
!1200 = !DILocation(line: 962, column: 5, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 962, column: 5)
!1202 = !DILocation(line: 963, column: 5, scope: !1168)
!1203 = !DILocation(line: 963, column: 5, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 963, column: 5)
!1205 = !DILocation(line: 965, column: 52, scope: !1168)
!1206 = !DILocation(line: 966, column: 41, scope: !1168)
!1207 = !DILocation(line: 965, column: 23, scope: !1168)
!1208 = !DILocation(line: 965, column: 21, scope: !1168)
!1209 = !DILocation(line: 967, column: 9, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 967, column: 9)
!1211 = !DILocation(line: 967, column: 9, scope: !1168)
!1212 = !DILocation(line: 968, column: 9, scope: !1210)
!1213 = !DILocalVariable(name: "response_vec", scope: !1168, file: !3, line: 970, type: !1214)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 256, elements: !182)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !1216, line: 26, size: 128, elements: !1217)
!1216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!1217 = !{!1218, !1219}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !1215, file: !1216, line: 28, baseType: !20, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !1215, file: !1216, line: 29, baseType: !84, size: 64, offset: 64)
!1220 = !DILocation(line: 970, column: 18, scope: !1168)
!1221 = !DILocation(line: 970, column: 35, scope: !1168)
!1222 = !DILocation(line: 971, column: 9, scope: !1168)
!1223 = !DILocation(line: 971, column: 23, scope: !1168)
!1224 = !DILocation(line: 971, column: 46, scope: !1168)
!1225 = !DILocation(line: 972, column: 9, scope: !1168)
!1226 = !DILocation(line: 972, column: 23, scope: !1168)
!1227 = !DILocation(line: 972, column: 27, scope: !1168)
!1228 = !DILocation(line: 972, column: 48, scope: !1168)
!1229 = !DILocation(line: 972, column: 57, scope: !1168)
!1230 = !DILocation(line: 972, column: 66, scope: !1168)
!1231 = !DILocation(line: 975, column: 17, scope: !1168)
!1232 = !DILocation(line: 975, column: 26, scope: !1168)
!1233 = !DILocation(line: 975, column: 5, scope: !1168)
!1234 = !DILocation(line: 977, column: 5, scope: !1168)
!1235 = !DILocation(line: 978, column: 1, scope: !1168)
!1236 = distinct !DISubprogram(name: "redir_init", scope: !3, file: !3, line: 439, type: !356, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!1237 = !DILocalVariable(name: "ce", arg: 1, scope: !1236, file: !3, line: 439, type: !333)
!1238 = !DILocation(line: 439, column: 32, scope: !1236)
!1239 = !DILocalVariable(name: "priv", arg: 2, scope: !1236, file: !3, line: 440, type: !358)
!1240 = !DILocation(line: 440, column: 33, scope: !1236)
!1241 = !DILocalVariable(name: "full_path", arg: 3, scope: !1236, file: !3, line: 441, type: !13)
!1242 = !DILocation(line: 441, column: 25, scope: !1236)
!1243 = !DILocalVariable(name: "st", arg: 4, scope: !1236, file: !3, line: 442, type: !379)
!1244 = !DILocation(line: 442, column: 26, scope: !1236)
!1245 = !DILocalVariable(name: "rd", scope: !1236, file: !3, line: 444, type: !303)
!1246 = !DILocation(line: 444, column: 25, scope: !1236)
!1247 = !DILocation(line: 444, column: 53, scope: !1236)
!1248 = !DILocation(line: 444, column: 56, scope: !1236)
!1249 = !DILocation(line: 446, column: 19, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1236, file: !3, line: 446, column: 9)
!1251 = !DILocation(line: 446, column: 23, scope: !1250)
!1252 = !DILocation(line: 446, column: 40, scope: !1250)
!1253 = !DILocation(line: 446, column: 52, scope: !1250)
!1254 = !DILocation(line: 446, column: 58, scope: !1250)
!1255 = !DILocation(line: 446, column: 63, scope: !1250)
!1256 = !DILocation(line: 446, column: 50, scope: !1250)
!1257 = !DILocation(line: 446, column: 9, scope: !1250)
!1258 = !DILocation(line: 446, column: 73, scope: !1250)
!1259 = !DILocation(line: 446, column: 9, scope: !1236)
!1260 = !DILocation(line: 447, column: 9, scope: !1250)
!1261 = !DILocation(line: 449, column: 5, scope: !1236)
!1262 = !DILocation(line: 449, column: 9, scope: !1236)
!1263 = !DILocation(line: 449, column: 19, scope: !1236)
!1264 = !DILocation(line: 450, column: 5, scope: !1236)
!1265 = !DILocation(line: 451, column: 1, scope: !1236)
!1266 = distinct !DISubprogram(name: "redir_free", scope: !3, file: !3, line: 588, type: !31, scopeLine: 589, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!1267 = !DILocalVariable(name: "data", arg: 1, scope: !1266, file: !3, line: 588, type: !20)
!1268 = !DILocation(line: 588, column: 18, scope: !1266)
!1269 = !DILocalVariable(name: "rd", scope: !1266, file: !3, line: 590, type: !303)
!1270 = !DILocation(line: 590, column: 25, scope: !1266)
!1271 = !DILocation(line: 590, column: 30, scope: !1266)
!1272 = !DILocation(line: 592, column: 10, scope: !1266)
!1273 = !DILocation(line: 592, column: 14, scope: !1266)
!1274 = !DILocation(line: 592, column: 5, scope: !1266)
!1275 = !DILocation(line: 593, column: 1, scope: !1266)
!1276 = distinct !DISubprogram(name: "dirlist_serve", scope: !3, file: !3, line: 941, type: !242, scopeLine: 942, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !259, retainedNodes: !519)
!1277 = !DILocalVariable(name: "request", arg: 1, scope: !1276, file: !3, line: 941, type: !57)
!1278 = !DILocation(line: 941, column: 31, scope: !1276)
!1279 = !DILocalVariable(name: "data", arg: 2, scope: !1276, file: !3, line: 941, type: !20)
!1280 = !DILocation(line: 941, column: 46, scope: !1276)
!1281 = !DILocalVariable(name: "fce", scope: !1276, file: !3, line: 943, type: !333)
!1282 = !DILocation(line: 943, column: 25, scope: !1276)
!1283 = !DILocation(line: 943, column: 31, scope: !1276)
!1284 = !DILocalVariable(name: "dd", scope: !1276, file: !3, line: 944, type: !308)
!1285 = !DILocation(line: 944, column: 28, scope: !1276)
