; ModuleID = '/home/raj/lwan/common/lwan-cache.c'
source_filename = "/home/raj/lwan/common/lwan-cache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cache_t = type { %struct.anon, %struct.anon.0, %struct.anon.1, %struct.anon.2, i32, %struct.anon.3 }
%struct.anon = type { ptr, %union.pthread_rwlock_t }
%union.pthread_rwlock_t = type { %struct.__pthread_rwlock_arch_t }
%struct.__pthread_rwlock_arch_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i8, [7 x i8], i64, i32 }
%struct.anon.0 = type { %struct.list_head, %union.pthread_rwlock_t }
%struct.list_head = type { %struct.list_node }
%struct.list_node = type { ptr, ptr }
%struct.anon.1 = type { ptr, ptr, ptr }
%struct.anon.2 = type { i64, i32 }
%struct.anon.3 = type { i32, i32, i32 }
%struct.timespec = type { i64, i64 }
%struct.cache_entry_t = type { %struct.list_node, ptr, i32, i32, i64 }

@.str = private unnamed_addr constant [16 x i8] c"create_entry_cb\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"/home/raj/lwan/common/lwan-cache.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.cache_create = private unnamed_addr constant [88 x i8] c"struct cache_t *cache_create(CreateEntryCallback, DestroyEntryCallback, void *, time_t)\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [17 x i8] c"destroy_entry_cb\00", align 1, !dbg !18

!24 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !20, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(scope: null, file: !2, line: 146, type: !27, isLocal: true, isDefinition: true)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 6)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(scope: null, file: !2, line: 146, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 296, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 37)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !37, isLocal: true, isDefinition: true)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 112, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 14)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 46)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 680, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 85)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !27, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 177, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 4)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !27, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 520, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 65)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 192, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 24)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !38)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(scope: null, file: !2, line: 287, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 136, elements: !21)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(scope: null, file: !2, line: 287, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 22)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(scope: null, file: !2, line: 312, type: !77, isLocal: true, isDefinition: true)
!82 = distinct !DICompileUnit(language: DW_LANG_C11, file: !83, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !84, retainedTypes: !98, globals: !110, splitDebugInlining: false, nameTableKind: None)
!83 = !DIFile(filename: "/home/raj/lwan/common/lwan-cache.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "f1aa9dd4cc8594b027bd5599ddc2fec4")
!84 = !{!85, !91}
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 35, baseType: !86, size: 32, elements: !87)
!86 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!87 = !{!88, !89, !90}
!88 = !DIEnumerator(name: "FLOATING", value: 1)
!89 = !DIEnumerator(name: "TEMPORARY", value: 2)
!90 = !DIEnumerator(name: "SHUTTING_DOWN", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !92, line: 167, baseType: !93, size: 32, elements: !94)
!92 = !DIFile(filename: "common/lwan.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "56f65bbbfce1c5452d6905964ca2b84f")
!93 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!94 = !{!95, !96, !97}
!95 = !DIEnumerator(name: "CONN_CORO_ABORT", value: -1)
!96 = !DIEnumerator(name: "CONN_CORO_MAY_RESUME", value: 0)
!97 = !DIEnumerator(name: "CONN_CORO_FINISHED", value: 1)
!98 = !{!99, !103, !102, !109}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !102, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !105, line: 191, size: 128, elements: !106)
!105 = !DIFile(filename: "common/list.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "c0dffb77b1bbbbb179ef8d69b9e1dd8c")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !105, line: 193, baseType: !103, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !105, line: 193, baseType: !103, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!110 = !{!0, !7, !12, !18, !23, !25, !30, !35, !40, !45, !50, !52, !57, !59, !64, !69, !72, !75, !80}
!111 = !{i32 7, !"Dwarf Version", i32 5}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{i32 1, !"wchar_size", i32 4}
!114 = !{i32 8, !"PIC Level", i32 2}
!115 = !{i32 7, !"PIE Level", i32 2}
!116 = !{i32 7, !"uwtable", i32 2}
!117 = !{i32 7, !"frame-pointer", i32 2}
!118 = !{!"clang version 16.0.0"}
!119 = distinct !DISubprogram(name: "cache_create", scope: !2, file: !2, line: 97, type: !120, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !216)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !177, !196, !102, !190}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_t", file: !2, line: 44, size: 1536, elements: !124)
!124 = !{!125, !165, !173, !201, !209, !210}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !123, file: !2, line: 48, baseType: !126, size: 512)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !2, line: 45, size: 512, elements: !127)
!127 = !{!128, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !126, file: !2, line: 46, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !131, line: 6, flags: DIFlagFwdDecl)
!131 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !126, file: !2, line: 47, baseType: !133, size: 448, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !134, line: 91, baseType: !135)
!134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !134, line: 86, size: 448, elements: !136)
!136 = !{!137, !159, !163}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !135, file: !134, line: 88, baseType: !138, size: 448)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !139, line: 23, size: 448, elements: !140)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_rwlock.h", directory: "", checksumkind: CSK_MD5, checksum: "2034038f4a99ff6cb7b9de3a3e8c2a8e")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !151, !156, !158}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !138, file: !139, line: 25, baseType: !86, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !138, file: !139, line: 26, baseType: !86, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !138, file: !139, line: 27, baseType: !86, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !138, file: !139, line: 28, baseType: !86, size: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !138, file: !139, line: 29, baseType: !86, size: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !138, file: !139, line: 30, baseType: !86, size: 32, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !138, file: !139, line: 32, baseType: !93, size: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !138, file: !139, line: 33, baseType: !93, size: 32, offset: 224)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !138, file: !139, line: 34, baseType: !150, size: 8, offset: 256)
!150 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !138, file: !139, line: 39, baseType: !152, size: 56, offset: 264)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 56, elements: !154)
!153 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !{!155}
!155 = !DISubrange(count: 7)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !138, file: !139, line: 42, baseType: !157, size: 64, offset: 320)
!157 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !138, file: !139, line: 45, baseType: !86, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !135, file: !134, line: 89, baseType: !160, size: 448)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 56)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !135, file: !134, line: 90, baseType: !164, size: 64)
!164 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !123, file: !2, line: 53, baseType: !166, size: 576, offset: 512)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !2, line: 50, size: 576, elements: !167)
!167 = !{!168, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !166, file: !2, line: 51, baseType: !169, size: 128)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !105, line: 208, size: 128, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !169, file: !105, line: 210, baseType: !104, size: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !166, file: !2, line: 52, baseType: !133, size: 448, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !123, file: !2, line: 59, baseType: !174, size: 192, offset: 1088)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !2, line: 55, size: 192, elements: !175)
!175 = !{!176, !195, !200}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "create_entry", scope: !174, file: !2, line: 56, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "CreateEntryCallback", file: !178, line: 35, baseType: !179)
!178 = !DIFile(filename: "common/lwan-cache.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "f48e19cadb0735f737f22aa65af51f83")
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !194, !102}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache_entry_t", file: !178, line: 27, size: 320, elements: !184)
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !183, file: !178, line: 28, baseType: !104, size: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !183, file: !178, line: 29, baseType: !109, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !183, file: !178, line: 30, baseType: !86, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !183, file: !178, line: 31, baseType: !86, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !183, file: !178, line: 32, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !191, line: 10, baseType: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !193, line: 160, baseType: !164)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_entry", scope: !174, file: !2, line: 57, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "DestroyEntryCallback", file: !178, line: 37, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !182, !102}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !174, file: !2, line: 58, baseType: !102, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !123, file: !2, line: 64, baseType: !202, size: 128, offset: 1280)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !2, line: 61, size: 128, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_live", scope: !202, file: !2, line: 62, baseType: !190, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "clock_id", scope: !202, file: !2, line: 63, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !207, line: 7, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/clockid_t.h", directory: "", checksumkind: CSK_MD5, checksum: "099a80153c2ad48bc7f5f4a188cb6d24")
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clockid_t", file: !193, line: 169, baseType: !93)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !2, line: 66, baseType: !86, size: 32, offset: 1408)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !123, file: !2, line: 73, baseType: !211, size: 96, offset: 1440)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !123, file: !2, line: 69, size: 96, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "hits", scope: !211, file: !2, line: 70, baseType: !86, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "misses", scope: !211, file: !2, line: 71, baseType: !86, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "evicted", scope: !211, file: !2, line: 72, baseType: !86, size: 32, offset: 64)
!216 = !{}
!217 = !DILocalVariable(name: "create_entry_cb", arg: 1, scope: !119, file: !2, line: 97, type: !177)
!218 = !DILocation(line: 97, column: 50, scope: !119)
!219 = !DILocalVariable(name: "destroy_entry_cb", arg: 2, scope: !119, file: !2, line: 98, type: !196)
!220 = !DILocation(line: 98, column: 51, scope: !119)
!221 = !DILocalVariable(name: "cb_context", arg: 3, scope: !119, file: !2, line: 99, type: !102)
!222 = !DILocation(line: 99, column: 36, scope: !119)
!223 = !DILocalVariable(name: "time_to_live", arg: 4, scope: !119, file: !2, line: 100, type: !190)
!224 = !DILocation(line: 100, column: 37, scope: !119)
!225 = !DILocalVariable(name: "cache", scope: !119, file: !2, line: 102, type: !122)
!226 = !DILocation(line: 102, column: 21, scope: !119)
!227 = !DILocation(line: 104, column: 5, scope: !228)
!228 = distinct !DILexicalBlock(scope: !229, file: !2, line: 104, column: 5)
!229 = distinct !DILexicalBlock(scope: !119, file: !2, line: 104, column: 5)
!230 = !DILocation(line: 104, column: 5, scope: !229)
!231 = !DILocation(line: 105, column: 5, scope: !232)
!232 = distinct !DILexicalBlock(scope: !233, file: !2, line: 105, column: 5)
!233 = distinct !DILexicalBlock(scope: !119, file: !2, line: 105, column: 5)
!234 = !DILocation(line: 105, column: 5, scope: !233)
!235 = !DILocation(line: 106, column: 5, scope: !236)
!236 = distinct !DILexicalBlock(scope: !237, file: !2, line: 106, column: 5)
!237 = distinct !DILexicalBlock(scope: !119, file: !2, line: 106, column: 5)
!238 = !DILocation(line: 106, column: 5, scope: !237)
!239 = !DILocation(line: 108, column: 13, scope: !119)
!240 = !DILocation(line: 108, column: 11, scope: !119)
!241 = !DILocation(line: 109, column: 10, scope: !242)
!242 = distinct !DILexicalBlock(scope: !119, file: !2, line: 109, column: 9)
!243 = !DILocation(line: 109, column: 9, scope: !119)
!244 = !DILocation(line: 110, column: 9, scope: !242)
!245 = !DILocation(line: 112, column: 25, scope: !119)
!246 = !DILocation(line: 112, column: 5, scope: !119)
!247 = !DILocation(line: 112, column: 12, scope: !119)
!248 = !DILocation(line: 112, column: 17, scope: !119)
!249 = !DILocation(line: 112, column: 23, scope: !119)
!250 = !DILocation(line: 113, column: 10, scope: !251)
!251 = distinct !DILexicalBlock(scope: !119, file: !2, line: 113, column: 9)
!252 = !DILocation(line: 113, column: 17, scope: !251)
!253 = !DILocation(line: 113, column: 22, scope: !251)
!254 = !DILocation(line: 113, column: 9, scope: !119)
!255 = !DILocation(line: 114, column: 9, scope: !251)
!256 = !DILocation(line: 116, column: 30, scope: !257)
!257 = distinct !DILexicalBlock(scope: !119, file: !2, line: 116, column: 9)
!258 = !DILocation(line: 116, column: 37, scope: !257)
!259 = !DILocation(line: 116, column: 42, scope: !257)
!260 = !DILocation(line: 116, column: 9, scope: !257)
!261 = !DILocation(line: 116, column: 9, scope: !119)
!262 = !DILocation(line: 117, column: 9, scope: !257)
!263 = !DILocation(line: 118, column: 30, scope: !264)
!264 = distinct !DILexicalBlock(scope: !119, file: !2, line: 118, column: 9)
!265 = !DILocation(line: 118, column: 37, scope: !264)
!266 = !DILocation(line: 118, column: 43, scope: !264)
!267 = !DILocation(line: 118, column: 9, scope: !264)
!268 = !DILocation(line: 118, column: 9, scope: !119)
!269 = !DILocation(line: 119, column: 9, scope: !264)
!270 = !DILocation(line: 121, column: 30, scope: !119)
!271 = !DILocation(line: 121, column: 5, scope: !119)
!272 = !DILocation(line: 121, column: 12, scope: !119)
!273 = !DILocation(line: 121, column: 15, scope: !119)
!274 = !DILocation(line: 121, column: 28, scope: !119)
!275 = !DILocation(line: 122, column: 31, scope: !119)
!276 = !DILocation(line: 122, column: 5, scope: !119)
!277 = !DILocation(line: 122, column: 12, scope: !119)
!278 = !DILocation(line: 122, column: 15, scope: !119)
!279 = !DILocation(line: 122, column: 29, scope: !119)
!280 = !DILocation(line: 123, column: 25, scope: !119)
!281 = !DILocation(line: 123, column: 5, scope: !119)
!282 = !DILocation(line: 123, column: 12, scope: !119)
!283 = !DILocation(line: 123, column: 15, scope: !119)
!284 = !DILocation(line: 123, column: 23, scope: !119)
!285 = !DILocation(line: 125, column: 32, scope: !119)
!286 = !DILocation(line: 125, column: 5, scope: !119)
!287 = !DILocation(line: 125, column: 12, scope: !119)
!288 = !DILocation(line: 125, column: 21, scope: !119)
!289 = !DILocation(line: 125, column: 30, scope: !119)
!290 = !DILocation(line: 126, column: 36, scope: !119)
!291 = !DILocation(line: 126, column: 5, scope: !119)
!292 = !DILocation(line: 126, column: 12, scope: !119)
!293 = !DILocation(line: 126, column: 21, scope: !119)
!294 = !DILocation(line: 126, column: 34, scope: !119)
!295 = !DILocation(line: 128, column: 21, scope: !119)
!296 = !DILocation(line: 128, column: 28, scope: !119)
!297 = !DILocation(line: 128, column: 34, scope: !119)
!298 = !DILocation(line: 128, column: 5, scope: !119)
!299 = !DILocation(line: 130, column: 36, scope: !119)
!300 = !DILocation(line: 130, column: 5, scope: !119)
!301 = !DILocation(line: 132, column: 12, scope: !119)
!302 = !DILocation(line: 132, column: 5, scope: !119)
!303 = !DILabel(scope: !119, name: "error_no_queue_lock", file: !2, line: 134)
!304 = !DILocation(line: 134, column: 1, scope: !119)
!305 = !DILocation(line: 135, column: 29, scope: !119)
!306 = !DILocation(line: 135, column: 36, scope: !119)
!307 = !DILocation(line: 135, column: 41, scope: !119)
!308 = !DILocation(line: 135, column: 5, scope: !119)
!309 = !DILabel(scope: !119, name: "error_no_hash_lock", file: !2, line: 136)
!310 = !DILocation(line: 136, column: 1, scope: !119)
!311 = !DILocation(line: 137, column: 15, scope: !119)
!312 = !DILocation(line: 137, column: 22, scope: !119)
!313 = !DILocation(line: 137, column: 27, scope: !119)
!314 = !DILocation(line: 137, column: 5, scope: !119)
!315 = !DILabel(scope: !119, name: "error_no_hash", file: !2, line: 138)
!316 = !DILocation(line: 138, column: 1, scope: !119)
!317 = !DILocation(line: 139, column: 10, scope: !119)
!318 = !DILocation(line: 139, column: 5, scope: !119)
!319 = !DILocation(line: 141, column: 5, scope: !119)
!320 = !DILocation(line: 142, column: 1, scope: !119)
!321 = distinct !DISubprogram(name: "detect_fastest_monotonic_clock", scope: !2, file: !2, line: 79, type: !322, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !82, retainedNodes: !216)
!322 = !DISubroutineType(types: !323)
!323 = !{!206}
!324 = !DILocalVariable(name: "ts", scope: !321, file: !2, line: 82, type: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !326, line: 11, size: 128, elements: !327)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !325, file: !326, line: 16, baseType: !192, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !325, file: !326, line: 21, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !193, line: 197, baseType: !164)
!331 = !DILocation(line: 82, column: 21, scope: !321)
!332 = !DILocation(line: 84, column: 10, scope: !333)
!333 = distinct !DILexicalBlock(scope: !321, file: !2, line: 84, column: 9)
!334 = !DILocation(line: 84, column: 9, scope: !321)
!335 = !DILocation(line: 85, column: 9, scope: !333)
!336 = !DILocation(line: 87, column: 5, scope: !321)
!337 = !DILocation(line: 88, column: 1, scope: !321)
!338 = distinct !DISubprogram(name: "list_head_init", scope: !105, file: !105, line: 309, type: !339, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !82, retainedNodes: !216)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!342 = !DILocalVariable(name: "h", arg: 1, scope: !338, file: !105, line: 309, type: !341)
!343 = !DILocation(line: 309, column: 53, scope: !338)
!344 = !DILocation(line: 311, column: 27, scope: !338)
!345 = !DILocation(line: 311, column: 30, scope: !338)
!346 = !DILocation(line: 311, column: 14, scope: !338)
!347 = !DILocation(line: 311, column: 17, scope: !338)
!348 = !DILocation(line: 311, column: 19, scope: !338)
!349 = !DILocation(line: 311, column: 24, scope: !338)
!350 = !DILocation(line: 311, column: 2, scope: !338)
!351 = !DILocation(line: 311, column: 5, scope: !338)
!352 = !DILocation(line: 311, column: 7, scope: !338)
!353 = !DILocation(line: 311, column: 12, scope: !338)
!354 = !DILocation(line: 312, column: 1, scope: !338)
!355 = distinct !DISubprogram(name: "cache_pruner_job", scope: !2, file: !2, line: 272, type: !356, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !82, retainedNodes: !216)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !102}
!358 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!359 = !DILocalVariable(name: "data", arg: 1, scope: !355, file: !2, line: 272, type: !102)
!360 = !DILocation(line: 272, column: 36, scope: !355)
!361 = !DILocalVariable(name: "cache", scope: !355, file: !2, line: 274, type: !122)
!362 = !DILocation(line: 274, column: 21, scope: !355)
!363 = !DILocation(line: 274, column: 29, scope: !355)
!364 = !DILocalVariable(name: "node", scope: !355, file: !2, line: 275, type: !182)
!365 = !DILocation(line: 275, column: 27, scope: !355)
!366 = !DILocalVariable(name: "next", scope: !355, file: !2, line: 275, type: !182)
!367 = !DILocation(line: 275, column: 34, scope: !355)
!368 = !DILocalVariable(name: "now", scope: !355, file: !2, line: 276, type: !325)
!369 = !DILocation(line: 276, column: 21, scope: !355)
!370 = !DILocalVariable(name: "shutting_down", scope: !355, file: !2, line: 277, type: !358)
!371 = !DILocation(line: 277, column: 10, scope: !355)
!372 = !DILocation(line: 277, column: 26, scope: !355)
!373 = !DILocation(line: 277, column: 33, scope: !355)
!374 = !DILocation(line: 277, column: 39, scope: !355)
!375 = !DILocalVariable(name: "evicted", scope: !355, file: !2, line: 278, type: !86)
!376 = !DILocation(line: 278, column: 14, scope: !355)
!377 = !DILocalVariable(name: "queue", scope: !355, file: !2, line: 279, type: !169)
!378 = !DILocation(line: 279, column: 22, scope: !355)
!379 = !DILocation(line: 281, column: 9, scope: !380)
!380 = distinct !DILexicalBlock(scope: !355, file: !2, line: 281, column: 9)
!381 = !DILocation(line: 281, column: 9, scope: !355)
!382 = !DILocation(line: 282, column: 9, scope: !380)
!383 = !DILocation(line: 285, column: 21, scope: !384)
!384 = distinct !DILexicalBlock(scope: !355, file: !2, line: 285, column: 9)
!385 = !DILocation(line: 285, column: 28, scope: !384)
!386 = !DILocation(line: 285, column: 34, scope: !384)
!387 = !DILocation(line: 285, column: 9, scope: !384)
