; ModuleID = '/home/raj/lwan/common/lwan-response.c'
source_filename = "/home/raj/lwan/common/lwan-response.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lwan_var_descriptor_t_ = type { ptr, i64, ptr, ptr, ptr, ptr }
%struct.iovec = type { ptr, i64 }
%struct.lwan_request_t_ = type { i32, i32, %struct.lwan_value_t_, %struct.lwan_value_t_, ptr, %struct.anon.2, %struct.anon.2, %struct.anon.3, %struct.lwan_response_t_ }
%struct.lwan_value_t_ = type { ptr, i64 }
%struct.anon.2 = type { ptr, i64 }
%struct.anon.3 = type { i64, %struct.anon.4 }
%struct.anon.4 = type { i64, i64 }
%struct.lwan_response_t_ = type { ptr, ptr, i64, ptr, %struct.anon.5 }
%struct.anon.5 = type { ptr, ptr, ptr }
%struct.lwan_connection_t_ = type { i32, i32, ptr, ptr, i32, i32 }
%struct.strbuf_t_ = type { %union.anon, %struct.anon, i32 }
%union.anon = type { ptr }
%struct.anon = type { i64, i64 }
%struct.lwan_key_value_t_ = type { ptr, ptr }
%struct.lwan_thread_t_ = type { ptr, %struct.anon.1, i32, [2 x i32], i64 }
%struct.anon.1 = type { [30 x i8], [30 x i8], i64 }
%struct.error_template_t = type { ptr, ptr }


!7 = !DIFile(filename: "/home/raj/lwan/common/lwan-response.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "01cc1c0717cf554caf1186c7b49ddf10")
!8 = !{!9, !23, !31, !50, !55}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 145, baseType: !11, size: 32, elements: !12)
!10 = !DIFile(filename: "common/lwan.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "56f65bbbfce1c5452d6905964ca2b84f")
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22}
!13 = !DIEnumerator(name: "REQUEST_ALL_FLAGS", value: -1)
!14 = !DIEnumerator(name: "REQUEST_METHOD_GET", value: 1)
!15 = !DIEnumerator(name: "REQUEST_METHOD_HEAD", value: 2)
!16 = !DIEnumerator(name: "REQUEST_METHOD_POST", value: 4)
!17 = !DIEnumerator(name: "REQUEST_ACCEPT_DEFLATE", value: 8)
!18 = !DIEnumerator(name: "REQUEST_ACCEPT_GZIP", value: 16)
!19 = !DIEnumerator(name: "REQUEST_IS_HTTP_1_0", value: 32)
!20 = !DIEnumerator(name: "RESPONSE_SENT_HEADERS", value: 64)
!21 = !DIEnumerator(name: "RESPONSE_CHUNKED_ENCODING", value: 128)
!22 = !DIEnumerator(name: "RESPONSE_NO_CONTENT_LENGTH", value: 256)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 158, baseType: !11, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !30}
!25 = !DIEnumerator(name: "CONN_MASK", value: -1)
!26 = !DIEnumerator(name: "CONN_KEEP_ALIVE", value: 1)
!27 = !DIEnumerator(name: "CONN_IS_ALIVE", value: 2)
!28 = !DIEnumerator(name: "CONN_SHOULD_RESUME_CORO", value: 4)
!29 = !DIEnumerator(name: "CONN_WRITE_EVENTS", value: 8)
!30 = !DIEnumerator(name: "CONN_MUST_READ", value: 16)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 114, baseType: !32, size: 32, elements: !33)
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!34 = !DIEnumerator(name: "HTTP_OK", value: 200)
!35 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!36 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!37 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!38 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!39 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!40 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!41 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!42 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!43 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!44 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!45 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!46 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!47 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!48 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!49 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 167, baseType: !11, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "CONN_CORO_ABORT", value: -1)
!53 = !DIEnumerator(name: "CONN_CORO_MAY_RESUME", value: 0)
!54 = !DIEnumerator(name: "CONN_CORO_FINISHED", value: 1)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 202, baseType: !32, size: 32, elements: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!58 = !DIEnumerator(name: "MSG_OOB", value: 1)
!59 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!60 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!61 = !DIEnumerator(name: "MSG_TRYHARD", value: 4)
!62 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!63 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!64 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!65 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!66 = !DIEnumerator(name: "MSG_EOR", value: 128)
!67 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!68 = !DIEnumerator(name: "MSG_FIN", value: 512)
!69 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!70 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!71 = !DIEnumerator(name: "MSG_RST", value: 4096)
!72 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!73 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!74 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!75 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!76 = !DIEnumerator(name: "MSG_BATCH", value: 262144)
!77 = !DIEnumerator(name: "MSG_ZEROCOPY", value: 67108864)
!78 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!79 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!80 = !{!81, !99, !90}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !83, line: 25, baseType: !84)
!83 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !83, line: 27, size: 256, elements: !85)
!85 = !{!86, !95, !103}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !83, line: 31, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !84, file: !83, line: 28, size: 64, elements: !88)
!88 = !{!89, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !87, file: !83, line: 29, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !87, file: !83, line: 30, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, file: !83, line: 34, baseType: !96, size: 128, offset: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !83, line: 32, size: 128, elements: !97)
!97 = !{!98, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !96, file: !83, line: 33, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!101 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !96, file: !83, line: 33, baseType: !99, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !84, file: !83, line: 35, baseType: !32, size: 32, offset: 192)
!104 = !{!105, !110, !0, !115, !120, !125, !130, !135, !138, !143, !148, !151, !156, !161, !164, !169, !174, !176, !178, !183, !186, !191, !196, !201, !206, !211, !216, !218, !223, !228, !233, !235, !394, !397, !402, !407, !409, !411, !413, !419, !424, !426, !429, !431, !436, !438, !440, !442, !444}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !3, line: 68, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 112, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 14)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !3, line: 69, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 104, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 13)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !3, line: 73, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 16)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !3, line: 73, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 304, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 38)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !3, line: 73, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 240, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 30)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !3, line: 75, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 152, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 19)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !3, line: 75, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 240, elements: !128)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !3, line: 79, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 192, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 24)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 184, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 23)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 184, elements: !146)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(scope: null, file: !3, line: 86, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 120, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 15)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !3, line: 86, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 272, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 34)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !3, line: 136, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 112, elements: !108)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !3, line: 136, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 288, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 36)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !3, line: 184, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 80, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 10)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !3, line: 242, type: !171, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !3, line: 244, type: !171, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !3, line: 248, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 232, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 29)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !3, line: 252, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 152, elements: !133)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !3, line: 259, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 136, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 17)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !3, line: 263, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 200, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 25)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !3, line: 265, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 160, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 20)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !3, line: 271, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 56, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 7)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !3, line: 273, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 40, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 5)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !3, line: 275, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 64, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 8)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !3, line: 290, type: !188, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !3, line: 291, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 168, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 21)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !3, line: 299, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 72, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 9)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !3, line: 304, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 96, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 12)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !3, line: 308, type: !198, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "last_chunk", scope: !237, file: !3, line: 352, type: !391, isLocal: true, isDefinition: true)
!237 = distinct !DISubprogram(name: "lwan_response_send_chunk", scope: !3, file: !3, line: 343, type: !238, scopeLine: 344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !390)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !10, line: 106, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !10, line: 206, size: 1280, elements: !243)
!243 = !{!244, !246, !247, !253, !254, !348, !359, !360, !372}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !242, file: !10, line: 207, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !10, line: 156, baseType: !9)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !242, file: !10, line: 208, baseType: !11, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !242, file: !10, line: 209, baseType: !248, size: 128, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !10, line: 110, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !10, line: 191, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !249, file: !10, line: 192, baseType: !90, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !10, line: 193, baseType: !99, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !242, file: !10, line: 210, baseType: !248, size: 128, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !242, file: !10, line: 211, baseType: !255, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !10, line: 112, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !10, line: 196, size: 256, elements: !258)
!258 = !{!259, !261, !262, !267, !346, !347}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !10, line: 199, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !10, line: 165, baseType: !23)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !257, file: !10, line: 200, baseType: !32, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !257, file: !10, line: 201, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !265, line: 34, baseType: !266)
!265 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !265, line: 34, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !257, file: !10, line: 202, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !10, line: 108, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !10, line: 253, size: 832, elements: !271)
!271 = !{!272, !327, !338, !339, !343}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !270, file: !10, line: 254, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !10, line: 103, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !10, line: 275, size: 640, elements: !276)
!276 = !{!277, !303, !304, !311, !315, !326}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !275, file: !10, line: 276, baseType: !278, size: 128)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !279, line: 25, baseType: !280)
!279 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !279, line: 41, size: 128, elements: !281)
!281 = !{!282, !299}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !280, file: !279, line: 42, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !279, line: 26, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !279, line: 29, size: 640, elements: !286)
!286 = !{!287, !289, !298}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !279, line: 30, baseType: !288, size: 512)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 512, elements: !214)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !285, file: !279, line: 31, baseType: !290, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !279, line: 27, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !279, line: 35, size: 192, elements: !293)
!293 = !{!294, !295, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !292, file: !279, line: 36, baseType: !90, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !279, line: 37, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !279, line: 38, baseType: !290, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !285, file: !279, line: 32, baseType: !11, size: 32, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !280, file: !279, line: 43, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !296}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !275, file: !10, line: 277, baseType: !255, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !275, file: !10, line: 283, baseType: !305, size: 128, offset: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !275, file: !10, line: 279, size: 128, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !305, file: !10, line: 280, baseType: !268, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !305, file: !10, line: 281, baseType: !32, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !305, file: !10, line: 282, baseType: !310, size: 16, offset: 96)
!310 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !275, file: !10, line: 285, baseType: !312, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !314, line: 6, flags: DIFlagFwdDecl)
!314 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !275, file: !10, line: 286, baseType: !316, size: 192, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !10, line: 111, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !10, line: 266, size: 192, elements: !318)
!318 = !{!319, !320, !321, !323, !324, !325}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !317, file: !10, line: 267, baseType: !90, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !317, file: !10, line: 268, baseType: !310, size: 16, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !317, file: !10, line: 269, baseType: !322, size: 8, offset: 80)
!322 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !317, file: !10, line: 270, baseType: !322, size: 8, offset: 88)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !317, file: !10, line: 271, baseType: !32, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !317, file: !10, line: 272, baseType: !310, size: 16, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !275, file: !10, line: 287, baseType: !11, size: 32, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !270, file: !10, line: 259, baseType: !328, size: 576, offset: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !270, file: !10, line: 255, size: 576, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !328, file: !10, line: 256, baseType: !137, size: 240)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !328, file: !10, line: 257, baseType: !137, size: 240, offset: 240)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !328, file: !10, line: 258, baseType: !333, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !334, line: 10, baseType: !335)
!334 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !336, line: 160, baseType: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!337 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !270, file: !10, line: 261, baseType: !11, size: 32, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !270, file: !10, line: 262, baseType: !340, size: 64, offset: 672)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !270, file: !10, line: 263, baseType: !344, size: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !345, line: 27, baseType: !101)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !257, file: !10, line: 203, baseType: !11, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !10, line: 203, baseType: !11, size: 32, offset: 224)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !242, file: !10, line: 216, baseType: !349, size: 128, offset: 384)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !10, line: 213, size: 128, elements: !350)
!350 = !{!351, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !349, file: !10, line: 214, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !10, line: 105, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !10, line: 173, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !354, file: !10, line: 174, baseType: !90, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !354, file: !10, line: 175, baseType: !90, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !349, file: !10, line: 215, baseType: !99, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !242, file: !10, line: 216, baseType: !349, size: 128, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !242, file: !10, line: 223, baseType: !361, size: 192, offset: 640)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !10, line: 217, size: 192, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !361, file: !10, line: 218, baseType: !333, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !361, file: !10, line: 222, baseType: !365, size: 128, offset: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !361, file: !10, line: 219, size: 128, elements: !366)
!366 = !{!367, !371}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !365, file: !10, line: 220, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !369, line: 85, baseType: !370)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !336, line: 152, baseType: !337)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !365, file: !10, line: 221, baseType: !368, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !242, file: !10, line: 224, baseType: !373, size: 448, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !10, line: 107, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !10, line: 178, size: 448, elements: !375)
!375 = !{!376, !377, !378, !379, !380}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !374, file: !10, line: 179, baseType: !81, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !374, file: !10, line: 180, baseType: !93, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !374, file: !10, line: 181, baseType: !99, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !374, file: !10, line: 182, baseType: !352, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !374, file: !10, line: 188, baseType: !381, size: 192, offset: 256)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !10, line: 184, size: 192, elements: !382)
!382 = !{!383, !388, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !381, file: !10, line: 185, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !240, !296}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !10, line: 131, baseType: !31)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !10, line: 186, baseType: !296, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !381, file: !10, line: 187, baseType: !296, size: 64, offset: 128)
!390 = !{}
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 48, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 6)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !3, line: 358, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 48, elements: !392)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !3, line: 366, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 24, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 3)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !3, line: 391, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 144, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 18)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !3, line: 416, type: !213, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !3, line: 431, type: !203, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !3, line: 441, type: !208, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "error_template", scope: !6, file: !3, line: 32, type: !415, isLocal: true, isDefinition: true)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_t", file: !417, line: 25, baseType: !418)
!417 = !DIFile(filename: "common/lwan-template.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1f1d0e1deded933cc0657e991f0859fe")
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_tpl_t_", file: !417, line: 25, flags: DIFlagFwdDecl)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !3, line: 34, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 8888, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 1111)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "error_template_str", scope: !6, file: !3, line: 34, type: !93, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !3, line: 108, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 96, elements: !231)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !3, line: 108, type: !137, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !3, line: 108, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 4)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !3, line: 108, type: !433, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !3, line: 95, type: !433, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !3, line: 97, type: !208, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !3, line: 99, type: !208, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !3, line: 100, type: !213, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 1152, elements: !400)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_var_descriptor_t", file: !417, line: 26, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_var_descriptor_t_", file: !417, line: 30, size: 384, elements: !449)
!449 = !{!450, !451, !453, !457, !461, !466}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !448, file: !417, line: 31, baseType: !93, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !448, file: !417, line: 32, baseType: !452, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "append_to_strbuf", scope: !448, file: !417, line: 34, baseType: !454, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !81, !296}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "get_is_empty", scope: !448, file: !417, line: 35, baseType: !458, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!322, !296}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !448, file: !417, line: 37, baseType: !462, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_tpl_list_generator_t", file: !417, line: 28, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!11, !263}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "list_desc", scope: !448, file: !417, line: 38, baseType: !467, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!469 = !{i32 7, !"Dwarf Version", i32 5}
!470 = !{i32 2, !"Debug Info Version", i32 3}
!471 = !{i32 1, !"wchar_size", i32 4}
!472 = !{i32 8, !"PIC Level", i32 2}
!473 = !{i32 7, !"PIE Level", i32 2}
!474 = !{i32 7, !"uwtable", i32 2}
!475 = !{i32 7, !"frame-pointer", i32 2}
!476 = !{!"clang version 16.0.0"}
!477 = !DILocation(line: 73, column: 5, scope: !478)
!478 = distinct !DILexicalBlock(scope: !479, file: !3, line: 73, column: 5)
!479 = distinct !DILexicalBlock(scope: !2, file: !3, line: 73, column: 5)
!480 = !DILocation(line: 73, column: 5, scope: !479)
!481 = !DILocation(line: 75, column: 5, scope: !2)
!482 = !DILocation(line: 77, column: 46, scope: !2)
!483 = !DILocation(line: 77, column: 22, scope: !2)
!484 = !DILocation(line: 77, column: 20, scope: !2)
!485 = !DILocation(line: 78, column: 9, scope: !486)
!486 = distinct !DILexicalBlock(scope: !2, file: !3, line: 78, column: 9)
!487 = !DILocation(line: 78, column: 9, scope: !2)
!488 = !DILocation(line: 79, column: 9, scope: !486)
!489 = !DILocation(line: 80, column: 1, scope: !2)
!490 = distinct !DISubprogram(name: "lwan_response_shutdown", scope: !3, file: !3, line: 83, type: !4, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !390)
!491 = !DILocation(line: 85, column: 5, scope: !490)
!492 = !DILocation(line: 86, column: 5, scope: !493)
!493 = distinct !DILexicalBlock(scope: !494, file: !3, line: 86, column: 5)
!494 = distinct !DILexicalBlock(scope: !490, file: !3, line: 86, column: 5)
!495 = !DILocation(line: 86, column: 5, scope: !494)
!496 = !DILocation(line: 87, column: 19, scope: !490)
!497 = !DILocation(line: 87, column: 5, scope: !490)
!498 = !DILocation(line: 88, column: 1, scope: !490)
!499 = distinct !DISubprogram(name: "lwan_response", scope: !3, file: !3, line: 122, type: !500, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !390)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !240, !387}
!502 = !DILocalVariable(name: "request", arg: 1, scope: !499, file: !3, line: 122, type: !240)
!503 = !DILocation(line: 122, column: 31, scope: !499)
!504 = !DILocalVariable(name: "status", arg: 2, scope: !499, file: !3, line: 122, type: !387)
!505 = !DILocation(line: 122, column: 59, scope: !499)
!506 = !DILocalVariable(name: "headers", scope: !499, file: !3, line: 124, type: !507)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 4096, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 512)
!510 = !DILocation(line: 124, column: 10, scope: !499)
!511 = !DILocation(line: 126, column: 9, scope: !512)
!512 = distinct !DILexicalBlock(scope: !499, file: !3, line: 126, column: 9)
!513 = !DILocation(line: 126, column: 18, scope: !512)
!514 = !DILocation(line: 126, column: 24, scope: !512)
!515 = !DILocation(line: 126, column: 9, scope: !499)
!516 = !DILocation(line: 128, column: 13, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 128, column: 13)
!518 = distinct !DILexicalBlock(scope: !512, file: !3, line: 126, column: 53)
!519 = !DILocation(line: 128, column: 13, scope: !518)
!520 = !DILocation(line: 129, column: 24, scope: !517)
!521 = !DILocation(line: 129, column: 33, scope: !517)
!522 = !DILocation(line: 129, column: 39, scope: !517)
!523 = !DILocation(line: 129, column: 13, scope: !517)
!524 = !DILocation(line: 130, column: 34, scope: !518)
!525 = !DILocation(line: 130, column: 9, scope: !518)
!526 = !DILocation(line: 131, column: 21, scope: !518)
!527 = !DILocation(line: 131, column: 30, scope: !518)
!528 = !DILocation(line: 131, column: 9, scope: !518)
!529 = !DILocation(line: 132, column: 9, scope: !518)
!530 = !DILocation(line: 135, column: 9, scope: !531)
!531 = distinct !DILexicalBlock(scope: !499, file: !3, line: 135, column: 9)
!532 = !DILocation(line: 135, column: 9, scope: !499)
!533 = !DILocation(line: 136, column: 9, scope: !534)
!534 = distinct !DILexicalBlock(scope: !531, file: !3, line: 135, column: 59)
!535 = !DILocation(line: 137, column: 9, scope: !534)
!536 = !DILocation(line: 142, column: 9, scope: !537)
!537 = distinct !DILexicalBlock(scope: !499, file: !3, line: 142, column: 9)
!538 = !DILocation(line: 142, column: 9, scope: !499)
!539 = !DILocation(line: 143, column: 31, scope: !540)
!540 = distinct !DILexicalBlock(scope: !537, file: !3, line: 142, column: 49)
!541 = !DILocation(line: 143, column: 40, scope: !540)
!542 = !DILocation(line: 143, column: 9, scope: !540)
!543 = !DILocation(line: 144, column: 9, scope: !540)
!544 = !DILocation(line: 147, column: 17, scope: !499)
!545 = !DILocation(line: 147, column: 26, scope: !499)
!546 = !DILocation(line: 147, column: 5, scope: !499)
!547 = !DILocation(line: 149, column: 9, scope: !548)
!548 = distinct !DILexicalBlock(scope: !499, file: !3, line: 149, column: 9)
!549 = !DILocation(line: 149, column: 18, scope: !548)
!550 = !DILocation(line: 149, column: 27, scope: !548)
!551 = !DILocation(line: 149, column: 34, scope: !548)
!552 = !DILocation(line: 149, column: 9, scope: !499)
!553 = !DILocalVariable(name: "callback_status", scope: !554, file: !3, line: 150, type: !387)
!554 = distinct !DILexicalBlock(scope: !548, file: !3, line: 149, column: 44)
!555 = !DILocation(line: 150, column: 28, scope: !554)
!556 = !DILocation(line: 152, column: 27, scope: !554)
!557 = !DILocation(line: 152, column: 36, scope: !554)
!558 = !DILocation(line: 152, column: 45, scope: !554)
!559 = !DILocation(line: 152, column: 52, scope: !554)
!560 = !DILocation(line: 152, column: 61, scope: !554)
!561 = !DILocation(line: 153, column: 21, scope: !554)
!562 = !DILocation(line: 153, column: 30, scope: !554)
!563 = !DILocation(line: 153, column: 39, scope: !554)
!564 = !DILocation(line: 153, column: 46, scope: !554)
!565 = !DILocation(line: 152, column: 25, scope: !554)
!566 = !DILocation(line: 155, column: 9, scope: !554)
!567 = !DILocation(line: 155, column: 18, scope: !554)
!568 = !DILocation(line: 155, column: 27, scope: !554)
!569 = !DILocation(line: 155, column: 34, scope: !554)
!570 = !DILocation(line: 155, column: 43, scope: !554)
!571 = !DILocation(line: 157, column: 13, scope: !572)
!572 = distinct !DILexicalBlock(scope: !554, file: !3, line: 157, column: 13)
!573 = !DILocation(line: 157, column: 29, scope: !572)
!574 = !DILocation(line: 157, column: 13, scope: !554)
!575 = !DILocation(line: 158, column: 35, scope: !572)
!576 = !DILocation(line: 158, column: 44, scope: !572)
!577 = !DILocation(line: 158, column: 13, scope: !572)
!578 = !DILocation(line: 159, column: 9, scope: !554)
!579 = !DILocalVariable(name: "header_len", scope: !499, file: !3, line: 162, type: !99)
!580 = !DILocation(line: 162, column: 12, scope: !499)
!581 = !DILocation(line: 162, column: 54, scope: !499)
!582 = !DILocation(line: 162, column: 63, scope: !499)
!583 = !DILocation(line: 162, column: 71, scope: !499)
!584 = !DILocalVariable(name: "request", arg: 1, scope: !585, file: !3, line: 231, type: !240)
!585 = distinct !DISubprogram(name: "lwan_prepare_response_header", scope: !3, file: !3, line: 231, type: !586, scopeLine: 232, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !390)
!586 = !DISubroutineType(types: !587)
!587 = !{!99, !240, !387, !90, !99}
!588 = !DILocation(line: 231, column: 46, scope: !585, inlinedAt: !589)
!589 = distinct !DILocation(line: 162, column: 25, scope: !499)
!590 = !DILocalVariable(name: "status", arg: 2, scope: !585, file: !3, line: 231, type: !387)
!591 = !DILocation(line: 231, column: 74, scope: !585, inlinedAt: !589)
!592 = !DILocalVariable(name: "headers", arg: 3, scope: !585, file: !3, line: 231, type: !90)
!593 = !DILocation(line: 231, column: 87, scope: !585, inlinedAt: !589)
!594 = !DILocalVariable(name: "headers_buf_size", arg: 4, scope: !585, file: !3, line: 231, type: !99)
!595 = !DILocation(line: 231, column: 105, scope: !585, inlinedAt: !589)
!596 = !DILocalVariable(name: "p_headers", scope: !585, file: !3, line: 233, type: !90)
!597 = !DILocation(line: 233, column: 11, scope: !585, inlinedAt: !589)
!598 = !DILocalVariable(name: "p_headers_end", scope: !585, file: !3, line: 234, type: !90)
!599 = !DILocation(line: 234, column: 11, scope: !585, inlinedAt: !589)
!600 = !DILocation(line: 234, column: 27, scope: !585, inlinedAt: !589)
!601 = !DILocation(line: 234, column: 37, scope: !585, inlinedAt: !589)
!602 = !DILocation(line: 234, column: 35, scope: !585, inlinedAt: !589)
!603 = !DILocalVariable(name: "buffer", scope: !585, file: !3, line: 235, type: !193)
!604 = !DILocation(line: 235, column: 10, scope: !585, inlinedAt: !589)
!605 = !DILocalVariable(name: "date_overridden", scope: !585, file: !3, line: 236, type: !322)
!606 = !DILocation(line: 236, column: 10, scope: !585, inlinedAt: !589)
!607 = !DILocalVariable(name: "expires_overridden", scope: !585, file: !3, line: 237, type: !322)
!608 = !DILocation(line: 237, column: 10, scope: !585, inlinedAt: !589)
!609 = !DILocation(line: 239, column: 17, scope: !585, inlinedAt: !589)
!610 = !DILocation(line: 239, column: 15, scope: !585, inlinedAt: !589)
!611 = !DILocation(line: 241, column: 9, scope: !612, inlinedAt: !589)
!612 = distinct !DILexicalBlock(scope: !585, file: !3, line: 241, column: 9)
!613 = !DILocation(line: 241, column: 18, scope: !612, inlinedAt: !589)
!614 = !DILocation(line: 241, column: 24, scope: !612, inlinedAt: !589)
!615 = !DILocation(line: 241, column: 9, scope: !585, inlinedAt: !589)
!616 = !DILocation(line: 242, column: 9, scope: !617, inlinedAt: !589)
!617 = distinct !DILexicalBlock(scope: !618, file: !3, line: 242, column: 9)
!618 = distinct !DILexicalBlock(scope: !612, file: !3, line: 242, column: 9)
!619 = !DILocation(line: 242, column: 9, scope: !618, inlinedAt: !589)
!620 = !DILocation(line: 244, column: 9, scope: !621, inlinedAt: !589)
!621 = distinct !DILexicalBlock(scope: !622, file: !3, line: 244, column: 9)
!622 = distinct !DILexicalBlock(scope: !612, file: !3, line: 244, column: 9)
!623 = !DILocation(line: 244, column: 9, scope: !622, inlinedAt: !589)
!624 = !DILocalVariable(name: "len", scope: !625, file: !3, line: 245, type: !99)
!625 = distinct !DILexicalBlock(scope: !585, file: !3, line: 245, column: 5)
!626 = !DILocation(line: 245, column: 5, scope: !625, inlinedAt: !589)
!627 = !DILocation(line: 245, column: 5, scope: !628, inlinedAt: !589)
!628 = distinct !DILexicalBlock(scope: !629, file: !3, line: 245, column: 5)
!629 = distinct !DILexicalBlock(scope: !625, file: !3, line: 245, column: 5)
!630 = !DILocation(line: 245, column: 5, scope: !629, inlinedAt: !589)
!631 = !DILocation(line: 247, column: 9, scope: !632, inlinedAt: !589)
!632 = distinct !DILexicalBlock(scope: !585, file: !3, line: 247, column: 9)
!633 = !DILocation(line: 247, column: 18, scope: !632, inlinedAt: !589)
!634 = !DILocation(line: 247, column: 24, scope: !632, inlinedAt: !589)
!635 = !DILocation(line: 247, column: 9, scope: !585, inlinedAt: !589)
!636 = !DILocation(line: 248, column: 9, scope: !637, inlinedAt: !589)
!637 = distinct !DILexicalBlock(scope: !638, file: !3, line: 248, column: 9)
!638 = distinct !DILexicalBlock(scope: !639, file: !3, line: 248, column: 9)
!639 = distinct !DILexicalBlock(scope: !632, file: !3, line: 247, column: 53)
!640 = !DILocation(line: 248, column: 9, scope: !638, inlinedAt: !589)
!641 = !DILocation(line: 249, column: 5, scope: !639, inlinedAt: !589)
!642 = !DILocation(line: 249, column: 16, scope: !643, inlinedAt: !589)
!643 = distinct !DILexicalBlock(scope: !632, file: !3, line: 249, column: 16)
!644 = !DILocation(line: 249, column: 25, scope: !643, inlinedAt: !589)
!645 = !DILocation(line: 249, column: 31, scope: !643, inlinedAt: !589)
!646 = !DILocation(line: 249, column: 16, scope: !632, inlinedAt: !589)
!647 = !DILocation(line: 251, column: 5, scope: !648, inlinedAt: !589)
!648 = distinct !DILexicalBlock(scope: !643, file: !3, line: 249, column: 61)
!649 = !DILocation(line: 252, column: 9, scope: !650, inlinedAt: !589)
!650 = distinct !DILexicalBlock(scope: !651, file: !3, line: 252, column: 9)
!651 = distinct !DILexicalBlock(scope: !652, file: !3, line: 252, column: 9)
!652 = distinct !DILexicalBlock(scope: !643, file: !3, line: 251, column: 12)
!653 = !DILocation(line: 252, column: 9, scope: !651, inlinedAt: !589)
!654 = !DILocation(line: 253, column: 13, scope: !655, inlinedAt: !589)
!655 = distinct !DILexicalBlock(scope: !652, file: !3, line: 253, column: 13)
!656 = !DILocation(line: 253, column: 22, scope: !655, inlinedAt: !589)
!657 = !DILocation(line: 253, column: 31, scope: !655, inlinedAt: !589)
!658 = !DILocation(line: 253, column: 38, scope: !655, inlinedAt: !589)
!659 = !DILocation(line: 253, column: 13, scope: !652, inlinedAt: !589)
!660 = !DILocalVariable(name: "len", scope: !661, file: !3, line: 254, type: !99)
!661 = distinct !DILexicalBlock(scope: !655, file: !3, line: 254, column: 13)
!662 = !DILocation(line: 254, column: 13, scope: !661, inlinedAt: !589)
!663 = !DILocalVariable(name: "tmp", scope: !661, file: !3, line: 254, type: !90)
!664 = !DILocation(line: 254, column: 13, scope: !665, inlinedAt: !589)
!665 = distinct !DILexicalBlock(scope: !661, file: !3, line: 254, column: 13)
!666 = !DILocation(line: 254, column: 13, scope: !667, inlinedAt: !589)
!667 = distinct !DILexicalBlock(scope: !668, file: !3, line: 254, column: 13)
!668 = distinct !DILexicalBlock(scope: !661, file: !3, line: 254, column: 13)
!669 = !DILocation(line: 254, column: 13, scope: !668, inlinedAt: !589)
!670 = !DILocalVariable(name: "len", scope: !671, file: !3, line: 256, type: !99)
!671 = distinct !DILexicalBlock(scope: !655, file: !3, line: 256, column: 13)
!672 = !DILocation(line: 256, column: 13, scope: !671, inlinedAt: !589)
!673 = !DILocalVariable(name: "tmp", scope: !671, file: !3, line: 256, type: !90)
!674 = !DILocation(line: 256, column: 13, scope: !675, inlinedAt: !589)
!675 = distinct !DILexicalBlock(scope: !671, file: !3, line: 256, column: 13)
!676 = !DILocation(line: 256, column: 13, scope: !677, inlinedAt: !589)
!677 = distinct !DILexicalBlock(scope: !678, file: !3, line: 256, column: 13)
!678 = distinct !DILexicalBlock(scope: !671, file: !3, line: 256, column: 13)
!679 = !DILocation(line: 256, column: 13, scope: !678, inlinedAt: !589)
!680 = !DILocation(line: 259, column: 5, scope: !681, inlinedAt: !589)
!681 = distinct !DILexicalBlock(scope: !682, file: !3, line: 259, column: 5)
!682 = distinct !DILexicalBlock(scope: !585, file: !3, line: 259, column: 5)
!683 = !DILocation(line: 259, column: 5, scope: !682, inlinedAt: !589)
!684 = !DILocalVariable(name: "len", scope: !685, file: !3, line: 260, type: !99)
!685 = distinct !DILexicalBlock(scope: !585, file: !3, line: 260, column: 5)
!686 = !DILocation(line: 260, column: 5, scope: !685, inlinedAt: !589)
!687 = !DILocation(line: 260, column: 5, scope: !688, inlinedAt: !589)
!688 = distinct !DILexicalBlock(scope: !689, file: !3, line: 260, column: 5)
!689 = distinct !DILexicalBlock(scope: !685, file: !3, line: 260, column: 5)
!690 = !DILocation(line: 260, column: 5, scope: !689, inlinedAt: !589)
!691 = !DILocation(line: 262, column: 9, scope: !692, inlinedAt: !589)
!692 = distinct !DILexicalBlock(scope: !585, file: !3, line: 262, column: 9)
!693 = !DILocation(line: 262, column: 18, scope: !692, inlinedAt: !589)
!694 = !DILocation(line: 262, column: 24, scope: !692, inlinedAt: !589)
!695 = !DILocation(line: 262, column: 30, scope: !692, inlinedAt: !589)
!696 = !DILocation(line: 262, column: 9, scope: !585, inlinedAt: !589)
!697 = !DILocation(line: 263, column: 9, scope: !698, inlinedAt: !589)
!698 = distinct !DILexicalBlock(scope: !699, file: !3, line: 263, column: 9)
!699 = distinct !DILexicalBlock(scope: !692, file: !3, line: 263, column: 9)
!700 = !DILocation(line: 263, column: 9, scope: !699, inlinedAt: !589)
!701 = !DILocation(line: 265, column: 9, scope: !702, inlinedAt: !589)
!702 = distinct !DILexicalBlock(scope: !703, file: !3, line: 265, column: 9)
!703 = distinct !DILexicalBlock(scope: !692, file: !3, line: 265, column: 9)
!704 = !DILocation(line: 265, column: 9, scope: !703, inlinedAt: !589)
!705 = !DILocation(line: 267, column: 10, scope: !706, inlinedAt: !589)
!706 = distinct !DILexicalBlock(scope: !585, file: !3, line: 267, column: 9)
!707 = !DILocation(line: 267, column: 17, scope: !706, inlinedAt: !589)
!708 = !DILocation(line: 267, column: 36, scope: !706, inlinedAt: !589)
!709 = !DILocation(line: 267, column: 39, scope: !706, inlinedAt: !589)
!710 = !DILocation(line: 267, column: 48, scope: !706, inlinedAt: !589)
!711 = !DILocation(line: 267, column: 57, scope: !706, inlinedAt: !589)
!712 = !DILocation(line: 267, column: 9, scope: !585, inlinedAt: !589)
!713 = !DILocalVariable(name: "header", scope: !714, file: !3, line: 268, type: !352)
!714 = distinct !DILexicalBlock(scope: !706, file: !3, line: 267, column: 67)
!715 = !DILocation(line: 268, column: 27, scope: !714, inlinedAt: !589)
!716 = !DILocation(line: 270, column: 23, scope: !717, inlinedAt: !589)
!717 = distinct !DILexicalBlock(scope: !714, file: !3, line: 270, column: 9)
!718 = !DILocation(line: 270, column: 32, scope: !717, inlinedAt: !589)
!719 = !DILocation(line: 270, column: 41, scope: !717, inlinedAt: !589)
!720 = !DILocation(line: 270, column: 21, scope: !717, inlinedAt: !589)
!721 = !DILocation(line: 270, column: 14, scope: !717, inlinedAt: !589)
!722 = !DILocation(line: 270, column: 50, scope: !723, inlinedAt: !589)
!723 = distinct !DILexicalBlock(scope: !717, file: !3, line: 270, column: 9)
!724 = !DILocation(line: 270, column: 58, scope: !723, inlinedAt: !589)
!725 = !DILocation(line: 270, column: 9, scope: !717, inlinedAt: !589)
!726 = !DILocation(line: 271, column: 17, scope: !727, inlinedAt: !589)
!727 = distinct !DILexicalBlock(scope: !728, file: !3, line: 271, column: 17)
!728 = distinct !DILexicalBlock(scope: !723, file: !3, line: 270, column: 73)
!729 = !DILocation(line: 271, column: 17, scope: !728, inlinedAt: !589)
!730 = !DILocation(line: 272, column: 17, scope: !727, inlinedAt: !589)
!731 = !DILocation(line: 273, column: 17, scope: !732, inlinedAt: !589)
!732 = distinct !DILexicalBlock(scope: !728, file: !3, line: 273, column: 17)
!733 = !DILocation(line: 273, column: 17, scope: !728, inlinedAt: !589)
!734 = !DILocation(line: 274, column: 33, scope: !732, inlinedAt: !589)
!735 = !DILocation(line: 274, column: 17, scope: !732, inlinedAt: !589)
!736 = !DILocation(line: 275, column: 17, scope: !737, inlinedAt: !589)
!737 = distinct !DILexicalBlock(scope: !728, file: !3, line: 275, column: 17)
!738 = !DILocation(line: 275, column: 17, scope: !728, inlinedAt: !589)
!739 = !DILocation(line: 276, column: 36, scope: !737, inlinedAt: !589)
!740 = !DILocation(line: 276, column: 17, scope: !737, inlinedAt: !589)
!741 = !DILocation(line: 278, column: 13, scope: !742, inlinedAt: !589)
!742 = distinct !DILexicalBlock(scope: !728, file: !3, line: 278, column: 13)
!743 = !DILocation(line: 278, column: 13, scope: !728, inlinedAt: !589)
!744 = !DILocation(line: 279, column: 13, scope: !728, inlinedAt: !589)
!745 = !DILocation(line: 280, column: 13, scope: !728, inlinedAt: !589)
!746 = !DILocalVariable(name: "len", scope: !747, file: !3, line: 281, type: !99)
!747 = distinct !DILexicalBlock(scope: !728, file: !3, line: 281, column: 13)
!748 = !DILocation(line: 281, column: 13, scope: !747, inlinedAt: !589)
!749 = !DILocation(line: 281, column: 13, scope: !750, inlinedAt: !589)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 281, column: 13)
!751 = distinct !DILexicalBlock(scope: !747, file: !3, line: 281, column: 13)
!752 = !DILocation(line: 281, column: 13, scope: !751, inlinedAt: !589)
!753 = !DILocation(line: 282, column: 13, scope: !728, inlinedAt: !589)
!754 = !DILocation(line: 283, column: 13, scope: !728, inlinedAt: !589)
!755 = !DILocalVariable(name: "len", scope: !756, file: !3, line: 284, type: !99)
!756 = distinct !DILexicalBlock(scope: !728, file: !3, line: 284, column: 13)
!757 = !DILocation(line: 284, column: 13, scope: !756, inlinedAt: !589)
!758 = !DILocation(line: 284, column: 13, scope: !759, inlinedAt: !589)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 284, column: 13)
!760 = distinct !DILexicalBlock(scope: !756, file: !3, line: 284, column: 13)
!761 = !DILocation(line: 284, column: 13, scope: !760, inlinedAt: !589)
!762 = !DILocation(line: 285, column: 9, scope: !728, inlinedAt: !589)
!763 = !DILocation(line: 270, column: 69, scope: !723, inlinedAt: !589)
!764 = !DILocation(line: 270, column: 9, scope: !723, inlinedAt: !589)
!765 = distinct !{!765, !725, !766, !767}
!766 = !DILocation(line: 285, column: 9, scope: !717, inlinedAt: !589)
!767 = !{!"llvm.loop.mustprogress"}
!768 = !DILocation(line: 286, column: 5, scope: !714, inlinedAt: !589)
!769 = !DILocation(line: 286, column: 16, scope: !770, inlinedAt: !589)
!770 = distinct !DILexicalBlock(scope: !706, file: !3, line: 286, column: 16)
!771 = !DILocation(line: 286, column: 23, scope: !770, inlinedAt: !589)
!772 = !DILocation(line: 286, column: 16, scope: !706, inlinedAt: !589)
!773 = !DILocalVariable(name: "header", scope: !774, file: !3, line: 287, type: !352)
!774 = distinct !DILexicalBlock(scope: !770, file: !3, line: 286, column: 47)
!775 = !DILocation(line: 287, column: 27, scope: !774, inlinedAt: !589)
!776 = !DILocation(line: 289, column: 23, scope: !777, inlinedAt: !589)
!777 = distinct !DILexicalBlock(scope: !774, file: !3, line: 289, column: 9)
!778 = !DILocation(line: 289, column: 32, scope: !777, inlinedAt: !589)
!779 = !DILocation(line: 289, column: 41, scope: !777, inlinedAt: !589)
!780 = !DILocation(line: 289, column: 21, scope: !777, inlinedAt: !589)
!781 = !DILocation(line: 289, column: 14, scope: !777, inlinedAt: !589)
!782 = !DILocation(line: 289, column: 50, scope: !783, inlinedAt: !589)
!783 = distinct !DILexicalBlock(scope: !777, file: !3, line: 289, column: 9)
!784 = !DILocation(line: 289, column: 58, scope: !783, inlinedAt: !589)
!785 = !DILocation(line: 289, column: 9, scope: !777, inlinedAt: !589)
!786 = !DILocation(line: 290, column: 25, scope: !787, inlinedAt: !589)
!787 = distinct !DILexicalBlock(scope: !788, file: !3, line: 290, column: 17)
!788 = distinct !DILexicalBlock(scope: !783, file: !3, line: 289, column: 73)
!789 = !DILocation(line: 290, column: 33, scope: !787, inlinedAt: !589)
!790 = !DILocation(line: 290, column: 18, scope: !787, inlinedAt: !589)
!791 = !DILocation(line: 290, column: 17, scope: !788, inlinedAt: !589)
!792 = !DILocation(line: 291, column: 17, scope: !793, inlinedAt: !589)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 291, column: 17)
!794 = distinct !DILexicalBlock(scope: !795, file: !3, line: 291, column: 17)
!795 = distinct !DILexicalBlock(scope: !787, file: !3, line: 290, column: 59)
!796 = !DILocation(line: 291, column: 17, scope: !794, inlinedAt: !589)
!797 = !DILocalVariable(name: "len", scope: !798, file: !3, line: 292, type: !99)
!798 = distinct !DILexicalBlock(scope: !795, file: !3, line: 292, column: 17)
!799 = !DILocation(line: 292, column: 17, scope: !798, inlinedAt: !589)
!800 = !DILocation(line: 292, column: 17, scope: !801, inlinedAt: !589)
!801 = distinct !DILexicalBlock(scope: !802, file: !3, line: 292, column: 17)
!802 = distinct !DILexicalBlock(scope: !798, file: !3, line: 292, column: 17)
!803 = !DILocation(line: 292, column: 17, scope: !802, inlinedAt: !589)
!804 = !DILocation(line: 293, column: 17, scope: !795, inlinedAt: !589)
!805 = !DILocation(line: 289, column: 69, scope: !783, inlinedAt: !589)
!806 = !DILocation(line: 289, column: 9, scope: !783, inlinedAt: !589)
!807 = distinct !{!807, !785, !808, !767}
!808 = !DILocation(line: 295, column: 9, scope: !777, inlinedAt: !589)
!809 = !DILocation(line: 296, column: 5, scope: !774, inlinedAt: !589)
!810 = !DILocation(line: 298, column: 9, scope: !811, inlinedAt: !589)
!811 = distinct !DILexicalBlock(scope: !585, file: !3, line: 298, column: 9)
!812 = !DILocation(line: 298, column: 9, scope: !585, inlinedAt: !589)
!813 = !DILocation(line: 299, column: 9, scope: !814, inlinedAt: !589)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 299, column: 9)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 299, column: 9)
!816 = distinct !DILexicalBlock(scope: !811, file: !3, line: 298, column: 35)
!817 = !DILocation(line: 299, column: 9, scope: !815, inlinedAt: !589)
!818 = !DILocation(line: 300, column: 9, scope: !819, inlinedAt: !589)
!819 = distinct !DILexicalBlock(scope: !820, file: !3, line: 300, column: 9)
!820 = distinct !DILexicalBlock(scope: !816, file: !3, line: 300, column: 9)
!821 = !DILocation(line: 300, column: 9, scope: !820, inlinedAt: !589)
!822 = !DILocation(line: 301, column: 5, scope: !816, inlinedAt: !589)
!823 = !DILocation(line: 303, column: 9, scope: !824, inlinedAt: !589)
!824 = distinct !DILexicalBlock(scope: !585, file: !3, line: 303, column: 9)
!825 = !DILocation(line: 303, column: 9, scope: !585, inlinedAt: !589)
!826 = !DILocation(line: 304, column: 9, scope: !827, inlinedAt: !589)
!827 = distinct !DILexicalBlock(scope: !828, file: !3, line: 304, column: 9)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 304, column: 9)
!829 = distinct !DILexicalBlock(scope: !824, file: !3, line: 303, column: 38)
!830 = !DILocation(line: 304, column: 9, scope: !828, inlinedAt: !589)
!831 = !DILocation(line: 305, column: 9, scope: !832, inlinedAt: !589)
!832 = distinct !DILexicalBlock(scope: !833, file: !3, line: 305, column: 9)
!833 = distinct !DILexicalBlock(scope: !829, file: !3, line: 305, column: 9)
!834 = !DILocation(line: 305, column: 9, scope: !833, inlinedAt: !589)
!835 = !DILocation(line: 306, column: 5, scope: !829, inlinedAt: !589)
!836 = !DILocation(line: 308, column: 5, scope: !837, inlinedAt: !589)
!837 = distinct !DILexicalBlock(scope: !838, file: !3, line: 308, column: 5)
!838 = distinct !DILexicalBlock(scope: !585, file: !3, line: 308, column: 5)
!839 = !DILocation(line: 308, column: 5, scope: !838, inlinedAt: !589)
!840 = !DILocation(line: 310, column: 21, scope: !585, inlinedAt: !589)
!841 = !DILocation(line: 310, column: 33, scope: !585, inlinedAt: !589)
!842 = !DILocation(line: 310, column: 31, scope: !585, inlinedAt: !589)
!843 = !DILocation(line: 310, column: 41, scope: !585, inlinedAt: !589)
!844 = !DILocation(line: 310, column: 5, scope: !585, inlinedAt: !589)
!845 = !DILocation(line: 311, column: 1, scope: !585, inlinedAt: !589)
!846 = !DILocation(line: 163, column: 9, scope: !847)
!847 = distinct !DILexicalBlock(scope: !499, file: !3, line: 163, column: 9)
!848 = !DILocation(line: 163, column: 9, scope: !499)
!849 = !DILocation(line: 164, column: 31, scope: !850)
!850 = distinct !DILexicalBlock(scope: !847, file: !3, line: 163, column: 32)
!851 = !DILocation(line: 164, column: 9, scope: !850)
!852 = !DILocation(line: 165, column: 9, scope: !850)
!853 = !DILocation(line: 168, column: 9, scope: !854)
!854 = distinct !DILexicalBlock(scope: !499, file: !3, line: 168, column: 9)
!855 = !DILocation(line: 168, column: 18, scope: !854)
!856 = !DILocation(line: 168, column: 24, scope: !854)
!857 = !DILocation(line: 168, column: 9, scope: !499)
!858 = !DILocation(line: 169, column: 20, scope: !859)
!859 = distinct !DILexicalBlock(scope: !854, file: !3, line: 168, column: 47)
!860 = !DILocation(line: 169, column: 29, scope: !859)
!861 = !DILocation(line: 169, column: 38, scope: !859)
!862 = !DILocation(line: 169, column: 9, scope: !859)
!863 = !DILocation(line: 170, column: 9, scope: !859)
!864 = !DILocalVariable(name: "response_vec", scope: !499, file: !3, line: 173, type: !865)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 256, elements: !341)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !867, line: 26, size: 128, elements: !868)
!867 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !866, file: !867, line: 28, baseType: !296, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !866, file: !867, line: 29, baseType: !99, size: 64, offset: 64)
!871 = !DILocation(line: 173, column: 18, scope: !499)
!872 = !DILocation(line: 173, column: 35, scope: !499)
!873 = !DILocation(line: 174, column: 9, scope: !499)
!874 = !DILocation(line: 174, column: 23, scope: !499)
!875 = !DILocation(line: 174, column: 43, scope: !499)
!876 = !DILocation(line: 175, column: 9, scope: !499)
!877 = !DILocation(line: 175, column: 23, scope: !499)
!878 = !DILocation(line: 175, column: 79, scope: !499)
!879 = !DILocation(line: 178, column: 17, scope: !499)
!880 = !DILocation(line: 178, column: 26, scope: !499)
!881 = !DILocation(line: 178, column: 5, scope: !499)
!882 = !DILocation(line: 179, column: 1, scope: !499)
!883 = !DILocalVariable(name: "request", arg: 1, scope: !237, file: !3, line: 343, type: !240)
!884 = !DILocation(line: 343, column: 42, scope: !237)
!885 = !DILocation(line: 345, column: 11, scope: !886)
!886 = distinct !DILexicalBlock(scope: !237, file: !3, line: 345, column: 9)
!887 = !DILocation(line: 345, column: 20, scope: !886)
!888 = !DILocation(line: 345, column: 26, scope: !886)
!889 = !DILocation(line: 345, column: 9, scope: !237)
!890 = !DILocation(line: 346, column: 13, scope: !891)
!891 = distinct !DILexicalBlock(scope: !892, file: !3, line: 346, column: 13)
!892 = distinct !DILexicalBlock(scope: !886, file: !3, line: 345, column: 52)
!893 = !DILocation(line: 346, column: 13, scope: !892)
!894 = !DILocation(line: 347, column: 13, scope: !891)
!895 = !DILocation(line: 348, column: 5, scope: !892)
!896 = !DILocalVariable(name: "buffer_len", scope: !237, file: !3, line: 350, type: !99)
!897 = !DILocation(line: 350, column: 12, scope: !237)
!898 = !DILocation(line: 350, column: 25, scope: !237)
!899 = !DILocation(line: 351, column: 9, scope: !900)
!900 = distinct !DILexicalBlock(scope: !237, file: !3, line: 351, column: 9)
!901 = !DILocation(line: 351, column: 9, scope: !237)
!902 = !DILocation(line: 353, column: 19, scope: !903)
!903 = distinct !DILexicalBlock(scope: !900, file: !3, line: 351, column: 32)
!904 = !DILocation(line: 353, column: 9, scope: !903)
!905 = !DILocation(line: 354, column: 9, scope: !903)
!906 = !DILocalVariable(name: "chunk_size", scope: !237, file: !3, line: 357, type: !907)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 208, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 26)
!910 = !DILocation(line: 357, column: 10, scope: !237)
!911 = !DILocalVariable(name: "converted_len", scope: !237, file: !3, line: 358, type: !11)
!912 = !DILocation(line: 358, column: 9, scope: !237)
!913 = !DILocation(line: 358, column: 34, scope: !237)
!914 = !DILocation(line: 358, column: 77, scope: !237)
!915 = !DILocation(line: 358, column: 25, scope: !237)
!916 = !DILocation(line: 359, column: 9, scope: !917)
!917 = distinct !DILexicalBlock(scope: !237, file: !3, line: 359, column: 9)
!918 = !DILocation(line: 359, column: 9, scope: !237)
!919 = !DILocation(line: 360, column: 9, scope: !917)
!920 = !DILocalVariable(name: "chunk_size_len", scope: !237, file: !3, line: 361, type: !99)
!921 = !DILocation(line: 361, column: 12, scope: !237)
!922 = !DILocation(line: 361, column: 37, scope: !237)
!923 = !DILocation(line: 361, column: 29, scope: !237)
!924 = !DILocalVariable(name: "chunk_vec", scope: !237, file: !3, line: 363, type: !925)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 384, elements: !400)
!926 = !DILocation(line: 363, column: 18, scope: !237)
!927 = !DILocation(line: 363, column: 32, scope: !237)
!928 = !DILocation(line: 364, column: 9, scope: !237)
!929 = !DILocation(line: 364, column: 23, scope: !237)
!930 = !DILocation(line: 364, column: 46, scope: !237)
!931 = !DILocation(line: 365, column: 9, scope: !237)
!932 = !DILocation(line: 365, column: 23, scope: !237)
!933 = !DILocation(line: 365, column: 79, scope: !237)
!934 = !DILocation(line: 366, column: 9, scope: !237)
