; ModuleID = '/home/raj/lwan/common/realpathat.c'
source_filename = "/home/raj/lwan/common/realpathat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [38 x i8] c"resolved == NULL || resolved == rpath\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [35 x i8] c"/home/raj/lwan/common/realpathat.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.realpathat2 = private unnamed_addr constant [68 x i8] c"char *realpathat2(int, char *, const char *, char *, struct stat *)\00", align 1, !dbg !12

; Function Attrs: noinline nounwind optnone uwtable
define dso_local ptr @realpathat2(i32 noundef %0, ptr noundef %1, ptr noundef %2, ptr noundef %3, ptr noundef %4) #0 !dbg !37 {
  %6 = alloca ptr, align 8
  %7 = alloca i32, align 4
  %8 = alloca ptr, align 8
  %9 = alloca ptr, align 8
  %10 = alloca ptr, align 8
  %11 = alloca ptr, align 8
  %12 = alloca ptr, align 8
  %13 = alloca ptr, align 8
  %14 = alloca [4096 x i8], align 16
  %15 = alloca ptr, align 8
  %16 = alloca ptr, align 8
  %17 = alloca ptr, align 8
  %18 = alloca i32, align 4
  %19 = alloca i64, align 8
  %20 = alloca ptr, align 8
  %21 = alloca i32, align 4
  %22 = alloca i64, align 8
  %23 = alloca i64, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "common/realpathat.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "90270fbee7ce027e07b9bf25029a1a78")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 38)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 35)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 544, elements: !16)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!16 = !{!17}
!17 = !DISubrange(count: 68)
!18 = distinct !DICompileUnit(language: DW_LANG_C11, file: !19, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !20, globals: !28, splitDebugInlining: false, nameTableKind: None)
!19 = !DIFile(filename: "/home/raj/lwan/common/realpathat.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "90270fbee7ce027e07b9bf25029a1a78")
!20 = !{!21, !22, !25, !26, !27}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !23, line: 46, baseType: !24)
!23 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!24 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!28 = !{!0, !7, !12}
!29 = !{i32 7, !"Dwarf Version", i32 5}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{i32 1, !"wchar_size", i32 4}
!32 = !{i32 8, !"PIC Level", i32 2}
!33 = !{i32 7, !"PIE Level", i32 2}
!34 = !{i32 7, !"uwtable", i32 2}
!35 = !{i32 7, !"frame-pointer", i32 2}
!36 = !{!"clang version 16.0.0"}
!37 = distinct !DISubprogram(name: "realpathat2", scope: !2, file: !2, line: 38, type: !38, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !81)
!38 = !DISubroutineType(types: !39)
!39 = !{!25, !26, !25, !40, !25, !41}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !43, line: 26, size: 1152, elements: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!44 = !{!45, !48, !50, !52, !55, !57, !59, !60, !61, !63, !65, !67, !75, !76, !77}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !42, file: !43, line: 31, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !47, line: 145, baseType: !24)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !42, file: !43, line: 36, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !47, line: 148, baseType: !24)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !42, file: !43, line: 44, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !47, line: 151, baseType: !24)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !42, file: !43, line: 45, baseType: !53, size: 32, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !47, line: 150, baseType: !54)
!54 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !42, file: !43, line: 47, baseType: !56, size: 32, offset: 224)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !47, line: 146, baseType: !54)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !42, file: !43, line: 48, baseType: !58, size: 32, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !47, line: 147, baseType: !54)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !42, file: !43, line: 50, baseType: !26, size: 32, offset: 288)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !42, file: !43, line: 52, baseType: !46, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !42, file: !43, line: 57, baseType: !62, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 152, baseType: !27)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !42, file: !43, line: 61, baseType: !64, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !47, line: 175, baseType: !27)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !42, file: !43, line: 63, baseType: !66, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !47, line: 180, baseType: !27)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !42, file: !43, line: 74, baseType: !68, size: 128, offset: 576)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !69, line: 11, size: 128, elements: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!70 = !{!71, !73}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !68, file: !69, line: 16, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !47, line: 160, baseType: !27)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !68, file: !69, line: 21, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !47, line: 197, baseType: !27)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !42, file: !43, line: 75, baseType: !68, size: 128, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !42, file: !43, line: 76, baseType: !68, size: 128, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !42, file: !43, line: 89, baseType: !78, size: 192, offset: 960)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 192, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 3)
!81 = !{}
!82 = !DILocalVariable(name: "dirfd", arg: 1, scope: !37, file: !2, line: 38, type: !26)
!83 = !DILocation(line: 38, column: 17, scope: !37)
!84 = !DILocalVariable(name: "dirfdpath", arg: 2, scope: !37, file: !2, line: 38, type: !25)
!85 = !DILocation(line: 38, column: 30, scope: !37)
!86 = !DILocalVariable(name: "name", arg: 3, scope: !37, file: !2, line: 38, type: !40)
!87 = !DILocation(line: 38, column: 53, scope: !37)
!88 = !DILocalVariable(name: "resolved", arg: 4, scope: !37, file: !2, line: 38, type: !25)
!89 = !DILocation(line: 38, column: 65, scope: !37)
!90 = !DILocalVariable(name: "st", arg: 5, scope: !37, file: !2, line: 39, type: !41)
!91 = !DILocation(line: 39, column: 22, scope: !37)
!92 = !DILocalVariable(name: "rpath", scope: !37, file: !2, line: 41, type: !25)
!93 = !DILocation(line: 41, column: 11, scope: !37)
!94 = !DILocalVariable(name: "dest", scope: !37, file: !2, line: 41, type: !25)
!95 = !DILocation(line: 41, column: 19, scope: !37)
!96 = !DILocalVariable(name: "extra_buf", scope: !37, file: !2, line: 41, type: !97)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 4096)
!100 = !DILocation(line: 41, column: 25, scope: !37)
!101 = !DILocalVariable(name: "start", scope: !37, file: !2, line: 42, type: !40)
!102 = !DILocation(line: 42, column: 17, scope: !37)
!103 = !DILocalVariable(name: "end", scope: !37, file: !2, line: 42, type: !40)
!104 = !DILocation(line: 42, column: 25, scope: !37)
!105 = !DILocalVariable(name: "rpath_limit", scope: !37, file: !2, line: 42, type: !40)
!106 = !DILocation(line: 42, column: 31, scope: !37)
!107 = !DILocalVariable(name: "num_links", scope: !37, file: !2, line: 43, type: !26)
!108 = !DILocation(line: 43, column: 9, scope: !37)
!109 = !DILocalVariable(name: "dirfdlen", scope: !37, file: !2, line: 44, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !23, line: 35, baseType: !27)
!111 = !DILocation(line: 44, column: 15, scope: !37)
!112 = !DILocalVariable(name: "pathat", scope: !37, file: !2, line: 45, type: !25)
!113 = !DILocation(line: 45, column: 11, scope: !37)
!114 = !DILocation(line: 50, column: 9, scope: !115)
!115 = distinct !DILexicalBlock(scope: !37, file: !2, line: 50, column: 9)
!116 = !DILocation(line: 50, column: 9, scope: !37)
!117 = !DILocation(line: 51, column: 25, scope: !115)
!118 = !DILocation(line: 51, column: 31, scope: !115)
!119 = !DILocation(line: 51, column: 16, scope: !115)
!120 = !DILocation(line: 51, column: 9, scope: !115)
!121 = !DILocation(line: 53, column: 9, scope: !122)
!122 = distinct !DILexicalBlock(scope: !37, file: !2, line: 53, column: 9)
!123 = !DILocation(line: 53, column: 9, scope: !37)
!124 = !DILocation(line: 58, column: 9, scope: !125)
!125 = distinct !DILexicalBlock(scope: !122, file: !2, line: 53, column: 33)
!126 = !DILocation(line: 58, column: 15, scope: !125)
!127 = !DILocation(line: 59, column: 9, scope: !125)
!128 = !DILocation(line: 62, column: 9, scope: !129)
!129 = distinct !DILexicalBlock(scope: !37, file: !2, line: 62, column: 9)
!130 = !DILocation(line: 62, column: 17, scope: !129)
!131 = !DILocation(line: 62, column: 9, scope: !37)
!132 = !DILocation(line: 63, column: 13, scope: !133)
!133 = distinct !DILexicalBlock(scope: !134, file: !2, line: 63, column: 13)
!134 = distinct !DILexicalBlock(scope: !129, file: !2, line: 62, column: 26)
!135 = !DILocation(line: 63, column: 13, scope: !134)
!136 = !DILocation(line: 64, column: 13, scope: !133)
!137 = !DILocation(line: 65, column: 13, scope: !138)
!138 = distinct !DILexicalBlock(scope: !134, file: !2, line: 65, column: 13)
!139 = !DILocation(line: 65, column: 13, scope: !134)
