; ModuleID = '/home/raj/lwan/common/sd-daemon.c'
source_filename = "/home/raj/lwan/common/sd-daemon.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.sockaddr_union = type { %struct.sockaddr_storage }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%union.__SOCKADDR_ARG = type { ptr }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.sockaddr_un = type { i16, [108 x i8] }
%struct.msghdr = type { ptr, i32, ptr, i64, ptr, i64, i32 }
%struct.iovec = type { ptr, i64 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [11 x i8] c"LISTEN_PID\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [11 x i8] c"LISTEN_FDS\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [14 x i8] c"NOTIFY_SOCKET\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [21 x i8] c"/run/systemd/system/\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [13 x i8] c"WATCHDOG_PID\00", align 1, !dbg !19

!167 = !DILocation(line: 80, column: 13, scope: !85)
!168 = !DILocation(line: 81, column: 22, scope: !169)
!169 = distinct !DILexicalBlock(scope: !165, file: !2, line: 80, column: 24)
!170 = !DILocation(line: 81, column: 21, scope: !169)
!171 = !DILocation(line: 81, column: 19, scope: !169)
!172 = !DILocation(line: 82, column: 17, scope: !169)
!173 = !DILocation(line: 85, column: 14, scope: !174)
!174 = distinct !DILexicalBlock(scope: !85, file: !2, line: 85, column: 13)
!175 = !DILocation(line: 85, column: 16, scope: !174)
!176 = !DILocation(line: 85, column: 19, scope: !174)
!177 = !DILocation(line: 85, column: 24, scope: !174)
!178 = !DILocation(line: 85, column: 21, scope: !174)
!179 = !DILocation(line: 85, column: 26, scope: !174)
!180 = !DILocation(line: 85, column: 30, scope: !174)
!181 = !DILocation(line: 85, column: 29, scope: !174)
!182 = !DILocation(line: 85, column: 13, scope: !85)
!183 = !DILocation(line: 86, column: 19, scope: !184)
!184 = distinct !DILexicalBlock(scope: !174, file: !2, line: 85, column: 33)
!185 = !DILocation(line: 87, column: 17, scope: !184)
!186 = !DILocation(line: 90, column: 17, scope: !187)
!187 = distinct !DILexicalBlock(scope: !85, file: !2, line: 90, column: 9)
!188 = !DILocation(line: 90, column: 14, scope: !187)
!189 = !DILocation(line: 90, column: 40, scope: !190)
!190 = distinct !DILexicalBlock(scope: !187, file: !2, line: 90, column: 9)
!191 = !DILocation(line: 90, column: 73, scope: !190)
!192 = !DILocation(line: 90, column: 67, scope: !190)
!193 = !DILocation(line: 90, column: 65, scope: !190)
!194 = !DILocation(line: 90, column: 43, scope: !190)
!195 = !DILocation(line: 90, column: 9, scope: !187)
!196 = !DILocalVariable(name: "flags", scope: !197, file: !2, line: 91, type: !72)
!197 = distinct !DILexicalBlock(scope: !190, file: !2, line: 90, column: 83)
!198 = !DILocation(line: 91, column: 21, scope: !197)
!199 = !DILocation(line: 93, column: 31, scope: !197)
!200 = !DILocation(line: 93, column: 25, scope: !197)
!201 = !DILocation(line: 93, column: 23, scope: !197)
!202 = !DILocation(line: 94, column: 21, scope: !203)
!203 = distinct !DILexicalBlock(scope: !197, file: !2, line: 94, column: 21)
!204 = !DILocation(line: 94, column: 27, scope: !203)
!205 = !DILocation(line: 94, column: 21, scope: !197)
!206 = !DILocation(line: 95, column: 30, scope: !207)
!207 = distinct !DILexicalBlock(scope: !203, file: !2, line: 94, column: 32)
!208 = !DILocation(line: 95, column: 29, scope: !207)
!209 = !DILocation(line: 95, column: 27, scope: !207)
!210 = !DILocation(line: 96, column: 25, scope: !207)
!211 = !DILocation(line: 99, column: 21, scope: !212)
!212 = distinct !DILexicalBlock(scope: !197, file: !2, line: 99, column: 21)
!213 = !DILocation(line: 99, column: 27, scope: !212)
!214 = !DILocation(line: 99, column: 21, scope: !197)
!215 = !DILocation(line: 100, column: 25, scope: !212)
!216 = !DILocation(line: 102, column: 27, scope: !217)
!217 = distinct !DILexicalBlock(scope: !197, file: !2, line: 102, column: 21)
!218 = !DILocation(line: 102, column: 40, scope: !217)
!219 = !DILocation(line: 102, column: 46, scope: !217)
!220 = !DILocation(line: 102, column: 21, scope: !217)
!221 = !DILocation(line: 102, column: 60, scope: !217)
!222 = !DILocation(line: 102, column: 21, scope: !197)
!223 = !DILocation(line: 103, column: 30, scope: !224)
!224 = distinct !DILexicalBlock(scope: !217, file: !2, line: 102, column: 65)
!225 = !DILocation(line: 103, column: 29, scope: !224)
!226 = !DILocation(line: 103, column: 27, scope: !224)
!227 = !DILocation(line: 104, column: 25, scope: !224)
!228 = !DILocation(line: 106, column: 9, scope: !197)
!229 = !DILocation(line: 90, column: 79, scope: !190)
!230 = !DILocation(line: 90, column: 9, scope: !190)
!231 = distinct !{!231, !195, !232, !233}
!232 = !DILocation(line: 106, column: 9, scope: !187)
!233 = !{!"llvm.loop.mustprogress"}
!234 = !DILocation(line: 108, column: 19, scope: !85)
!235 = !DILocation(line: 108, column: 13, scope: !85)
!236 = !DILocation(line: 108, column: 11, scope: !85)
!237 = !DILocation(line: 108, column: 9, scope: !85)
!238 = !DILabel(scope: !85, name: "finish", file: !2, line: 110)
!239 = !DILocation(line: 110, column: 1, scope: !85)
!240 = !DILocation(line: 111, column: 13, scope: !241)
!241 = distinct !DILexicalBlock(scope: !85, file: !2, line: 111, column: 13)
!242 = !DILocation(line: 111, column: 13, scope: !85)
!243 = !DILocation(line: 112, column: 17, scope: !244)
!244 = distinct !DILexicalBlock(scope: !241, file: !2, line: 111, column: 32)
!245 = !DILocation(line: 113, column: 17, scope: !244)
!246 = !DILocation(line: 114, column: 9, scope: !244)
!247 = !DILocation(line: 116, column: 16, scope: !85)
!248 = !DILocation(line: 116, column: 9, scope: !85)
!249 = distinct !DISubprogram(name: "sd_is_fifo", scope: !2, file: !2, line: 119, type: !250, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!250 = !DISubroutineType(types: !251)
!251 = !{!72, !72, !96}
!252 = !DILocalVariable(name: "fd", arg: 1, scope: !249, file: !2, line: 119, type: !72)
!253 = !DILocation(line: 119, column: 20, scope: !249)
!254 = !DILocalVariable(name: "path", arg: 2, scope: !249, file: !2, line: 119, type: !96)
!255 = !DILocation(line: 119, column: 36, scope: !249)
!256 = !DILocalVariable(name: "st_fd", scope: !249, file: !2, line: 120, type: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !258, line: 26, size: 1152, elements: !259)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!259 = !{!260, !262, !264, !266, !268, !270, !272, !273, !274, !277, !279, !281, !289, !290, !291}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !257, file: !258, line: 31, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !71, line: 145, baseType: !102)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !257, file: !258, line: 36, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !71, line: 148, baseType: !102)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !257, file: !258, line: 44, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !71, line: 151, baseType: !102)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !257, file: !258, line: 45, baseType: !267, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !71, line: 150, baseType: !31)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !257, file: !258, line: 47, baseType: !269, size: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !71, line: 146, baseType: !31)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !257, file: !258, line: 48, baseType: !271, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !71, line: 147, baseType: !31)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !257, file: !258, line: 50, baseType: !72, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !257, file: !258, line: 52, baseType: !261, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !257, file: !258, line: 57, baseType: !275, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 152, baseType: !276)
!276 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !257, file: !258, line: 61, baseType: !278, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !71, line: 175, baseType: !276)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !257, file: !258, line: 63, baseType: !280, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !71, line: 180, baseType: !276)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !257, file: !258, line: 74, baseType: !282, size: 128, offset: 576)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !283, line: 11, size: 128, elements: !284)
!283 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!284 = !{!285, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !282, file: !283, line: 16, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !71, line: 160, baseType: !276)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !282, file: !283, line: 21, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !71, line: 197, baseType: !276)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !257, file: !258, line: 75, baseType: !282, size: 128, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !257, file: !258, line: 76, baseType: !282, size: 128, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !257, file: !258, line: 89, baseType: !292, size: 192, offset: 960)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 192, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 3)
!295 = !DILocation(line: 120, column: 21, scope: !249)
!296 = !DILocation(line: 122, column: 13, scope: !297)
!297 = distinct !DILexicalBlock(scope: !249, file: !2, line: 122, column: 13)
!298 = !DILocation(line: 122, column: 16, scope: !297)
!299 = !DILocation(line: 122, column: 13, scope: !249)
!300 = !DILocation(line: 123, column: 17, scope: !297)
!301 = !DILocation(line: 125, column: 19, scope: !302)
!302 = distinct !DILexicalBlock(scope: !249, file: !2, line: 125, column: 13)
!303 = !DILocation(line: 125, column: 13, scope: !302)
!304 = !DILocation(line: 125, column: 31, scope: !302)
!305 = !DILocation(line: 125, column: 13, scope: !249)
!306 = !DILocation(line: 126, column: 25, scope: !302)
!307 = !DILocation(line: 126, column: 24, scope: !302)
!308 = !DILocation(line: 126, column: 17, scope: !302)
!309 = !DILocation(line: 128, column: 14, scope: !310)
!310 = distinct !DILexicalBlock(scope: !249, file: !2, line: 128, column: 13)
!311 = !DILocation(line: 128, column: 13, scope: !249)
!312 = !DILocation(line: 129, column: 17, scope: !310)
!313 = !DILocation(line: 131, column: 13, scope: !314)
!314 = distinct !DILexicalBlock(scope: !249, file: !2, line: 131, column: 13)
!315 = !DILocation(line: 131, column: 13, scope: !249)
!316 = !DILocalVariable(name: "st_path", scope: !317, file: !2, line: 132, type: !257)
!317 = distinct !DILexicalBlock(scope: !314, file: !2, line: 131, column: 19)
!318 = !DILocation(line: 132, column: 29, scope: !317)
!319 = !DILocation(line: 134, column: 26, scope: !320)
!320 = distinct !DILexicalBlock(scope: !317, file: !2, line: 134, column: 21)
!321 = !DILocation(line: 134, column: 21, scope: !320)
!322 = !DILocation(line: 134, column: 42, scope: !320)
!323 = !DILocation(line: 134, column: 21, scope: !317)
!324 = !DILocation(line: 136, column: 29, scope: !325)
!325 = distinct !DILexicalBlock(scope: !326, file: !2, line: 136, column: 29)
!326 = distinct !DILexicalBlock(scope: !320, file: !2, line: 134, column: 47)
!327 = !DILocation(line: 136, column: 35, scope: !325)
!328 = !DILocation(line: 136, column: 45, scope: !325)
!329 = !DILocation(line: 136, column: 48, scope: !325)
!330 = !DILocation(line: 136, column: 54, scope: !325)
!331 = !DILocation(line: 136, column: 29, scope: !326)
!332 = !DILocation(line: 137, column: 33, scope: !325)
!333 = !DILocation(line: 139, column: 33, scope: !326)
!334 = !DILocation(line: 139, column: 32, scope: !326)
!335 = !DILocation(line: 139, column: 25, scope: !326)
!336 = !DILocation(line: 143, column: 33, scope: !317)
!337 = !DILocation(line: 143, column: 49, scope: !317)
!338 = !DILocation(line: 143, column: 40, scope: !317)
!339 = !DILocation(line: 143, column: 56, scope: !317)
!340 = !DILocation(line: 144, column: 33, scope: !317)
!341 = !DILocation(line: 144, column: 49, scope: !317)
!342 = !DILocation(line: 144, column: 40, scope: !317)
!343 = !DILocation(line: 0, scope: !317)
!344 = !DILocation(line: 142, column: 17, scope: !317)
!345 = !DILocation(line: 147, column: 9, scope: !249)
!346 = !DILocation(line: 148, column: 1, scope: !249)
!347 = distinct !DISubprogram(name: "sd_is_special", scope: !2, file: !2, line: 150, type: !250, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!348 = !DILocalVariable(name: "fd", arg: 1, scope: !347, file: !2, line: 150, type: !72)
!349 = !DILocation(line: 150, column: 23, scope: !347)
!350 = !DILocalVariable(name: "path", arg: 2, scope: !347, file: !2, line: 150, type: !96)
!351 = !DILocation(line: 150, column: 39, scope: !347)
!352 = !DILocalVariable(name: "st_fd", scope: !347, file: !2, line: 151, type: !257)
!353 = !DILocation(line: 151, column: 21, scope: !347)
!354 = !DILocation(line: 153, column: 13, scope: !355)
!355 = distinct !DILexicalBlock(scope: !347, file: !2, line: 153, column: 13)
!356 = !DILocation(line: 153, column: 16, scope: !355)
!357 = !DILocation(line: 153, column: 13, scope: !347)
!358 = !DILocation(line: 154, column: 17, scope: !355)
!359 = !DILocation(line: 156, column: 19, scope: !360)
!360 = distinct !DILexicalBlock(scope: !347, file: !2, line: 156, column: 13)
!361 = !DILocation(line: 156, column: 13, scope: !360)
!362 = !DILocation(line: 156, column: 31, scope: !360)
!363 = !DILocation(line: 156, column: 13, scope: !347)
!364 = !DILocation(line: 157, column: 25, scope: !360)
!365 = !DILocation(line: 157, column: 24, scope: !360)
!366 = !DILocation(line: 157, column: 17, scope: !360)
!367 = !DILocation(line: 159, column: 14, scope: !368)
!368 = distinct !DILexicalBlock(scope: !347, file: !2, line: 159, column: 13)
!369 = !DILocation(line: 159, column: 37, scope: !368)
!370 = !DILocation(line: 159, column: 41, scope: !368)
!371 = !DILocation(line: 159, column: 13, scope: !347)
!372 = !DILocation(line: 160, column: 17, scope: !368)
!373 = !DILocation(line: 162, column: 13, scope: !374)
!374 = distinct !DILexicalBlock(scope: !347, file: !2, line: 162, column: 13)
!375 = !DILocation(line: 162, column: 13, scope: !347)
!376 = !DILocalVariable(name: "st_path", scope: !377, file: !2, line: 163, type: !257)
!377 = distinct !DILexicalBlock(scope: !374, file: !2, line: 162, column: 19)
!378 = !DILocation(line: 163, column: 29, scope: !377)
!379 = !DILocation(line: 165, column: 26, scope: !380)
!380 = distinct !DILexicalBlock(scope: !377, file: !2, line: 165, column: 21)
!381 = !DILocation(line: 165, column: 21, scope: !380)
!382 = !DILocation(line: 165, column: 42, scope: !380)
!383 = !DILocation(line: 165, column: 21, scope: !377)
!384 = !DILocation(line: 167, column: 29, scope: !385)
!385 = distinct !DILexicalBlock(scope: !386, file: !2, line: 167, column: 29)
!386 = distinct !DILexicalBlock(scope: !380, file: !2, line: 165, column: 47)
!387 = !DILocation(line: 167, column: 35, scope: !385)
!388 = !DILocation(line: 167, column: 45, scope: !385)
!389 = !DILocation(line: 167, column: 48, scope: !385)
!390 = !DILocation(line: 167, column: 54, scope: !385)
!391 = !DILocation(line: 167, column: 29, scope: !386)
!392 = !DILocation(line: 168, column: 33, scope: !385)
!393 = !DILocation(line: 170, column: 33, scope: !386)
!394 = !DILocation(line: 170, column: 32, scope: !386)
!395 = !DILocation(line: 170, column: 25, scope: !386)
!396 = !DILocation(line: 173, column: 21, scope: !397)
!397 = distinct !DILexicalBlock(scope: !377, file: !2, line: 173, column: 21)
!398 = !DILocation(line: 173, column: 44, scope: !397)
!399 = !DILocation(line: 173, column: 47, scope: !397)
!400 = !DILocation(line: 173, column: 21, scope: !377)
!401 = !DILocation(line: 175, column: 41, scope: !397)
!402 = !DILocation(line: 175, column: 57, scope: !397)
!403 = !DILocation(line: 175, column: 48, scope: !397)
!404 = !DILocation(line: 175, column: 64, scope: !397)
!405 = !DILocation(line: 176, column: 41, scope: !397)
!406 = !DILocation(line: 176, column: 57, scope: !397)
!407 = !DILocation(line: 176, column: 48, scope: !397)
!408 = !DILocation(line: 0, scope: !397)
!409 = !DILocation(line: 174, column: 25, scope: !397)
!410 = !DILocation(line: 177, column: 26, scope: !411)
!411 = distinct !DILexicalBlock(scope: !397, file: !2, line: 177, column: 26)
!412 = !DILocation(line: 177, column: 49, scope: !411)
!413 = !DILocation(line: 177, column: 52, scope: !411)
!414 = !DILocation(line: 177, column: 26, scope: !397)
!415 = !DILocation(line: 178, column: 40, scope: !411)
!416 = !DILocation(line: 178, column: 57, scope: !411)
!417 = !DILocation(line: 178, column: 48, scope: !411)
!418 = !DILocation(line: 178, column: 25, scope: !411)
!419 = !DILocation(line: 180, column: 25, scope: !411)
!420 = !DILocation(line: 183, column: 9, scope: !347)
!421 = !DILocation(line: 184, column: 1, scope: !347)
!422 = distinct !DISubprogram(name: "sd_is_socket", scope: !2, file: !2, line: 237, type: !423, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!423 = !DISubroutineType(types: !424)
!424 = !{!72, !72, !72, !72, !72}
!425 = !DILocalVariable(name: "fd", arg: 1, scope: !422, file: !2, line: 237, type: !72)
!426 = !DILocation(line: 237, column: 22, scope: !422)
!427 = !DILocalVariable(name: "family", arg: 2, scope: !422, file: !2, line: 237, type: !72)
!428 = !DILocation(line: 237, column: 30, scope: !422)
!429 = !DILocalVariable(name: "type", arg: 3, scope: !422, file: !2, line: 237, type: !72)
!430 = !DILocation(line: 237, column: 42, scope: !422)
!431 = !DILocalVariable(name: "listening", arg: 4, scope: !422, file: !2, line: 237, type: !72)
!432 = !DILocation(line: 237, column: 52, scope: !422)
!433 = !DILocalVariable(name: "r", scope: !422, file: !2, line: 238, type: !72)
!434 = !DILocation(line: 238, column: 13, scope: !422)
!435 = !DILocation(line: 240, column: 13, scope: !436)
!436 = distinct !DILexicalBlock(scope: !422, file: !2, line: 240, column: 13)
!437 = !DILocation(line: 240, column: 20, scope: !436)
!438 = !DILocation(line: 240, column: 13, scope: !422)
!439 = !DILocation(line: 241, column: 17, scope: !436)
!440 = !DILocation(line: 243, column: 35, scope: !422)
!441 = !DILocation(line: 243, column: 39, scope: !422)
!442 = !DILocation(line: 243, column: 45, scope: !422)
!443 = !DILocation(line: 243, column: 13, scope: !422)
!444 = !DILocation(line: 243, column: 11, scope: !422)
!445 = !DILocation(line: 244, column: 13, scope: !446)
!446 = distinct !DILexicalBlock(scope: !422, file: !2, line: 244, column: 13)
!447 = !DILocation(line: 244, column: 15, scope: !446)
!448 = !DILocation(line: 244, column: 13, scope: !422)
!449 = !DILocation(line: 245, column: 24, scope: !446)
!450 = !DILocation(line: 245, column: 17, scope: !446)
!451 = !DILocation(line: 247, column: 13, scope: !452)
!452 = distinct !DILexicalBlock(scope: !422, file: !2, line: 247, column: 13)
!453 = !DILocation(line: 247, column: 20, scope: !452)
!454 = !DILocation(line: 247, column: 13, scope: !422)
!455 = !DILocalVariable(name: "sockaddr", scope: !456, file: !2, line: 248, type: !457)
!456 = distinct !DILexicalBlock(scope: !452, file: !2, line: 247, column: 25)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sockaddr_union", file: !2, line: 229, size: 1024, elements: !458)
!458 = !{!459, !467, !489, !514, !523}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !457, file: !2, line: 230, baseType: !460, size: 128)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !43, line: 180, size: 128, elements: !461)
!461 = !{!462, !466}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !460, file: !43, line: 182, baseType: !463, size: 16)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !464, line: 28, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!465 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !460, file: !43, line: 183, baseType: !11, size: 112, offset: 16)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "in4", scope: !457, file: !2, line: 231, baseType: !468, size: 128)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !469, line: 245, size: 128, elements: !470)
!469 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!470 = !{!471, !472, !477, !484}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !468, file: !469, line: 247, baseType: !463, size: 16)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !468, file: !469, line: 248, baseType: !473, size: 16, offset: 16)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !469, line: 123, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !475, line: 25, baseType: !476)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !71, line: 40, baseType: !465)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !468, file: !469, line: 249, baseType: !478, size: 32, offset: 32)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !469, line: 31, size: 32, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !478, file: !469, line: 33, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !469, line: 30, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !475, line: 26, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !71, line: 42, baseType: !31)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !468, file: !469, line: 252, baseType: !485, size: 64, offset: 64)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 64, elements: !487)
!486 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!487 = !{!488}
!488 = !DISubrange(count: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !457, file: !2, line: 232, baseType: !490, size: 224)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !469, line: 260, size: 224, elements: !491)
!491 = !{!492, !493, !494, !495, !513}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !490, file: !469, line: 262, baseType: !463, size: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !490, file: !469, line: 263, baseType: !473, size: 16, offset: 16)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !490, file: !469, line: 264, baseType: !482, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !490, file: !469, line: 265, baseType: !496, size: 128, offset: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !469, line: 219, size: 128, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !496, file: !469, line: 226, baseType: !499, size: 128)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !469, line: 221, size: 128, elements: !500)
!500 = !{!501, !507, !509}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !499, file: !469, line: 223, baseType: !502, size: 128)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 128, elements: !505)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !475, line: 24, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !71, line: 38, baseType: !486)
!505 = !{!506}
!506 = !DISubrange(count: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !499, file: !469, line: 224, baseType: !508, size: 128)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 128, elements: !487)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !499, file: !469, line: 225, baseType: !510, size: 128)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 128, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 4)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !490, file: !469, line: 266, baseType: !482, size: 32, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !457, file: !2, line: 233, baseType: !515, size: 880)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !516, line: 29, size: 880, elements: !517)
!516 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "", checksumkind: CSK_MD5, checksum: "543d98cd612c9215c9333043f81a0cd3")
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !515, file: !516, line: 31, baseType: !463, size: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !515, file: !516, line: 32, baseType: !520, size: 864, offset: 16)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 108)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !457, file: !2, line: 234, baseType: !524, size: 1024)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !43, line: 193, size: 1024, elements: !525)
!525 = !{!526, !527, !531}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !524, file: !43, line: 195, baseType: !463, size: 16)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !524, file: !43, line: 196, baseType: !528, size: 944, offset: 16)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 944, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 118)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !524, file: !43, line: 197, baseType: !102, size: 64, offset: 960)
!532 = !DILocation(line: 248, column: 38, scope: !456)
!533 = !DILocalVariable(name: "l", scope: !456, file: !2, line: 249, type: !74)
!534 = !DILocation(line: 249, column: 27, scope: !456)
!535 = !DILocation(line: 251, column: 33, scope: !536)
!536 = distinct !DILexicalBlock(scope: !456, file: !2, line: 251, column: 21)
!537 = !DILocation(line: 251, column: 37, scope: !536)
!538 = !DILocation(line: 251, column: 21, scope: !536)
!539 = !DILocation(line: 251, column: 55, scope: !536)
!540 = !DILocation(line: 251, column: 21, scope: !456)
!541 = !DILocation(line: 252, column: 33, scope: !536)
!542 = !DILocation(line: 252, column: 32, scope: !536)
!543 = !DILocation(line: 252, column: 25, scope: !536)
!544 = !DILocation(line: 254, column: 21, scope: !545)
!545 = distinct !DILexicalBlock(scope: !456, file: !2, line: 254, column: 21)
!546 = !DILocation(line: 254, column: 23, scope: !545)
!547 = !DILocation(line: 254, column: 21, scope: !456)
!548 = !DILocation(line: 255, column: 25, scope: !545)
!549 = !DILocation(line: 257, column: 36, scope: !456)
!550 = !DILocation(line: 257, column: 24, scope: !456)
!551 = !DILocation(line: 257, column: 49, scope: !456)
!552 = !DILocation(line: 257, column: 46, scope: !456)
!553 = !DILocation(line: 257, column: 17, scope: !456)
!554 = !DILocation(line: 260, column: 9, scope: !422)
!555 = !DILocation(line: 261, column: 1, scope: !422)
!556 = distinct !DISubprogram(name: "sd_is_socket_internal", scope: !2, file: !2, line: 186, type: !557, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !26, retainedNodes: !88)
!557 = !DISubroutineType(types: !558)
!558 = !{!72, !72, !72, !72}
!559 = !DILocalVariable(name: "fd", arg: 1, scope: !556, file: !2, line: 186, type: !72)
!560 = !DILocation(line: 186, column: 38, scope: !556)
!561 = !DILocalVariable(name: "type", arg: 2, scope: !556, file: !2, line: 186, type: !72)
!562 = !DILocation(line: 186, column: 46, scope: !556)
!563 = !DILocalVariable(name: "listening", arg: 3, scope: !556, file: !2, line: 186, type: !72)
!564 = !DILocation(line: 186, column: 56, scope: !556)
!565 = !DILocalVariable(name: "st_fd", scope: !556, file: !2, line: 187, type: !257)
!566 = !DILocation(line: 187, column: 21, scope: !556)
!567 = !DILocation(line: 189, column: 13, scope: !568)
!568 = distinct !DILexicalBlock(scope: !556, file: !2, line: 189, column: 13)
!569 = !DILocation(line: 189, column: 16, scope: !568)
!570 = !DILocation(line: 189, column: 20, scope: !568)
!571 = !DILocation(line: 189, column: 23, scope: !568)
!572 = !DILocation(line: 189, column: 28, scope: !568)
!573 = !DILocation(line: 189, column: 13, scope: !556)
!574 = !DILocation(line: 190, column: 17, scope: !568)
!575 = !DILocation(line: 192, column: 19, scope: !576)
!576 = distinct !DILexicalBlock(scope: !556, file: !2, line: 192, column: 13)
!577 = !DILocation(line: 192, column: 13, scope: !576)
!578 = !DILocation(line: 192, column: 31, scope: !576)
!579 = !DILocation(line: 192, column: 13, scope: !556)
!580 = !DILocation(line: 193, column: 25, scope: !576)
!581 = !DILocation(line: 193, column: 24, scope: !576)
!582 = !DILocation(line: 193, column: 17, scope: !576)
!583 = !DILocation(line: 195, column: 14, scope: !584)
!584 = distinct !DILexicalBlock(scope: !556, file: !2, line: 195, column: 13)
!585 = !DILocation(line: 195, column: 13, scope: !556)
!586 = !DILocation(line: 196, column: 17, scope: !584)
!587 = !DILocation(line: 198, column: 13, scope: !588)
!588 = distinct !DILexicalBlock(scope: !556, file: !2, line: 198, column: 13)
!589 = !DILocation(line: 198, column: 18, scope: !588)
!590 = !DILocation(line: 198, column: 13, scope: !556)
!591 = !DILocalVariable(name: "other_type", scope: !592, file: !2, line: 199, type: !72)
!592 = distinct !DILexicalBlock(scope: !588, file: !2, line: 198, column: 24)
!593 = !DILocation(line: 199, column: 21, scope: !592)
!594 = !DILocalVariable(name: "l", scope: !592, file: !2, line: 200, type: !74)
!595 = !DILocation(line: 200, column: 27, scope: !592)
!596 = !DILocation(line: 202, column: 32, scope: !597)
!597 = distinct !DILexicalBlock(scope: !592, file: !2, line: 202, column: 21)
!598 = !DILocation(line: 202, column: 21, scope: !597)
!599 = !DILocation(line: 202, column: 74, scope: !597)
!600 = !DILocation(line: 202, column: 21, scope: !592)
!601 = !DILocation(line: 203, column: 33, scope: !597)
!602 = !DILocation(line: 203, column: 32, scope: !597)
!603 = !DILocation(line: 203, column: 25, scope: !597)
!604 = !DILocation(line: 205, column: 21, scope: !605)
!605 = distinct !DILexicalBlock(scope: !592, file: !2, line: 205, column: 21)
!606 = !DILocation(line: 205, column: 23, scope: !605)
!607 = !DILocation(line: 205, column: 21, scope: !592)
!608 = !DILocation(line: 206, column: 25, scope: !605)
!609 = !DILocation(line: 208, column: 21, scope: !610)
!610 = distinct !DILexicalBlock(scope: !592, file: !2, line: 208, column: 21)
!611 = !DILocation(line: 208, column: 35, scope: !610)
!612 = !DILocation(line: 208, column: 32, scope: !610)
!613 = !DILocation(line: 208, column: 21, scope: !592)
!614 = !DILocation(line: 209, column: 25, scope: !610)
!615 = !DILocation(line: 210, column: 9, scope: !592)
!616 = !DILocation(line: 212, column: 13, scope: !617)
!617 = distinct !DILexicalBlock(scope: !556, file: !2, line: 212, column: 13)
!618 = !DILocation(line: 212, column: 23, scope: !617)
!619 = !DILocation(line: 212, column: 13, scope: !556)
!620 = !DILocalVariable(name: "accepting", scope: !621, file: !2, line: 213, type: !72)
!621 = distinct !DILexicalBlock(scope: !617, file: !2, line: 212, column: 29)
!622 = !DILocation(line: 213, column: 21, scope: !621)
!623 = !DILocalVariable(name: "l", scope: !621, file: !2, line: 214, type: !74)
!624 = !DILocation(line: 214, column: 27, scope: !621)
!625 = !DILocation(line: 216, column: 32, scope: !626)
!626 = distinct !DILexicalBlock(scope: !621, file: !2, line: 216, column: 21)
!627 = !DILocation(line: 216, column: 21, scope: !626)
!628 = !DILocation(line: 216, column: 79, scope: !626)
!629 = !DILocation(line: 216, column: 21, scope: !621)
!630 = !DILocation(line: 217, column: 33, scope: !626)
!631 = !DILocation(line: 217, column: 32, scope: !626)
!632 = !DILocation(line: 217, column: 25, scope: !626)
!633 = !DILocation(line: 219, column: 21, scope: !634)
!634 = distinct !DILexicalBlock(scope: !621, file: !2, line: 219, column: 21)
!635 = !DILocation(line: 219, column: 23, scope: !634)
!636 = !DILocation(line: 219, column: 21, scope: !621)
!637 = !DILocation(line: 220, column: 25, scope: !634)
!638 = !DILocation(line: 222, column: 22, scope: !639)
!639 = distinct !DILexicalBlock(scope: !621, file: !2, line: 222, column: 21)
!640 = !DILocation(line: 222, column: 21, scope: !639)
!641 = !DILocation(line: 222, column: 36, scope: !639)
!642 = !DILocation(line: 222, column: 35, scope: !639)
!643 = !DILocation(line: 222, column: 32, scope: !639)
!644 = !DILocation(line: 222, column: 21, scope: !621)
!645 = !DILocation(line: 223, column: 25, scope: !639)
!646 = !DILocation(line: 224, column: 9, scope: !621)
!647 = !DILocation(line: 226, column: 9, scope: !556)
!648 = !DILocation(line: 227, column: 1, scope: !556)
!649 = distinct !DISubprogram(name: "sd_is_socket_inet", scope: !2, file: !2, line: 263, type: !650, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!650 = !DISubroutineType(types: !651)
!651 = !{!72, !72, !72, !72, !72, !474}
!652 = !DILocalVariable(name: "fd", arg: 1, scope: !649, file: !2, line: 263, type: !72)
!653 = !DILocation(line: 263, column: 27, scope: !649)
!654 = !DILocalVariable(name: "family", arg: 2, scope: !649, file: !2, line: 263, type: !72)
!655 = !DILocation(line: 263, column: 35, scope: !649)
!656 = !DILocalVariable(name: "type", arg: 3, scope: !649, file: !2, line: 263, type: !72)
!657 = !DILocation(line: 263, column: 47, scope: !649)
!658 = !DILocalVariable(name: "listening", arg: 4, scope: !649, file: !2, line: 263, type: !72)
!659 = !DILocation(line: 263, column: 57, scope: !649)
!660 = !DILocalVariable(name: "port", arg: 5, scope: !649, file: !2, line: 263, type: !474)
!661 = !DILocation(line: 263, column: 77, scope: !649)
!662 = !DILocalVariable(name: "sockaddr", scope: !649, file: !2, line: 264, type: !457)
!663 = !DILocation(line: 264, column: 30, scope: !649)
!664 = !DILocalVariable(name: "l", scope: !649, file: !2, line: 265, type: !74)
!665 = !DILocation(line: 265, column: 19, scope: !649)
!666 = !DILocalVariable(name: "r", scope: !649, file: !2, line: 266, type: !72)
!667 = !DILocation(line: 266, column: 13, scope: !649)
!668 = !DILocation(line: 268, column: 13, scope: !669)
!669 = distinct !DILexicalBlock(scope: !649, file: !2, line: 268, column: 13)
!670 = !DILocation(line: 268, column: 20, scope: !669)
!671 = !DILocation(line: 268, column: 25, scope: !669)
!672 = !DILocation(line: 268, column: 28, scope: !669)
!673 = !DILocation(line: 268, column: 35, scope: !669)
!674 = !DILocation(line: 268, column: 46, scope: !669)
!675 = !DILocation(line: 268, column: 49, scope: !669)
!676 = !DILocation(line: 268, column: 56, scope: !669)
!677 = !DILocation(line: 268, column: 13, scope: !649)
!678 = !DILocation(line: 269, column: 17, scope: !669)
!679 = !DILocation(line: 271, column: 35, scope: !649)
!680 = !DILocation(line: 271, column: 39, scope: !649)
!681 = !DILocation(line: 271, column: 45, scope: !649)
!682 = !DILocation(line: 271, column: 13, scope: !649)
!683 = !DILocation(line: 271, column: 11, scope: !649)
!684 = !DILocation(line: 272, column: 13, scope: !685)
!685 = distinct !DILexicalBlock(scope: !649, file: !2, line: 272, column: 13)
!686 = !DILocation(line: 272, column: 15, scope: !685)
!687 = !DILocation(line: 272, column: 13, scope: !649)
!688 = !DILocation(line: 273, column: 24, scope: !685)
!689 = !DILocation(line: 273, column: 17, scope: !685)
!690 = !DILocation(line: 275, column: 25, scope: !691)
!691 = distinct !DILexicalBlock(scope: !649, file: !2, line: 275, column: 13)
!692 = !DILocation(line: 275, column: 29, scope: !691)
!693 = !DILocation(line: 275, column: 13, scope: !691)
!694 = !DILocation(line: 275, column: 47, scope: !691)
!695 = !DILocation(line: 275, column: 13, scope: !649)
!696 = !DILocation(line: 276, column: 25, scope: !691)
!697 = !DILocation(line: 276, column: 24, scope: !691)
!698 = !DILocation(line: 276, column: 17, scope: !691)
!699 = !DILocation(line: 278, column: 13, scope: !700)
!700 = distinct !DILexicalBlock(scope: !649, file: !2, line: 278, column: 13)
!701 = !DILocation(line: 278, column: 15, scope: !700)
!702 = !DILocation(line: 278, column: 13, scope: !649)
!703 = !DILocation(line: 279, column: 17, scope: !700)
!704 = !DILocation(line: 281, column: 25, scope: !705)
!705 = distinct !DILexicalBlock(scope: !649, file: !2, line: 281, column: 13)
!706 = !DILocation(line: 281, column: 13, scope: !705)
!707 = !DILocation(line: 281, column: 35, scope: !705)
!708 = !DILocation(line: 281, column: 46, scope: !705)
!709 = !DILocation(line: 282, column: 25, scope: !705)
!710 = !DILocation(line: 282, column: 13, scope: !705)
!711 = !DILocation(line: 282, column: 35, scope: !705)
!712 = !DILocation(line: 281, column: 13, scope: !649)
!713 = !DILocation(line: 283, column: 17, scope: !705)
!714 = !DILocation(line: 285, column: 13, scope: !715)
!715 = distinct !DILexicalBlock(scope: !649, file: !2, line: 285, column: 13)
!716 = !DILocation(line: 285, column: 20, scope: !715)
!717 = !DILocation(line: 285, column: 13, scope: !649)
!718 = !DILocation(line: 286, column: 33, scope: !719)
!719 = distinct !DILexicalBlock(scope: !715, file: !2, line: 286, column: 21)
!720 = !DILocation(line: 286, column: 21, scope: !719)
!721 = !DILocation(line: 286, column: 46, scope: !719)
!722 = !DILocation(line: 286, column: 43, scope: !719)
!723 = !DILocation(line: 286, column: 21, scope: !715)
!724 = !DILocation(line: 287, column: 25, scope: !719)
!725 = !DILocation(line: 289, column: 13, scope: !726)
!726 = distinct !DILexicalBlock(scope: !649, file: !2, line: 289, column: 13)
!727 = !DILocation(line: 289, column: 18, scope: !726)
!728 = !DILocation(line: 289, column: 13, scope: !649)
!729 = !DILocation(line: 290, column: 33, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !2, line: 290, column: 21)
!731 = distinct !DILexicalBlock(scope: !726, file: !2, line: 289, column: 23)
!732 = !DILocation(line: 290, column: 21, scope: !730)
!733 = !DILocation(line: 290, column: 43, scope: !730)
!734 = !DILocation(line: 290, column: 21, scope: !731)
!735 = !DILocation(line: 291, column: 29, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !2, line: 291, column: 29)
!737 = distinct !DILexicalBlock(scope: !730, file: !2, line: 290, column: 55)
!738 = !DILocation(line: 291, column: 31, scope: !736)
!739 = !DILocation(line: 291, column: 29, scope: !737)
!740 = !DILocation(line: 292, column: 33, scope: !736)
!741 = !DILocation(line: 294, column: 38, scope: !737)
!742 = !DILocation(line: 294, column: 32, scope: !737)
!743 = !DILocation(line: 294, column: 60, scope: !737)
!744 = !DILocation(line: 294, column: 47, scope: !737)
!745 = !DILocation(line: 294, column: 44, scope: !737)
!746 = !DILocation(line: 294, column: 25, scope: !737)
!747 = !DILocation(line: 296, column: 29, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !2, line: 296, column: 29)
!749 = distinct !DILexicalBlock(scope: !730, file: !2, line: 295, column: 24)
!750 = !DILocation(line: 296, column: 31, scope: !748)
!751 = !DILocation(line: 296, column: 29, scope: !749)
!752 = !DILocation(line: 297, column: 33, scope: !748)
!753 = !DILocation(line: 299, column: 38, scope: !749)
!754 = !DILocation(line: 299, column: 32, scope: !749)
!755 = !DILocation(line: 299, column: 60, scope: !749)
!756 = !DILocation(line: 299, column: 47, scope: !749)
!757 = !DILocation(line: 299, column: 44, scope: !749)
!758 = !DILocation(line: 299, column: 25, scope: !749)
!759 = !DILocation(line: 303, column: 9, scope: !649)
!760 = !DILocation(line: 304, column: 1, scope: !649)
!761 = distinct !DISubprogram(name: "sd_is_socket_unix", scope: !2, file: !2, line: 306, type: !762, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!762 = !DISubroutineType(types: !763)
!763 = !{!72, !72, !72, !72, !96, !764}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !765, line: 46, baseType: !102)
!765 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!766 = !DILocalVariable(name: "fd", arg: 1, scope: !761, file: !2, line: 306, type: !72)
!767 = !DILocation(line: 306, column: 27, scope: !761)
!768 = !DILocalVariable(name: "type", arg: 2, scope: !761, file: !2, line: 306, type: !72)
!769 = !DILocation(line: 306, column: 35, scope: !761)
!770 = !DILocalVariable(name: "listening", arg: 3, scope: !761, file: !2, line: 306, type: !72)
!771 = !DILocation(line: 306, column: 45, scope: !761)
!772 = !DILocalVariable(name: "path", arg: 4, scope: !761, file: !2, line: 306, type: !96)
!773 = !DILocation(line: 306, column: 68, scope: !761)
!774 = !DILocalVariable(name: "length", arg: 5, scope: !761, file: !2, line: 306, type: !764)
!775 = !DILocation(line: 306, column: 81, scope: !761)
!776 = !DILocalVariable(name: "sockaddr", scope: !761, file: !2, line: 307, type: !457)
!777 = !DILocation(line: 307, column: 30, scope: !761)
!778 = !DILocalVariable(name: "l", scope: !761, file: !2, line: 308, type: !74)
!779 = !DILocation(line: 308, column: 19, scope: !761)
!780 = !DILocalVariable(name: "r", scope: !761, file: !2, line: 309, type: !72)
!781 = !DILocation(line: 309, column: 13, scope: !761)
!782 = !DILocation(line: 311, column: 35, scope: !761)
!783 = !DILocation(line: 311, column: 39, scope: !761)
!784 = !DILocation(line: 311, column: 45, scope: !761)
!785 = !DILocation(line: 311, column: 13, scope: !761)
!786 = !DILocation(line: 311, column: 11, scope: !761)
!787 = !DILocation(line: 312, column: 13, scope: !788)
!788 = distinct !DILexicalBlock(scope: !761, file: !2, line: 312, column: 13)
!789 = !DILocation(line: 312, column: 15, scope: !788)
!790 = !DILocation(line: 312, column: 13, scope: !761)
!791 = !DILocation(line: 313, column: 24, scope: !788)
!792 = !DILocation(line: 313, column: 17, scope: !788)
!793 = !DILocation(line: 315, column: 25, scope: !794)
!794 = distinct !DILexicalBlock(scope: !761, file: !2, line: 315, column: 13)
!795 = !DILocation(line: 315, column: 29, scope: !794)
!796 = !DILocation(line: 315, column: 13, scope: !794)
!797 = !DILocation(line: 315, column: 47, scope: !794)
!798 = !DILocation(line: 315, column: 13, scope: !761)
!799 = !DILocation(line: 316, column: 25, scope: !794)
!800 = !DILocation(line: 316, column: 24, scope: !794)
!801 = !DILocation(line: 316, column: 17, scope: !794)
!802 = !DILocation(line: 318, column: 13, scope: !803)
!803 = distinct !DILexicalBlock(scope: !761, file: !2, line: 318, column: 13)
!804 = !DILocation(line: 318, column: 15, scope: !803)
!805 = !DILocation(line: 318, column: 13, scope: !761)
!806 = !DILocation(line: 319, column: 17, scope: !803)
!807 = !DILocation(line: 321, column: 25, scope: !808)
!808 = distinct !DILexicalBlock(scope: !761, file: !2, line: 321, column: 13)
!809 = !DILocation(line: 321, column: 13, scope: !808)
!810 = !DILocation(line: 321, column: 35, scope: !808)
!811 = !DILocation(line: 321, column: 13, scope: !761)
!812 = !DILocation(line: 322, column: 17, scope: !808)
!813 = !DILocation(line: 324, column: 13, scope: !814)
!814 = distinct !DILexicalBlock(scope: !761, file: !2, line: 324, column: 13)
!815 = !DILocation(line: 324, column: 13, scope: !761)
!816 = !DILocation(line: 325, column: 21, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !2, line: 325, column: 21)
!818 = distinct !DILexicalBlock(scope: !814, file: !2, line: 324, column: 19)
!819 = !DILocation(line: 325, column: 28, scope: !817)
!820 = !DILocation(line: 325, column: 21, scope: !818)
!821 = !DILocation(line: 326, column: 41, scope: !817)
!822 = !DILocation(line: 326, column: 34, scope: !817)
!823 = !DILocation(line: 326, column: 32, scope: !817)
!824 = !DILocation(line: 326, column: 25, scope: !817)
!825 = !DILocation(line: 328, column: 21, scope: !826)
!826 = distinct !DILexicalBlock(scope: !818, file: !2, line: 328, column: 21)
!827 = !DILocation(line: 328, column: 28, scope: !826)
!828 = !DILocation(line: 328, column: 21, scope: !818)
!829 = !DILocation(line: 330, column: 32, scope: !826)
!830 = !DILocation(line: 330, column: 34, scope: !826)
!831 = !DILocation(line: 330, column: 25, scope: !826)
!832 = !DILocation(line: 332, column: 21, scope: !833)
!833 = distinct !DILexicalBlock(scope: !818, file: !2, line: 332, column: 21)
!834 = !DILocation(line: 332, column: 21, scope: !818)
!835 = !DILocation(line: 335, column: 34, scope: !833)
!836 = !DILocation(line: 335, column: 80, scope: !833)
!837 = !DILocation(line: 335, column: 78, scope: !833)
!838 = !DILocation(line: 335, column: 87, scope: !833)
!839 = !DILocation(line: 335, column: 36, scope: !833)
!840 = !DILocation(line: 335, column: 92, scope: !833)
!841 = !DILocation(line: 336, column: 40, scope: !833)
!842 = !DILocation(line: 336, column: 58, scope: !833)
!843 = !DILocation(line: 336, column: 46, scope: !833)
!844 = !DILocation(line: 336, column: 68, scope: !833)
!845 = !DILocation(line: 336, column: 74, scope: !833)
!846 = !DILocation(line: 336, column: 33, scope: !833)
!847 = !DILocation(line: 336, column: 78, scope: !833)
!848 = !DILocation(line: 0, scope: !833)
!849 = !DILocation(line: 334, column: 25, scope: !833)
!850 = !DILocation(line: 340, column: 34, scope: !833)
!851 = !DILocation(line: 340, column: 80, scope: !833)
!852 = !DILocation(line: 340, column: 78, scope: !833)
!853 = !DILocation(line: 340, column: 36, scope: !833)
!854 = !DILocation(line: 340, column: 88, scope: !833)
!855 = !DILocation(line: 341, column: 40, scope: !833)
!856 = !DILocation(line: 341, column: 58, scope: !833)
!857 = !DILocation(line: 341, column: 46, scope: !833)
!858 = !DILocation(line: 341, column: 68, scope: !833)
!859 = !DILocation(line: 341, column: 33, scope: !833)
!860 = !DILocation(line: 341, column: 76, scope: !833)
!861 = !DILocation(line: 339, column: 25, scope: !833)
!862 = !DILocation(line: 344, column: 9, scope: !761)
!863 = !DILocation(line: 345, column: 1, scope: !761)
!864 = distinct !DISubprogram(name: "sd_notify", scope: !2, file: !2, line: 347, type: !250, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!865 = !DILocalVariable(name: "unset_environment", arg: 1, scope: !864, file: !2, line: 347, type: !72)
!866 = !DILocation(line: 347, column: 19, scope: !864)
!867 = !DILocalVariable(name: "state", arg: 2, scope: !864, file: !2, line: 347, type: !96)
!868 = !DILocation(line: 347, column: 50, scope: !864)
!869 = !DILocalVariable(name: "fd", scope: !864, file: !2, line: 348, type: !72)
!870 = !DILocation(line: 348, column: 13, scope: !864)
!871 = !DILocalVariable(name: "r", scope: !864, file: !2, line: 348, type: !72)
!872 = !DILocation(line: 348, column: 22, scope: !864)
!873 = !DILocalVariable(name: "msghdr", scope: !864, file: !2, line: 349, type: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !43, line: 259, size: 448, elements: !875)
!875 = !{!876, !878, !879, !886, !887, !888, !889}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !874, file: !43, line: 261, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !874, file: !43, line: 262, baseType: !74, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !874, file: !43, line: 264, baseType: !880, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !882, line: 26, size: 128, elements: !883)
!882 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !881, file: !882, line: 28, baseType: !877, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !881, file: !882, line: 29, baseType: !764, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !874, file: !43, line: 265, baseType: !764, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !874, file: !43, line: 267, baseType: !877, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !874, file: !43, line: 268, baseType: !764, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !874, file: !43, line: 273, baseType: !72, size: 32, offset: 384)
!890 = !DILocation(line: 349, column: 23, scope: !864)
!891 = !DILocalVariable(name: "iovec", scope: !864, file: !2, line: 350, type: !881)
!892 = !DILocation(line: 350, column: 22, scope: !864)
!893 = !DILocalVariable(name: "sockaddr", scope: !864, file: !2, line: 351, type: !457)
!894 = !DILocation(line: 351, column: 30, scope: !864)
!895 = !DILocalVariable(name: "e", scope: !864, file: !2, line: 352, type: !96)
!896 = !DILocation(line: 352, column: 21, scope: !864)
!897 = !DILocation(line: 354, column: 14, scope: !898)
!898 = distinct !DILexicalBlock(scope: !864, file: !2, line: 354, column: 13)
!899 = !DILocation(line: 354, column: 13, scope: !864)
!900 = !DILocation(line: 355, column: 19, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !2, line: 354, column: 21)
!902 = !DILocation(line: 356, column: 17, scope: !901)
!903 = !DILocation(line: 359, column: 13, scope: !864)
!904 = !DILocation(line: 359, column: 11, scope: !864)
!905 = !DILocation(line: 360, column: 14, scope: !906)
!906 = distinct !DILexicalBlock(scope: !864, file: !2, line: 360, column: 13)
!907 = !DILocation(line: 360, column: 13, scope: !864)
!908 = !DILocation(line: 361, column: 17, scope: !906)
!909 = !DILocation(line: 364, column: 14, scope: !910)
!910 = distinct !DILexicalBlock(scope: !864, file: !2, line: 364, column: 13)
!911 = !DILocation(line: 364, column: 19, scope: !910)
!912 = !DILocation(line: 364, column: 26, scope: !910)
!913 = !DILocation(line: 364, column: 29, scope: !910)
!914 = !DILocation(line: 364, column: 34, scope: !910)
!915 = !DILocation(line: 364, column: 42, scope: !910)
!916 = !DILocation(line: 364, column: 45, scope: !910)
!917 = !DILocation(line: 364, column: 50, scope: !910)
!918 = !DILocation(line: 364, column: 13, scope: !864)
!919 = !DILocation(line: 365, column: 19, scope: !920)
!920 = distinct !DILexicalBlock(scope: !910, file: !2, line: 364, column: 56)
!921 = !DILocation(line: 366, column: 17, scope: !920)
!922 = !DILocation(line: 369, column: 14, scope: !864)
!923 = !DILocation(line: 369, column: 12, scope: !864)
!924 = !DILocation(line: 370, column: 13, scope: !925)
!925 = distinct !DILexicalBlock(scope: !864, file: !2, line: 370, column: 13)
!926 = !DILocation(line: 370, column: 16, scope: !925)
!927 = !DILocation(line: 370, column: 13, scope: !864)
!928 = !DILocation(line: 371, column: 22, scope: !929)
!929 = distinct !DILexicalBlock(scope: !925, file: !2, line: 370, column: 21)
!930 = !DILocation(line: 371, column: 21, scope: !929)
!931 = !DILocation(line: 371, column: 19, scope: !929)
!932 = !DILocation(line: 372, column: 17, scope: !929)
!933 = !DILocation(line: 375, column: 9, scope: !864)
!934 = !DILocation(line: 376, column: 21, scope: !864)
!935 = !DILocation(line: 376, column: 31, scope: !864)
!936 = !DILocation(line: 377, column: 29, scope: !864)
!937 = !DILocation(line: 377, column: 17, scope: !864)
!938 = !DILocation(line: 377, column: 39, scope: !864)
!939 = !DILocation(line: 377, column: 9, scope: !864)
!940 = !DILocation(line: 379, column: 25, scope: !941)
!941 = distinct !DILexicalBlock(scope: !864, file: !2, line: 379, column: 13)
!942 = !DILocation(line: 379, column: 13, scope: !941)
!943 = !DILocation(line: 379, column: 37, scope: !941)
!944 = !DILocation(line: 379, column: 13, scope: !864)
!945 = !DILocation(line: 380, column: 29, scope: !941)
!946 = !DILocation(line: 380, column: 17, scope: !941)
!947 = !DILocation(line: 380, column: 41, scope: !941)
!948 = !DILocation(line: 382, column: 9, scope: !864)
!949 = !DILocation(line: 383, column: 34, scope: !864)
!950 = !DILocation(line: 383, column: 15, scope: !864)
!951 = !DILocation(line: 383, column: 24, scope: !864)
!952 = !DILocation(line: 384, column: 32, scope: !864)
!953 = !DILocation(line: 384, column: 25, scope: !864)
!954 = !DILocation(line: 384, column: 15, scope: !864)
!955 = !DILocation(line: 384, column: 23, scope: !864)
!956 = !DILocation(line: 386, column: 9, scope: !864)
!957 = !DILocation(line: 387, column: 16, scope: !864)
!958 = !DILocation(line: 387, column: 25, scope: !864)
!959 = !DILocation(line: 388, column: 90, scope: !864)
!960 = !DILocation(line: 388, column: 83, scope: !864)
!961 = !DILocation(line: 388, column: 81, scope: !864)
!962 = !DILocation(line: 388, column: 30, scope: !864)
!963 = !DILocation(line: 388, column: 16, scope: !864)
!964 = !DILocation(line: 388, column: 28, scope: !864)
!965 = !DILocation(line: 390, column: 20, scope: !966)
!966 = distinct !DILexicalBlock(scope: !864, file: !2, line: 390, column: 13)
!967 = !DILocation(line: 390, column: 13, scope: !966)
!968 = !DILocation(line: 390, column: 32, scope: !966)
!969 = !DILocation(line: 390, column: 13, scope: !864)
!970 = !DILocation(line: 391, column: 24, scope: !966)
!971 = !DILocation(line: 391, column: 36, scope: !966)
!972 = !DILocation(line: 391, column: 17, scope: !966)
!973 = !DILocation(line: 393, column: 16, scope: !864)
!974 = !DILocation(line: 393, column: 24, scope: !864)
!975 = !DILocation(line: 394, column: 16, scope: !864)
!976 = !DILocation(line: 394, column: 27, scope: !864)
!977 = !DILocation(line: 396, column: 21, scope: !978)
!978 = distinct !DILexicalBlock(scope: !864, file: !2, line: 396, column: 13)
!979 = !DILocation(line: 396, column: 13, scope: !978)
!980 = !DILocation(line: 396, column: 48, scope: !978)
!981 = !DILocation(line: 396, column: 13, scope: !864)
!982 = !DILocation(line: 397, column: 22, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !2, line: 396, column: 53)
!984 = !DILocation(line: 397, column: 21, scope: !983)
!985 = !DILocation(line: 397, column: 19, scope: !983)
!986 = !DILocation(line: 398, column: 17, scope: !983)
!987 = !DILocation(line: 401, column: 11, scope: !864)
!988 = !DILocation(line: 401, column: 9, scope: !864)
!989 = !DILabel(scope: !864, name: "finish", file: !2, line: 403)
!990 = !DILocation(line: 403, column: 1, scope: !864)
!991 = !DILocation(line: 404, column: 13, scope: !992)
!992 = distinct !DILexicalBlock(scope: !864, file: !2, line: 404, column: 13)
!993 = !DILocation(line: 404, column: 13, scope: !864)
!994 = !DILocation(line: 405, column: 17, scope: !992)
!995 = !DILocation(line: 407, column: 13, scope: !996)
!996 = distinct !DILexicalBlock(scope: !864, file: !2, line: 407, column: 13)
!997 = !DILocation(line: 407, column: 16, scope: !996)
!998 = !DILocation(line: 407, column: 13, scope: !864)
!999 = !DILocation(line: 408, column: 23, scope: !996)
!1000 = !DILocation(line: 408, column: 17, scope: !996)
!1001 = !DILocation(line: 410, column: 16, scope: !864)
!1002 = !DILocation(line: 410, column: 9, scope: !864)
!1003 = !DILocation(line: 411, column: 1, scope: !864)
!1004 = distinct !DISubprogram(name: "sd_notifyf", scope: !2, file: !2, line: 413, type: !1005, scopeLine: 413, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!72, !72, !96, null}
!1007 = !DILocalVariable(name: "unset_environment", arg: 1, scope: !1004, file: !2, line: 413, type: !72)
!1008 = !DILocation(line: 413, column: 20, scope: !1004)
!1009 = !DILocalVariable(name: "format", arg: 2, scope: !1004, file: !2, line: 413, type: !96)
!1010 = !DILocation(line: 413, column: 51, scope: !1004)
!1011 = !DILocalVariable(name: "ap", scope: !1004, file: !2, line: 414, type: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1013, line: 52, baseType: !1014)
!1013 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1015, line: 14, baseType: !1016)
!1015 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stdarg.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1017, baseType: !1018)
!1017 = !DIFile(filename: "common/sd-daemon.c", directory: "/home/raj/lwan")
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 192, elements: !1025)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1019, file: !1017, line: 414, baseType: !31, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1019, file: !1017, line: 414, baseType: !31, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1019, file: !1017, line: 414, baseType: !877, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1019, file: !1017, line: 414, baseType: !877, size: 64, offset: 128)
!1025 = !{!1026}
!1026 = !DISubrange(count: 1)
!1027 = !DILocation(line: 414, column: 17, scope: !1004)
!1028 = !DILocalVariable(name: "p", scope: !1004, file: !2, line: 415, type: !73)
!1029 = !DILocation(line: 415, column: 15, scope: !1004)
!1030 = !DILocalVariable(name: "r", scope: !1004, file: !2, line: 416, type: !72)
!1031 = !DILocation(line: 416, column: 13, scope: !1004)
!1032 = !DILocation(line: 418, column: 9, scope: !1004)
!1033 = !DILocation(line: 419, column: 27, scope: !1004)
!1034 = !DILocation(line: 419, column: 35, scope: !1004)
!1035 = !DILocation(line: 419, column: 13, scope: !1004)
!1036 = !DILocation(line: 419, column: 11, scope: !1004)
!1037 = !DILocation(line: 420, column: 9, scope: !1004)
!1038 = !DILocation(line: 422, column: 13, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1004, file: !2, line: 422, column: 13)
!1040 = !DILocation(line: 422, column: 15, scope: !1039)
!1041 = !DILocation(line: 422, column: 19, scope: !1039)
!1042 = !DILocation(line: 422, column: 23, scope: !1039)
!1043 = !DILocation(line: 422, column: 13, scope: !1004)
!1044 = !DILocation(line: 423, column: 17, scope: !1039)
!1045 = !DILocation(line: 425, column: 23, scope: !1004)
!1046 = !DILocation(line: 425, column: 42, scope: !1004)
!1047 = !DILocation(line: 425, column: 13, scope: !1004)
!1048 = !DILocation(line: 425, column: 11, scope: !1004)
!1049 = !DILocation(line: 426, column: 14, scope: !1004)
!1050 = !DILocation(line: 426, column: 9, scope: !1004)
!1051 = !DILocation(line: 428, column: 16, scope: !1004)
!1052 = !DILocation(line: 428, column: 9, scope: !1004)
!1053 = !DILocation(line: 429, column: 1, scope: !1004)
!1054 = distinct !DISubprogram(name: "sd_booted", scope: !2, file: !2, line: 431, type: !1055, scopeLine: 431, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!72}
!1057 = !DILocalVariable(name: "st", scope: !1054, file: !2, line: 432, type: !257)
!1058 = !DILocation(line: 432, column: 21, scope: !1054)
!1059 = !DILocation(line: 438, column: 13, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1054, file: !2, line: 438, column: 13)
!1061 = !DILocation(line: 438, column: 48, scope: !1060)
!1062 = !DILocation(line: 438, column: 13, scope: !1054)
!1063 = !DILocation(line: 439, column: 17, scope: !1060)
!1064 = !DILocation(line: 441, column: 18, scope: !1054)
!1065 = !DILocation(line: 441, column: 17, scope: !1054)
!1066 = !DILocation(line: 441, column: 16, scope: !1054)
!1067 = !DILocation(line: 441, column: 9, scope: !1054)
!1068 = !DILocation(line: 442, column: 1, scope: !1054)
!1069 = distinct !DISubprogram(name: "sd_watchdog_enabled", scope: !2, file: !2, line: 444, type: !1070, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !88)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!72, !72, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !475, line: 27, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !71, line: 45, baseType: !102)
!1075 = !DILocalVariable(name: "unset_environment", arg: 1, scope: !1069, file: !2, line: 444, type: !72)
!1076 = !DILocation(line: 444, column: 29, scope: !1069)
!1077 = !DILocalVariable(name: "usec", arg: 2, scope: !1069, file: !2, line: 444, type: !1072)
!1078 = !DILocation(line: 444, column: 58, scope: !1069)
!1079 = !DILocalVariable(name: "ll", scope: !1069, file: !2, line: 445, type: !1080)
!1080 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1081 = !DILocation(line: 445, column: 28, scope: !1069)
!1082 = !DILocalVariable(name: "l", scope: !1069, file: !2, line: 446, type: !102)
!1083 = !DILocation(line: 446, column: 23, scope: !1069)
