; ModuleID = '/home/raj/lwan/common/lwan-thread.c'
source_filename = "/home/raj/lwan/common/lwan-thread.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.epoll_event = type <{ i32, %union.epoll_data }>
%union.epoll_data = type { ptr }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct.lwan_thread_t_ = type { ptr, %struct.anon.0, i32, [2 x i32], i64 }
%struct.anon.0 = type { [30 x i8], [30 x i8], i64 }
%struct.lwan_t_ = type { %struct.lwan_trie_t_, ptr, %struct.anon, ptr, %struct.lwan_config_t_, i32 }
%struct.lwan_trie_t_ = type { ptr, ptr }
%struct.anon = type { ptr, i32, i16 }
%struct.lwan_config_t_ = type { ptr, i16, i8, i8, i32, i16 }
%struct.lwan_connection_t_ = type { i32, i32, ptr, ptr, i32, i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }
%struct.coro_switcher_t_ = type { [10 x i64], [10 x i64] }
%struct.death_queue_t = type { ptr, %struct.lwan_connection_t_, i32, i16 }
%struct.lwan_value_t_ = type { ptr, i64 }
%struct.lwan_request_t_ = type { i32, i32, %struct.lwan_value_t_, %struct.lwan_value_t_, ptr, %struct.anon.2, %struct.anon.2, %struct.anon.3, %struct.lwan_response_t_ }
%struct.anon.2 = type { ptr, i64 }
%struct.anon.3 = type { i64, %struct.anon.4 }
%struct.anon.4 = type { i64, i64 }
%struct.lwan_response_t_ = type { ptr, ptr, i64, ptr, %struct.anon.5 }
%struct.anon.5 = type { ptr, ptr, ptr }


!175 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!176 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!177 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!178 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!179 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!180 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!181 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!182 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!183 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!184 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!185 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!186 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!187 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!188 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !118, line: 167, baseType: !119, size: 32, elements: !190)
!190 = !{!191, !192, !193}
!191 = !DIEnumerator(name: "CONN_CORO_ABORT", value: -1)
!192 = !DIEnumerator(name: "CONN_CORO_MAY_RESUME", value: 0)
!193 = !DIEnumerator(name: "CONN_CORO_FINISHED", value: 1)
!194 = !{!195, !119, !198, !199, !201, !202, !129}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !196, line: 46, baseType: !197)
!196 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!197 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !196, line: 35, baseType: !200)
!200 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !203, line: 10, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !205, line: 160, baseType: !200)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!206 = !{!0, !7, !13, !18, !23, !25, !30, !35, !40, !43, !48, !50, !55, !60, !65, !70, !72, !77, !82, !87, !92, !94, !97, !102, !107, !110, !112, !207, !209, !214, !219, !224}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !74, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 280, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 35)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 177, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 11)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 177, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 616, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 77)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !109, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 64, elements: !231)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !229, line: 26, baseType: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !205, line: 42, baseType: !129)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !{i32 7, !"Dwarf Version", i32 5}
!234 = !{i32 2, !"Debug Info Version", i32 3}
!235 = !{i32 1, !"wchar_size", i32 4}
!236 = !{i32 8, !"PIC Level", i32 2}
!237 = !{i32 7, !"PIE Level", i32 2}
!238 = !{i32 7, !"uwtable", i32 2}
!239 = !{i32 7, !"frame-pointer", i32 2}
!240 = !{!"clang version 16.0.0"}
!241 = distinct !DISubprogram(name: "lwan_format_rfc_time", scope: !2, file: !2, line: 236, type: !242, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !114, retainedNodes: !245)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !202, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!245 = !{}
!246 = !DILocalVariable(name: "t", arg: 1, scope: !241, file: !2, line: 236, type: !202)
!247 = !DILocation(line: 236, column: 29, scope: !241)
!248 = !DILocalVariable(name: "buffer", arg: 2, scope: !241, file: !2, line: 236, type: !244)
!249 = !DILocation(line: 236, column: 37, scope: !241)
!250 = !DILocalVariable(name: "tm", scope: !241, file: !2, line: 238, type: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !252, line: 7, size: 448, elements: !253)
!252 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !251, file: !252, line: 9, baseType: !119, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !251, file: !252, line: 10, baseType: !119, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !251, file: !252, line: 11, baseType: !119, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !251, file: !252, line: 12, baseType: !119, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !251, file: !252, line: 13, baseType: !119, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !251, file: !252, line: 14, baseType: !119, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !251, file: !252, line: 15, baseType: !119, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !251, file: !252, line: 16, baseType: !119, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !251, file: !252, line: 17, baseType: !119, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !251, file: !252, line: 20, baseType: !200, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !251, file: !252, line: 21, baseType: !265, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!266 = !DILocation(line: 238, column: 15, scope: !241)
!267 = !DILocation(line: 240, column: 9, scope: !268)
!268 = distinct !DILexicalBlock(scope: !241, file: !2, line: 240, column: 9)
!269 = !DILocation(line: 240, column: 9, scope: !241)
!270 = !DILocation(line: 241, column: 9, scope: !271)
!271 = distinct !DILexicalBlock(scope: !268, file: !2, line: 240, column: 39)
!272 = !DILocation(line: 242, column: 9, scope: !271)
!273 = !DILocation(line: 245, column: 9, scope: !274)
!274 = distinct !DILexicalBlock(scope: !241, file: !2, line: 245, column: 9)
!275 = !DILocation(line: 245, column: 9, scope: !241)
!276 = !DILocation(line: 246, column: 9, scope: !274)
!277 = !DILocation(line: 247, column: 1, scope: !241)
!278 = distinct !DISubprogram(name: "lwan_thread_add_client", scope: !2, file: !2, line: 402, type: !279, scopeLine: 403, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !114, retainedNodes: !245)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !281, !119}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !118, line: 108, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !118, line: 253, size: 832, elements: !284)
!284 = !{!285, !355, !364, !365, !367}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !283, file: !118, line: 254, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !118, line: 103, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !118, line: 275, size: 640, elements: !289)
!289 = !{!290, !317, !333, !339, !343, !354}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !288, file: !118, line: 276, baseType: !291, size: 128)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !292, line: 25, baseType: !293)
!292 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !292, line: 41, size: 128, elements: !294)
!294 = !{!295, !313}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !293, file: !292, line: 42, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !292, line: 26, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !292, line: 29, size: 640, elements: !299)
!299 = !{!300, !304, !312}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !292, line: 30, baseType: !301, size: 512)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 512, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 8)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !298, file: !292, line: 31, baseType: !305, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !292, line: 27, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !292, line: 35, size: 192, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !307, file: !292, line: 36, baseType: !244, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !307, file: !292, line: 37, baseType: !201, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !292, line: 38, baseType: !305, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !298, file: !292, line: 32, baseType: !119, size: 32, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !293, file: !292, line: 43, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !201}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !288, file: !118, line: 277, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !118, line: 112, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !118, line: 196, size: 256, elements: !321)
!321 = !{!322, !324, !325, !330, !331, !332}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !320, file: !118, line: 199, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !118, line: 165, baseType: !117)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !320, file: !118, line: 200, baseType: !129, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !320, file: !118, line: 201, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !328, line: 34, baseType: !329)
!328 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !328, line: 34, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !320, file: !118, line: 202, baseType: !281, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !320, file: !118, line: 203, baseType: !119, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !118, line: 203, baseType: !119, size: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !288, file: !118, line: 283, baseType: !334, size: 128, offset: 192)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !118, line: 279, size: 128, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !334, file: !118, line: 280, baseType: !281, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !334, file: !118, line: 281, baseType: !129, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !334, file: !118, line: 282, baseType: !198, size: 16, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !288, file: !118, line: 285, baseType: !340, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !342, line: 6, flags: DIFlagFwdDecl)
!342 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !288, file: !118, line: 286, baseType: !344, size: 192, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !118, line: 111, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !118, line: 266, size: 192, elements: !346)
!346 = !{!347, !348, !349, !351, !352, !353}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !345, file: !118, line: 267, baseType: !244, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !345, file: !118, line: 268, baseType: !198, size: 16, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !345, file: !118, line: 269, baseType: !350, size: 8, offset: 80)
!350 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !345, file: !118, line: 270, baseType: !350, size: 8, offset: 88)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !345, file: !118, line: 271, baseType: !129, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !345, file: !118, line: 272, baseType: !198, size: 16, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !288, file: !118, line: 287, baseType: !119, size: 32, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !283, file: !118, line: 259, baseType: !356, size: 576, offset: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !283, file: !118, line: 255, size: 576, elements: !357)
!357 = !{!358, !362, !363}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !356, file: !118, line: 256, baseType: !359, size: 240)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 30)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !356, file: !118, line: 257, baseType: !359, size: 240, offset: 240)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !356, file: !118, line: 258, baseType: !202, size: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !283, file: !118, line: 261, baseType: !119, size: 32, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !283, file: !118, line: 262, baseType: !366, size: 64, offset: 672)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !231)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !283, file: !118, line: 263, baseType: !368, size: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !369, line: 27, baseType: !197)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!370 = !DILocalVariable(name: "t", arg: 1, scope: !278, file: !2, line: 402, type: !281)
!371 = !DILocation(line: 402, column: 39, scope: !278)
!372 = !DILocalVariable(name: "fd", arg: 2, scope: !278, file: !2, line: 402, type: !119)
!373 = !DILocation(line: 402, column: 46, scope: !278)
!374 = !DILocation(line: 404, column: 5, scope: !278)
!375 = !DILocation(line: 404, column: 8, scope: !278)
!376 = !DILocation(line: 404, column: 14, scope: !278)
!377 = !DILocation(line: 404, column: 20, scope: !278)
!378 = !DILocation(line: 404, column: 24, scope: !278)
!379 = !DILocation(line: 404, column: 30, scope: !278)
!380 = !DILocation(line: 405, column: 33, scope: !278)
!381 = !DILocation(line: 405, column: 5, scope: !278)
!382 = !DILocation(line: 405, column: 8, scope: !278)
!383 = !DILocation(line: 405, column: 14, scope: !278)
!384 = !DILocation(line: 405, column: 20, scope: !278)
!385 = !DILocation(line: 405, column: 24, scope: !278)
!386 = !DILocation(line: 405, column: 31, scope: !278)
!387 = !DILocation(line: 407, column: 9, scope: !388)
!388 = distinct !DILexicalBlock(scope: !278, file: !2, line: 407, column: 9)
!389 = !DILocation(line: 407, column: 9, scope: !278)
!390 = !DILocation(line: 408, column: 9, scope: !388)
!391 = !DILocation(line: 409, column: 1, scope: !278)
!392 = distinct !DISubprogram(name: "lwan_thread_init", scope: !2, file: !2, line: 412, type: !393, scopeLine: 413, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !114, retainedNodes: !245)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !286}
!395 = !DILocalVariable(name: "l", arg: 1, scope: !392, file: !2, line: 412, type: !286)
!396 = !DILocation(line: 412, column: 26, scope: !392)
!397 = !DILocation(line: 414, column: 5, scope: !392)
!398 = !DILocation(line: 416, column: 40, scope: !392)
!399 = !DILocation(line: 416, column: 43, scope: !392)
!400 = !DILocation(line: 416, column: 50, scope: !392)
!401 = !DILocation(line: 416, column: 32, scope: !392)
!402 = !DILocation(line: 416, column: 25, scope: !392)
!403 = !DILocation(line: 416, column: 5, scope: !392)
!404 = !DILocation(line: 416, column: 8, scope: !392)
!405 = !DILocation(line: 416, column: 15, scope: !392)
!406 = !DILocation(line: 416, column: 23, scope: !392)
!407 = !DILocation(line: 417, column: 10, scope: !408)
!408 = distinct !DILexicalBlock(scope: !392, file: !2, line: 417, column: 9)
!409 = !DILocation(line: 417, column: 13, scope: !408)
!410 = !DILocation(line: 417, column: 20, scope: !408)
!411 = !DILocation(line: 417, column: 9, scope: !392)
!412 = !DILocation(line: 418, column: 9, scope: !408)
!413 = !DILocalVariable(name: "i", scope: !414, file: !2, line: 420, type: !415)
!414 = distinct !DILexicalBlock(scope: !392, file: !2, line: 420, column: 5)
!415 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!416 = !DILocation(line: 420, column: 16, scope: !414)
!417 = !DILocation(line: 420, column: 10, scope: !414)
!418 = !DILocation(line: 420, column: 23, scope: !419)
!419 = distinct !DILexicalBlock(scope: !414, file: !2, line: 420, column: 5)
!420 = !DILocation(line: 420, column: 27, scope: !419)
!421 = !DILocation(line: 420, column: 30, scope: !419)
!422 = !DILocation(line: 420, column: 37, scope: !419)
!423 = !DILocation(line: 420, column: 25, scope: !419)
!424 = !DILocation(line: 420, column: 5, scope: !414)
!425 = !DILocation(line: 421, column: 23, scope: !419)
!426 = !DILocation(line: 421, column: 27, scope: !419)
!427 = !DILocation(line: 421, column: 30, scope: !419)
!428 = !DILocation(line: 421, column: 37, scope: !419)
!429 = !DILocation(line: 421, column: 45, scope: !419)
!430 = !DILocation(line: 421, column: 9, scope: !419)
!431 = !DILocation(line: 420, column: 45, scope: !419)
!432 = !DILocation(line: 420, column: 5, scope: !419)
!433 = distinct !{!433, !424, !434, !435}
!434 = !DILocation(line: 421, column: 47, scope: !414)
!435 = !{!"llvm.loop.mustprogress"}
!436 = !DILocation(line: 422, column: 1, scope: !392)
!437 = distinct !DISubprogram(name: "create_thread", scope: !2, file: !2, line: 368, type: !438, scopeLine: 369, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !286, !281}
!440 = !DILocalVariable(name: "l", arg: 1, scope: !437, file: !2, line: 368, type: !286)
!441 = !DILocation(line: 368, column: 23, scope: !437)
!442 = !DILocalVariable(name: "thread", arg: 2, scope: !437, file: !2, line: 368, type: !281)
!443 = !DILocation(line: 368, column: 41, scope: !437)
!444 = !DILocalVariable(name: "attr", scope: !437, file: !2, line: 370, type: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !369, line: 62, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !369, line: 56, size: 448, elements: !447)
!447 = !{!448, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !446, file: !369, line: 58, baseType: !449, size: 448)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 56)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !446, file: !369, line: 59, baseType: !200, size: 64)
!453 = !DILocation(line: 370, column: 20, scope: !437)
!454 = !DILocation(line: 372, column: 12, scope: !437)
!455 = !DILocation(line: 372, column: 5, scope: !437)
!456 = !DILocation(line: 373, column: 20, scope: !437)
!457 = !DILocation(line: 373, column: 5, scope: !437)
!458 = !DILocation(line: 373, column: 13, scope: !437)
!459 = !DILocation(line: 373, column: 18, scope: !437)
!460 = !DILocation(line: 375, column: 29, scope: !461)
!461 = distinct !DILexicalBlock(scope: !437, file: !2, line: 375, column: 9)
!462 = !DILocation(line: 375, column: 10, scope: !461)
!463 = !DILocation(line: 375, column: 18, scope: !461)
!464 = !DILocation(line: 375, column: 27, scope: !461)
!465 = !DILocation(line: 375, column: 59, scope: !461)
!466 = !DILocation(line: 375, column: 9, scope: !437)
!467 = !DILocation(line: 376, column: 9, scope: !461)
!468 = !DILocation(line: 378, column: 9, scope: !469)
!469 = distinct !DILexicalBlock(scope: !437, file: !2, line: 378, column: 9)
!470 = !DILocation(line: 378, column: 9, scope: !437)
!471 = !DILocation(line: 379, column: 9, scope: !469)
!472 = !DILocation(line: 381, column: 9, scope: !473)
!473 = distinct !DILexicalBlock(scope: !437, file: !2, line: 381, column: 9)
!474 = !DILocation(line: 381, column: 9, scope: !437)
!475 = !DILocation(line: 382, column: 9, scope: !473)
!476 = !DILocation(line: 384, column: 9, scope: !477)
!477 = distinct !DILexicalBlock(scope: !437, file: !2, line: 384, column: 9)
!478 = !DILocation(line: 384, column: 9, scope: !437)
!479 = !DILocation(line: 385, column: 9, scope: !477)
!480 = !DILocation(line: 387, column: 15, scope: !481)
!481 = distinct !DILexicalBlock(scope: !437, file: !2, line: 387, column: 9)
!482 = !DILocation(line: 387, column: 23, scope: !481)
!483 = !DILocation(line: 387, column: 9, scope: !481)
!484 = !DILocation(line: 387, column: 56, scope: !481)
!485 = !DILocation(line: 387, column: 9, scope: !437)
!486 = !DILocation(line: 388, column: 9, scope: !481)
!487 = !DILocalVariable(name: "event", scope: !437, file: !2, line: 390, type: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !142, line: 84, size: 96, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !488, file: !142, line: 86, baseType: !228, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !142, line: 87, baseType: !492, size: 64, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "epoll_data_t", file: !142, line: 82, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "epoll_data", file: !142, line: 76, size: 64, elements: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !493, file: !142, line: 78, baseType: !201, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !493, file: !142, line: 79, baseType: !119, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !493, file: !142, line: 80, baseType: !228, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !493, file: !142, line: 81, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !229, line: 27, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !205, line: 45, baseType: !197)
!501 = !DILocation(line: 390, column: 24, scope: !437)
!502 = !DILocation(line: 391, column: 19, scope: !503)
!503 = distinct !DILexicalBlock(scope: !437, file: !2, line: 391, column: 9)
!504 = !DILocation(line: 391, column: 27, scope: !503)
!505 = !DILocation(line: 391, column: 52, scope: !503)
!506 = !DILocation(line: 391, column: 60, scope: !503)
!507 = !DILocation(line: 391, column: 9, scope: !503)
!508 = !DILocation(line: 391, column: 80, scope: !503)
!509 = !DILocation(line: 391, column: 9, scope: !437)
!510 = !DILocation(line: 392, column: 9, scope: !503)
!511 = !DILocation(line: 394, column: 25, scope: !512)
!512 = distinct !DILexicalBlock(scope: !437, file: !2, line: 394, column: 9)
!513 = !DILocation(line: 394, column: 33, scope: !512)
!514 = !DILocation(line: 394, column: 62, scope: !512)
!515 = !DILocation(line: 394, column: 9, scope: !512)
!516 = !DILocation(line: 394, column: 9, scope: !437)
!517 = !DILocation(line: 395, column: 9, scope: !512)
!518 = !DILocation(line: 397, column: 9, scope: !519)
!519 = distinct !DILexicalBlock(scope: !437, file: !2, line: 397, column: 9)
!520 = !DILocation(line: 397, column: 9, scope: !437)
!521 = !DILocation(line: 398, column: 9, scope: !519)
!522 = !DILocation(line: 399, column: 1, scope: !437)
!523 = distinct !DISubprogram(name: "lwan_thread_shutdown", scope: !2, file: !2, line: 425, type: !393, scopeLine: 426, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !114, retainedNodes: !245)
!524 = !DILocalVariable(name: "l", arg: 1, scope: !523, file: !2, line: 425, type: !286)
!525 = !DILocation(line: 425, column: 30, scope: !523)
!526 = !DILocation(line: 427, column: 5, scope: !523)
!527 = !DILocalVariable(name: "i", scope: !528, file: !2, line: 429, type: !119)
!528 = distinct !DILexicalBlock(scope: !523, file: !2, line: 429, column: 5)
!529 = !DILocation(line: 429, column: 14, scope: !528)
!530 = !DILocation(line: 429, column: 18, scope: !528)
!531 = !DILocation(line: 429, column: 21, scope: !528)
!532 = !DILocation(line: 429, column: 28, scope: !528)
!533 = !DILocation(line: 429, column: 34, scope: !528)
!534 = !DILocation(line: 429, column: 10, scope: !528)
!535 = !DILocation(line: 429, column: 39, scope: !536)
!536 = distinct !DILexicalBlock(scope: !528, file: !2, line: 429, column: 5)
!537 = !DILocation(line: 429, column: 41, scope: !536)
!538 = !DILocation(line: 429, column: 5, scope: !528)
!539 = !DILocalVariable(name: "t", scope: !540, file: !2, line: 430, type: !281)
!540 = distinct !DILexicalBlock(scope: !536, file: !2, line: 429, column: 52)
!541 = !DILocation(line: 430, column: 24, scope: !540)
!542 = !DILocation(line: 430, column: 29, scope: !540)
!543 = !DILocation(line: 430, column: 32, scope: !540)
!544 = !DILocation(line: 430, column: 39, scope: !540)
!545 = !DILocation(line: 430, column: 47, scope: !540)
!546 = !DILocation(line: 433, column: 15, scope: !540)
!547 = !DILocation(line: 433, column: 18, scope: !540)
!548 = !DILocation(line: 433, column: 9, scope: !540)
!549 = !DILocation(line: 435, column: 15, scope: !540)
!550 = !DILocation(line: 435, column: 18, scope: !540)
!551 = !DILocation(line: 435, column: 9, scope: !540)
!552 = !DILocation(line: 436, column: 15, scope: !540)
!553 = !DILocation(line: 436, column: 18, scope: !540)
!554 = !DILocation(line: 436, column: 9, scope: !540)
!555 = !DILocation(line: 438, column: 28, scope: !540)
!556 = !DILocation(line: 438, column: 31, scope: !540)
!557 = !DILocation(line: 438, column: 38, scope: !540)
!558 = !DILocation(line: 438, column: 46, scope: !540)
!559 = !DILocation(line: 438, column: 49, scope: !540)
!560 = !DILocation(line: 438, column: 9, scope: !540)
!561 = !DILocation(line: 439, column: 5, scope: !540)
!562 = !DILocation(line: 429, column: 48, scope: !536)
!563 = !DILocation(line: 429, column: 5, scope: !536)
!564 = distinct !{!564, !538, !565, !435}
!565 = !DILocation(line: 439, column: 5, scope: !528)
!566 = !DILocation(line: 441, column: 10, scope: !523)
!567 = !DILocation(line: 441, column: 13, scope: !523)
!568 = !DILocation(line: 441, column: 20, scope: !523)
!569 = !DILocation(line: 441, column: 5, scope: !523)
!570 = !DILocation(line: 442, column: 1, scope: !523)
!571 = distinct !DISubprogram(name: "thread_io_loop", scope: !2, file: !2, line: 300, type: !572, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!572 = !DISubroutineType(types: !573)
!573 = !{!201, !201}
!574 = !DILocalVariable(name: "data", arg: 1, scope: !571, file: !2, line: 300, type: !201)
!575 = !DILocation(line: 300, column: 22, scope: !571)
!576 = !DILocalVariable(name: "t", scope: !571, file: !2, line: 302, type: !281)
!577 = !DILocation(line: 302, column: 20, scope: !571)
!578 = !DILocation(line: 302, column: 24, scope: !571)
!579 = !DILocalVariable(name: "epoll_fd", scope: !571, file: !2, line: 303, type: !580)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!581 = !DILocation(line: 303, column: 15, scope: !571)
!582 = !DILocation(line: 303, column: 26, scope: !571)
!583 = !DILocation(line: 303, column: 29, scope: !571)
!584 = !DILocalVariable(name: "read_pipe_fd", scope: !571, file: !2, line: 304, type: !580)
!585 = !DILocation(line: 304, column: 15, scope: !571)
!586 = !DILocation(line: 304, column: 30, scope: !571)
!587 = !DILocation(line: 304, column: 33, scope: !571)
!588 = !DILocalVariable(name: "max_events", scope: !571, file: !2, line: 305, type: !580)
!589 = !DILocation(line: 305, column: 15, scope: !571)
!590 = !DILocation(line: 305, column: 37, scope: !571)
!591 = !DILocation(line: 305, column: 40, scope: !571)
!592 = !DILocation(line: 305, column: 46, scope: !571)
!593 = !DILocation(line: 305, column: 53, scope: !571)
!594 = !DILocalVariable(name: "a", arg: 1, scope: !595, file: !2, line: 128, type: !580)
!595 = distinct !DISubprogram(name: "min", scope: !2, file: !2, line: 128, type: !596, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!596 = !DISubroutineType(types: !597)
!597 = !{!119, !580, !580}
!598 = !DILocation(line: 128, column: 15, scope: !595, inlinedAt: !599)
!599 = distinct !DILocation(line: 305, column: 28, scope: !571)
!600 = !DILocalVariable(name: "b", arg: 2, scope: !595, file: !2, line: 128, type: !580)
!601 = !DILocation(line: 128, column: 28, scope: !595, inlinedAt: !599)
!602 = !DILocation(line: 130, column: 12, scope: !595, inlinedAt: !599)
!603 = !DILocation(line: 130, column: 16, scope: !595, inlinedAt: !599)
!604 = !DILocation(line: 130, column: 14, scope: !595, inlinedAt: !599)
!605 = !DILocation(line: 130, column: 20, scope: !595, inlinedAt: !599)
!606 = !DILocation(line: 130, column: 24, scope: !595, inlinedAt: !599)
!607 = !DILocalVariable(name: "conns", scope: !571, file: !2, line: 306, type: !318)
!608 = !DILocation(line: 306, column: 24, scope: !571)
!609 = !DILocation(line: 306, column: 32, scope: !571)
!610 = !DILocation(line: 306, column: 35, scope: !571)
!611 = !DILocation(line: 306, column: 41, scope: !571)
!612 = !DILocalVariable(name: "events", scope: !571, file: !2, line: 307, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!614 = !DILocation(line: 307, column: 25, scope: !571)
!615 = !DILocalVariable(name: "switcher", scope: !571, file: !2, line: 308, type: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_switcher_t", file: !328, line: 35, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "coro_switcher_t_", file: !328, line: 39, size: 1280, elements: !618)
!618 = !{!619, !624}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "caller", scope: !617, file: !328, line: 40, baseType: !620, size: 640)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_context_t", file: !328, line: 25, baseType: !621)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 640, elements: !85)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !623, line: 90, baseType: !197)
!623 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!624 = !DIDerivedType(tag: DW_TAG_member, name: "callee", scope: !617, file: !328, line: 41, baseType: !620, size: 640, offset: 640)
!625 = !DILocation(line: 308, column: 21, scope: !571)
!626 = !DILocalVariable(name: "dq", scope: !571, file: !2, line: 309, type: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "death_queue_t", file: !2, line: 32, size: 384, elements: !628)
!628 = !{!629, !630, !631, !632}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !627, file: !2, line: 33, baseType: !318, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !627, file: !2, line: 34, baseType: !319, size: 256, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !627, file: !2, line: 35, baseType: !129, size: 32, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !627, file: !2, line: 36, baseType: !198, size: 16, offset: 352)
!633 = !DILocation(line: 309, column: 26, scope: !571)
!634 = !DILocalVariable(name: "n_fds", scope: !571, file: !2, line: 310, type: !119)
!635 = !DILocation(line: 310, column: 9, scope: !571)
!636 = !DILocation(line: 312, column: 5, scope: !571)
!637 = !DILocation(line: 315, column: 29, scope: !571)
!638 = !DILocation(line: 315, column: 21, scope: !571)
!639 = !DILocation(line: 315, column: 14, scope: !571)
!640 = !DILocation(line: 315, column: 12, scope: !571)
!641 = !DILocation(line: 316, column: 9, scope: !642)
!642 = distinct !DILexicalBlock(scope: !571, file: !2, line: 316, column: 9)
!643 = !DILocation(line: 316, column: 9, scope: !571)
!644 = !DILocation(line: 317, column: 9, scope: !642)
!645 = !DILocation(line: 319, column: 27, scope: !571)
!646 = !DILocation(line: 319, column: 34, scope: !571)
!647 = !DILocation(line: 319, column: 37, scope: !571)
!648 = !DILocation(line: 319, column: 43, scope: !571)
!649 = !DILocation(line: 319, column: 50, scope: !571)
!650 = !DILocation(line: 319, column: 5, scope: !571)
!651 = !DILocation(line: 321, column: 5, scope: !571)
!652 = !DILocation(line: 322, column: 36, scope: !653)
!653 = distinct !DILexicalBlock(scope: !654, file: !2, line: 321, column: 14)
!654 = distinct !DILexicalBlock(scope: !655, file: !2, line: 321, column: 5)
!655 = distinct !DILexicalBlock(scope: !571, file: !2, line: 321, column: 5)
!656 = !DILocation(line: 322, column: 46, scope: !653)
!657 = !DILocation(line: 322, column: 54, scope: !653)
!658 = !DILocalVariable(name: "dq", arg: 1, scope: !659, file: !2, line: 108, type: !662)
!659 = distinct !DISubprogram(name: "death_queue_epoll_timeout", scope: !2, file: !2, line: 108, type: !660, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!660 = !DISubroutineType(types: !661)
!661 = !{!119, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!663 = !DILocation(line: 108, column: 49, scope: !659, inlinedAt: !664)
!664 = distinct !DILocation(line: 323, column: 36, scope: !653)
!665 = !DILocation(line: 110, column: 30, scope: !659, inlinedAt: !664)
!666 = !DILocation(line: 110, column: 12, scope: !659, inlinedAt: !664)
!667 = !DILocation(line: 322, column: 25, scope: !653)
!668 = !DILocation(line: 322, column: 23, scope: !653)
!669 = !DILocation(line: 322, column: 9, scope: !653)
!670 = !DILocation(line: 325, column: 21, scope: !671)
!671 = distinct !DILexicalBlock(scope: !653, file: !2, line: 323, column: 69)
!672 = !DILocation(line: 325, column: 13, scope: !671)
!673 = !DILocation(line: 328, column: 17, scope: !674)
!674 = distinct !DILexicalBlock(scope: !671, file: !2, line: 325, column: 28)
!675 = !DILocation(line: 330, column: 13, scope: !671)
!676 = distinct !{!676, !677, !678}
!677 = !DILocation(line: 321, column: 5, scope: !655)
!678 = !DILocation(line: 359, column: 5, scope: !655)
!679 = !DILocation(line: 332, column: 13, scope: !671)
!680 = !DILocation(line: 333, column: 13, scope: !671)
!681 = !DILocation(line: 335, column: 31, scope: !671)
!682 = !DILocation(line: 335, column: 13, scope: !671)
!683 = !DILocalVariable(name: "ep_event", scope: !684, file: !2, line: 337, type: !613)
!684 = distinct !DILexicalBlock(scope: !671, file: !2, line: 337, column: 13)
!685 = !DILocation(line: 337, column: 38, scope: !684)
!686 = !DILocation(line: 337, column: 49, scope: !684)
!687 = !DILocation(line: 337, column: 18, scope: !684)
!688 = !DILocation(line: 337, column: 62, scope: !689)
!689 = distinct !DILexicalBlock(scope: !684, file: !2, line: 337, column: 13)
!690 = !DILocation(line: 337, column: 13, scope: !684)
!691 = !DILocalVariable(name: "conn", scope: !692, file: !2, line: 338, type: !318)
!692 = distinct !DILexicalBlock(scope: !689, file: !2, line: 337, column: 78)
!693 = !DILocation(line: 338, column: 36, scope: !692)
!694 = !DILocation(line: 340, column: 22, scope: !695)
!695 = distinct !DILexicalBlock(scope: !692, file: !2, line: 340, column: 21)
!696 = !DILocation(line: 340, column: 32, scope: !695)
!697 = !DILocation(line: 340, column: 37, scope: !695)
!698 = !DILocation(line: 340, column: 21, scope: !692)
!699 = !DILocation(line: 341, column: 50, scope: !700)
!700 = distinct !DILexicalBlock(scope: !695, file: !2, line: 340, column: 42)
!701 = !DILocation(line: 341, column: 60, scope: !700)
!702 = !DILocation(line: 341, column: 74, scope: !700)
!703 = !DILocation(line: 341, column: 28, scope: !700)
!704 = !DILocation(line: 341, column: 26, scope: !700)
!705 = !DILocation(line: 342, column: 25, scope: !706)
!706 = distinct !DILexicalBlock(scope: !700, file: !2, line: 342, column: 25)
!707 = !DILocation(line: 342, column: 25, scope: !700)
!708 = !DILocation(line: 343, column: 25, scope: !706)
!709 = !DILocation(line: 344, column: 51, scope: !700)
!710 = !DILocalVariable(name: "conn", arg: 1, scope: !711, file: !2, line: 262, type: !318)
!711 = distinct !DISubprogram(name: "spawn_or_reset_coro_if_needed", scope: !2, file: !2, line: 262, type: !712, scopeLine: 264, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !318, !714, !662}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!715 = !DILocation(line: 262, column: 50, scope: !711, inlinedAt: !716)
!716 = distinct !DILocation(line: 344, column: 21, scope: !700)
!717 = !DILocalVariable(name: "switcher", arg: 2, scope: !711, file: !2, line: 263, type: !714)
!718 = !DILocation(line: 263, column: 30, scope: !711, inlinedAt: !716)
!719 = !DILocalVariable(name: "dq", arg: 3, scope: !711, file: !2, line: 263, type: !662)
!720 = !DILocation(line: 263, column: 62, scope: !711, inlinedAt: !716)
!721 = !DILocation(line: 265, column: 9, scope: !722, inlinedAt: !716)
!722 = distinct !DILexicalBlock(scope: !711, file: !2, line: 265, column: 9)
!723 = !DILocation(line: 265, column: 15, scope: !722, inlinedAt: !716)
!724 = !DILocation(line: 265, column: 9, scope: !711, inlinedAt: !716)
!725 = !DILocation(line: 266, column: 13, scope: !726, inlinedAt: !716)
!726 = distinct !DILexicalBlock(scope: !727, file: !2, line: 266, column: 13)
!727 = distinct !DILexicalBlock(scope: !722, file: !2, line: 265, column: 21)
!728 = !DILocation(line: 266, column: 19, scope: !726, inlinedAt: !716)
!729 = !DILocation(line: 266, column: 25, scope: !726, inlinedAt: !716)
!730 = !DILocation(line: 266, column: 13, scope: !727, inlinedAt: !716)
!731 = !DILocation(line: 267, column: 13, scope: !726, inlinedAt: !716)
!732 = !DILocation(line: 269, column: 20, scope: !727, inlinedAt: !716)
!733 = !DILocation(line: 269, column: 26, scope: !727, inlinedAt: !716)
!734 = !DILocation(line: 269, column: 54, scope: !727, inlinedAt: !716)
!735 = !DILocation(line: 269, column: 9, scope: !727, inlinedAt: !716)
!736 = !DILocation(line: 270, column: 5, scope: !727, inlinedAt: !716)
!737 = !DILocation(line: 271, column: 31, scope: !738, inlinedAt: !716)
!738 = distinct !DILexicalBlock(scope: !722, file: !2, line: 270, column: 12)
!739 = !DILocation(line: 271, column: 63, scope: !738, inlinedAt: !716)
!740 = !DILocation(line: 271, column: 22, scope: !738, inlinedAt: !716)
!741 = !DILocation(line: 271, column: 9, scope: !738, inlinedAt: !716)
!742 = !DILocation(line: 271, column: 15, scope: !738, inlinedAt: !716)
!743 = !DILocation(line: 271, column: 20, scope: !738, inlinedAt: !716)
!744 = !DILocation(line: 273, column: 28, scope: !738, inlinedAt: !716)
!745 = !DILocation(line: 273, column: 32, scope: !738, inlinedAt: !716)
!746 = !DILocation(line: 273, column: 9, scope: !738, inlinedAt: !716)
!747 = !DILocation(line: 274, column: 9, scope: !738, inlinedAt: !716)
!748 = !DILocation(line: 274, column: 21, scope: !738, inlinedAt: !716)
!749 = !DILocation(line: 276, column: 5, scope: !711, inlinedAt: !716)
!750 = !DILocation(line: 276, column: 17, scope: !711, inlinedAt: !716)
!751 = !DILocation(line: 277, column: 5, scope: !711, inlinedAt: !716)
!752 = !DILocation(line: 277, column: 17, scope: !711, inlinedAt: !716)
!753 = !DILocation(line: 278, column: 1, scope: !711, inlinedAt: !716)
!754 = !DILocation(line: 345, column: 17, scope: !700)
!755 = !DILocation(line: 346, column: 28, scope: !756)
!756 = distinct !DILexicalBlock(scope: !695, file: !2, line: 345, column: 24)
!757 = !DILocation(line: 346, column: 38, scope: !756)
!758 = !DILocation(line: 346, column: 43, scope: !756)
!759 = !DILocation(line: 346, column: 26, scope: !756)
!760 = !DILocation(line: 347, column: 25, scope: !761)
!761 = distinct !DILexicalBlock(scope: !756, file: !2, line: 347, column: 25)
!762 = !DILocation(line: 347, column: 25, scope: !756)
!763 = !DILocation(line: 348, column: 43, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !2, line: 347, column: 79)
!765 = !DILocalVariable(name: "dq", arg: 1, scope: !766, file: !2, line: 114, type: !662)
!766 = distinct !DISubprogram(name: "destroy_coro", scope: !2, file: !2, line: 114, type: !767, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !662, !318}
!769 = !DILocation(line: 114, column: 36, scope: !766, inlinedAt: !770)
!770 = distinct !DILocation(line: 348, column: 25, scope: !764)
!771 = !DILocalVariable(name: "conn", arg: 2, scope: !766, file: !2, line: 114, type: !318)
!772 = !DILocation(line: 114, column: 59, scope: !766, inlinedAt: !770)
!773 = !DILocation(line: 116, column: 24, scope: !766, inlinedAt: !770)
!774 = !DILocation(line: 116, column: 28, scope: !766, inlinedAt: !770)
!775 = !DILocation(line: 116, column: 5, scope: !766, inlinedAt: !770)
!776 = !DILocation(line: 117, column: 9, scope: !777, inlinedAt: !770)
!777 = distinct !DILexicalBlock(scope: !766, file: !2, line: 117, column: 9)
!778 = !DILocation(line: 117, column: 9, scope: !766, inlinedAt: !770)
!779 = !DILocation(line: 118, column: 19, scope: !780, inlinedAt: !770)
!780 = distinct !DILexicalBlock(scope: !777, file: !2, line: 117, column: 29)
!781 = !DILocation(line: 118, column: 25, scope: !780, inlinedAt: !770)
!782 = !DILocation(line: 118, column: 9, scope: !780, inlinedAt: !770)
!783 = !DILocation(line: 119, column: 9, scope: !780, inlinedAt: !770)
!784 = !DILocation(line: 119, column: 15, scope: !780, inlinedAt: !770)
!785 = !DILocation(line: 119, column: 20, scope: !780, inlinedAt: !770)
!786 = !DILocation(line: 120, column: 5, scope: !780, inlinedAt: !770)
!787 = !DILocation(line: 121, column: 9, scope: !788, inlinedAt: !770)
!788 = distinct !DILexicalBlock(scope: !766, file: !2, line: 121, column: 9)
!789 = !DILocation(line: 121, column: 15, scope: !788, inlinedAt: !770)
!790 = !DILocation(line: 121, column: 21, scope: !788, inlinedAt: !770)
!791 = !DILocation(line: 121, column: 9, scope: !766, inlinedAt: !770)
!792 = !DILocation(line: 122, column: 9, scope: !793, inlinedAt: !770)
!793 = distinct !DILexicalBlock(scope: !788, file: !2, line: 121, column: 38)
!794 = !DILocation(line: 122, column: 21, scope: !793, inlinedAt: !770)
!795 = !DILocation(line: 123, column: 38, scope: !793, inlinedAt: !770)
!796 = !DILocation(line: 123, column: 15, scope: !793, inlinedAt: !770)
!797 = !DILocation(line: 123, column: 9, scope: !793, inlinedAt: !770)
!798 = !DILocation(line: 124, column: 5, scope: !793, inlinedAt: !770)
!799 = !DILocation(line: 349, column: 25, scope: !764)
!800 = !DILocation(line: 352, column: 51, scope: !756)
!801 = !DILocation(line: 262, column: 50, scope: !711, inlinedAt: !802)
!802 = distinct !DILocation(line: 352, column: 21, scope: !756)
!803 = !DILocation(line: 263, column: 30, scope: !711, inlinedAt: !802)
!804 = !DILocation(line: 263, column: 62, scope: !711, inlinedAt: !802)
!805 = !DILocation(line: 265, column: 9, scope: !722, inlinedAt: !802)
!806 = !DILocation(line: 265, column: 15, scope: !722, inlinedAt: !802)
!807 = !DILocation(line: 265, column: 9, scope: !711, inlinedAt: !802)
!808 = !DILocation(line: 266, column: 13, scope: !726, inlinedAt: !802)
!809 = !DILocation(line: 266, column: 19, scope: !726, inlinedAt: !802)
!810 = !DILocation(line: 266, column: 25, scope: !726, inlinedAt: !802)
!811 = !DILocation(line: 266, column: 13, scope: !727, inlinedAt: !802)
!812 = !DILocation(line: 267, column: 13, scope: !726, inlinedAt: !802)
!813 = !DILocation(line: 269, column: 20, scope: !727, inlinedAt: !802)
!814 = !DILocation(line: 269, column: 26, scope: !727, inlinedAt: !802)
!815 = !DILocation(line: 269, column: 54, scope: !727, inlinedAt: !802)
!816 = !DILocation(line: 269, column: 9, scope: !727, inlinedAt: !802)
!817 = !DILocation(line: 270, column: 5, scope: !727, inlinedAt: !802)
!818 = !DILocation(line: 271, column: 31, scope: !738, inlinedAt: !802)
!819 = !DILocation(line: 271, column: 63, scope: !738, inlinedAt: !802)
!820 = !DILocation(line: 271, column: 22, scope: !738, inlinedAt: !802)
!821 = !DILocation(line: 271, column: 9, scope: !738, inlinedAt: !802)
!822 = !DILocation(line: 271, column: 15, scope: !738, inlinedAt: !802)
!823 = !DILocation(line: 271, column: 20, scope: !738, inlinedAt: !802)
!824 = !DILocation(line: 273, column: 28, scope: !738, inlinedAt: !802)
!825 = !DILocation(line: 273, column: 32, scope: !738, inlinedAt: !802)
!826 = !DILocation(line: 273, column: 9, scope: !738, inlinedAt: !802)
!827 = !DILocation(line: 274, column: 9, scope: !738, inlinedAt: !802)
!828 = !DILocation(line: 274, column: 21, scope: !738, inlinedAt: !802)
!829 = !DILocation(line: 276, column: 5, scope: !711, inlinedAt: !802)
!830 = !DILocation(line: 276, column: 17, scope: !711, inlinedAt: !802)
!831 = !DILocation(line: 277, column: 5, scope: !711, inlinedAt: !802)
!832 = !DILocation(line: 277, column: 17, scope: !711, inlinedAt: !802)
!833 = !DILocation(line: 278, column: 1, scope: !711, inlinedAt: !802)
!834 = !DILocation(line: 353, column: 48, scope: !756)
!835 = !DILocation(line: 353, column: 54, scope: !756)
!836 = !DILocalVariable(name: "dq", arg: 1, scope: !837, file: !2, line: 174, type: !662)
!837 = distinct !DISubprogram(name: "resume_coro_if_needed", scope: !2, file: !2, line: 174, type: !838, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !662, !318, !119}
!840 = !DILocation(line: 174, column: 45, scope: !837, inlinedAt: !841)
!841 = distinct !DILocation(line: 353, column: 21, scope: !756)
!842 = !DILocalVariable(name: "conn", arg: 2, scope: !837, file: !2, line: 174, type: !318)
!843 = !DILocation(line: 174, column: 68, scope: !837, inlinedAt: !841)
!844 = !DILocalVariable(name: "epoll_fd", arg: 3, scope: !837, file: !2, line: 175, type: !119)
!845 = !DILocation(line: 175, column: 9, scope: !837, inlinedAt: !841)
!846 = !DILocation(line: 177, column: 5, scope: !847, inlinedAt: !841)
!847 = distinct !DILexicalBlock(scope: !848, file: !2, line: 177, column: 5)
!848 = distinct !DILexicalBlock(scope: !837, file: !2, line: 177, column: 5)
!849 = !DILocation(line: 177, column: 5, scope: !848, inlinedAt: !841)
!850 = !DILocation(line: 179, column: 11, scope: !851, inlinedAt: !841)
!851 = distinct !DILexicalBlock(scope: !837, file: !2, line: 179, column: 9)
!852 = !DILocation(line: 179, column: 17, scope: !851, inlinedAt: !841)
!853 = !DILocation(line: 179, column: 23, scope: !851, inlinedAt: !841)
!854 = !DILocation(line: 179, column: 9, scope: !837, inlinedAt: !841)
!855 = !DILocation(line: 180, column: 9, scope: !851, inlinedAt: !841)
!856 = !DILocalVariable(name: "yield_result", scope: !837, file: !2, line: 182, type: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_coro_yield_t", file: !118, line: 171, baseType: !189)
!858 = !DILocation(line: 182, column: 34, scope: !837, inlinedAt: !841)
!859 = !DILocation(line: 182, column: 61, scope: !837, inlinedAt: !841)
!860 = !DILocation(line: 182, column: 67, scope: !837, inlinedAt: !841)
!861 = !DILocation(line: 182, column: 49, scope: !837, inlinedAt: !841)
!862 = !DILocation(line: 184, column: 9, scope: !863, inlinedAt: !841)
!863 = distinct !DILexicalBlock(scope: !837, file: !2, line: 184, column: 9)
!864 = !DILocation(line: 184, column: 22, scope: !863, inlinedAt: !841)
!865 = !DILocation(line: 184, column: 9, scope: !837, inlinedAt: !841)
!866 = !DILocation(line: 185, column: 22, scope: !867, inlinedAt: !841)
!867 = distinct !DILexicalBlock(scope: !863, file: !2, line: 184, column: 46)
!868 = !DILocation(line: 185, column: 26, scope: !867, inlinedAt: !841)
!869 = !DILocation(line: 114, column: 36, scope: !766, inlinedAt: !870)
!870 = distinct !DILocation(line: 185, column: 9, scope: !867, inlinedAt: !841)
!871 = !DILocation(line: 114, column: 59, scope: !766, inlinedAt: !870)
!872 = !DILocation(line: 116, column: 24, scope: !766, inlinedAt: !870)
!873 = !DILocation(line: 116, column: 28, scope: !766, inlinedAt: !870)
!874 = !DILocation(line: 116, column: 5, scope: !766, inlinedAt: !870)
!875 = !DILocation(line: 117, column: 9, scope: !777, inlinedAt: !870)
!876 = !DILocation(line: 117, column: 9, scope: !766, inlinedAt: !870)
!877 = !DILocation(line: 118, column: 19, scope: !780, inlinedAt: !870)
!878 = !DILocation(line: 118, column: 25, scope: !780, inlinedAt: !870)
!879 = !DILocation(line: 118, column: 9, scope: !780, inlinedAt: !870)
!880 = !DILocation(line: 119, column: 9, scope: !780, inlinedAt: !870)
!881 = !DILocation(line: 119, column: 15, scope: !780, inlinedAt: !870)
!882 = !DILocation(line: 119, column: 20, scope: !780, inlinedAt: !870)
!883 = !DILocation(line: 120, column: 5, scope: !780, inlinedAt: !870)
!884 = !DILocation(line: 121, column: 9, scope: !788, inlinedAt: !870)
!885 = !DILocation(line: 121, column: 15, scope: !788, inlinedAt: !870)
!886 = !DILocation(line: 121, column: 21, scope: !788, inlinedAt: !870)
!887 = !DILocation(line: 121, column: 9, scope: !766, inlinedAt: !870)
!888 = !DILocation(line: 122, column: 9, scope: !793, inlinedAt: !870)
!889 = !DILocation(line: 122, column: 21, scope: !793, inlinedAt: !870)
!890 = !DILocation(line: 123, column: 38, scope: !793, inlinedAt: !870)
!891 = !DILocation(line: 123, column: 15, scope: !793, inlinedAt: !870)
!892 = !DILocation(line: 123, column: 9, scope: !793, inlinedAt: !870)
!893 = !DILocation(line: 124, column: 5, scope: !793, inlinedAt: !870)
!894 = !DILocation(line: 186, column: 9, scope: !867, inlinedAt: !841)
!895 = !DILocalVariable(name: "write_events", scope: !837, file: !2, line: 189, type: !350)
!896 = !DILocation(line: 189, column: 10, scope: !837, inlinedAt: !841)
!897 = !DILocation(line: 190, column: 9, scope: !898, inlinedAt: !841)
!898 = distinct !DILexicalBlock(scope: !837, file: !2, line: 190, column: 9)
!899 = !DILocation(line: 190, column: 15, scope: !898, inlinedAt: !841)
!900 = !DILocation(line: 190, column: 21, scope: !898, inlinedAt: !841)
!901 = !DILocation(line: 190, column: 9, scope: !837, inlinedAt: !841)
!902 = !DILocation(line: 191, column: 22, scope: !903, inlinedAt: !841)
!903 = distinct !DILexicalBlock(scope: !898, file: !2, line: 190, column: 39)
!904 = !DILocation(line: 192, column: 5, scope: !903, inlinedAt: !841)
!905 = !DILocalVariable(name: "should_resume_coro", scope: !906, file: !2, line: 193, type: !350)
!906 = distinct !DILexicalBlock(scope: !898, file: !2, line: 192, column: 12)
!907 = !DILocation(line: 193, column: 14, scope: !906, inlinedAt: !841)
!908 = !DILocation(line: 193, column: 36, scope: !906, inlinedAt: !841)
!909 = !DILocation(line: 193, column: 49, scope: !906, inlinedAt: !841)
!910 = !DILocation(line: 195, column: 13, scope: !911, inlinedAt: !841)
!911 = distinct !DILexicalBlock(scope: !906, file: !2, line: 195, column: 13)
!912 = !DILocation(line: 195, column: 13, scope: !906, inlinedAt: !841)
!913 = !DILocation(line: 196, column: 13, scope: !911, inlinedAt: !841)
!914 = !DILocation(line: 196, column: 25, scope: !911, inlinedAt: !841)
!915 = !DILocation(line: 198, column: 13, scope: !911, inlinedAt: !841)
!916 = !DILocation(line: 198, column: 25, scope: !911, inlinedAt: !841)
!917 = !DILocation(line: 200, column: 25, scope: !906, inlinedAt: !841)
!918 = !DILocation(line: 200, column: 31, scope: !906, inlinedAt: !841)
!919 = !DILocation(line: 200, column: 37, scope: !906, inlinedAt: !841)
!920 = !DILocation(line: 200, column: 24, scope: !906, inlinedAt: !841)
!921 = !DILocation(line: 200, column: 22, scope: !906, inlinedAt: !841)
!922 = !DILocation(line: 201, column: 13, scope: !923, inlinedAt: !841)
!923 = distinct !DILexicalBlock(scope: !906, file: !2, line: 201, column: 13)
!924 = !DILocation(line: 201, column: 35, scope: !923, inlinedAt: !841)
!925 = !DILocation(line: 201, column: 32, scope: !923, inlinedAt: !841)
!926 = !DILocation(line: 201, column: 13, scope: !906, inlinedAt: !841)
!927 = !DILocation(line: 202, column: 13, scope: !923, inlinedAt: !841)
!928 = !DILocalVariable(name: "event", scope: !837, file: !2, line: 205, type: !488)
!929 = !DILocation(line: 205, column: 24, scope: !837, inlinedAt: !841)
!930 = !DILocation(line: 206, column: 40, scope: !837, inlinedAt: !841)
!931 = !DILocation(line: 206, column: 19, scope: !837, inlinedAt: !841)
!932 = !DILocation(line: 205, column: 32, scope: !837, inlinedAt: !841)
!933 = !DILocation(line: 207, column: 21, scope: !837, inlinedAt: !841)
!934 = !DILocation(line: 207, column: 14, scope: !837, inlinedAt: !841)
!935 = !DILocalVariable(name: "fd", scope: !837, file: !2, line: 210, type: !119)
!936 = !DILocation(line: 210, column: 9, scope: !837, inlinedAt: !841)
!937 = !DILocation(line: 210, column: 37, scope: !837, inlinedAt: !841)
!938 = !DILocation(line: 210, column: 14, scope: !837, inlinedAt: !841)
!939 = !DILocation(line: 211, column: 9, scope: !940, inlinedAt: !841)
!940 = distinct !DILexicalBlock(scope: !837, file: !2, line: 211, column: 9)
!941 = !DILocation(line: 211, column: 9, scope: !837, inlinedAt: !841)
!942 = !DILocation(line: 212, column: 9, scope: !940, inlinedAt: !841)
!943 = !DILocation(line: 214, column: 5, scope: !837, inlinedAt: !841)
!944 = !DILocation(line: 214, column: 17, scope: !837, inlinedAt: !841)
!945 = !DILocation(line: 215, column: 1, scope: !837, inlinedAt: !841)
!946 = !DILocation(line: 356, column: 47, scope: !692)
!947 = !DILocation(line: 356, column: 17, scope: !692)
!948 = !DILocation(line: 357, column: 13, scope: !692)
!949 = !DILocation(line: 337, column: 74, scope: !689)
!950 = !DILocation(line: 337, column: 13, scope: !689)
!951 = distinct !{!951, !690, !952, !435}
!952 = !DILocation(line: 357, column: 13, scope: !684)
!953 = !DILocation(line: 358, column: 9, scope: !671)
!954 = !DILocation(line: 321, column: 5, scope: !654)
!955 = !DILabel(scope: !571, name: "epoll_fd_closed", file: !2, line: 361)
!956 = !DILocation(line: 361, column: 1, scope: !571)
!957 = !DILocation(line: 362, column: 10, scope: !571)
!958 = !DILocation(line: 362, column: 5, scope: !571)
!959 = !DILocation(line: 364, column: 5, scope: !571)
!960 = distinct !DISubprogram(name: "death_queue_init", scope: !2, file: !2, line: 98, type: !961, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !662, !318, !198}
!963 = !DILocalVariable(name: "dq", arg: 1, scope: !960, file: !2, line: 98, type: !662)
!964 = !DILocation(line: 98, column: 40, scope: !960)
!965 = !DILocalVariable(name: "conns", arg: 2, scope: !960, file: !2, line: 98, type: !318)
!966 = !DILocation(line: 98, column: 63, scope: !960)
!967 = !DILocalVariable(name: "keep_alive_timeout", arg: 3, scope: !960, file: !2, line: 99, type: !198)
!968 = !DILocation(line: 99, column: 20, scope: !960)
!969 = !DILocation(line: 101, column: 17, scope: !960)
!970 = !DILocation(line: 101, column: 5, scope: !960)
!971 = !DILocation(line: 101, column: 9, scope: !960)
!972 = !DILocation(line: 101, column: 15, scope: !960)
!973 = !DILocation(line: 102, column: 5, scope: !960)
!974 = !DILocation(line: 102, column: 9, scope: !960)
!975 = !DILocation(line: 102, column: 14, scope: !960)
!976 = !DILocation(line: 103, column: 30, scope: !960)
!977 = !DILocation(line: 103, column: 5, scope: !960)
!978 = !DILocation(line: 103, column: 9, scope: !960)
!979 = !DILocation(line: 103, column: 28, scope: !960)
!980 = !DILocation(line: 104, column: 21, scope: !960)
!981 = !DILocation(line: 104, column: 25, scope: !960)
!982 = !DILocation(line: 104, column: 30, scope: !960)
!983 = !DILocation(line: 104, column: 35, scope: !960)
!984 = !DILocation(line: 104, column: 5, scope: !960)
!985 = !DILocation(line: 104, column: 9, scope: !960)
!986 = !DILocation(line: 104, column: 14, scope: !960)
!987 = !DILocation(line: 104, column: 19, scope: !960)
!988 = !DILocation(line: 105, column: 1, scope: !960)
!989 = distinct !DISubprogram(name: "death_queue_kill_waiting", scope: !2, file: !2, line: 218, type: !990, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !662}
!992 = !DILocalVariable(name: "dq", arg: 1, scope: !989, file: !2, line: 218, type: !662)
!993 = !DILocation(line: 218, column: 48, scope: !989)
!994 = !DILocation(line: 220, column: 5, scope: !989)
!995 = !DILocation(line: 220, column: 9, scope: !989)
!996 = !DILocation(line: 220, column: 13, scope: !989)
!997 = !DILocation(line: 222, column: 5, scope: !989)
!998 = !DILocation(line: 222, column: 31, scope: !989)
!999 = !DILocation(line: 222, column: 13, scope: !989)
!1000 = !DILocation(line: 222, column: 12, scope: !989)
!1001 = !DILocalVariable(name: "conn", scope: !1002, file: !2, line: 223, type: !318)
!1002 = distinct !DILexicalBlock(scope: !989, file: !2, line: 222, column: 36)
!1003 = !DILocation(line: 223, column: 28, scope: !1002)
!1004 = !DILocation(line: 223, column: 59, scope: !1002)
!1005 = !DILocation(line: 223, column: 63, scope: !1002)
!1006 = !DILocation(line: 223, column: 67, scope: !1002)
!1007 = !DILocation(line: 223, column: 72, scope: !1002)
!1008 = !DILocation(line: 223, column: 35, scope: !1002)
!1009 = !DILocation(line: 225, column: 13, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1002, file: !2, line: 225, column: 13)
!1011 = !DILocation(line: 225, column: 19, scope: !1010)
!1012 = !DILocation(line: 225, column: 33, scope: !1010)
!1013 = !DILocation(line: 225, column: 37, scope: !1010)
!1014 = !DILocation(line: 225, column: 31, scope: !1010)
!1015 = !DILocation(line: 225, column: 13, scope: !1002)
!1016 = !DILocation(line: 226, column: 13, scope: !1010)
!1017 = !DILocation(line: 228, column: 22, scope: !1002)
!1018 = !DILocation(line: 228, column: 26, scope: !1002)
!1019 = !DILocation(line: 114, column: 36, scope: !766, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 228, column: 9, scope: !1002)
!1021 = !DILocation(line: 114, column: 59, scope: !766, inlinedAt: !1020)
!1022 = !DILocation(line: 116, column: 24, scope: !766, inlinedAt: !1020)
!1023 = !DILocation(line: 116, column: 28, scope: !766, inlinedAt: !1020)
!1024 = !DILocation(line: 116, column: 5, scope: !766, inlinedAt: !1020)
!1025 = !DILocation(line: 117, column: 9, scope: !777, inlinedAt: !1020)
!1026 = !DILocation(line: 117, column: 9, scope: !766, inlinedAt: !1020)
!1027 = !DILocation(line: 118, column: 19, scope: !780, inlinedAt: !1020)
!1028 = !DILocation(line: 118, column: 25, scope: !780, inlinedAt: !1020)
!1029 = !DILocation(line: 118, column: 9, scope: !780, inlinedAt: !1020)
!1030 = !DILocation(line: 119, column: 9, scope: !780, inlinedAt: !1020)
!1031 = !DILocation(line: 119, column: 15, scope: !780, inlinedAt: !1020)
!1032 = !DILocation(line: 119, column: 20, scope: !780, inlinedAt: !1020)
!1033 = !DILocation(line: 120, column: 5, scope: !780, inlinedAt: !1020)
!1034 = !DILocation(line: 121, column: 9, scope: !788, inlinedAt: !1020)
!1035 = !DILocation(line: 121, column: 15, scope: !788, inlinedAt: !1020)
!1036 = !DILocation(line: 121, column: 21, scope: !788, inlinedAt: !1020)
!1037 = !DILocation(line: 121, column: 9, scope: !766, inlinedAt: !1020)
!1038 = !DILocation(line: 122, column: 9, scope: !793, inlinedAt: !1020)
!1039 = !DILocation(line: 122, column: 21, scope: !793, inlinedAt: !1020)
!1040 = !DILocation(line: 123, column: 38, scope: !793, inlinedAt: !1020)
!1041 = !DILocation(line: 123, column: 15, scope: !793, inlinedAt: !1020)
!1042 = !DILocation(line: 123, column: 9, scope: !793, inlinedAt: !1020)
!1043 = !DILocation(line: 124, column: 5, scope: !793, inlinedAt: !1020)
!1044 = distinct !{!1044, !997, !1045, !435}
!1045 = !DILocation(line: 229, column: 5, scope: !989)
!1046 = !DILocation(line: 232, column: 5, scope: !989)
!1047 = !DILocation(line: 232, column: 9, scope: !989)
!1048 = !DILocation(line: 232, column: 14, scope: !989)
!1049 = !DILocation(line: 233, column: 1, scope: !989)
!1050 = distinct !DISubprogram(name: "update_date_cache", scope: !2, file: !2, line: 250, type: !1051, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !281}
!1053 = !DILocalVariable(name: "thread", arg: 1, scope: !1050, file: !2, line: 250, type: !281)
!1054 = !DILocation(line: 250, column: 34, scope: !1050)
!1055 = !DILocalVariable(name: "now", scope: !1050, file: !2, line: 252, type: !202)
!1056 = !DILocation(line: 252, column: 12, scope: !1050)
!1057 = !DILocation(line: 252, column: 18, scope: !1050)
!1058 = !DILocation(line: 253, column: 9, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1050, file: !2, line: 253, column: 9)
!1060 = !DILocation(line: 253, column: 16, scope: !1059)
!1061 = !DILocation(line: 253, column: 24, scope: !1059)
!1062 = !DILocation(line: 253, column: 29, scope: !1059)
!1063 = !DILocation(line: 253, column: 13, scope: !1059)
!1064 = !DILocation(line: 253, column: 9, scope: !1050)
!1065 = !DILocation(line: 254, column: 29, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 253, column: 35)
!1067 = !DILocation(line: 254, column: 9, scope: !1066)
!1068 = !DILocation(line: 254, column: 17, scope: !1066)
!1069 = !DILocation(line: 254, column: 22, scope: !1066)
!1070 = !DILocation(line: 254, column: 27, scope: !1066)
!1071 = !DILocation(line: 255, column: 30, scope: !1066)
!1072 = !DILocation(line: 255, column: 35, scope: !1066)
!1073 = !DILocation(line: 255, column: 43, scope: !1066)
!1074 = !DILocation(line: 255, column: 48, scope: !1066)
!1075 = !DILocation(line: 255, column: 9, scope: !1066)
!1076 = !DILocation(line: 256, column: 30, scope: !1066)
!1077 = !DILocation(line: 256, column: 44, scope: !1066)
!1078 = !DILocation(line: 256, column: 52, scope: !1066)
!1079 = !DILocation(line: 256, column: 58, scope: !1066)
!1080 = !DILocation(line: 256, column: 65, scope: !1066)
!1081 = !DILocation(line: 256, column: 36, scope: !1066)
!1082 = !DILocation(line: 256, column: 34, scope: !1066)
!1083 = !DILocation(line: 257, column: 21, scope: !1066)
!1084 = !DILocation(line: 257, column: 29, scope: !1066)
!1085 = !DILocation(line: 257, column: 34, scope: !1066)
!1086 = !DILocation(line: 256, column: 9, scope: !1066)
!1087 = !DILocation(line: 258, column: 5, scope: !1066)
!1088 = !DILocation(line: 259, column: 1, scope: !1050)
!1089 = distinct !DISubprogram(name: "grab_and_watch_client", scope: !2, file: !2, line: 281, type: !1090, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!318, !119, !119, !318}
!1092 = !DILocalVariable(name: "epoll_fd", arg: 1, scope: !1089, file: !2, line: 281, type: !119)
!1093 = !DILocation(line: 281, column: 27, scope: !1089)
!1094 = !DILocalVariable(name: "pipe_fd", arg: 2, scope: !1089, file: !2, line: 281, type: !119)
!1095 = !DILocation(line: 281, column: 41, scope: !1089)
!1096 = !DILocalVariable(name: "conns", arg: 3, scope: !1089, file: !2, line: 281, type: !318)
!1097 = !DILocation(line: 281, column: 69, scope: !1089)
!1098 = !DILocalVariable(name: "fd", scope: !1089, file: !2, line: 283, type: !119)
!1099 = !DILocation(line: 283, column: 9, scope: !1089)
!1100 = !DILocation(line: 284, column: 9, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1089, file: !2, line: 284, column: 9)
!1102 = !DILocation(line: 284, column: 9, scope: !1089)
!1103 = !DILocation(line: 285, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1101, file: !2, line: 284, column: 67)
!1105 = !DILocation(line: 286, column: 9, scope: !1104)
!1106 = !DILocalVariable(name: "event", scope: !1089, file: !2, line: 289, type: !488)
!1107 = !DILocation(line: 289, column: 24, scope: !1089)
!1108 = !DILocation(line: 289, column: 32, scope: !1089)
!1109 = !DILocation(line: 290, column: 19, scope: !1089)
!1110 = !DILocation(line: 291, column: 22, scope: !1089)
!1111 = !DILocation(line: 291, column: 28, scope: !1089)
!1112 = !DILocation(line: 291, column: 14, scope: !1089)
!1113 = !DILocation(line: 293, column: 9, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1089, file: !2, line: 293, column: 9)
!1115 = !DILocation(line: 293, column: 9, scope: !1089)
!1116 = !DILocation(line: 294, column: 9, scope: !1114)
!1117 = !DILocation(line: 296, column: 13, scope: !1089)
!1118 = !DILocation(line: 296, column: 19, scope: !1089)
!1119 = !DILocation(line: 296, column: 5, scope: !1089)
!1120 = !DILocation(line: 297, column: 1, scope: !1089)
!1121 = distinct !DISubprogram(name: "death_queue_move_to_last", scope: !2, file: !2, line: 79, type: !767, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!1122 = !DILocalVariable(name: "dq", arg: 1, scope: !1121, file: !2, line: 79, type: !662)
!1123 = !DILocation(line: 79, column: 60, scope: !1121)
!1124 = !DILocalVariable(name: "conn", arg: 2, scope: !1121, file: !2, line: 80, type: !318)
!1125 = !DILocation(line: 80, column: 24, scope: !1121)
!1126 = !DILocation(line: 90, column: 25, scope: !1121)
!1127 = !DILocation(line: 90, column: 29, scope: !1121)
!1128 = !DILocation(line: 90, column: 36, scope: !1121)
!1129 = !DILocation(line: 90, column: 40, scope: !1121)
!1130 = !DILocation(line: 91, column: 26, scope: !1121)
!1131 = !DILocation(line: 91, column: 32, scope: !1121)
!1132 = !DILocation(line: 91, column: 38, scope: !1121)
!1133 = !DILocation(line: 91, column: 24, scope: !1121)
!1134 = !DILocation(line: 91, column: 23, scope: !1121)
!1135 = !DILocation(line: 90, column: 59, scope: !1121)
!1136 = !DILocation(line: 90, column: 34, scope: !1121)
!1137 = !DILocation(line: 90, column: 5, scope: !1121)
!1138 = !DILocation(line: 90, column: 11, scope: !1121)
!1139 = !DILocation(line: 90, column: 23, scope: !1121)
!1140 = !DILocation(line: 93, column: 24, scope: !1121)
!1141 = !DILocation(line: 93, column: 28, scope: !1121)
!1142 = !DILocation(line: 93, column: 5, scope: !1121)
!1143 = !DILocation(line: 94, column: 24, scope: !1121)
!1144 = !DILocation(line: 94, column: 28, scope: !1121)
!1145 = !DILocation(line: 94, column: 5, scope: !1121)
!1146 = !DILocation(line: 95, column: 1, scope: !1121)
!1147 = distinct !DISubprogram(name: "death_queue_empty", scope: !2, file: !2, line: 74, type: !1148, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!350, !662}
!1150 = !DILocalVariable(name: "dq", arg: 1, scope: !1147, file: !2, line: 74, type: !662)
!1151 = !DILocation(line: 74, column: 53, scope: !1147)
!1152 = !DILocation(line: 76, column: 12, scope: !1147)
!1153 = !DILocation(line: 76, column: 16, scope: !1147)
!1154 = !DILocation(line: 76, column: 21, scope: !1147)
!1155 = !DILocation(line: 76, column: 26, scope: !1147)
!1156 = !DILocation(line: 76, column: 5, scope: !1147)
!1157 = distinct !DISubprogram(name: "death_queue_idx_to_node", scope: !2, file: !2, line: 50, type: !1158, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!318, !662, !119}
!1160 = !DILocalVariable(name: "dq", arg: 1, scope: !1157, file: !2, line: 50, type: !662)
!1161 = !DILocation(line: 50, column: 80, scope: !1157)
!1162 = !DILocalVariable(name: "idx", arg: 2, scope: !1157, file: !2, line: 51, type: !119)
!1163 = !DILocation(line: 51, column: 9, scope: !1157)
!1164 = !DILocation(line: 53, column: 13, scope: !1157)
!1165 = !DILocation(line: 53, column: 17, scope: !1157)
!1166 = !DILocation(line: 53, column: 12, scope: !1157)
!1167 = !DILocation(line: 53, column: 25, scope: !1157)
!1168 = !DILocation(line: 53, column: 29, scope: !1157)
!1169 = !DILocation(line: 53, column: 37, scope: !1157)
!1170 = !DILocation(line: 53, column: 41, scope: !1157)
!1171 = !DILocation(line: 53, column: 47, scope: !1157)
!1172 = !DILocation(line: 53, column: 5, scope: !1157)
!1173 = distinct !DISubprogram(name: "process_request_coro", scope: !2, file: !2, line: 134, type: !1174, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!119, !326}
!1176 = !DILocalVariable(name: "coro", arg: 1, scope: !1173, file: !2, line: 134, type: !326)
!1177 = !DILocation(line: 134, column: 30, scope: !1173)
!1178 = !DILocalVariable(name: "strbuf", scope: !1173, file: !2, line: 136, type: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !1181, line: 25, baseType: !1182)
!1181 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !1181, line: 27, size: 256, elements: !1183)
!1183 = !{!1184, !1189, !1194}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1182, file: !1181, line: 31, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1182, file: !1181, line: 28, size: 64, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1185, file: !1181, line: 29, baseType: !244, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !1185, file: !1181, line: 30, baseType: !265, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1182, file: !1181, line: 34, baseType: !1190, size: 128, offset: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1182, file: !1181, line: 32, size: 128, elements: !1191)
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1190, file: !1181, line: 33, baseType: !195, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1190, file: !1181, line: 33, baseType: !195, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1182, file: !1181, line: 35, baseType: !129, size: 32, offset: 192)
!1195 = !DILocation(line: 136, column: 15, scope: !1173)
!1196 = !DILocation(line: 136, column: 41, scope: !1173)
!1197 = !DILocation(line: 136, column: 24, scope: !1173)
!1198 = !DILocalVariable(name: "conn", scope: !1173, file: !2, line: 137, type: !318)
!1199 = !DILocation(line: 137, column: 24, scope: !1173)
!1200 = !DILocation(line: 137, column: 45, scope: !1173)
!1201 = !DILocation(line: 137, column: 31, scope: !1173)
!1202 = !DILocalVariable(name: "lwan", scope: !1173, file: !2, line: 138, type: !286)
!1203 = !DILocation(line: 138, column: 13, scope: !1173)
!1204 = !DILocation(line: 138, column: 20, scope: !1173)
!1205 = !DILocation(line: 138, column: 26, scope: !1173)
!1206 = !DILocation(line: 138, column: 34, scope: !1173)
!1207 = !DILocalVariable(name: "fd", scope: !1173, file: !2, line: 139, type: !119)
!1208 = !DILocation(line: 139, column: 9, scope: !1173)
!1209 = !DILocation(line: 139, column: 37, scope: !1173)
!1210 = !DILocation(line: 139, column: 14, scope: !1173)
!1211 = !DILocalVariable(name: "request_buffer", scope: !1173, file: !2, line: 140, type: !1212)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32768, elements: !1213)
!1213 = !{!1214}
!1214 = !DISubrange(count: 4096)
!1215 = !DILocation(line: 140, column: 10, scope: !1173)
!1216 = !DILocalVariable(name: "buffer", scope: !1173, file: !2, line: 141, type: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !118, line: 110, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !118, line: 191, size: 128, elements: !1219)
!1219 = !{!1220, !1221}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1218, file: !118, line: 192, baseType: !244, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1218, file: !118, line: 193, baseType: !195, size: 64, offset: 64)
!1222 = !DILocation(line: 141, column: 18, scope: !1173)
!1223 = !DILocation(line: 141, column: 27, scope: !1173)
!1224 = !DILocation(line: 142, column: 18, scope: !1173)
!1225 = !DILocalVariable(name: "next_request", scope: !1173, file: !2, line: 145, type: !244)
!1226 = !DILocation(line: 145, column: 11, scope: !1173)
!1227 = !DILocation(line: 147, column: 17, scope: !1173)
!1228 = !DILocation(line: 147, column: 5, scope: !1173)
!1229 = !DILocation(line: 149, column: 5, scope: !1173)
!1230 = !DILocalVariable(name: "request", scope: !1231, file: !2, line: 150, type: !1232)
!1231 = distinct !DILexicalBlock(scope: !1173, file: !2, line: 149, column: 18)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !118, line: 106, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !118, line: 206, size: 1280, elements: !1234)
!1234 = !{!1235, !1237, !1238, !1239, !1240, !1241, !1252, !1253, !1265}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1233, file: !118, line: 207, baseType: !1236, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !118, line: 156, baseType: !159)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1233, file: !118, line: 208, baseType: !119, size: 32, offset: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !1233, file: !118, line: 209, baseType: !1217, size: 128, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !1233, file: !118, line: 210, baseType: !1217, size: 128, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !1233, file: !118, line: 211, baseType: !318, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !1233, file: !118, line: 216, baseType: !1242, size: 128, offset: 384)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1233, file: !118, line: 213, size: 128, elements: !1243)
!1243 = !{!1244, !1251}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1242, file: !118, line: 214, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !118, line: 105, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !118, line: 173, size: 128, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1247, file: !118, line: 174, baseType: !244, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1247, file: !118, line: 175, baseType: !244, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1242, file: !118, line: 215, baseType: !195, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !1233, file: !118, line: 216, baseType: !1242, size: 128, offset: 512)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1233, file: !118, line: 223, baseType: !1254, size: 192, offset: 640)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1233, file: !118, line: 217, size: 192, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !1254, file: !118, line: 218, baseType: !202, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1254, file: !118, line: 222, baseType: !1258, size: 128, offset: 64)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1254, file: !118, line: 219, size: 128, elements: !1259)
!1259 = !{!1260, !1264}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !1258, file: !118, line: 220, baseType: !1261, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1262, line: 56, baseType: !1263)
!1262 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !205, line: 152, baseType: !200)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !1258, file: !118, line: 221, baseType: !1261, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !1233, file: !118, line: 224, baseType: !1266, size: 448, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !118, line: 107, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !118, line: 178, size: 448, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272, !1273}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1267, file: !118, line: 179, baseType: !1179, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1267, file: !118, line: 180, baseType: !265, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !1267, file: !118, line: 181, baseType: !195, size: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !1267, file: !118, line: 182, baseType: !1245, size: 64, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1267, file: !118, line: 188, baseType: !1274, size: 192, offset: 256)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1267, file: !118, line: 184, size: 192, elements: !1275)
!1275 = !{!1276, !1282, !1283}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1274, file: !118, line: 185, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!1280, !1281, !201}
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !118, line: 131, baseType: !171)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1274, file: !118, line: 186, baseType: !201, size: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !1274, file: !118, line: 187, baseType: !201, size: 64, offset: 128)
!1284 = !DILocation(line: 150, column: 24, scope: !1231)
!1285 = !DILocation(line: 150, column: 34, scope: !1231)
!1286 = !DILocation(line: 152, column: 19, scope: !1231)
!1287 = !DILocation(line: 151, column: 21, scope: !1231)
!1288 = !DILocation(line: 153, column: 25, scope: !1231)
!1289 = !DILocation(line: 154, column: 27, scope: !1231)
!1290 = !DILocation(line: 158, column: 9, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !2, line: 158, column: 9)
!1292 = distinct !DILexicalBlock(scope: !1231, file: !2, line: 158, column: 9)
!1293 = !DILocation(line: 158, column: 9, scope: !1292)
!1294 = !DILocation(line: 160, column: 45, scope: !1231)
!1295 = !DILocation(line: 160, column: 70, scope: !1231)
!1296 = !DILocation(line: 160, column: 24, scope: !1231)
!1297 = !DILocation(line: 160, column: 22, scope: !1231)
!1298 = !DILocation(line: 161, column: 14, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1231, file: !2, line: 161, column: 13)
!1300 = !DILocation(line: 161, column: 13, scope: !1231)
!1301 = !DILocation(line: 162, column: 13, scope: !1299)
!1302 = !DILocation(line: 164, column: 20, scope: !1231)
!1303 = !DILocation(line: 164, column: 9, scope: !1231)
!1304 = !DILocation(line: 166, column: 13, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1231, file: !2, line: 166, column: 13)
!1306 = !DILocation(line: 166, column: 13, scope: !1231)
!1307 = !DILocation(line: 167, column: 13, scope: !1305)
!1308 = distinct !{!1308, !1229, !1309}
!1309 = !DILocation(line: 168, column: 5, scope: !1173)
!1310 = !DILocation(line: 170, column: 5, scope: !1173)
!1311 = !DILocation(line: 171, column: 1, scope: !1173)
!1312 = distinct !DISubprogram(name: "death_queue_insert", scope: !2, file: !2, line: 56, type: !767, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !114, retainedNodes: !245)
!1313 = !DILocalVariable(name: "dq", arg: 1, scope: !1312, file: !2, line: 56, type: !662)
!1314 = !DILocation(line: 56, column: 54, scope: !1312)
!1315 = !DILocalVariable(name: "new_node", arg: 2, scope: !1312, file: !2, line: 57, type: !318)
!1316 = !DILocation(line: 57, column: 24, scope: !1312)
!1317 = !DILocation(line: 59, column: 5, scope: !1312)
!1318 = !DILocation(line: 59, column: 15, scope: !1312)
!1319 = !DILocation(line: 59, column: 20, scope: !1312)
!1320 = !DILocation(line: 60, column: 22, scope: !1312)
!1321 = !DILocation(line: 60, column: 26, scope: !1312)
!1322 = !DILocation(line: 60, column: 31, scope: !1312)
!1323 = !DILocation(line: 60, column: 5, scope: !1312)
!1324 = !DILocation(line: 60, column: 15, scope: !1312)
!1325 = !DILocation(line: 60, column: 20, scope: !1312)
!1326 = !DILocalVariable(name: "prev", scope: !1312, file: !2, line: 61, type: !318)
!1327 = !DILocation(line: 61, column: 24, scope: !1312)
!1328 = !DILocation(line: 61, column: 55, scope: !1312)
!1329 = !DILocation(line: 61, column: 59, scope: !1312)
!1330 = !DILocation(line: 61, column: 63, scope: !1312)
!1331 = !DILocation(line: 61, column: 68, scope: !1312)
!1332 = !DILocation(line: 61, column: 31, scope: !1312)
!1333 = !DILocation(line: 62, column: 58, scope: !1312)
!1334 = !DILocation(line: 62, column: 62, scope: !1312)
!1335 = !DILocation(line: 62, column: 34, scope: !1312)
!1336 = !DILocation(line: 62, column: 21, scope: !1312)
!1337 = !DILocation(line: 62, column: 27, scope: !1312)
!1338 = !DILocation(line: 62, column: 32, scope: !1312)
!1339 = !DILocation(line: 62, column: 5, scope: !1312)
!1340 = !DILocation(line: 62, column: 9, scope: !1312)
!1341 = !DILocation(line: 62, column: 14, scope: !1312)
!1342 = !DILocation(line: 62, column: 19, scope: !1312)
!1343 = !DILocation(line: 63, column: 1, scope: !1312)
