; ModuleID = '/home/raj/lwan/common/lwan-io-wrappers.c'
source_filename = "/home/raj/lwan/common/lwan-io-wrappers.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lwan_request_t_ = type { i32, i32, %struct.lwan_value_t_, %struct.lwan_value_t_, ptr, %struct.anon.1, %struct.anon.1, %struct.anon.2, %struct.lwan_response_t_ }
%struct.lwan_value_t_ = type { ptr, i64 }
%struct.anon.1 = type { ptr, i64 }
%struct.anon.2 = type { i64, %struct.anon.3 }
%struct.anon.3 = type { i64, i64 }
%struct.lwan_response_t_ = type { ptr, ptr, i64, ptr, %struct.anon.5 }
%struct.anon.5 = type { ptr, ptr, ptr }
%struct.lwan_connection_t_ = type { i32, i32, ptr, ptr, i32, i32 }
%struct.iovec = type { ptr, i64 }

@.str = private unnamed_addr constant [41 x i8] c"/home/raj/lwan/common/lwan-io-wrappers.c\00", align 1, !dbg !0
@__FUNCTION__.lwan_sendfile = private unnamed_addr constant [14 x i8] c"lwan_sendfile\00", align 1, !dbg !7
@.str.1 = private unnamed_addr constant [14 x i8] c"posix_fadvise\00", align 1, !dbg !13
@__FUNCTION__.sendfile_read_write = private unnamed_addr constant [20 x i8] c"sendfile_read_write\00", align 1, !dbg !16
@.str.2 = private unnamed_addr constant [6 x i8] c"lseek\00", align 1, !dbg !21

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @lwan_openat(ptr noundef %0, i32 noundef %1, ptr noundef %2, i32 noundef %3) #0 !dbg !109 {
  %5 = alloca i32, align 4

!36 = !DIEnumerator(name: "REQUEST_METHOD_POST", value: 4)
!37 = !DIEnumerator(name: "REQUEST_ACCEPT_DEFLATE", value: 8)
!38 = !DIEnumerator(name: "REQUEST_ACCEPT_GZIP", value: 16)
!39 = !DIEnumerator(name: "REQUEST_IS_HTTP_1_0", value: 32)
!40 = !DIEnumerator(name: "RESPONSE_SENT_HEADERS", value: 64)
!41 = !DIEnumerator(name: "RESPONSE_CHUNKED_ENCODING", value: 128)
!42 = !DIEnumerator(name: "RESPONSE_NO_CONTENT_LENGTH", value: 256)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 158, baseType: !31, size: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "CONN_MASK", value: -1)
!46 = !DIEnumerator(name: "CONN_KEEP_ALIVE", value: 1)
!47 = !DIEnumerator(name: "CONN_IS_ALIVE", value: 2)
!48 = !DIEnumerator(name: "CONN_SHOULD_RESUME_CORO", value: 4)
!49 = !DIEnumerator(name: "CONN_WRITE_EVENTS", value: 8)
!50 = !DIEnumerator(name: "CONN_MUST_READ", value: 16)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 114, baseType: !52, size: 32, elements: !53)
!52 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!54 = !DIEnumerator(name: "HTTP_OK", value: 200)
!55 = !DIEnumerator(name: "HTTP_PARTIAL_CONTENT", value: 206)
!56 = !DIEnumerator(name: "HTTP_MOVED_PERMANENTLY", value: 301)
!57 = !DIEnumerator(name: "HTTP_NOT_MODIFIED", value: 304)
!58 = !DIEnumerator(name: "HTTP_BAD_REQUEST", value: 400)
!59 = !DIEnumerator(name: "HTTP_NOT_AUTHORIZED", value: 401)
!60 = !DIEnumerator(name: "HTTP_FORBIDDEN", value: 403)
!61 = !DIEnumerator(name: "HTTP_NOT_FOUND", value: 404)
!62 = !DIEnumerator(name: "HTTP_NOT_ALLOWED", value: 405)
!63 = !DIEnumerator(name: "HTTP_TIMEOUT", value: 408)
!64 = !DIEnumerator(name: "HTTP_TOO_LARGE", value: 413)
!65 = !DIEnumerator(name: "HTTP_RANGE_UNSATISFIABLE", value: 416)
!66 = !DIEnumerator(name: "HTTP_I_AM_A_TEAPOT", value: 418)
!67 = !DIEnumerator(name: "HTTP_INTERNAL_ERROR", value: 500)
!68 = !DIEnumerator(name: "HTTP_NOT_IMPLEMENTED", value: 501)
!69 = !DIEnumerator(name: "HTTP_UNAVAILABLE", value: 503)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 167, baseType: !31, size: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "CONN_CORO_ABORT", value: -1)
!73 = !DIEnumerator(name: "CONN_CORO_MAY_RESUME", value: 0)
!74 = !DIEnumerator(name: "CONN_CORO_FINISHED", value: 1)
!75 = !{!76, !79, !80, !85, !87, !88, !91}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !79}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !81, line: 267, baseType: !82)
!81 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !83, line: 207, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!84 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !81, line: 220, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !83, line: 194, baseType: !84)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 46, baseType: !90)
!89 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!90 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !92, line: 56, baseType: !93)
!92 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 152, baseType: !84)
!94 = !{!95, !98, !0, !7, !13, !16, !21}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression(DW_OP_constu, 5, DW_OP_stack_value))
!96 = distinct !DIGlobalVariable(name: "MAX_FAILED_TRIES", scope: !26, file: !2, line: 29, type: !97, isLocal: true, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression(DW_OP_constu, 1400, DW_OP_stack_value))
!99 = distinct !DIGlobalVariable(name: "BUFFER_SIZE", scope: !26, file: !2, line: 30, type: !100, isLocal: true, isDefinition: true)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!101 = !{i32 7, !"Dwarf Version", i32 5}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{i32 1, !"wchar_size", i32 4}
!104 = !{i32 8, !"PIC Level", i32 2}
!105 = !{i32 7, !"PIE Level", i32 2}
!106 = !{i32 7, !"uwtable", i32 2}
!107 = !{i32 7, !"frame-pointer", i32 2}
!108 = !{!"clang version 16.0.0"}
!109 = distinct !DISubprogram(name: "lwan_openat", scope: !2, file: !2, line: 33, type: !110, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !275)
!110 = !DISubroutineType(types: !111)
!111 = !{!31, !112, !31, !255, !31}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_t", file: !30, line: 106, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_request_t_", file: !30, line: 206, size: 1280, elements: !115)
!115 = !{!116, !118, !119, !125, !126, !219, !230, !231, !240}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !114, file: !30, line: 207, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_request_flags_t", file: !30, line: 156, baseType: !29)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !114, file: !30, line: 208, baseType: !31, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !114, file: !30, line: 209, baseType: !120, size: 128, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_value_t", file: !30, line: 110, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_value_t_", file: !30, line: 191, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !121, file: !30, line: 192, baseType: !87, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !121, file: !30, line: 193, baseType: !88, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "original_url", scope: !114, file: !30, line: 210, baseType: !120, size: 128, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !114, file: !30, line: 211, baseType: !127, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !30, line: 112, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !30, line: 196, size: 256, elements: !130)
!130 = !{!131, !133, !134, !139, !217, !218}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !30, line: 199, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !30, line: 165, baseType: !43)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !129, file: !30, line: 200, baseType: !52, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !129, file: !30, line: 201, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !137, line: 34, baseType: !138)
!137 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !137, line: 34, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !129, file: !30, line: 202, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !30, line: 108, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !30, line: 253, size: 832, elements: !143)
!143 = !{!144, !197, !209, !210, !214}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !142, file: !30, line: 254, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !30, line: 103, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !30, line: 275, size: 640, elements: !148)
!148 = !{!149, !173, !174, !181, !185, !196}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !147, file: !30, line: 276, baseType: !150, size: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !151, line: 25, baseType: !152)
!151 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !151, line: 41, size: 128, elements: !153)
!153 = !{!154, !172}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !152, file: !151, line: 42, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !151, line: 26, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !151, line: 29, size: 640, elements: !158)
!158 = !{!159, !163, !171}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !151, line: 30, baseType: !160, size: 512)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 512, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !157, file: !151, line: 31, baseType: !164, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !151, line: 27, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !151, line: 35, size: 192, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !151, line: 36, baseType: !87, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !151, line: 37, baseType: !79, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !151, line: 38, baseType: !164, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !157, file: !151, line: 32, baseType: !31, size: 32, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !152, file: !151, line: 43, baseType: !76, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !147, file: !30, line: 277, baseType: !127, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !147, file: !30, line: 283, baseType: !175, size: 128, offset: 192)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !30, line: 279, size: 128, elements: !176)
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !175, file: !30, line: 280, baseType: !140, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !175, file: !30, line: 281, baseType: !52, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !175, file: !30, line: 282, baseType: !180, size: 16, offset: 96)
!180 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !147, file: !30, line: 285, baseType: !182, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !184, line: 6, flags: DIFlagFwdDecl)
!184 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !147, file: !30, line: 286, baseType: !186, size: 192, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !30, line: 111, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !30, line: 266, size: 192, elements: !188)
!188 = !{!189, !190, !191, !193, !194, !195}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !187, file: !30, line: 267, baseType: !87, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !187, file: !30, line: 268, baseType: !180, size: 16, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !187, file: !30, line: 269, baseType: !192, size: 8, offset: 80)
!192 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !187, file: !30, line: 270, baseType: !192, size: 8, offset: 88)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !187, file: !30, line: 271, baseType: !52, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !187, file: !30, line: 272, baseType: !180, size: 16, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !147, file: !30, line: 287, baseType: !31, size: 32, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !142, file: !30, line: 259, baseType: !198, size: 576, offset: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !142, file: !30, line: 255, size: 576, elements: !199)
!199 = !{!200, !204, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !198, file: !30, line: 256, baseType: !201, size: 240)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 30)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !198, file: !30, line: 257, baseType: !201, size: 240, offset: 240)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !198, file: !30, line: 258, baseType: !206, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !207, line: 10, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !83, line: 160, baseType: !84)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !142, file: !30, line: 261, baseType: !31, size: 32, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !142, file: !30, line: 262, baseType: !211, size: 64, offset: 672)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !142, file: !30, line: 263, baseType: !215, size: 64, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !216, line: 27, baseType: !90)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !30, line: 203, baseType: !31, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !30, line: 203, baseType: !31, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "query_params", scope: !114, file: !30, line: 216, baseType: !220, size: 128, offset: 384)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !30, line: 213, size: 128, elements: !221)
!221 = !{!222, !229}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !220, file: !30, line: 214, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_key_value_t", file: !30, line: 105, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_key_value_t_", file: !30, line: 173, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !225, file: !30, line: 174, baseType: !87, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !225, file: !30, line: 175, baseType: !87, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !220, file: !30, line: 215, baseType: !88, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "post_data", scope: !114, file: !30, line: 216, baseType: !220, size: 128, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !114, file: !30, line: 223, baseType: !232, size: 192, offset: 640)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !30, line: 217, size: 192, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "if_modified_since", scope: !232, file: !30, line: 218, baseType: !206, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !232, file: !30, line: 222, baseType: !236, size: 128, offset: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !232, file: !30, line: 219, size: 128, elements: !237)
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !236, file: !30, line: 220, baseType: !91, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "to", scope: !236, file: !30, line: 221, baseType: !91, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "response", scope: !114, file: !30, line: 224, baseType: !241, size: 448, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_response_t", file: !30, line: 107, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_response_t_", file: !30, line: 178, size: 448, elements: !243)
!243 = !{!244, !262, !263, !264, !265}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !242, file: !30, line: 179, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "strbuf_t", file: !247, line: 25, baseType: !248)
!247 = !DIFile(filename: "common/strbuf.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "1033ae3716fb79c0aa99479d5ab6b6cd")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strbuf_t_", file: !247, line: 27, size: 256, elements: !249)
!249 = !{!250, !256, !261}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !247, line: 31, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !247, line: 28, size: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !251, file: !247, line: 29, baseType: !87, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "static_buffer", scope: !251, file: !247, line: 30, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !248, file: !247, line: 34, baseType: !257, size: 128, offset: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !247, line: 32, size: 128, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !257, file: !247, line: 33, baseType: !88, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !257, file: !247, line: 33, baseType: !88, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !247, line: 35, baseType: !52, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !242, file: !30, line: 180, baseType: !255, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "content_length", scope: !242, file: !30, line: 181, baseType: !88, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !242, file: !30, line: 182, baseType: !223, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !242, file: !30, line: 188, baseType: !266, size: 192, offset: 256)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !30, line: 184, size: 192, elements: !267)
!267 = !{!268, !273, !274}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !266, file: !30, line: 185, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !112, !79}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_http_status_t", file: !30, line: 131, baseType: !51)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !30, line: 186, baseType: !79, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !266, file: !30, line: 187, baseType: !79, size: 64, offset: 128)
!275 = !{}
!276 = !DILocalVariable(name: "request", arg: 1, scope: !109, file: !2, line: 33, type: !112)
!277 = !DILocation(line: 33, column: 29, scope: !109)
!278 = !DILocalVariable(name: "dirfd", arg: 2, scope: !109, file: !2, line: 34, type: !31)
!279 = !DILocation(line: 34, column: 17, scope: !109)
!280 = !DILocalVariable(name: "pathname", arg: 3, scope: !109, file: !2, line: 34, type: !255)
!281 = !DILocation(line: 34, column: 36, scope: !109)
!282 = !DILocalVariable(name: "flags", arg: 4, scope: !109, file: !2, line: 34, type: !31)
!283 = !DILocation(line: 34, column: 50, scope: !109)
!284 = !DILocalVariable(name: "tries", scope: !285, file: !2, line: 36, type: !31)
!285 = distinct !DILexicalBlock(scope: !109, file: !2, line: 36, column: 5)
!286 = !DILocation(line: 36, column: 14, scope: !285)
!287 = !DILocation(line: 36, column: 10, scope: !285)
!288 = !DILocation(line: 36, column: 40, scope: !289)
!289 = distinct !DILexicalBlock(scope: !285, file: !2, line: 36, column: 5)
!290 = !DILocation(line: 36, column: 5, scope: !285)
!291 = !DILocalVariable(name: "fd", scope: !292, file: !2, line: 37, type: !31)
!292 = distinct !DILexicalBlock(scope: !289, file: !2, line: 36, column: 56)
!293 = !DILocation(line: 37, column: 13, scope: !292)
!294 = !DILocation(line: 37, column: 25, scope: !292)
!295 = !DILocation(line: 37, column: 32, scope: !292)
!296 = !DILocation(line: 37, column: 42, scope: !292)
!297 = !DILocation(line: 37, column: 18, scope: !292)
!298 = !DILocation(line: 38, column: 13, scope: !299)
!299 = distinct !DILexicalBlock(scope: !292, file: !2, line: 38, column: 13)
!300 = !DILocation(line: 38, column: 13, scope: !292)
!301 = !DILocation(line: 39, column: 24, scope: !302)
!302 = distinct !DILexicalBlock(scope: !299, file: !2, line: 38, column: 30)
!303 = !DILocation(line: 39, column: 33, scope: !302)
!304 = !DILocation(line: 39, column: 39, scope: !302)
!305 = !DILocation(line: 39, column: 82, scope: !302)
!306 = !DILocation(line: 39, column: 72, scope: !302)
!307 = !DILocation(line: 39, column: 64, scope: !302)
!308 = !DILocation(line: 39, column: 13, scope: !302)
!309 = !DILocation(line: 40, column: 20, scope: !302)
!310 = !DILocation(line: 40, column: 13, scope: !302)
!311 = !DILocation(line: 43, column: 17, scope: !292)
!312 = !DILocation(line: 43, column: 9, scope: !292)
!313 = !DILocation(line: 48, column: 24, scope: !314)
!314 = distinct !DILexicalBlock(scope: !292, file: !2, line: 43, column: 24)
!315 = !DILocation(line: 48, column: 33, scope: !314)
!316 = !DILocation(line: 48, column: 39, scope: !314)
!317 = !DILocation(line: 48, column: 13, scope: !314)
!318 = !DILocation(line: 49, column: 13, scope: !314)
!319 = !DILocation(line: 51, column: 21, scope: !314)
!320 = !DILocation(line: 51, column: 20, scope: !314)
!321 = !DILocation(line: 51, column: 13, scope: !314)
!322 = !DILocation(line: 53, column: 5, scope: !292)
!323 = !DILocation(line: 36, column: 52, scope: !289)
!324 = !DILocation(line: 36, column: 5, scope: !289)
!325 = distinct !{!325, !290, !326, !327}
!326 = !DILocation(line: 53, column: 5, scope: !285)
!327 = !{!"llvm.loop.mustprogress"}
!328 = !DILocation(line: 55, column: 5, scope: !109)
!329 = !DILocation(line: 56, column: 1, scope: !109)
!330 = distinct !DISubprogram(name: "lwan_writev", scope: !2, file: !2, line: 59, type: !331, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !275)
!331 = !DISubroutineType(types: !332)
!332 = !{!85, !112, !333, !31}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !335, line: 26, size: 128, elements: !336)
!335 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !334, file: !335, line: 28, baseType: !79, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !334, file: !335, line: 29, baseType: !88, size: 64, offset: 64)
!339 = !DILocalVariable(name: "request", arg: 1, scope: !330, file: !2, line: 59, type: !112)
!340 = !DILocation(line: 59, column: 29, scope: !330)
!341 = !DILocalVariable(name: "iov", arg: 2, scope: !330, file: !2, line: 59, type: !333)
!342 = !DILocation(line: 59, column: 52, scope: !330)
!343 = !DILocalVariable(name: "iov_count", arg: 3, scope: !330, file: !2, line: 59, type: !31)
!344 = !DILocation(line: 59, column: 61, scope: !330)
!345 = !DILocalVariable(name: "total_written", scope: !330, file: !2, line: 61, type: !85)
!346 = !DILocation(line: 61, column: 13, scope: !330)
!347 = !DILocalVariable(name: "curr_iov", scope: !330, file: !2, line: 62, type: !31)
!348 = !DILocation(line: 62, column: 9, scope: !330)
!349 = !DILocalVariable(name: "tries", scope: !350, file: !2, line: 64, type: !31)
!350 = distinct !DILexicalBlock(scope: !330, file: !2, line: 64, column: 5)
!351 = !DILocation(line: 64, column: 14, scope: !350)
!352 = !DILocation(line: 64, column: 10, scope: !350)
!353 = !DILocation(line: 64, column: 40, scope: !354)
!354 = distinct !DILexicalBlock(scope: !350, file: !2, line: 64, column: 5)
!355 = !DILocation(line: 64, column: 5, scope: !350)
!356 = !DILocalVariable(name: "written", scope: !357, file: !2, line: 65, type: !85)
!357 = distinct !DILexicalBlock(scope: !354, file: !2, line: 64, column: 48)
!358 = !DILocation(line: 65, column: 17, scope: !357)
!359 = !DILocation(line: 65, column: 34, scope: !357)
!360 = !DILocation(line: 65, column: 43, scope: !357)
!361 = !DILocation(line: 65, column: 47, scope: !357)
!362 = !DILocation(line: 65, column: 53, scope: !357)
!363 = !DILocation(line: 65, column: 51, scope: !357)
!364 = !DILocation(line: 65, column: 63, scope: !357)
!365 = !DILocation(line: 65, column: 75, scope: !357)
!366 = !DILocation(line: 65, column: 73, scope: !357)
!367 = !DILocation(line: 65, column: 27, scope: !357)
!368 = !DILocation(line: 66, column: 13, scope: !369)
!369 = distinct !DILexicalBlock(scope: !357, file: !2, line: 66, column: 13)
!370 = !DILocation(line: 66, column: 13, scope: !357)
!371 = !DILocation(line: 68, column: 18, scope: !372)
!372 = distinct !DILexicalBlock(scope: !369, file: !2, line: 66, column: 36)
!373 = !DILocation(line: 70, column: 21, scope: !372)
!374 = !DILocation(line: 70, column: 13, scope: !372)
!375 = !DILocation(line: 73, column: 17, scope: !376)
!376 = distinct !DILexicalBlock(scope: !372, file: !2, line: 70, column: 28)
!377 = !DILocation(line: 75, column: 17, scope: !376)
!378 = !DILocation(line: 79, column: 26, scope: !357)
!379 = !DILocation(line: 79, column: 23, scope: !357)
!380 = !DILocation(line: 81, column: 9, scope: !357)
!381 = !DILocation(line: 81, column: 16, scope: !357)
!382 = !DILocation(line: 81, column: 27, scope: !357)
!383 = !DILocation(line: 81, column: 25, scope: !357)
!384 = !DILocation(line: 81, column: 37, scope: !357)
!385 = !DILocation(line: 81, column: 40, scope: !357)
!386 = !DILocation(line: 81, column: 60, scope: !357)
!387 = !DILocation(line: 81, column: 64, scope: !357)
!388 = !DILocation(line: 81, column: 74, scope: !357)
!389 = !DILocation(line: 81, column: 48, scope: !357)
!390 = !DILocation(line: 0, scope: !357)
!391 = !DILocation(line: 82, column: 33, scope: !392)
!392 = distinct !DILexicalBlock(scope: !357, file: !2, line: 81, column: 83)
!393 = !DILocation(line: 82, column: 37, scope: !392)
!394 = !DILocation(line: 82, column: 47, scope: !392)
!395 = !DILocation(line: 82, column: 21, scope: !392)
!396 = !DILocation(line: 83, column: 21, scope: !392)
!397 = distinct !{!397, !380, !398, !327}
!398 = !DILocation(line: 84, column: 9, scope: !357)
!399 = !DILocation(line: 86, column: 13, scope: !400)
!400 = distinct !DILexicalBlock(scope: !357, file: !2, line: 86, column: 13)
!401 = !DILocation(line: 86, column: 25, scope: !400)
!402 = !DILocation(line: 86, column: 22, scope: !400)
