; ModuleID = '/home/raj/lwan/common/lwan-job.c'
source_filename = "/home/raj/lwan/common/lwan-job.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.list_head = type { %struct.list_node }
%struct.list_node = type { ptr, ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.timespec = type { i64, i64 }
%struct.sched_param = type { i32 }
%struct.job_t = type { %struct.list_node, ptr, ptr }

@running = internal global i8 0, align 1, !dbg !0
@.str = private unnamed_addr constant [9 x i8] c"!running\00", align 1, !dbg !15
@.str.1 = private unnamed_addr constant [33 x i8] c"/home/raj/lwan/common/lwan-job.c\00", align 1, !dbg !21
@__PRETTY_FUNCTION__.lwan_job_thread_init = private unnamed_addr constant [32 x i8] c"void lwan_job_thread_init(void)\00", align 1, !dbg !26
@__FUNCTION__.lwan_job_thread_init = private unnamed_addr constant [21 x i8] c"lwan_job_thread_init\00", align 1, !dbg !32
@.str.2 = private unnamed_addr constant [37 x i8] c"Initializing low priority job thread\00", align 1, !dbg !37
@jobs = internal global %struct.list_head zeroinitializer, align 8, !dbg !95
@self = internal global i64 0, align 8, !dbg !90
@.str.3 = private unnamed_addr constant [15 x i8] c"pthread_create\00", align 1, !dbg !42

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "running", scope: !2, file: !17, line: 41, type: !133, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/raj/lwan/common/lwan-job.c", directory: "/home/raj/lwan/build", checksumkind: CSK_MD5, checksum: "37f1591a76c3166f23ef5ae3b94f9151")
!4 = !{!5, !6, !12}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_node", file: !8, line: 191, size: 128, elements: !9)
!8 = !DIFile(filename: "common/list.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "c0dffb77b1bbbbb179ef8d69b9e1dd8c")
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 193, baseType: !6, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 193, baseType: !6, size: 64, offset: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !{!15, !21, !26, !32, !37, !42, !47, !52, !57, !60, !65, !70, !75, !78, !83, !88, !90, !95, !0, !100}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(scope: null, file: !17, line: 77, type: !18, isLocal: true, isDefinition: true)
!17 = !DIFile(filename: "common/lwan-job.c", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "37f1591a76c3166f23ef5ae3b94f9151")
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 72, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 9)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(scope: null, file: !17, line: 77, type: !23, isLocal: true, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 264, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 33)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(scope: null, file: !17, line: 77, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!30 = !{!31}
!31 = !DISubrange(count: 32)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !17, line: 79, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 168, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 21)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !17, line: 79, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 296, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 37)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(scope: null, file: !17, line: 85, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 120, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 15)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !17, line: 92, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 176, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 22)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !17, line: 98, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 200, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 25)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !17, line: 98, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 200, elements: !55)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(scope: null, file: !17, line: 108, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 104, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 13)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(scope: null, file: !17, line: 115, type: !67, isLocal: true, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 24, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 3)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(scope: null, file: !17, line: 115, type: !72, isLocal: true, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 360, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 45)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(scope: null, file: !17, line: 119, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 104, elements: !63)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !17, line: 119, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 56, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 7)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(scope: null, file: !17, line: 128, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 24)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(scope: null, file: !17, line: 137, type: !72, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "self", scope: !2, file: !17, line: 39, type: !92, isLocal: true, isDefinition: true)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !93, line: 27, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!94 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "jobs", scope: !2, file: !17, line: 42, type: !97, isLocal: true, isDefinition: true)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !8, line: 208, size: 128, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !97, file: !8, line: 210, baseType: !7, size: 128)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "queue_mutex", scope: !2, file: !17, line: 40, type: !102, isLocal: true, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !93, line: 72, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !93, line: 67, size: 320, elements: !104)
!104 = !{!105, !127, !131}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !103, file: !93, line: 69, baseType: !106, size: 320)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !107, line: 22, size: 320, elements: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!108 = !{!109, !111, !113, !114, !115, !116, !118, !119}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !106, file: !107, line: 24, baseType: !110, size: 32)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !106, file: !107, line: 25, baseType: !112, size: 32, offset: 32)
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !106, file: !107, line: 26, baseType: !110, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !106, file: !107, line: 28, baseType: !112, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !106, file: !107, line: 32, baseType: !110, size: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !106, file: !107, line: 34, baseType: !117, size: 16, offset: 160)
!117 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !106, file: !107, line: 35, baseType: !117, size: 16, offset: 176)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !106, file: !107, line: 36, baseType: !120, size: 128, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !121, line: 55, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !121, line: 51, size: 128, elements: !123)
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !122, file: !121, line: 53, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !122, file: !121, line: 54, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !103, file: !93, line: 70, baseType: !128, size: 320)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 320, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 40)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !103, file: !93, line: 71, baseType: !132, size: 64)
!132 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!133 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!134 = !{i32 7, !"Dwarf Version", i32 5}
!135 = !{i32 2, !"Debug Info Version", i32 3}
!136 = !{i32 1, !"wchar_size", i32 4}
!137 = !{i32 8, !"PIC Level", i32 2}
!138 = !{i32 7, !"PIE Level", i32 2}
!139 = !{i32 7, !"uwtable", i32 2}
!140 = !{i32 7, !"frame-pointer", i32 2}
!141 = !{!"clang version 16.0.0"}
!142 = distinct !DISubprogram(name: "lwan_job_thread_init", scope: !17, file: !17, line: 75, type: !143, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{null}
!145 = !{}
!146 = !DILocation(line: 77, column: 5, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !17, line: 77, column: 5)
!148 = distinct !DILexicalBlock(scope: !142, file: !17, line: 77, column: 5)
!149 = !DILocation(line: 77, column: 5, scope: !148)
!150 = !DILocation(line: 79, column: 5, scope: !142)
!151 = !DILocation(line: 81, column: 5, scope: !142)
!152 = !DILocation(line: 83, column: 13, scope: !142)
!153 = !DILocation(line: 84, column: 9, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !17, line: 84, column: 9)
!155 = !DILocation(line: 84, column: 55, scope: !154)
!156 = !DILocation(line: 84, column: 9, scope: !142)
!157 = !DILocation(line: 85, column: 9, scope: !154)
!158 = !DILocalVariable(name: "sched_param", scope: !142, file: !17, line: 88, type: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_param", file: !160, line: 23, size: 32, elements: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_sched_param.h", directory: "", checksumkind: CSK_MD5, checksum: "13c2f29d5f5dc39597ef32d201b78292")
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !159, file: !160, line: 25, baseType: !110, size: 32)
!163 = !DILocation(line: 88, column: 24, scope: !142)
!164 = !DILocation(line: 91, column: 31, scope: !165)
!165 = distinct !DILexicalBlock(scope: !142, file: !17, line: 91, column: 9)
!166 = !DILocation(line: 91, column: 9, scope: !165)
!167 = !DILocation(line: 91, column: 63, scope: !165)
!168 = !DILocation(line: 91, column: 9, scope: !142)
!169 = !DILocation(line: 92, column: 9, scope: !165)
!170 = !DILocation(line: 94, column: 1, scope: !142)
!171 = distinct !DISubprogram(name: "list_head_init", scope: !8, file: !8, line: 309, type: !172, scopeLine: 310, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !145)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!175 = !DILocalVariable(name: "h", arg: 1, scope: !171, file: !8, line: 309, type: !174)
!176 = !DILocation(line: 309, column: 53, scope: !171)
!177 = !DILocation(line: 311, column: 27, scope: !171)
!178 = !DILocation(line: 311, column: 30, scope: !171)
!179 = !DILocation(line: 311, column: 14, scope: !171)
!180 = !DILocation(line: 311, column: 17, scope: !171)
!181 = !DILocation(line: 311, column: 19, scope: !171)
!182 = !DILocation(line: 311, column: 24, scope: !171)
!183 = !DILocation(line: 311, column: 2, scope: !171)
!184 = !DILocation(line: 311, column: 5, scope: !171)
!185 = !DILocation(line: 311, column: 7, scope: !171)
!186 = !DILocation(line: 311, column: 12, scope: !171)
!187 = !DILocation(line: 312, column: 1, scope: !171)
!188 = distinct !DISubprogram(name: "job_thread", scope: !17, file: !17, line: 45, type: !189, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !145)
!189 = !DISubroutineType(types: !190)
!190 = !{!5, !5}
!191 = !DILocalVariable(name: "data", arg: 1, scope: !188, file: !17, line: 45, type: !5)
!192 = !DILocation(line: 45, column: 18, scope: !188)
!193 = !DILocalVariable(name: "rgtp", scope: !188, file: !17, line: 47, type: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !195, line: 11, size: 128, elements: !196)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!196 = !{!197, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !194, file: !195, line: 16, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !199, line: 160, baseType: !132)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !194, file: !195, line: 21, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !199, line: 197, baseType: !132)
!202 = !DILocation(line: 47, column: 21, scope: !188)
!203 = !DILocation(line: 49, column: 5, scope: !188)
!204 = !DILocation(line: 49, column: 12, scope: !188)
!205 = !DILocalVariable(name: "had_job", scope: !206, file: !17, line: 50, type: !133)
!206 = distinct !DILexicalBlock(scope: !188, file: !17, line: 49, column: 21)
!207 = !DILocation(line: 50, column: 14, scope: !206)
!208 = !DILocation(line: 52, column: 13, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !17, line: 52, column: 13)
!210 = !DILocation(line: 52, column: 13, scope: !206)
!211 = !DILocalVariable(name: "job", scope: !212, file: !17, line: 53, type: !213)
!212 = distinct !DILexicalBlock(scope: !209, file: !17, line: 52, column: 56)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "job_t", file: !17, line: 33, size: 256, elements: !215)
!215 = !{!216, !217, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "jobs", scope: !214, file: !17, line: 34, baseType: !7, size: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !214, file: !17, line: 35, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!133, !5}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !17, line: 36, baseType: !5, size: 64, offset: 192)
!222 = !DILocation(line: 53, column: 27, scope: !212)
!223 = !DILocation(line: 55, column: 13, scope: !224)
!224 = distinct !DILexicalBlock(scope: !212, file: !17, line: 55, column: 13)
!225 = !DILocation(line: 55, column: 13, scope: !226)
!226 = distinct !DILexicalBlock(scope: !224, file: !17, line: 55, column: 13)
!227 = !DILocation(line: 56, column: 28, scope: !226)
!228 = !DILocation(line: 56, column: 33, scope: !226)
!229 = !DILocation(line: 56, column: 36, scope: !226)
!230 = !DILocation(line: 56, column: 41, scope: !226)
!231 = !DILocation(line: 56, column: 25, scope: !226)
!232 = !DILocation(line: 56, column: 17, scope: !226)
!233 = distinct !{!233, !223, !234, !235}
!234 = !DILocation(line: 56, column: 45, scope: !224)
!235 = !{!"llvm.loop.mustprogress"}
!236 = !DILocation(line: 58, column: 13, scope: !212)
!237 = !DILocation(line: 59, column: 9, scope: !212)
!238 = !DILocation(line: 61, column: 13, scope: !239)
!239 = distinct !DILexicalBlock(scope: !206, file: !17, line: 61, column: 13)
!240 = !DILocation(line: 61, column: 13, scope: !206)
!241 = !DILocation(line: 62, column: 18, scope: !239)
!242 = !DILocation(line: 62, column: 25, scope: !239)
!243 = !DILocation(line: 62, column: 13, scope: !239)
!244 = !DILocation(line: 63, column: 23, scope: !245)
!245 = distinct !DILexicalBlock(scope: !239, file: !17, line: 63, column: 18)
!246 = !DILocation(line: 63, column: 30, scope: !245)
!247 = !DILocation(line: 63, column: 18, scope: !239)
!248 = !DILocation(line: 64, column: 18, scope: !245)
!249 = !DILocation(line: 64, column: 24, scope: !245)
!250 = !DILocation(line: 64, column: 13, scope: !245)
!251 = !DILocation(line: 66, column: 13, scope: !252)
!252 = distinct !DILexicalBlock(scope: !206, file: !17, line: 66, column: 13)
!253 = !DILocation(line: 66, column: 13, scope: !206)
!254 = !DILocation(line: 67, column: 17, scope: !255)
!255 = distinct !DILexicalBlock(scope: !256, file: !17, line: 67, column: 17)
!256 = distinct !DILexicalBlock(scope: !252, file: !17, line: 66, column: 51)
!257 = !DILocation(line: 67, column: 23, scope: !255)
!258 = !DILocation(line: 67, column: 17, scope: !256)
!259 = !DILocation(line: 68, column: 17, scope: !255)
!260 = !DILocation(line: 69, column: 9, scope: !256)
!261 = distinct !{!261, !203, !262, !235}
!262 = !DILocation(line: 70, column: 5, scope: !188)
!263 = !DILocation(line: 72, column: 5, scope: !188)
!264 = distinct !DISubprogram(name: "lwan_job_thread_shutdown", scope: !17, file: !17, line: 96, type: !143, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !145)
!265 = !DILocation(line: 98, column: 5, scope: !264)
!266 = !DILocation(line: 100, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !264, file: !17, line: 100, column: 9)
!268 = !DILocation(line: 100, column: 9, scope: !264)
!269 = !DILocalVariable(name: "node", scope: !270, file: !17, line: 101, type: !213)
!270 = distinct !DILexicalBlock(scope: !267, file: !17, line: 100, column: 52)
!271 = !DILocation(line: 101, column: 23, scope: !270)
!272 = !DILocalVariable(name: "next", scope: !270, file: !17, line: 101, type: !213)
!273 = !DILocation(line: 101, column: 30, scope: !270)
!274 = !DILocation(line: 102, column: 9, scope: !275)
!275 = distinct !DILexicalBlock(scope: !270, file: !17, line: 102, column: 9)
!276 = !DILocation(line: 102, column: 9, scope: !277)
!277 = distinct !DILexicalBlock(scope: !275, file: !17, line: 102, column: 9)
!278 = !DILocation(line: 103, column: 23, scope: !279)
!279 = distinct !DILexicalBlock(scope: !277, file: !17, line: 102, column: 53)
!280 = !DILocation(line: 103, column: 29, scope: !279)
!281 = !DILocation(line: 103, column: 13, scope: !279)
!282 = !DILocation(line: 104, column: 18, scope: !279)
!283 = !DILocation(line: 104, column: 13, scope: !279)
!284 = !DILocation(line: 105, column: 9, scope: !279)
