; ModuleID = '/home/raj/lwan/common/lwan-status.c'
source_filename = "/home/raj/lwan/common/lwan-status.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@quiet = internal global i8 0, align 1, !dbg !0
@mutex = internal global %union.pthread_mutex_t zeroinitializer, align 8, !dbg !88
@.str = private unnamed_addr constant [19 x i8] c"pthread_mutex_lock\00", align 1, !dbg !30
@stdout = external global ptr, align 8
@.str.1 = private unnamed_addr constant [15 x i8] c"\1B[32;1m%ld\1B[0m\00", align 1, !dbg !36
@.str.2 = private unnamed_addr constant [15 x i8] c" \1B[3m%s:%d\1B[0m\00", align 1, !dbg !41
@.str.3 = private unnamed_addr constant [15 x i8] c" \1B[33m%s()\1B[0m\00", align 1, !dbg !43
@.str.4 = private unnamed_addr constant [2 x i8] c" \00", align 1, !dbg !45
@.str.5 = private unnamed_addr constant [21 x i8] c"pthread_mutex_unlock\00", align 1, !dbg !50
@.str.6 = private unnamed_addr constant [6 x i8] c"\1B[36m\00", align 1, !dbg !55
@.str.7 = private unnamed_addr constant [6 x i8] c"\1B[33m\00", align 1, !dbg !60
@.str.8 = private unnamed_addr constant [8 x i8] c"\1B[31;1m\00", align 1, !dbg !62

!20 = !DIEnumerator(name: "STATUS_WARNING", value: 2)
!21 = !DIEnumerator(name: "STATUS_ERROR", value: 4)
!22 = !DIEnumerator(name: "STATUS_PERROR", value: 8)
!23 = !DIEnumerator(name: "STATUS_CRITICAL", value: 16)
!24 = !DIEnumerator(name: "STATUS_DEBUG", value: 32)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !27, line: 46, baseType: !28)
!27 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!28 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!29 = !{!0, !30, !36, !41, !43, !45, !50, !55, !60, !62, !67, !69, !71, !73, !78, !88}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(scope: null, file: !16, line: 109, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 152, elements: !34)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !{!35}
!35 = !DISubrange(count: 19)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !16, line: 112, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 120, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 15)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !16, line: 113, type: !38, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !16, line: 114, type: !38, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !16, line: 115, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 16, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !16, line: 134, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 168, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 21)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !16, line: 69, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 48, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 6)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(scope: null, file: !16, line: 71, type: !57, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(scope: null, file: !16, line: 73, type: !64, isLocal: true, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 8)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(scope: null, file: !16, line: 75, type: !57, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !16, line: 77, type: !57, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !16, line: 79, type: !57, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(scope: null, file: !16, line: 90, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 40, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 5)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "retval", scope: !80, file: !16, line: 90, type: !83, isLocal: true, isDefinition: true)
!80 = distinct !DISubprogram(name: "get_color_end_for_type", scope: !16, file: !16, line: 87, type: !81, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !87)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !85, !86}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_status_type_t", file: !16, line: 42, baseType: !15)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!87 = !{}
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "mutex", scope: !2, file: !16, line: 45, type: !90, isLocal: true, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !91, line: 72, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !91, line: 67, size: 320, elements: !93)
!93 = !{!94, !114, !118}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !92, file: !91, line: 69, baseType: !95, size: 320)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !96, line: 22, size: 320, elements: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!97 = !{!98, !99, !100, !101, !102, !103, !105, !106}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !95, file: !96, line: 24, baseType: !7, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !95, file: !96, line: 25, baseType: !17, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !95, file: !96, line: 26, baseType: !7, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !95, file: !96, line: 28, baseType: !17, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !95, file: !96, line: 32, baseType: !7, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !95, file: !96, line: 34, baseType: !104, size: 16, offset: 160)
!104 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !95, file: !96, line: 35, baseType: !104, size: 16, offset: 176)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !95, file: !96, line: 36, baseType: !107, size: 128, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !108, line: 55, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !108, line: 51, size: 128, elements: !110)
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !109, file: !108, line: 53, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !109, file: !108, line: 54, baseType: !112, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !92, file: !91, line: 70, baseType: !115, size: 320)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 320, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 40)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !92, file: !91, line: 71, baseType: !119, size: 64)
!119 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !{i32 7, !"Dwarf Version", i32 5}
!123 = !{i32 2, !"Debug Info Version", i32 3}
!124 = !{i32 1, !"wchar_size", i32 4}
!125 = !{i32 8, !"PIC Level", i32 2}
!126 = !{i32 7, !"PIE Level", i32 2}
!127 = !{i32 7, !"uwtable", i32 2}
!128 = !{i32 7, !"frame-pointer", i32 2}
!129 = !{!"clang version 16.0.0"}
!130 = distinct !DISubprogram(name: "lwan_status_init", scope: !16, file: !16, line: 48, type: !131, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_t", file: !6, line: 103, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_t_", file: !6, line: 275, size: 640, elements: !136)
!136 = !{!137, !164, !203, !210, !214, !224}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "url_map_trie", scope: !135, file: !6, line: 276, baseType: !138, size: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_t", file: !139, line: 25, baseType: !140)
!139 = !DIFile(filename: "common/lwan-trie.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "ee6a35f9d72fff2f5550c3424937f5b6")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_t_", file: !139, line: 41, size: 128, elements: !141)
!141 = !{!142, !160}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !140, file: !139, line: 42, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_node_t", file: !139, line: 26, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_node_t_", file: !139, line: 29, size: 640, elements: !146)
!146 = !{!147, !149, !159}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !139, line: 30, baseType: !148, size: 512)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 512, elements: !65)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "leaf", scope: !145, file: !139, line: 31, baseType: !150, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_trie_leaf_t", file: !139, line: 27, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_trie_leaf_t_", file: !139, line: 35, size: 192, elements: !153)
!153 = !{!154, !156, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !152, file: !139, line: 36, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !139, line: 37, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !139, line: 38, baseType: !150, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !145, file: !139, line: 32, baseType: !7, size: 32, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !140, file: !139, line: 43, baseType: !161, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !157}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "conns", scope: !135, file: !6, line: 277, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_t", file: !6, line: 112, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_connection_t_", file: !6, line: 196, size: 256, elements: !168)
!168 = !{!169, !171, !172, !177, !201, !202}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !6, line: 199, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_connection_flags_t", file: !6, line: 165, baseType: !5)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "time_to_die", scope: !167, file: !6, line: 200, baseType: !17, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "coro", scope: !167, file: !6, line: 201, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "coro_t", file: !175, line: 34, baseType: !176)
!175 = !DIFile(filename: "common/lwan-coro.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "34b7f40341e2e8a3481f0400ece0424e")
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "coro_t_", file: !175, line: 34, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !167, file: !6, line: 202, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_thread_t", file: !6, line: 108, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_thread_t_", file: !6, line: 253, size: 832, elements: !181)
!181 = !{!182, !183, !196, !197, !199}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "lwan", scope: !180, file: !6, line: 254, baseType: !133, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !180, file: !6, line: 259, baseType: !184, size: 576, offset: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !180, file: !6, line: 255, size: 576, elements: !185)
!185 = !{!186, !190, !191}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !184, file: !6, line: 256, baseType: !187, size: 240)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 240, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 30)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !184, file: !6, line: 257, baseType: !187, size: 240, offset: 240)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !184, file: !6, line: 258, baseType: !192, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !193, line: 10, baseType: !194)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !195, line: 160, baseType: !119)
!195 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !180, file: !6, line: 261, baseType: !7, size: 32, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pipe_fd", scope: !180, file: !6, line: 262, baseType: !198, size: 64, offset: 672)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !48)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !180, file: !6, line: 263, baseType: !200, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !91, line: 27, baseType: !28)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !167, file: !6, line: 203, baseType: !7, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !6, line: 203, baseType: !7, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !135, file: !6, line: 283, baseType: !204, size: 128, offset: 192)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !135, file: !6, line: 279, size: 128, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !204, file: !6, line: 280, baseType: !178, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "max_fd", scope: !204, file: !6, line: 281, baseType: !17, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !204, file: !6, line: 282, baseType: !209, size: 16, offset: 96)
!209 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "module_registry", scope: !135, file: !6, line: 285, baseType: !211, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash", file: !213, line: 6, flags: DIFlagFwdDecl)
!213 = !DIFile(filename: "common/hash.h", directory: "/home/raj/lwan", checksumkind: CSK_MD5, checksum: "8a7f0d7c578de44c7172c81fd9e8cd22")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !135, file: !6, line: 286, baseType: !215, size: 192, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "lwan_config_t", file: !6, line: 111, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lwan_config_t_", file: !6, line: 266, size: 192, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !216, file: !6, line: 267, baseType: !155, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive_timeout", scope: !216, file: !6, line: 268, baseType: !209, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !216, file: !6, line: 269, baseType: !121, size: 8, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_port", scope: !216, file: !6, line: 270, baseType: !121, size: 8, offset: 88)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !216, file: !6, line: 271, baseType: !17, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "n_threads", scope: !216, file: !6, line: 272, baseType: !209, size: 16, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "main_socket", scope: !135, file: !6, line: 287, baseType: !7, size: 32, offset: 576)
!225 = !DILocalVariable(name: "l", arg: 1, scope: !130, file: !16, line: 48, type: !133)
!226 = !DILocation(line: 48, column: 26, scope: !130)
!227 = !DILocation(line: 53, column: 11, scope: !130)
!228 = !DILocation(line: 54, column: 12, scope: !130)
!229 = !DILocation(line: 56, column: 1, scope: !130)
!230 = distinct !DISubprogram(name: "lwan_status_shutdown", scope: !16, file: !16, line: 59, type: !131, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!231 = !DILocalVariable(name: "l", arg: 1, scope: !230, file: !16, line: 59, type: !133)
!232 = !DILocation(line: 59, column: 30, scope: !230)
!233 = !DILocation(line: 61, column: 1, scope: !230)
!234 = distinct !DISubprogram(name: "lwan_status_debug_debug", scope: !16, file: !16, line: 188, type: !235, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !83, !237, !83, !83, null}
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!238 = !DILocalVariable(name: "file", arg: 1, scope: !234, file: !16, line: 188, type: !83)
!239 = !DILocation(line: 188, column: 1, scope: !234)
!240 = !DILocalVariable(name: "line", arg: 2, scope: !234, file: !16, line: 188, type: !237)
!241 = !DILocalVariable(name: "func", arg: 3, scope: !234, file: !16, line: 188, type: !83)
!242 = !DILocalVariable(name: "fmt", arg: 4, scope: !234, file: !16, line: 188, type: !83)
!243 = !DILocation(line: 188, column: 1, scope: !244)
!244 = distinct !DILexicalBlock(scope: !234, file: !16, line: 188, column: 1)
!245 = !DILocalVariable(name: "values", scope: !246, file: !16, line: 188, type: !247)
!246 = distinct !DILexicalBlock(scope: !244, file: !16, line: 188, column: 1)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !248, line: 52, baseType: !249)
!248 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !250, line: 14, baseType: !251)
!250 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stdarg.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !252, baseType: !253)
!252 = !DIFile(filename: "common/lwan-status.c", directory: "/home/raj/lwan")
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 192, elements: !260)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !254, file: !252, line: 188, baseType: !17, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !254, file: !252, line: 188, baseType: !17, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !254, file: !252, line: 188, baseType: !157, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !254, file: !252, line: 188, baseType: !157, size: 64, offset: 128)
!260 = !{!261}
!261 = !DISubrange(count: 1)
!262 = !DILocation(line: 188, column: 1, scope: !246)
!263 = distinct !DISubprogram(name: "status_out", scope: !16, file: !16, line: 141, type: !264, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !87)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !83, !237, !83, !85, !83, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!267 = !DILocalVariable(name: "file", arg: 1, scope: !263, file: !16, line: 141, type: !83)
!268 = !DILocation(line: 141, column: 24, scope: !263)
!269 = !DILocalVariable(name: "line", arg: 2, scope: !263, file: !16, line: 141, type: !237)
!270 = !DILocation(line: 141, column: 40, scope: !263)
!271 = !DILocalVariable(name: "func", arg: 3, scope: !263, file: !16, line: 141, type: !83)
!272 = !DILocation(line: 141, column: 58, scope: !263)
!273 = !DILocalVariable(name: "type", arg: 4, scope: !263, file: !16, line: 142, type: !85)
!274 = !DILocation(line: 142, column: 32, scope: !263)
!275 = !DILocalVariable(name: "fmt", arg: 5, scope: !263, file: !16, line: 142, type: !83)
!276 = !DILocation(line: 142, column: 50, scope: !263)
!277 = !DILocalVariable(name: "values", arg: 6, scope: !263, file: !16, line: 142, type: !266)
!278 = !DILocation(line: 142, column: 63, scope: !263)
!279 = !DILocalVariable(name: "output", scope: !263, file: !16, line: 145, type: !155)
!280 = !DILocation(line: 145, column: 11, scope: !263)
!281 = !DILocalVariable(name: "len", scope: !263, file: !16, line: 146, type: !7)
!282 = !DILocation(line: 146, column: 9, scope: !263)
!283 = !DILocation(line: 148, column: 30, scope: !263)
!284 = !DILocation(line: 148, column: 35, scope: !263)
!285 = !DILocation(line: 148, column: 11, scope: !263)
!286 = !DILocation(line: 148, column: 9, scope: !263)
!287 = !DILocation(line: 149, column: 9, scope: !288)
!288 = distinct !DILexicalBlock(scope: !263, file: !16, line: 149, column: 9)
!289 = !DILocation(line: 149, column: 13, scope: !288)
!290 = !DILocation(line: 149, column: 9, scope: !263)
!291 = !DILocation(line: 153, column: 24, scope: !292)
!292 = distinct !DILexicalBlock(scope: !288, file: !16, line: 149, column: 19)
!293 = !DILocation(line: 153, column: 30, scope: !292)
!294 = !DILocation(line: 153, column: 36, scope: !292)
!295 = !DILocation(line: 153, column: 42, scope: !292)
!296 = !DILocation(line: 153, column: 48, scope: !292)
!297 = !DILocation(line: 153, column: 64, scope: !292)
!298 = !DILocation(line: 153, column: 56, scope: !292)
!299 = !DILocation(line: 153, column: 9, scope: !292)
!300 = !DILocation(line: 155, column: 14, scope: !292)
!301 = !DILocation(line: 155, column: 9, scope: !292)
!302 = !DILocation(line: 156, column: 5, scope: !292)
!303 = !DILocation(line: 157, column: 1, scope: !263)
!304 = distinct !DISubprogram(name: "lwan_status_info_debug", scope: !16, file: !16, line: 191, type: !235, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!305 = !DILocalVariable(name: "file", arg: 1, scope: !304, file: !16, line: 191, type: !83)
!306 = !DILocation(line: 191, column: 1, scope: !304)
!307 = !DILocalVariable(name: "line", arg: 2, scope: !304, file: !16, line: 191, type: !237)
!308 = !DILocalVariable(name: "func", arg: 3, scope: !304, file: !16, line: 191, type: !83)
!309 = !DILocalVariable(name: "fmt", arg: 4, scope: !304, file: !16, line: 191, type: !83)
!310 = !DILocation(line: 191, column: 1, scope: !311)
!311 = distinct !DILexicalBlock(scope: !304, file: !16, line: 191, column: 1)
!312 = !DILocalVariable(name: "values", scope: !313, file: !16, line: 191, type: !247)
!313 = distinct !DILexicalBlock(scope: !311, file: !16, line: 191, column: 1)
!314 = !DILocation(line: 191, column: 1, scope: !313)
