; ModuleID = '/home/raj/lwan/common/lwan-config.c'
source_filename = "/home/raj/lwan/common/lwan-config.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.config_t_ = type { ptr, i32, ptr }
%struct.config_line_t_ = type { %union.anon, i32, [1024 x i8] }
%union.anon = type { %struct.anon }
%struct.anon = type { ptr, ptr }
%struct.anon.0 = type { ptr, ptr }

@.str = private unnamed_addr constant [5 x i8] c"%u%c\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [36 x i8] c"/home/raj/lwan/common/lwan-config.c\00", align 1, !dbg !7
@__FUNCTION__.parse_time_period = private unnamed_addr constant [18 x i8] c"parse_time_period\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [32 x i8] c"Ignoring unknown multiplier: %c\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [5 x i8] c"true\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [2 x i8] c"1\00", align 1, !dbg !25
@.str.5 = private unnamed_addr constant [3 x i8] c"on\00", align 1, !dbg !30
@.str.6 = private unnamed_addr constant [4 x i8] c"yes\00", align 1, !dbg !35
@.str.7 = private unnamed_addr constant [6 x i8] c"false\00", align 1, !dbg !40
@.str.8 = private unnamed_addr constant [2 x i8] c"0\00", align 1, !dbg !45
@.str.9 = private unnamed_addr constant [4 x i8] c"off\00", align 1, !dbg !47

!187 = !DILocation(line: 63, column: 41, scope: !180)
!188 = !DILocation(line: 65, column: 10, scope: !189)
!189 = distinct !DILexicalBlock(scope: !180, file: !2, line: 65, column: 9)
!190 = !DILocation(line: 65, column: 9, scope: !180)
!191 = !DILocation(line: 66, column: 16, scope: !189)
!192 = !DILocation(line: 66, column: 9, scope: !189)
!193 = !DILocation(line: 68, column: 17, scope: !194)
!194 = distinct !DILexicalBlock(scope: !180, file: !2, line: 68, column: 9)
!195 = !DILocation(line: 68, column: 10, scope: !194)
!196 = !DILocation(line: 68, column: 32, scope: !194)
!197 = !DILocation(line: 68, column: 43, scope: !194)
!198 = !DILocation(line: 68, column: 36, scope: !194)
!199 = !DILocation(line: 69, column: 13, scope: !194)
!200 = !DILocation(line: 69, column: 24, scope: !194)
!201 = !DILocation(line: 69, column: 17, scope: !194)
!202 = !DILocation(line: 69, column: 37, scope: !194)
!203 = !DILocation(line: 69, column: 48, scope: !194)
!204 = !DILocation(line: 69, column: 41, scope: !194)
!205 = !DILocation(line: 68, column: 9, scope: !180)
!206 = !DILocation(line: 70, column: 9, scope: !194)
!207 = !DILocation(line: 72, column: 17, scope: !208)
!208 = distinct !DILexicalBlock(scope: !180, file: !2, line: 72, column: 9)
!209 = !DILocation(line: 72, column: 10, scope: !208)
!210 = !DILocation(line: 72, column: 33, scope: !208)
!211 = !DILocation(line: 72, column: 44, scope: !208)
!212 = !DILocation(line: 72, column: 37, scope: !208)
!213 = !DILocation(line: 73, column: 13, scope: !208)
!214 = !DILocation(line: 73, column: 24, scope: !208)
!215 = !DILocation(line: 73, column: 17, scope: !208)
!216 = !DILocation(line: 73, column: 38, scope: !208)
!217 = !DILocation(line: 73, column: 49, scope: !208)
!218 = !DILocation(line: 73, column: 42, scope: !208)
!219 = !DILocation(line: 72, column: 9, scope: !180)
!220 = !DILocation(line: 74, column: 9, scope: !208)
!221 = !DILocation(line: 76, column: 12, scope: !180)
!222 = !DILocation(line: 76, column: 5, scope: !180)
!223 = !DILocation(line: 77, column: 1, scope: !180)
!224 = distinct !DISubprogram(name: "parse_long", scope: !2, file: !2, line: 79, type: !225, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !68, retainedNodes: !110)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !94, !227}
!227 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!228 = !DILocalVariable(name: "value", arg: 1, scope: !224, file: !2, line: 79, type: !94)
!229 = !DILocation(line: 79, column: 29, scope: !224)
!230 = !DILocalVariable(name: "default_value", arg: 2, scope: !224, file: !2, line: 79, type: !227)
!231 = !DILocation(line: 79, column: 41, scope: !224)
!232 = !DILocalVariable(name: "endptr", scope: !224, file: !2, line: 81, type: !97)
!233 = !DILocation(line: 81, column: 11, scope: !224)
!234 = !DILocalVariable(name: "parsed", scope: !224, file: !2, line: 82, type: !227)
!235 = !DILocation(line: 82, column: 10, scope: !224)
!236 = !DILocation(line: 84, column: 5, scope: !224)
!237 = !DILocation(line: 84, column: 11, scope: !224)
!238 = !DILocation(line: 85, column: 21, scope: !224)
!239 = !DILocation(line: 85, column: 14, scope: !224)
!240 = !DILocation(line: 85, column: 12, scope: !224)
!241 = !DILocation(line: 87, column: 9, scope: !242)
!242 = distinct !DILexicalBlock(scope: !224, file: !2, line: 87, column: 9)
!243 = !DILocation(line: 87, column: 15, scope: !242)
!244 = !DILocation(line: 87, column: 9, scope: !224)
!245 = !DILocation(line: 88, column: 16, scope: !242)
!246 = !DILocation(line: 88, column: 9, scope: !242)
!247 = !DILocation(line: 90, column: 10, scope: !248)
!248 = distinct !DILexicalBlock(scope: !224, file: !2, line: 90, column: 9)
!249 = !DILocation(line: 90, column: 9, scope: !248)
!250 = !DILocation(line: 90, column: 17, scope: !248)
!251 = !DILocation(line: 90, column: 25, scope: !248)
!252 = !DILocation(line: 90, column: 28, scope: !248)
!253 = !DILocation(line: 90, column: 37, scope: !248)
!254 = !DILocation(line: 90, column: 34, scope: !248)
!255 = !DILocation(line: 90, column: 9, scope: !224)
!256 = !DILocation(line: 91, column: 16, scope: !248)
!257 = !DILocation(line: 91, column: 9, scope: !248)
!258 = !DILocation(line: 93, column: 12, scope: !224)
!259 = !DILocation(line: 93, column: 5, scope: !224)
!260 = !DILocation(line: 94, column: 1, scope: !224)
!261 = distinct !DISubprogram(name: "config_error", scope: !2, file: !2, line: 96, type: !262, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !68, retainedNodes: !110)
!262 = !DISubroutineType(types: !263)
!263 = !{!183, !264, !94, null}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_t", file: !72, line: 32, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_t_", file: !72, line: 41, size: 192, elements: !267)
!267 = !{!268, !327, !328}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !266, file: !72, line: 42, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !271, line: 7, baseType: !272)
!271 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !273, line: 49, size: 1728, elements: !274)
!273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !290, !292, !293, !294, !297, !298, !300, !304, !307, !309, !312, !315, !316, !318, !322, !323}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !272, file: !273, line: 51, baseType: !95, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !272, file: !273, line: 54, baseType: !97, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !272, file: !273, line: 55, baseType: !97, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !272, file: !273, line: 56, baseType: !97, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !272, file: !273, line: 57, baseType: !97, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !272, file: !273, line: 58, baseType: !97, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !272, file: !273, line: 59, baseType: !97, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !272, file: !273, line: 60, baseType: !97, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !272, file: !273, line: 61, baseType: !97, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !272, file: !273, line: 64, baseType: !97, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !272, file: !273, line: 65, baseType: !97, size: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !272, file: !273, line: 66, baseType: !97, size: 64, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !272, file: !273, line: 68, baseType: !288, size: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !273, line: 36, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !272, file: !273, line: 70, baseType: !291, size: 64, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !272, file: !273, line: 72, baseType: !95, size: 32, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !272, file: !273, line: 73, baseType: !95, size: 32, offset: 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !272, file: !273, line: 74, baseType: !295, size: 64, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !296, line: 152, baseType: !227)
!296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !272, file: !273, line: 77, baseType: !96, size: 16, offset: 1024)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !272, file: !273, line: 78, baseType: !299, size: 8, offset: 1040)
!299 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !272, file: !273, line: 79, baseType: !301, size: 8, offset: 1048)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 1)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !272, file: !273, line: 81, baseType: !305, size: 64, offset: 1088)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !273, line: 43, baseType: null)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !272, file: !273, line: 89, baseType: !308, size: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !296, line: 153, baseType: !227)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !272, file: !273, line: 91, baseType: !310, size: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !273, line: 37, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !272, file: !273, line: 92, baseType: !313, size: 64, offset: 1280)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !273, line: 38, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !272, file: !273, line: 93, baseType: !291, size: 64, offset: 1344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !272, file: !273, line: 94, baseType: !317, size: 64, offset: 1408)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !272, file: !273, line: 95, baseType: !319, size: 64, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !320, line: 46, baseType: !321)
!320 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!321 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !272, file: !273, line: 96, baseType: !95, size: 32, offset: 1536)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !272, file: !273, line: 98, baseType: !324, size: 160, offset: 1568)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 20)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !266, file: !72, line: 43, baseType: !95, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "error_message", scope: !266, file: !72, line: 44, baseType: !97, size: 64, offset: 128)
!329 = !DILocalVariable(name: "conf", arg: 1, scope: !261, file: !2, line: 96, type: !264)
!330 = !DILocation(line: 96, column: 29, scope: !261)
!331 = !DILocalVariable(name: "fmt", arg: 2, scope: !261, file: !2, line: 96, type: !94)
!332 = !DILocation(line: 96, column: 47, scope: !261)
!333 = !DILocalVariable(name: "values", scope: !261, file: !2, line: 98, type: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !335, line: 52, baseType: !336)
!335 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !337, line: 14, baseType: !338)
!337 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stdarg.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !339, baseType: !340)
!339 = !DIFile(filename: "common/lwan-config.c", directory: "/home/raj/lwan")
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 192, elements: !302)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !341, file: !339, line: 98, baseType: !73, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !341, file: !339, line: 98, baseType: !73, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !341, file: !339, line: 98, baseType: !317, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !341, file: !339, line: 98, baseType: !317, size: 64, offset: 128)
!347 = !DILocation(line: 98, column: 13, scope: !261)
!348 = !DILocalVariable(name: "len", scope: !261, file: !2, line: 99, type: !95)
!349 = !DILocation(line: 99, column: 9, scope: !261)
!350 = !DILocalVariable(name: "output", scope: !261, file: !2, line: 100, type: !97)
!351 = !DILocation(line: 100, column: 11, scope: !261)
!352 = !DILocation(line: 102, column: 9, scope: !353)
!353 = distinct !DILexicalBlock(scope: !261, file: !2, line: 102, column: 9)
!354 = !DILocation(line: 102, column: 15, scope: !353)
!355 = !DILocation(line: 102, column: 9, scope: !261)
!356 = !DILocation(line: 103, column: 9, scope: !353)
!357 = !DILocation(line: 105, column: 5, scope: !261)
!358 = !DILocation(line: 106, column: 30, scope: !261)
!359 = !DILocation(line: 106, column: 35, scope: !261)
!360 = !DILocation(line: 106, column: 11, scope: !261)
!361 = !DILocation(line: 106, column: 9, scope: !261)
!362 = !DILocation(line: 107, column: 5, scope: !261)
!363 = !DILocation(line: 109, column: 9, scope: !364)
!364 = distinct !DILexicalBlock(scope: !261, file: !2, line: 109, column: 9)
!365 = !DILocation(line: 109, column: 13, scope: !364)
!366 = !DILocation(line: 109, column: 9, scope: !261)
!367 = !DILocation(line: 110, column: 31, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !2, line: 109, column: 19)
!369 = !DILocation(line: 110, column: 9, scope: !368)
!370 = !DILocation(line: 110, column: 15, scope: !368)
!371 = !DILocation(line: 110, column: 29, scope: !368)
!372 = !DILocation(line: 111, column: 9, scope: !368)
!373 = !DILocation(line: 114, column: 5, scope: !261)
!374 = !DILocation(line: 114, column: 11, scope: !261)
!375 = !DILocation(line: 114, column: 25, scope: !261)
!376 = !DILocation(line: 115, column: 5, scope: !261)
!377 = !DILocation(line: 116, column: 1, scope: !261)
!378 = distinct !DISubprogram(name: "config_read_line", scope: !2, file: !2, line: 183, type: !379, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !68, retainedNodes: !110)
!379 = !DISubroutineType(types: !380)
!380 = !{!183, !264, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_line_t", file: !72, line: 33, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_line_t_", file: !72, line: 47, size: 8384, elements: !384)
!384 = !{!385, !398, !400}
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !383, file: !72, line: 48, baseType: !386, size: 128)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !72, line: 48, size: 128, elements: !387)
!387 = !{!388, !393}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !386, file: !72, line: 51, baseType: !389, size: 128)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !72, line: 49, size: 128, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !72, line: 50, baseType: !97, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !389, file: !72, line: 50, baseType: !97, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !386, file: !72, line: 54, baseType: !394, size: 128)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !72, line: 52, size: 128, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !394, file: !72, line: 53, baseType: !97, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !394, file: !72, line: 53, baseType: !97, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !72, line: 56, baseType: !399, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_line_type_t", file: !72, line: 39, baseType: !71)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !383, file: !72, line: 57, baseType: !401, size: 8192, offset: 160)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 1024)
!404 = !DILocalVariable(name: "conf", arg: 1, scope: !378, file: !2, line: 183, type: !264)
!405 = !DILocation(line: 183, column: 33, scope: !378)
!406 = !DILocalVariable(name: "l", arg: 2, scope: !378, file: !2, line: 183, type: !381)
!407 = !DILocation(line: 183, column: 54, scope: !378)
!408 = !DILocalVariable(name: "line", scope: !378, file: !2, line: 185, type: !97)
!409 = !DILocation(line: 185, column: 11, scope: !378)
!410 = !DILocalVariable(name: "line_end", scope: !378, file: !2, line: 185, type: !97)
!411 = !DILocation(line: 185, column: 18, scope: !378)
!412 = !DILocation(line: 187, column: 9, scope: !413)
!413 = distinct !DILexicalBlock(scope: !378, file: !2, line: 187, column: 9)
!414 = !DILocation(line: 187, column: 15, scope: !413)
!415 = !DILocation(line: 187, column: 9, scope: !378)
!416 = !DILocation(line: 188, column: 9, scope: !413)
!417 = !DILabel(scope: !378, name: "retry", file: !2, line: 190)
!418 = !DILocation(line: 190, column: 1, scope: !378)
!419 = !DILocation(line: 191, column: 16, scope: !420)
!420 = distinct !DILexicalBlock(scope: !378, file: !2, line: 191, column: 9)
!421 = !DILocation(line: 191, column: 19, scope: !420)
!422 = !DILocation(line: 191, column: 46, scope: !420)
!423 = !DILocation(line: 191, column: 52, scope: !420)
!424 = !DILocation(line: 191, column: 10, scope: !420)
!425 = !DILocation(line: 191, column: 9, scope: !378)
!426 = !DILocation(line: 192, column: 9, scope: !420)
!427 = !DILocation(line: 194, column: 5, scope: !378)
!428 = !DILocation(line: 194, column: 11, scope: !378)
!429 = !DILocation(line: 194, column: 15, scope: !378)
!430 = !DILocation(line: 196, column: 28, scope: !378)
!431 = !DILocation(line: 196, column: 31, scope: !378)
!432 = !DILocation(line: 196, column: 12, scope: !378)
!433 = !DILocation(line: 196, column: 10, scope: !378)
!434 = !DILocation(line: 197, column: 34, scope: !378)
!435 = !DILocation(line: 197, column: 12, scope: !378)
!436 = !DILocation(line: 197, column: 10, scope: !378)
!437 = !DILocation(line: 198, column: 35, scope: !378)
!438 = !DILocation(line: 198, column: 12, scope: !378)
!439 = !DILocation(line: 198, column: 10, scope: !378)
!440 = !DILocation(line: 199, column: 30, scope: !378)
!441 = !DILocation(line: 199, column: 16, scope: !378)
!442 = !DILocation(line: 199, column: 14, scope: !378)
!443 = !DILocation(line: 201, column: 10, scope: !444)
!444 = distinct !DILexicalBlock(scope: !378, file: !2, line: 201, column: 9)
!445 = !DILocation(line: 201, column: 9, scope: !444)
!446 = !DILocation(line: 201, column: 19, scope: !444)
!447 = !DILocation(line: 201, column: 9, scope: !378)
!448 = !DILocation(line: 202, column: 28, scope: !449)
!449 = distinct !DILexicalBlock(scope: !450, file: !2, line: 202, column: 13)
!450 = distinct !DILexicalBlock(scope: !444, file: !2, line: 201, column: 27)
!451 = !DILocation(line: 202, column: 34, scope: !449)
!452 = !DILocation(line: 202, column: 14, scope: !449)
!453 = !DILocation(line: 202, column: 13, scope: !450)
!454 = !DILocation(line: 203, column: 26, scope: !455)
!455 = distinct !DILexicalBlock(scope: !449, file: !2, line: 202, column: 38)
!456 = !DILocation(line: 203, column: 13, scope: !455)
!457 = !DILocation(line: 204, column: 13, scope: !455)
!458 = !DILocation(line: 206, column: 5, scope: !450)
!459 = !DILocation(line: 206, column: 17, scope: !460)
!460 = distinct !DILexicalBlock(scope: !444, file: !2, line: 206, column: 16)
!461 = !DILocation(line: 206, column: 16, scope: !460)
!462 = !DILocation(line: 206, column: 22, scope: !460)
!463 = !DILocation(line: 206, column: 16, scope: !444)
!464 = !DILocation(line: 207, column: 9, scope: !465)
!465 = distinct !DILexicalBlock(scope: !460, file: !2, line: 206, column: 31)
