; ModuleID = './fc-cat/fc-cat.c'
source_filename = "./fc-cat/fc-cat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._FcFontSet = type { i32, i32, ptr }

@.str = private unnamed_addr constant [8 x i8] c"version\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [8 x i8] c"verbose\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [8 x i8] c"recurse\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [5 x i8] c"help\00", align 1, !dbg !11
@longopts = dso_local constant [5 x %struct.option] [%struct.option { ptr @.str, i32 0, ptr null, i32 86 }, %struct.option { ptr @.str.1, i32 0, ptr null, i32 118 }, %struct.option { ptr @.str.2, i32 0, ptr null, i32 114 }, %struct.option { ptr @.str.3, i32 0, ptr null, i32 104 }, %struct.option zeroinitializer], align 16, !dbg !16
@.str.4 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !30
@.str.5 = private unnamed_addr constant [5 x i8] c"Vvrh\00", align 1, !dbg !35
@stderr = external global ptr, align 8
@.str.6 = private unnamed_addr constant [29 x i8] c"fontconfig version %d.%d.%d\0A\00", align 1, !dbg !37
@optind = external global i32, align 4

!45 = !{!46}
!46 = !DISubrange(count: 42)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 318, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 20)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !2, line: 369, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 34)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 2)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(scope: null, file: !2, line: 387, type: !54, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 162, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 69)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !13, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 38)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 36)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 37)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 44)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 52)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 35)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 61)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(scope: null, file: !2, line: 177, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 51)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !13, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 239, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 11)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 242, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 3)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 9)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 1280, elements: !14)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !131, line: 50, size: 256, elements: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!132 = !{!133, !136, !138, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !131, line: 52, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !130, file: !131, line: 55, baseType: !137, size: 32, offset: 64)
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !131, line: 56, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !130, file: !131, line: 57, baseType: !137, size: 32, offset: 192)
!141 = !{i32 7, !"Dwarf Version", i32 5}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{i32 1, !"wchar_size", i32 4}
!144 = !{i32 8, !"PIC Level", i32 2}
!145 = !{i32 7, !"PIE Level", i32 2}
!146 = !{i32 7, !"uwtable", i32 2}
!147 = !{i32 7, !"frame-pointer", i32 2}
!148 = !{!"clang version 16.0.0"}
!149 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 260, type: !150, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !153)
!150 = !DISubroutineType(types: !151)
!151 = !{!137, !137, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!153 = !{}
!154 = !DILocalVariable(name: "argc", arg: 1, scope: !149, file: !2, line: 260, type: !137)
!155 = !DILocation(line: 260, column: 11, scope: !149)
!156 = !DILocalVariable(name: "argv", arg: 2, scope: !149, file: !2, line: 260, type: !152)
!157 = !DILocation(line: 260, column: 24, scope: !149)
!158 = !DILocalVariable(name: "i", scope: !149, file: !2, line: 262, type: !137)
!159 = !DILocation(line: 262, column: 10, scope: !149)
!160 = !DILocalVariable(name: "ret", scope: !149, file: !2, line: 263, type: !137)
!161 = !DILocation(line: 263, column: 10, scope: !149)
!162 = !DILocalVariable(name: "fs", scope: !149, file: !2, line: 264, type: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcFontSet", file: !24, line: 281, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FcFontSet", file: !24, line: 277, size: 128, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nfont", scope: !165, file: !24, line: 278, baseType: !137, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sfont", scope: !165, file: !24, line: 279, baseType: !137, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fonts", scope: !165, file: !24, line: 280, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcPattern", file: !24, line: 251, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FcPattern", file: !24, line: 251, flags: DIFlagFwdDecl)
!174 = !DILocation(line: 264, column: 16, scope: !149)
!175 = !DILocalVariable(name: "dirs", scope: !149, file: !2, line: 265, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcStrSet", file: !24, line: 333, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FcStrSet", file: !24, line: 333, flags: DIFlagFwdDecl)
!179 = !DILocation(line: 265, column: 18, scope: !149)
!180 = !DILocalVariable(name: "args", scope: !149, file: !2, line: 266, type: !176)
!181 = !DILocation(line: 266, column: 15, scope: !149)
!182 = !DILocalVariable(name: "arglist", scope: !149, file: !2, line: 267, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcStrList", file: !24, line: 331, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FcStrList", file: !24, line: 331, flags: DIFlagFwdDecl)
!186 = !DILocation(line: 267, column: 16, scope: !149)
!187 = !DILocalVariable(name: "cache", scope: !149, file: !2, line: 268, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcCache", file: !24, line: 335, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FcCache", file: !24, line: 335, flags: DIFlagFwdDecl)
!191 = !DILocation(line: 268, column: 14, scope: !149)
!192 = !DILocalVariable(name: "config", scope: !149, file: !2, line: 269, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcConfig", file: !24, line: 325, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_FcConfig", file: !24, line: 325, flags: DIFlagFwdDecl)
!196 = !DILocation(line: 269, column: 15, scope: !149)
!197 = !DILocalVariable(name: "arg", scope: !149, file: !2, line: 270, type: !27)
!198 = !DILocation(line: 270, column: 14, scope: !149)
!199 = !DILocalVariable(name: "verbose", scope: !149, file: !2, line: 271, type: !137)
!200 = !DILocation(line: 271, column: 10, scope: !149)
!201 = !DILocalVariable(name: "recurse", scope: !149, file: !2, line: 272, type: !137)
!202 = !DILocation(line: 272, column: 10, scope: !149)
!203 = !DILocalVariable(name: "first", scope: !149, file: !2, line: 273, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "FcBool", file: !24, line: 46, baseType: !137)
!205 = !DILocation(line: 273, column: 12, scope: !149)
!206 = !DILocalVariable(name: "c", scope: !149, file: !2, line: 275, type: !137)
!207 = !DILocation(line: 275, column: 10, scope: !149)
!208 = !DILocation(line: 277, column: 5, scope: !149)
!209 = !DILocation(line: 279, column: 5, scope: !149)
!210 = !DILocation(line: 279, column: 30, scope: !149)
!211 = !DILocation(line: 279, column: 36, scope: !149)
!212 = !DILocation(line: 279, column: 17, scope: !149)
!213 = !DILocation(line: 279, column: 15, scope: !149)
!214 = !DILocation(line: 279, column: 67, scope: !149)
!215 = !DILocation(line: 284, column: 10, scope: !216)
!216 = distinct !DILexicalBlock(scope: !149, file: !2, line: 283, column: 5)
!217 = !DILocation(line: 284, column: 2, scope: !216)
!218 = !DILocation(line: 286, column: 15, scope: !219)
!219 = distinct !DILexicalBlock(scope: !216, file: !2, line: 284, column: 13)
!220 = !DILocation(line: 286, column: 6, scope: !219)
!221 = !DILocation(line: 288, column: 6, scope: !219)
!222 = !DILocation(line: 290, column: 13, scope: !219)
!223 = !DILocation(line: 291, column: 6, scope: !219)
!224 = !DILocation(line: 293, column: 13, scope: !219)
!225 = !DILocation(line: 294, column: 6, scope: !219)
!226 = !DILocation(line: 296, column: 13, scope: !219)
!227 = !DILocation(line: 296, column: 6, scope: !219)
!228 = !DILocation(line: 298, column: 13, scope: !219)
!229 = !DILocation(line: 298, column: 6, scope: !219)
!230 = !DILocation(line: 299, column: 2, scope: !219)
!231 = distinct !{!231, !209, !232, !233}
!232 = !DILocation(line: 300, column: 5, scope: !149)
!233 = !{!"llvm.loop.mustprogress"}
!234 = !DILocation(line: 301, column: 9, scope: !149)
!235 = !DILocation(line: 301, column: 7, scope: !149)
!236 = !DILocation(line: 306, column: 14, scope: !149)
!237 = !DILocation(line: 306, column: 12, scope: !149)
!238 = !DILocation(line: 307, column: 10, scope: !239)
!239 = distinct !DILexicalBlock(scope: !149, file: !2, line: 307, column: 9)
!240 = !DILocation(line: 307, column: 9, scope: !149)
!241 = !DILocation(line: 309, column: 11, scope: !242)
!242 = distinct !DILexicalBlock(scope: !239, file: !2, line: 308, column: 5)
!243 = !DILocation(line: 309, column: 68, scope: !242)
!244 = !DILocation(line: 309, column: 2, scope: !242)
!245 = !DILocation(line: 310, column: 2, scope: !242)
!246 = !DILocation(line: 312, column: 25, scope: !149)
!247 = !DILocation(line: 312, column: 5, scope: !149)
!248 = !DILocation(line: 313, column: 22, scope: !149)
!249 = !DILocation(line: 313, column: 5, scope: !149)
!250 = !DILocation(line: 315, column: 12, scope: !149)
!251 = !DILocation(line: 315, column: 10, scope: !149)
!252 = !DILocation(line: 316, column: 10, scope: !253)
!253 = distinct !DILexicalBlock(scope: !149, file: !2, line: 316, column: 9)
!254 = !DILocation(line: 316, column: 9, scope: !149)
!255 = !DILocation(line: 318, column: 11, scope: !256)
!256 = distinct !DILexicalBlock(scope: !253, file: !2, line: 317, column: 5)
!257 = !DILocation(line: 318, column: 46, scope: !256)
!258 = !DILocation(line: 318, column: 2, scope: !256)
!259 = !DILocation(line: 319, column: 2, scope: !256)
!260 = !DILocation(line: 321, column: 9, scope: !261)
!261 = distinct !DILexicalBlock(scope: !149, file: !2, line: 321, column: 9)
!262 = !DILocation(line: 321, column: 13, scope: !261)
!263 = !DILocation(line: 321, column: 11, scope: !261)
!264 = !DILocation(line: 321, column: 9, scope: !149)
!265 = !DILocation(line: 323, column: 2, scope: !266)
!266 = distinct !DILexicalBlock(scope: !261, file: !2, line: 322, column: 5)
!267 = !DILocation(line: 323, column: 9, scope: !268)
!268 = distinct !DILexicalBlock(scope: !269, file: !2, line: 323, column: 2)
!269 = distinct !DILexicalBlock(scope: !266, file: !2, line: 323, column: 2)
!270 = !DILocation(line: 323, column: 13, scope: !268)
!271 = !DILocation(line: 323, column: 11, scope: !268)
!272 = !DILocation(line: 323, column: 2, scope: !269)
!273 = !DILocation(line: 325, column: 32, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !2, line: 325, column: 10)
!275 = distinct !DILexicalBlock(scope: !268, file: !2, line: 324, column: 2)
!276 = !DILocation(line: 325, column: 56, scope: !274)
!277 = !DILocation(line: 325, column: 61, scope: !274)
!278 = !DILocation(line: 325, column: 11, scope: !274)
!279 = !DILocation(line: 325, column: 10, scope: !275)
!280 = !DILocation(line: 327, column: 12, scope: !281)
!281 = distinct !DILexicalBlock(scope: !274, file: !2, line: 326, column: 6)
!282 = !DILocation(line: 327, column: 47, scope: !281)
!283 = !DILocation(line: 327, column: 3, scope: !281)
!284 = !DILocation(line: 328, column: 3, scope: !281)
!285 = !DILocation(line: 330, column: 2, scope: !275)
!286 = !DILocation(line: 323, column: 20, scope: !268)
!287 = !DILocation(line: 323, column: 2, scope: !268)
!288 = distinct !{!288, !272, !289, !233}
!289 = !DILocation(line: 330, column: 2, scope: !269)
!290 = !DILocation(line: 331, column: 5, scope: !266)
!291 = !DILocation(line: 334, column: 9, scope: !292)
!292 = distinct !DILexicalBlock(scope: !261, file: !2, line: 333, column: 5)
!293 = !DILocation(line: 335, column: 33, scope: !292)
!294 = !DILocation(line: 335, column: 12, scope: !292)
!295 = !DILocation(line: 335, column: 10, scope: !292)
!296 = !DILocation(line: 336, column: 2, scope: !292)
!297 = !DILocation(line: 336, column: 31, scope: !292)
!298 = !DILocation(line: 336, column: 16, scope: !292)
!299 = !DILocation(line: 336, column: 14, scope: !292)
!300 = !DILocation(line: 337, column: 24, scope: !301)
!301 = distinct !DILexicalBlock(scope: !292, file: !2, line: 337, column: 10)
!302 = !DILocation(line: 337, column: 30, scope: !301)
!303 = !DILocation(line: 337, column: 11, scope: !301)
!304 = !DILocation(line: 337, column: 10, scope: !292)
!305 = !DILocation(line: 339, column: 12, scope: !306)
!306 = distinct !DILexicalBlock(scope: !301, file: !2, line: 338, column: 6)
!307 = !DILocation(line: 339, column: 47, scope: !306)
!308 = !DILocation(line: 339, column: 3, scope: !306)
!309 = !DILocation(line: 340, column: 3, scope: !306)
!310 = distinct !{!310, !296, !311, !233}
!311 = !DILocation(line: 341, column: 6, scope: !292)
!312 = !DILocation(line: 342, column: 17, scope: !292)
!313 = !DILocation(line: 342, column: 2, scope: !292)
!314 = !DILocation(line: 344, column: 32, scope: !149)
!315 = !DILocation(line: 344, column: 15, scope: !149)
!316 = !DILocation(line: 344, column: 13, scope: !149)
!317 = !DILocation(line: 345, column: 10, scope: !318)
!318 = distinct !DILexicalBlock(scope: !149, file: !2, line: 345, column: 9)
!319 = !DILocation(line: 345, column: 9, scope: !149)
!320 = !DILocation(line: 347, column: 11, scope: !321)
!321 = distinct !DILexicalBlock(scope: !318, file: !2, line: 346, column: 5)
!322 = !DILocation(line: 347, column: 46, scope: !321)
!323 = !DILocation(line: 347, column: 2, scope: !321)
!324 = !DILocation(line: 348, column: 2, scope: !321)
!325 = !DILocation(line: 350, column: 22, scope: !149)
!326 = !DILocation(line: 350, column: 5, scope: !149)
!327 = !DILocation(line: 352, column: 5, scope: !149)
!328 = !DILocation(line: 352, column: 34, scope: !149)
!329 = !DILocation(line: 352, column: 19, scope: !149)
!330 = !DILocation(line: 352, column: 17, scope: !149)
!331 = !DILocalVariable(name: "j", scope: !332, file: !2, line: 354, type: !137)
!332 = distinct !DILexicalBlock(scope: !149, file: !2, line: 353, column: 5)
!333 = !DILocation(line: 354, column: 10, scope: !332)
!334 = !DILocalVariable(name: "cache_file", scope: !332, file: !2, line: 355, type: !27)
!335 = !DILocation(line: 355, column: 15, scope: !332)
!336 = !DILocalVariable(name: "file_stat", scope: !332, file: !2, line: 356, type: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !338, line: 26, size: 1152, elements: !339)
!338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!339 = !{!340, !343, !345, !347, !350, !352, !354, !355, !356, !359, !361, !363, !371, !372, !373}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !337, file: !338, line: 31, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !342, line: 145, baseType: !28)
!342 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !337, file: !338, line: 36, baseType: !344, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !342, line: 148, baseType: !28)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !337, file: !338, line: 44, baseType: !346, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !342, line: 151, baseType: !28)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !337, file: !338, line: 45, baseType: !348, size: 32, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !342, line: 150, baseType: !349)
!349 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !337, file: !338, line: 47, baseType: !351, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !342, line: 146, baseType: !349)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !337, file: !338, line: 48, baseType: !353, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !342, line: 147, baseType: !349)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !337, file: !338, line: 50, baseType: !137, size: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !337, file: !338, line: 52, baseType: !341, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !337, file: !338, line: 57, baseType: !357, size: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !342, line: 152, baseType: !358)
!358 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !337, file: !338, line: 61, baseType: !360, size: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !342, line: 175, baseType: !358)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !337, file: !338, line: 63, baseType: !362, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !342, line: 180, baseType: !358)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !337, file: !338, line: 74, baseType: !364, size: 128, offset: 576)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !365, line: 11, size: 128, elements: !366)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !364, file: !365, line: 16, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !342, line: 160, baseType: !358)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !364, file: !365, line: 21, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !342, line: 197, baseType: !358)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !337, file: !338, line: 75, baseType: !364, size: 128, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !337, file: !338, line: 76, baseType: !364, size: 128, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !337, file: !338, line: 89, baseType: !374, size: 192, offset: 960)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 192, elements: !121)
!375 = !DILocation(line: 356, column: 14, scope: !332)
!376 = !DILocation(line: 359, column: 2, scope: !332)
!377 = !DILocation(line: 359, column: 8, scope: !332)
!378 = !DILocation(line: 360, column: 19, scope: !379)
!379 = distinct !DILexicalBlock(scope: !332, file: !2, line: 360, column: 6)
!380 = !DILocation(line: 360, column: 6, scope: !379)
!381 = !DILocation(line: 360, column: 6, scope: !332)
!382 = !DILocation(line: 361, column: 30, scope: !379)
!383 = !DILocation(line: 361, column: 35, scope: !379)
!384 = !DILocation(line: 361, column: 14, scope: !379)
!385 = !DILocation(line: 361, column: 12, scope: !379)
!386 = !DILocation(line: 361, column: 6, scope: !379)
!387 = !DILocation(line: 363, column: 34, scope: !379)
!388 = !DILocation(line: 363, column: 14, scope: !379)
!389 = !DILocation(line: 363, column: 12, scope: !379)
!390 = !DILocation(line: 364, column: 7, scope: !391)
!391 = distinct !DILexicalBlock(scope: !332, file: !2, line: 364, column: 6)
!392 = !DILocation(line: 364, column: 6, scope: !332)
!393 = !DILocation(line: 366, column: 10, scope: !394)
!394 = distinct !DILexicalBlock(scope: !395, file: !2, line: 366, column: 10)
!395 = distinct !DILexicalBlock(scope: !391, file: !2, line: 365, column: 2)
!396 = !DILocation(line: 366, column: 16, scope: !394)
!397 = !DILocation(line: 366, column: 10, scope: !395)
!398 = !DILocation(line: 367, column: 20, scope: !394)
!399 = !DILocation(line: 367, column: 3, scope: !394)
!400 = !DILocation(line: 369, column: 12, scope: !394)
!401 = !DILocation(line: 369, column: 58, scope: !394)
!402 = !DILocation(line: 369, column: 67, scope: !394)
!403 = !DILocation(line: 369, column: 3, scope: !394)
!404 = !DILocation(line: 370, column: 9, scope: !395)
!405 = !DILocation(line: 371, column: 6, scope: !395)
!406 = distinct !{!406, !327, !407, !233}
!407 = !DILocation(line: 399, column: 5, scope: !149)
!408 = !DILocation(line: 374, column: 9, scope: !332)
!409 = !DILocation(line: 374, column: 7, scope: !332)
!410 = !DILocation(line: 375, column: 23, scope: !332)
!411 = !DILocation(line: 375, column: 7, scope: !332)
!412 = !DILocation(line: 375, column: 5, scope: !332)
!413 = !DILocation(line: 376, column: 9, scope: !414)
!414 = distinct !DILexicalBlock(scope: !332, file: !2, line: 376, column: 2)
!415 = !DILocation(line: 376, column: 7, scope: !414)
!416 = !DILocation(line: 376, column: 14, scope: !417)
!417 = distinct !DILexicalBlock(scope: !414, file: !2, line: 376, column: 2)
!418 = !DILocation(line: 376, column: 36, scope: !417)
!419 = !DILocation(line: 376, column: 18, scope: !417)
!420 = !DILocation(line: 376, column: 16, scope: !417)
!421 = !DILocation(line: 376, column: 2, scope: !414)
!422 = !DILocation(line: 378, column: 19, scope: !423)
!423 = distinct !DILexicalBlock(scope: !417, file: !2, line: 377, column: 2)
!424 = !DILocation(line: 378, column: 40, scope: !423)
!425 = !DILocation(line: 378, column: 47, scope: !423)
!426 = !DILocation(line: 378, column: 25, scope: !423)
!427 = !DILocation(line: 378, column: 6, scope: !423)
!428 = !DILocation(line: 379, column: 10, scope: !429)
!429 = distinct !DILexicalBlock(scope: !423, file: !2, line: 379, column: 10)
!430 = !DILocation(line: 379, column: 10, scope: !423)
!431 = !DILocation(line: 380, column: 16, scope: !429)
!432 = !DILocation(line: 380, column: 37, scope: !429)
!433 = !DILocation(line: 380, column: 44, scope: !429)
!434 = !DILocation(line: 380, column: 22, scope: !429)
!435 = !DILocation(line: 380, column: 3, scope: !429)
!436 = !DILocation(line: 381, column: 2, scope: !423)
!437 = !DILocation(line: 376, column: 45, scope: !417)
!438 = !DILocation(line: 376, column: 2, scope: !417)
!439 = distinct !{!439, !421, !440, !233}
!440 = !DILocation(line: 381, column: 2, scope: !414)
!441 = !DILocation(line: 383, column: 6, scope: !442)
!442 = distinct !DILexicalBlock(scope: !332, file: !2, line: 383, column: 6)
!443 = !DILocation(line: 383, column: 6, scope: !332)
!444 = !DILocation(line: 385, column: 11, scope: !445)
!445 = distinct !DILexicalBlock(scope: !446, file: !2, line: 385, column: 10)
!446 = distinct !DILexicalBlock(scope: !442, file: !2, line: 384, column: 2)
!447 = !DILocation(line: 385, column: 10, scope: !446)
!448 = !DILocation(line: 386, column: 3, scope: !445)
!449 = !DILocation(line: 388, column: 18, scope: !446)
!450 = !DILocation(line: 388, column: 7, scope: !446)
!451 = !DILocation(line: 388, column: 26, scope: !446)
!452 = !DILocation(line: 388, column: 39, scope: !446)
!453 = !DILocation(line: 388, column: 52, scope: !446)
!454 = !DILocation(line: 387, column: 6, scope: !446)
!455 = !DILocation(line: 389, column: 12, scope: !446)
!456 = !DILocation(line: 390, column: 2, scope: !446)
!457 = !DILocation(line: 391, column: 26, scope: !332)
!458 = !DILocation(line: 391, column: 30, scope: !332)
!459 = !DILocation(line: 391, column: 48, scope: !332)
!460 = !DILocation(line: 391, column: 36, scope: !332)
!461 = !DILocation(line: 391, column: 56, scope: !332)
!462 = !DILocation(line: 391, column: 9, scope: !332)
!463 = !DILocation(line: 393, column: 19, scope: !332)
!464 = !DILocation(line: 393, column: 2, scope: !332)
!465 = !DILocation(line: 395, column: 20, scope: !332)
!466 = !DILocation(line: 395, column: 2, scope: !332)
!467 = !DILocation(line: 396, column: 20, scope: !332)
!468 = !DILocation(line: 396, column: 2, scope: !332)
!469 = !DILocation(line: 397, column: 6, scope: !470)
!470 = distinct !DILexicalBlock(scope: !332, file: !2, line: 397, column: 6)
!471 = !DILocation(line: 397, column: 6, scope: !332)
!472 = !DILocation(line: 398, column: 17, scope: !470)
!473 = !DILocation(line: 398, column: 6, scope: !470)
!474 = !DILocation(line: 400, column: 20, scope: !149)
!475 = !DILocation(line: 400, column: 5, scope: !149)
!476 = !DILocation(line: 402, column: 5, scope: !149)
!477 = !DILocation(line: 403, column: 5, scope: !149)
!478 = !DILocation(line: 404, column: 1, scope: !149)
!479 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 158, type: !480, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, retainedNodes: !153)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !26, !137}
!482 = !DILocalVariable(name: "program", arg: 1, scope: !479, file: !2, line: 158, type: !26)
!483 = !DILocation(line: 158, column: 14, scope: !479)
!484 = !DILocalVariable(name: "error", arg: 2, scope: !479, file: !2, line: 158, type: !137)
!485 = !DILocation(line: 158, column: 27, scope: !479)
!486 = !DILocalVariable(name: "file", scope: !479, file: !2, line: 160, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !489, line: 7, baseType: !490)
!489 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !492)
!491 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !508, !510, !511, !512, !513, !515, !517, !518, !521, !523, !526, !529, !530, !532, !535, !536}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !490, file: !491, line: 51, baseType: !137, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !490, file: !491, line: 54, baseType: !26, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !490, file: !491, line: 55, baseType: !26, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !490, file: !491, line: 56, baseType: !26, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !490, file: !491, line: 57, baseType: !26, size: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !490, file: !491, line: 58, baseType: !26, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !490, file: !491, line: 59, baseType: !26, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !490, file: !491, line: 60, baseType: !26, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !490, file: !491, line: 61, baseType: !26, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !490, file: !491, line: 64, baseType: !26, size: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !490, file: !491, line: 65, baseType: !26, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !490, file: !491, line: 66, baseType: !26, size: 64, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !490, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !491, line: 36, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !490, file: !491, line: 70, baseType: !509, size: 64, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !490, file: !491, line: 72, baseType: !137, size: 32, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !490, file: !491, line: 73, baseType: !137, size: 32, offset: 928)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !490, file: !491, line: 74, baseType: !357, size: 64, offset: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !490, file: !491, line: 77, baseType: !514, size: 16, offset: 1024)
!514 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !490, file: !491, line: 78, baseType: !516, size: 8, offset: 1040)
!516 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !490, file: !491, line: 79, baseType: !32, size: 8, offset: 1048)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !490, file: !491, line: 81, baseType: !519, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !491, line: 43, baseType: null)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !490, file: !491, line: 89, baseType: !522, size: 64, offset: 1152)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !342, line: 153, baseType: !358)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !490, file: !491, line: 91, baseType: !524, size: 64, offset: 1216)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !491, line: 37, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !490, file: !491, line: 92, baseType: !527, size: 64, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !491, line: 38, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !490, file: !491, line: 93, baseType: !509, size: 64, offset: 1344)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !490, file: !491, line: 94, baseType: !531, size: 64, offset: 1408)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !490, file: !491, line: 95, baseType: !533, size: 64, offset: 1472)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !534, line: 46, baseType: !28)
!534 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !490, file: !491, line: 96, baseType: !137, size: 32, offset: 1536)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !490, file: !491, line: 98, baseType: !49, size: 160, offset: 1568)
!537 = !DILocation(line: 160, column: 11, scope: !479)
!538 = !DILocation(line: 160, column: 18, scope: !479)
!539 = !DILocation(line: 160, column: 26, scope: !479)
!540 = !DILocation(line: 160, column: 35, scope: !479)
!541 = !DILocation(line: 162, column: 14, scope: !479)
!542 = !DILocation(line: 163, column: 7, scope: !479)
!543 = !DILocation(line: 162, column: 5, scope: !479)
!544 = !DILocation(line: 164, column: 14, scope: !479)
!545 = !DILocation(line: 164, column: 62, scope: !479)
!546 = !DILocation(line: 164, column: 5, scope: !479)
!547 = !DILocation(line: 169, column: 14, scope: !479)
!548 = !DILocation(line: 169, column: 5, scope: !479)
!549 = !DILocation(line: 170, column: 14, scope: !479)
!550 = !DILocation(line: 170, column: 5, scope: !479)
!551 = !DILocation(line: 171, column: 14, scope: !479)
!552 = !DILocation(line: 171, column: 5, scope: !479)
!553 = !DILocation(line: 172, column: 14, scope: !479)
!554 = !DILocation(line: 172, column: 5, scope: !479)
!555 = !DILocation(line: 174, column: 14, scope: !479)
!556 = !DILocation(line: 174, column: 5, scope: !479)
!557 = !DILocation(line: 175, column: 14, scope: !479)
!558 = !DILocation(line: 175, column: 5, scope: !479)
!559 = !DILocation(line: 176, column: 14, scope: !479)
!560 = !DILocation(line: 176, column: 5, scope: !479)
!561 = !DILocation(line: 177, column: 14, scope: !479)
!562 = !DILocation(line: 177, column: 5, scope: !479)
!563 = !DILocation(line: 184, column: 11, scope: !479)
!564 = !DILocation(line: 184, column: 5, scope: !479)
!565 = distinct !DISubprogram(name: "cache_print_set", scope: !2, file: !2, line: 204, type: !566, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, retainedNodes: !153)
!566 = !DISubroutineType(types: !567)
!567 = !{!204, !163, !176, !21, !204}
!568 = !DILocalVariable(name: "set", arg: 1, scope: !565, file: !2, line: 204, type: !163)
!569 = !DILocation(line: 204, column: 29, scope: !565)
!570 = !DILocalVariable(name: "dirs", arg: 2, scope: !565, file: !2, line: 204, type: !176)
!571 = !DILocation(line: 204, column: 44, scope: !565)
!572 = !DILocalVariable(name: "base_name", arg: 3, scope: !565, file: !2, line: 204, type: !21)
!573 = !DILocation(line: 204, column: 65, scope: !565)
!574 = !DILocalVariable(name: "verbose", arg: 4, scope: !565, file: !2, line: 204, type: !204)
!575 = !DILocation(line: 204, column: 83, scope: !565)
!576 = !DILocalVariable(name: "dir", scope: !565, file: !2, line: 206, type: !27)
!577 = !DILocation(line: 206, column: 18, scope: !565)
!578 = !DILocalVariable(name: "base", scope: !565, file: !2, line: 207, type: !21)
!579 = !DILocation(line: 207, column: 22, scope: !565)
!580 = !DILocalVariable(name: "n", scope: !565, file: !2, line: 208, type: !137)
!581 = !DILocation(line: 208, column: 14, scope: !565)
!582 = !DILocalVariable(name: "ndir", scope: !565, file: !2, line: 209, type: !137)
!583 = !DILocation(line: 209, column: 14, scope: !565)
!584 = !DILocalVariable(name: "list", scope: !565, file: !2, line: 210, type: !183)
!585 = !DILocation(line: 210, column: 20, scope: !565)
!586 = !DILocation(line: 212, column: 29, scope: !565)
!587 = !DILocation(line: 212, column: 12, scope: !565)
!588 = !DILocation(line: 212, column: 10, scope: !565)
!589 = !DILocation(line: 213, column: 10, scope: !590)
!590 = distinct !DILexicalBlock(scope: !565, file: !2, line: 213, column: 9)
!591 = !DILocation(line: 213, column: 9, scope: !565)
!592 = !DILocation(line: 214, column: 2, scope: !590)
!593 = !DILocation(line: 216, column: 5, scope: !565)
!594 = !DILocation(line: 216, column: 34, scope: !565)
!595 = !DILocation(line: 216, column: 19, scope: !565)
!596 = !DILocation(line: 216, column: 17, scope: !565)
!597 = !DILocation(line: 218, column: 25, scope: !598)
!598 = distinct !DILexicalBlock(scope: !565, file: !2, line: 217, column: 5)
