; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.xdp_hints_rx_time.0 = type { i32, ptr, %struct.xdp_hints_mark, %struct.xdp_hints_mark }
%struct.xdp_hints_mark = type { i32, i32 }
%struct.xdp_hints_mark.1 = type { i32, ptr, %struct.xdp_hints_mark }
%struct.timespec = type { i64, i64 }
%struct.ether_addr = type { [6 x i8] }
%struct.option_wrapper = type { %struct.option, ptr, ptr, i8 }
%struct.option = type { ptr, i32, ptr, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.xdp_hints_rx_time = type { i64, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.0 }
%union.anon.0 = type { [4 x i32] }
%struct.ipv6_opt_hdr = type { i8, i8 }
%struct.icmp6hdr = type { i8, i8, i16, %union.anon.2 }
%union.anon.2 = type { [1 x i32] }
%struct.xsk_umem_info = type { %struct.xsk_ring_prod, %struct.xsk_ring_prod, ptr, ptr, %struct.mem_frame_allocator }
%struct.xsk_ring_prod = type { i32, i32, i32, i32, ptr, ptr, ptr, ptr }
%struct.mem_frame_allocator = type { i32, i32, ptr }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !3, line: 24, type: !124, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !60, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "af_xdp_kern.c", directory: "/home/raj/bpf-examples/AF_XDP-interaction", checksumkind: CSK_MD5, checksum: "52edcc469fa04893c3967929f48f5226")
!4 = !{!5, !11, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bpf_type_id_kind", file: !6, line: 23, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../lib/libbpf-install/usr/include/bpf/bpf_core_read.h", directory: "/home/raj/bpf-examples/AF_XDP-interaction", checksumkind: CSK_MD5, checksum: "3f41fbd6626a5a6eb5da512ae52117e7")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "BPF_TYPE_ID_LOCAL", value: 0)
!10 = !DIEnumerator(name: "BPF_TYPE_ID_TARGET", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !12, line: 4363, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "../lib/../headers/linux/bpf.h", directory: "/home/raj/bpf-examples/AF_XDP-interaction", checksumkind: CSK_MD5, checksum: "686704d11802f5f210143bc29244c61a")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!15 = !DIEnumerator(name: "XDP_DROP", value: 1)
!16 = !DIEnumerator(name: "XDP_PASS", value: 2)
!17 = !DIEnumerator(name: "XDP_TX", value: 3)
!18 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 28, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!22 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!23 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!24 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!25 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!26 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!27 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!28 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!29 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!30 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!31 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!32 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!33 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!34 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!35 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!36 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!37 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!38 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!39 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!40 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!41 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!42 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!43 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!44 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!45 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!46 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!47 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!48 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!49 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!50 = !{!51, !52, !53, !54, !55, !58}
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!53 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !56, line: 24, baseType: !57)
!56 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!60 = !{!61, !66, !0, !84, !100, !107, !112, !119}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 193, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 32, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 4)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "xsks_map", scope: !2, file: !3, line: 17, type: !68, isLocal: false, isDefinition: true)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 12, size: 256, elements: !69)
!69 = !{!70, !75, !80, !83}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !3, line: 13, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 544, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 17)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !68, file: !3, line: 14, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !68, file: !3, line: 15, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, elements: !64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !68, file: !3, line: 16, baseType: !81, size: 64, offset: 192)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_meta", scope: !2, file: !86, line: 1367, type: !87, isLocal: true, isDefinition: true)
!86 = !DIFile(filename: "../lib/libbpf-install/usr/include/bpf/bpf_helper_defs.h", directory: "/home/raj/bpf-examples/AF_XDP-interaction", checksumkind: CSK_MD5, checksum: "52f02fca464a4053efa2721be82f1a3e")
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!54, !90, !51}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !12, line: 4374, size: 192, elements: !92)
!92 = !{!93, !95, !96, !97, !98, !99}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !12, line: 4375, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !56, line: 27, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !91, file: !12, line: 4376, baseType: !94, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !91, file: !12, line: 4377, baseType: !94, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !91, file: !12, line: 4379, baseType: !94, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !91, file: !12, line: 4380, baseType: !94, size: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !91, file: !12, line: 4382, baseType: !94, size: 32, offset: 160)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !86, line: 109, type: !102, isLocal: true, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !56, line: 31, baseType: !106)
!106 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !86, line: 201, type: !109, isLocal: true, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!94}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !86, line: 51, type: !114, isLocal: true, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!52, !52, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !86, line: 1296, type: !121, isLocal: true, isDefinition: true)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!54, !52, !94, !105}
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 19, size: 256, elements: !125)
!125 = !{!126, !131, !133, !134}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !3, line: 20, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 192, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 6)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !124, file: !3, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !124, file: !3, line: 22, baseType: !132, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !124, file: !3, line: 23, baseType: !76, size: 64, offset: 192)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_hints_rx_time", file: !3, line: 47, size: 128, align: 32, elements: !136)
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ktime", scope: !135, file: !3, line: 48, baseType: !105, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "xdp_rx_cpu", scope: !135, file: !3, line: 49, baseType: !94, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "btf_id", scope: !135, file: !3, line: 50, baseType: !94, size: 32, offset: 96)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_hints_mark", file: !3, line: 42, size: 64, align: 32, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !140, file: !3, line: 43, baseType: !94, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "btf_id", scope: !140, file: !3, line: 44, baseType: !94, size: 32, offset: 32)
!144 = !{!"clang version 16.0.0"}
!145 = !{i32 7, !"Dwarf Version", i32 5}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{i32 1, !"wchar_size", i32 4}
!148 = !{i32 7, !"frame-pointer", i32 2}
!149 = !{i32 8, !"PIC Level", i32 0}
!150 = !{i32 7, !"PIE Level", i32 2}
!151 = !{i32 7, !"uwtable", i32 2}
!152 = distinct !DISubprogram(name: "xdp_sock_prog", scope: !3, file: !3, line: 151, type: !153, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !155)
!153 = !DISubroutineType(types: !154)
!154 = !{!51, !90}
!155 = !{!156, !157, !158, !159, !160, !161}
!156 = !DILocalVariable(name: "ctx", arg: 1, scope: !152, file: !3, line: 151, type: !90)
!157 = !DILocalVariable(name: "index", scope: !152, file: !3, line: 153, type: !51)
!158 = !DILocalVariable(name: "pkt_count", scope: !152, file: !3, line: 154, type: !132)
!159 = !DILocalVariable(name: "err", scope: !152, file: !3, line: 155, type: !51)
!160 = !DILocalVariable(name: "ret", scope: !152, file: !3, line: 155, type: !51)
!161 = !DILocalVariable(name: "cnt", scope: !152, file: !3, line: 160, type: !105)
!162 = !DILocation(line: 0, scope: !152)
!163 = !DILocation(line: 153, column: 2, scope: !152)
!164 = !DILocation(line: 153, column: 19, scope: !152)
!165 = !{!166, !167, i64 16}
!166 = !{!"xdp_md", !167, i64 0, !167, i64 4, !167, i64 8, !167, i64 12, !167, i64 16, !167, i64 20}
!167 = !{!"int", !168, i64 0}
!168 = !{!"omnipotent char", !169, i64 0}
!169 = !{!"Simple C/C++ TBAA"}
!170 = !DILocation(line: 153, column: 6, scope: !152)
!171 = !{!167, !167, i64 0}
!172 = !DILocation(line: 157, column: 14, scope: !152)
!173 = !DILocation(line: 158, column: 7, scope: !174)
!174 = distinct !DILexicalBlock(scope: !152, file: !3, line: 158, column: 6)
!175 = !DILocation(line: 158, column: 6, scope: !152)
!176 = !DILocation(line: 160, column: 26, scope: !152)
!177 = !DILocation(line: 168, column: 11, scope: !178)
!178 = distinct !DILexicalBlock(scope: !152, file: !3, line: 168, column: 6)
!179 = !DILocation(line: 168, column: 16, scope: !178)
!180 = !DILocation(line: 168, column: 6, scope: !152)
!181 = !DILocalVariable(name: "ctx", arg: 1, scope: !182, file: !3, line: 53, type: !90)
!182 = distinct !DISubprogram(name: "meta_add_rx_time", scope: !3, file: !3, line: 53, type: !153, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !183)
!183 = !{!181, !184, !186, !187}
!184 = !DILocalVariable(name: "meta", scope: !182, file: !3, line: 55, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!186 = !DILocalVariable(name: "data", scope: !182, file: !3, line: 56, type: !52)
!187 = !DILocalVariable(name: "err", scope: !182, file: !3, line: 57, type: !51)
!188 = !DILocation(line: 0, scope: !182, inlinedAt: !189)
!189 = distinct !DILocation(line: 169, column: 9, scope: !190)
!190 = distinct !DILexicalBlock(scope: !178, file: !3, line: 168, column: 22)
!191 = !DILocation(line: 62, column: 8, scope: !182, inlinedAt: !189)
!192 = !DILocation(line: 63, column: 6, scope: !193, inlinedAt: !189)
!193 = distinct !DILexicalBlock(scope: !182, file: !3, line: 63, column: 6)
!194 = !DILocation(line: 63, column: 6, scope: !182, inlinedAt: !189)
!195 = !DILocation(line: 71, column: 37, scope: !182, inlinedAt: !189)
!196 = !{!166, !167, i64 0}
!197 = !DILocation(line: 71, column: 17, scope: !182, inlinedAt: !189)
!198 = !DILocation(line: 71, column: 9, scope: !182, inlinedAt: !189)
!199 = !DILocation(line: 73, column: 37, scope: !182, inlinedAt: !189)
!200 = !{!166, !167, i64 8}
!201 = !DILocation(line: 73, column: 17, scope: !182, inlinedAt: !189)
!202 = !DILocation(line: 73, column: 9, scope: !182, inlinedAt: !189)
!203 = !DILocation(line: 74, column: 11, scope: !204, inlinedAt: !189)
!204 = distinct !DILexicalBlock(scope: !182, file: !3, line: 74, column: 6)
!205 = !DILocation(line: 74, column: 15, scope: !204, inlinedAt: !189)
!206 = !DILocation(line: 74, column: 6, scope: !182, inlinedAt: !189)
!207 = !DILocation(line: 77, column: 19, scope: !182, inlinedAt: !189)
!208 = !DILocation(line: 77, column: 17, scope: !182, inlinedAt: !189)
!209 = !{!210, !211, i64 0}
!210 = !{!"xdp_hints_rx_time", !211, i64 0, !167, i64 8, !167, i64 12}
!211 = !{!"long long", !168, i64 0}
!212 = !DILocation(line: 78, column: 21, scope: !182, inlinedAt: !189)
!213 = !DILocation(line: 78, column: 8, scope: !182, inlinedAt: !189)
!214 = !DILocation(line: 78, column: 19, scope: !182, inlinedAt: !189)
!215 = !{!210, !167, i64 8}
!216 = !DILocation(line: 80, column: 17, scope: !182, inlinedAt: !189)
!217 = !DILocation(line: 80, column: 8, scope: !182, inlinedAt: !189)
!218 = !DILocation(line: 80, column: 15, scope: !182, inlinedAt: !189)
!219 = !{!210, !167, i64 12}
!220 = !DILocation(line: 170, column: 7, scope: !190)
!221 = !DILocalVariable(name: "ctx", arg: 1, scope: !222, file: !3, line: 85, type: !90)
!222 = distinct !DISubprogram(name: "meta_add_mark", scope: !3, file: !3, line: 85, type: !223, scopeLine: 86, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!51, !90, !94}
!225 = !{!221, !226, !227, !229, !230}
!226 = !DILocalVariable(name: "mark", arg: 2, scope: !222, file: !3, line: 85, type: !94)
!227 = !DILocalVariable(name: "meta", scope: !222, file: !3, line: 87, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!229 = !DILocalVariable(name: "data", scope: !222, file: !3, line: 88, type: !52)
!230 = !DILocalVariable(name: "err", scope: !222, file: !3, line: 89, type: !51)
!231 = !DILocation(line: 0, scope: !222, inlinedAt: !232)
!232 = distinct !DILocation(line: 173, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !178, file: !3, line: 172, column: 9)
!234 = !DILocation(line: 92, column: 8, scope: !222, inlinedAt: !232)
!235 = !DILocation(line: 93, column: 6, scope: !236, inlinedAt: !232)
!236 = distinct !DILexicalBlock(scope: !222, file: !3, line: 93, column: 6)
!237 = !DILocation(line: 93, column: 6, scope: !222, inlinedAt: !232)
!238 = !DILocation(line: 96, column: 37, scope: !222, inlinedAt: !232)
!239 = !DILocation(line: 96, column: 17, scope: !222, inlinedAt: !232)
!240 = !DILocation(line: 96, column: 9, scope: !222, inlinedAt: !232)
!241 = !DILocation(line: 97, column: 37, scope: !222, inlinedAt: !232)
!242 = !DILocation(line: 97, column: 17, scope: !222, inlinedAt: !232)
!243 = !DILocation(line: 97, column: 9, scope: !222, inlinedAt: !232)
!244 = !DILocation(line: 98, column: 11, scope: !245, inlinedAt: !232)
!245 = distinct !DILexicalBlock(scope: !222, file: !3, line: 98, column: 6)
!246 = !DILocation(line: 98, column: 15, scope: !245, inlinedAt: !232)
!247 = !DILocation(line: 98, column: 6, scope: !222, inlinedAt: !232)
!248 = !DILocation(line: 101, column: 13, scope: !222, inlinedAt: !232)
!249 = !{!250, !167, i64 0}
!250 = !{!"xdp_hints_mark", !167, i64 0, !167, i64 4}
!251 = !DILocation(line: 102, column: 17, scope: !222, inlinedAt: !232)
!252 = !DILocation(line: 102, column: 8, scope: !222, inlinedAt: !232)
!253 = !DILocation(line: 102, column: 15, scope: !222, inlinedAt: !232)
!254 = !{!250, !167, i64 4}
!255 = !DILocation(line: 174, column: 7, scope: !233)
!256 = !DILocation(line: 179, column: 8, scope: !152)
!257 = !DILocation(line: 180, column: 10, scope: !258)
!258 = distinct !DILexicalBlock(scope: !152, file: !3, line: 180, column: 6)
!259 = !DILocation(line: 180, column: 6, scope: !152)
!260 = !DILocation(line: 182, column: 10, scope: !261)
!261 = distinct !DILexicalBlock(scope: !152, file: !3, line: 182, column: 6)
!262 = !DILocation(line: 182, column: 6, scope: !152)
!263 = !DILocation(line: 187, column: 6, scope: !264)
!264 = distinct !DILexicalBlock(scope: !152, file: !3, line: 187, column: 6)
!265 = !DILocation(line: 187, column: 6, scope: !152)
!266 = !DILocation(line: 188, column: 38, scope: !264)
!267 = !DILocation(line: 188, column: 10, scope: !264)
!268 = !DILocation(line: 188, column: 3, scope: !264)
!269 = !DILocation(line: 191, column: 1, scope: !152)
!270 = distinct !DISubprogram(name: "parse_pkt__is_ARP_or_NDP", scope: !3, file: !3, line: 114, type: !153, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !271)
!271 = !{!272, !273, !274, !275, !280, !292, !293, !340, !341, !388}
!272 = !DILocalVariable(name: "ctx", arg: 1, scope: !270, file: !3, line: 114, type: !90)
!273 = !DILocalVariable(name: "data", scope: !270, file: !3, line: 116, type: !52)
!274 = !DILocalVariable(name: "data_end", scope: !270, file: !3, line: 117, type: !52)
!275 = !DILocalVariable(name: "nh", scope: !270, file: !3, line: 118, type: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !277, line: 35, size: 64, elements: !278)
!277 = !DIFile(filename: "../lib/../include/xdp/parsing_helpers.h", directory: "/home/raj/bpf-examples/AF_XDP-interaction", checksumkind: CSK_MD5, checksum: "e41ee3c44bb7300a1b081f0ef073eeff")
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !276, file: !277, line: 36, baseType: !52, size: 64)
!280 = !DILocalVariable(name: "eth", scope: !270, file: !3, line: 119, type: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !283, line: 168, size: 112, elements: !284)
!283 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!284 = !{!285, !288, !289}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !282, file: !283, line: 169, baseType: !286, size: 48)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 48, elements: !129)
!287 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !282, file: !283, line: 170, baseType: !286, size: 48, offset: 48)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !282, file: !283, line: 171, baseType: !290, size: 16, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !291, line: 25, baseType: !55)
!291 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!292 = !DILocalVariable(name: "eth_type", scope: !270, file: !3, line: 120, type: !51)
!293 = !DILocalVariable(name: "ip6h", scope: !294, file: !3, line: 130, type: !296)
!294 = distinct !DILexicalBlock(scope: !295, file: !3, line: 129, column: 41)
!295 = distinct !DILexicalBlock(scope: !270, file: !3, line: 129, column: 6)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !298, line: 118, size: 320, elements: !299)
!298 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "9926d49458ea1e0cc4651362e733e03e")
!299 = !{!300, !302, !303, !307, !308, !309, !310}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !297, file: !298, line: 120, baseType: !301, size: 4, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !56, line: 21, baseType: !287)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !297, file: !298, line: 121, baseType: !301, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !297, file: !298, line: 128, baseType: !304, size: 24, offset: 8)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 24, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 3)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !297, file: !298, line: 130, baseType: !290, size: 16, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !297, file: !298, line: 131, baseType: !301, size: 8, offset: 48)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !297, file: !298, line: 132, baseType: !301, size: 8, offset: 56)
!310 = !DIDerivedType(tag: DW_TAG_member, scope: !297, file: !298, line: 134, baseType: !311, size: 256, offset: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !297, file: !298, line: 134, size: 256, elements: !312)
!312 = !{!313, !335}
!313 = !DIDerivedType(tag: DW_TAG_member, scope: !311, file: !298, line: 134, baseType: !314, size: 256)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !311, file: !298, line: 134, size: 256, elements: !315)
!315 = !{!316, !334}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !314, file: !298, line: 134, baseType: !317, size: 128)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !318, line: 33, size: 128, elements: !319)
!318 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !317, file: !318, line: 40, baseType: !321, size: 128)
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !318, line: 34, size: 128, elements: !322)
!322 = !{!323, !327, !331}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !321, file: !318, line: 35, baseType: !324, size: 128)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 128, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !321, file: !318, line: 37, baseType: !328, size: 128)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 128, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 8)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !321, file: !318, line: 38, baseType: !332, size: 128)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 128, elements: !64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !291, line: 27, baseType: !94)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !314, file: !298, line: 134, baseType: !317, size: 128, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !311, file: !298, line: 134, baseType: !336, size: 256)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !311, file: !298, line: 134, size: 256, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !336, file: !298, line: 134, baseType: !317, size: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !336, file: !298, line: 134, baseType: !317, size: 128, offset: 128)
!340 = !DILocalVariable(name: "ip_type", scope: !294, file: !3, line: 131, type: !51)
!341 = !DILocalVariable(name: "icmp6hdr", scope: !342, file: !3, line: 136, type: !344)
!342 = distinct !DILexicalBlock(scope: !343, file: !3, line: 135, column: 34)
!343 = distinct !DILexicalBlock(scope: !294, file: !3, line: 135, column: 7)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !346, line: 8, size: 64, elements: !347)
!346 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!347 = !{!348, !349, !350, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !345, file: !346, line: 10, baseType: !301, size: 8)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !345, file: !346, line: 11, baseType: !301, size: 8, offset: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !345, file: !346, line: 12, baseType: !351, size: 16, offset: 16)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !291, line: 31, baseType: !55)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !345, file: !346, line: 63, baseType: !353, size: 32, offset: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !346, line: 15, size: 32, elements: !354)
!354 = !{!355, !359, !363, !365, !370, !378}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !353, file: !346, line: 16, baseType: !356, size: 32)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 32, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 1)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !353, file: !346, line: 17, baseType: !360, size: 32)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 32, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 2)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !353, file: !346, line: 18, baseType: !364, size: 32)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 32, elements: !64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !353, file: !346, line: 23, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !346, line: 20, size: 32, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !366, file: !346, line: 21, baseType: !290, size: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !366, file: !346, line: 22, baseType: !290, size: 16, offset: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !353, file: !346, line: 40, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !346, line: 25, size: 32, elements: !372)
!372 = !{!373, !374, !375, !376, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !371, file: !346, line: 27, baseType: !94, size: 5, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !371, file: !346, line: 28, baseType: !94, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !371, file: !346, line: 29, baseType: !94, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !371, file: !346, line: 30, baseType: !94, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !371, file: !346, line: 31, baseType: !94, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !353, file: !346, line: 61, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !346, line: 42, size: 32, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !379, file: !346, line: 43, baseType: !301, size: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !379, file: !346, line: 45, baseType: !301, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !379, file: !346, line: 46, baseType: !301, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !379, file: !346, line: 47, baseType: !301, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !379, file: !346, line: 48, baseType: !301, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !379, file: !346, line: 49, baseType: !301, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !379, file: !346, line: 60, baseType: !290, size: 16, offset: 16)
!388 = !DILocalVariable(name: "icmp6_type", scope: !342, file: !3, line: 137, type: !51)
!389 = !DILocation(line: 0, scope: !270)
!390 = !DILocation(line: 116, column: 38, scope: !270)
!391 = !DILocation(line: 116, column: 27, scope: !270)
!392 = !DILocation(line: 116, column: 19, scope: !270)
!393 = !DILocation(line: 117, column: 38, scope: !270)
!394 = !{!166, !167, i64 4}
!395 = !DILocation(line: 117, column: 27, scope: !270)
!396 = !DILocation(line: 117, column: 19, scope: !270)
!397 = !DILocalVariable(name: "nh", arg: 1, scope: !398, file: !277, line: 131, type: !401)
!398 = distinct !DISubprogram(name: "parse_ethhdr", scope: !277, file: !277, line: 131, type: !399, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !403)
!399 = !DISubroutineType(types: !400)
!400 = !{!51, !401, !52, !402}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!403 = !{!397, !404, !405}
!404 = !DILocalVariable(name: "data_end", arg: 2, scope: !398, file: !277, line: 132, type: !52)
!405 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !398, file: !277, line: 133, type: !402)
!406 = !DILocation(line: 0, scope: !398, inlinedAt: !407)
!407 = distinct !DILocation(line: 122, column: 13, scope: !270)
!408 = !DILocalVariable(name: "nh", arg: 1, scope: !409, file: !277, line: 86, type: !401)
!409 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !277, file: !277, line: 86, type: !410, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !417)
!410 = !DISubroutineType(types: !411)
!411 = !{!51, !401, !52, !402, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !277, line: 71, size: 32, elements: !414)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !413, file: !277, line: 72, baseType: !416, size: 32)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !361)
!417 = !{!408, !418, !419, !420, !421, !422, !423, !429, !430}
!418 = !DILocalVariable(name: "data_end", arg: 2, scope: !409, file: !277, line: 87, type: !52)
!419 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !409, file: !277, line: 88, type: !402)
!420 = !DILocalVariable(name: "vlans", arg: 4, scope: !409, file: !277, line: 89, type: !412)
!421 = !DILocalVariable(name: "eth", scope: !409, file: !277, line: 91, type: !281)
!422 = !DILocalVariable(name: "hdrsize", scope: !409, file: !277, line: 92, type: !51)
!423 = !DILocalVariable(name: "vlh", scope: !409, file: !277, line: 93, type: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !277, line: 44, size: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !425, file: !277, line: 45, baseType: !290, size: 16)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !425, file: !277, line: 46, baseType: !290, size: 16, offset: 16)
!429 = !DILocalVariable(name: "h_proto", scope: !409, file: !277, line: 94, type: !55)
!430 = !DILocalVariable(name: "i", scope: !409, file: !277, line: 95, type: !51)
!431 = !DILocation(line: 0, scope: !409, inlinedAt: !432)
!432 = distinct !DILocation(line: 136, column: 9, scope: !398, inlinedAt: !407)
!433 = !DILocation(line: 100, column: 14, scope: !434, inlinedAt: !432)
!434 = distinct !DILexicalBlock(scope: !409, file: !277, line: 100, column: 6)
!435 = !DILocation(line: 100, column: 24, scope: !434, inlinedAt: !432)
!436 = !DILocation(line: 100, column: 6, scope: !409, inlinedAt: !432)
!437 = !DILocation(line: 106, column: 17, scope: !409, inlinedAt: !432)
!438 = !{!439, !439, i64 0}
!439 = !{!"short", !168, i64 0}
!440 = !DILocalVariable(name: "h_proto", arg: 1, scope: !441, file: !277, line: 75, type: !55)
!441 = distinct !DISubprogram(name: "proto_is_vlan", scope: !277, file: !277, line: 75, type: !442, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!51, !55}
!444 = !{!440}
!445 = !DILocation(line: 0, scope: !441, inlinedAt: !446)
!446 = distinct !DILocation(line: 113, column: 8, scope: !447, inlinedAt: !432)
!447 = distinct !DILexicalBlock(scope: !448, file: !277, line: 113, column: 7)
!448 = distinct !DILexicalBlock(scope: !449, file: !277, line: 112, column: 39)
!449 = distinct !DILexicalBlock(scope: !450, file: !277, line: 112, column: 2)
!450 = distinct !DILexicalBlock(scope: !409, file: !277, line: 112, column: 2)
!451 = !DILocation(line: 77, column: 20, scope: !441, inlinedAt: !446)
!452 = !DILocation(line: 77, column: 46, scope: !441, inlinedAt: !446)
!453 = !DILocation(line: 113, column: 7, scope: !448, inlinedAt: !432)
!454 = !DILocation(line: 119, column: 18, scope: !448, inlinedAt: !432)
!455 = !DILocation(line: 126, column: 6, scope: !270)
!456 = !DILocalVariable(name: "nh", arg: 1, scope: !457, file: !277, line: 174, type: !401)
!457 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !277, file: !277, line: 174, type: !458, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !461)
!458 = !DISubroutineType(types: !459)
!459 = !{!51, !401, !52, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!461 = !{!456, !462, !463, !464}
!462 = !DILocalVariable(name: "data_end", arg: 2, scope: !457, file: !277, line: 175, type: !52)
!463 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !457, file: !277, line: 176, type: !460)
!464 = !DILocalVariable(name: "ip6h", scope: !457, file: !277, line: 178, type: !296)
!465 = !DILocation(line: 0, scope: !457, inlinedAt: !466)
!466 = distinct !DILocation(line: 131, column: 17, scope: !294)
!467 = !DILocation(line: 184, column: 11, scope: !468, inlinedAt: !466)
!468 = distinct !DILexicalBlock(scope: !457, file: !277, line: 184, column: 6)
!469 = !DILocation(line: 184, column: 15, scope: !468, inlinedAt: !466)
!470 = !DILocation(line: 184, column: 6, scope: !457, inlinedAt: !466)
!471 = !DILocation(line: 187, column: 12, scope: !472, inlinedAt: !466)
!472 = distinct !DILexicalBlock(scope: !457, file: !277, line: 187, column: 6)
!473 = !DILocation(line: 187, column: 20, scope: !472, inlinedAt: !466)
!474 = !DILocation(line: 187, column: 6, scope: !457, inlinedAt: !466)
!475 = !DILocalVariable(name: "nh", arg: 1, scope: !476, file: !277, line: 139, type: !401)
!476 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !277, file: !277, line: 139, type: !477, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{!51, !401, !52, !301}
!479 = !{!475, !480, !481, !482, !484}
!480 = !DILocalVariable(name: "data_end", arg: 2, scope: !476, file: !277, line: 140, type: !52)
!481 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !476, file: !277, line: 141, type: !301)
!482 = !DILocalVariable(name: "i", scope: !483, file: !277, line: 143, type: !51)
!483 = distinct !DILexicalBlock(scope: !476, file: !277, line: 143, column: 2)
!484 = !DILocalVariable(name: "hdr", scope: !485, file: !277, line: 144, type: !487)
!485 = distinct !DILexicalBlock(scope: !486, file: !277, line: 143, column: 47)
!486 = distinct !DILexicalBlock(scope: !483, file: !277, line: 143, column: 2)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !298, line: 63, size: 16, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !488, file: !298, line: 64, baseType: !301, size: 8)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !488, file: !298, line: 65, baseType: !301, size: 8, offset: 8)
!492 = !DILocation(line: 0, scope: !476, inlinedAt: !493)
!493 = distinct !DILocation(line: 193, column: 9, scope: !457, inlinedAt: !466)
!494 = !DILocation(line: 0, scope: !483, inlinedAt: !493)
!495 = !DILocation(line: 0, scope: !485, inlinedAt: !493)
!496 = !DILocation(line: 193, column: 44, scope: !457, inlinedAt: !466)
!497 = !{!498, !168, i64 6}
!498 = !{!"ipv6hdr", !168, i64 0, !168, i64 0, !168, i64 1, !439, i64 4, !168, i64 6, !168, i64 7, !168, i64 8}
!499 = !DILocation(line: 149, column: 3, scope: !485, inlinedAt: !493)
!500 = !DILocation(line: 160, column: 4, scope: !501, inlinedAt: !493)
!501 = distinct !DILexicalBlock(scope: !485, file: !277, line: 149, column: 26)
!502 = !DILocation(line: 0, scope: !501, inlinedAt: !493)
!503 = !{!504, !168, i64 1}
!504 = !{!"ipv6_opt_hdr", !168, i64 0, !168, i64 1}
!505 = !DILocation(line: 146, column: 11, scope: !506, inlinedAt: !493)
!506 = distinct !DILexicalBlock(scope: !485, file: !277, line: 146, column: 7)
!507 = !DILocation(line: 146, column: 15, scope: !506, inlinedAt: !493)
!508 = !DILocation(line: 146, column: 7, scope: !485, inlinedAt: !493)
!509 = !{!504, !168, i64 0}
!510 = !DILocation(line: 156, column: 4, scope: !501, inlinedAt: !493)
!511 = !DILocation(line: 0, scope: !294)
!512 = !DILocation(line: 135, column: 15, scope: !343)
!513 = !DILocation(line: 135, column: 7, scope: !294)
!514 = !DILocalVariable(name: "nh", arg: 1, scope: !515, file: !277, line: 224, type: !401)
!515 = distinct !DISubprogram(name: "parse_icmp6hdr", scope: !277, file: !277, line: 224, type: !516, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !519)
!516 = !DISubroutineType(types: !517)
!517 = !{!51, !401, !52, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!519 = !{!514, !520, !521, !522}
!520 = !DILocalVariable(name: "data_end", arg: 2, scope: !515, file: !277, line: 225, type: !52)
!521 = !DILocalVariable(name: "icmp6hdr", arg: 3, scope: !515, file: !277, line: 226, type: !518)
!522 = !DILocalVariable(name: "icmp6h", scope: !515, file: !277, line: 228, type: !344)
!523 = !DILocation(line: 0, scope: !515, inlinedAt: !524)
!524 = distinct !DILocation(line: 137, column: 21, scope: !342)
!525 = !DILocation(line: 230, column: 13, scope: !526, inlinedAt: !524)
!526 = distinct !DILexicalBlock(scope: !515, file: !277, line: 230, column: 6)
!527 = !DILocation(line: 230, column: 17, scope: !526, inlinedAt: !524)
!528 = !DILocation(line: 230, column: 6, scope: !515, inlinedAt: !524)
!529 = !DILocation(line: 236, column: 17, scope: !515, inlinedAt: !524)
!530 = !{!531, !168, i64 0}
!531 = !{!"icmp6hdr", !168, i64 0, !168, i64 1, !439, i64 2, !168, i64 4}
!532 = !DILocation(line: 236, column: 9, scope: !515, inlinedAt: !524)
!533 = !DILocation(line: 0, scope: !342)
!534 = !DILocation(line: 141, column: 32, scope: !535)
!535 = distinct !DILexicalBlock(scope: !342, file: !3, line: 141, column: 8)
!536 = !DILocation(line: 147, column: 2, scope: !270)
!537 = !DILocation(line: 148, column: 1, scope: !270)
!538 = !DILocation(line: 0, scope: !182)
!539 = !DILocation(line: 62, column: 8, scope: !182)
!540 = !DILocation(line: 63, column: 6, scope: !193)
!541 = !DILocation(line: 63, column: 6, scope: !182)
!542 = !DILocation(line: 71, column: 37, scope: !182)
!543 = !DILocation(line: 71, column: 17, scope: !182)
!544 = !DILocation(line: 71, column: 9, scope: !182)
!545 = !DILocation(line: 73, column: 37, scope: !182)
!546 = !DILocation(line: 73, column: 17, scope: !182)
!547 = !DILocation(line: 73, column: 9, scope: !182)
!548 = !DILocation(line: 74, column: 11, scope: !204)
!549 = !DILocation(line: 74, column: 15, scope: !204)
!550 = !DILocation(line: 74, column: 6, scope: !182)
!551 = !DILocation(line: 77, column: 19, scope: !182)
