; ModuleID = 'pping_kern.c'
source_filename = "pping_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.5 = type { ptr, ptr, ptr, ptr }
%struct.anon.6 = type { ptr, ptr, ptr }
%struct.bpf_config = type { i64, i64, i8, i8, i8, i8, i32 }
%struct.parsing_context = type { ptr, ptr, %struct.hdr_cursor, i32, i32, i8 }
%struct.hdr_cursor = type { ptr }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2, i32 }
%union.anon = type { ptr }
%union.anon.2 = type { ptr }
%struct.flow_event = type { i64, i64, %struct.network_tuple, i8, i8, i8, i8 }
%struct.network_tuple = type { %struct.flow_address, %struct.flow_address, i16, i8, i8 }
%struct.flow_address = type { %struct.in6_addr, i16, i16 }
%struct.in6_addr = type { %union.anon.4 }
%union.anon.4 = type { [4 x i32] }
%struct.rtt_event = type { i64, i64, %struct.network_tuple, i32, i64, i64, i64, i64, i64, i64, i8, [7 x i8] }
%struct.map_full_event = type { i64, i64, %struct.network_tuple, i8, [3 x i8] }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.19, %union.anon.20, %union.anon.21, i16, i16, [6 x i8], [6 x i8] }
%union.anon.19 = type { i32 }
%union.anon.20 = type { [4 x i32] }
%union.anon.21 = type { [4 x i32] }

!57 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!58 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!59 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!60 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 397, baseType: !7, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "BPF_ANY", value: 0)
!64 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!65 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!66 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pping_map", file: !15, line: 41, baseType: !16, size: 8, elements: !68)
!68 = !{!69, !70}
!69 = !DIEnumerator(name: "PPING_MAP_FLOWSTATE", value: 0)
!70 = !DIEnumerator(name: "PPING_MAP_PACKETTS", value: 1)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4063, baseType: !72, size: 64, elements: !73)
!72 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!73 = !{!74, !75, !76}
!74 = !DIEnumerator(name: "BPF_F_INDEX_MASK", value: 4294967295, isUnsigned: true)
!75 = !DIEnumerator(name: "BPF_F_CURRENT_CPU", value: 4294967295, isUnsigned: true)
!76 = !DIEnumerator(name: "BPF_F_CTXLEN_MASK", value: 4503595332403200, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4955, baseType: !7, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87}
!79 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_SUCCESS", value: 0)
!80 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_BLACKHOLE", value: 1)
!81 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNREACHABLE", value: 2)
!82 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_PROHIBIT", value: 3)
!83 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NOT_FWDED", value: 4)
!84 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FWD_DISABLED", value: 5)
!85 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_UNSUPP_LWT", value: 6)
!86 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_NO_NEIGH", value: 7)
!87 = !DIEnumerator(name: "BPF_FIB_LKUP_RET_FRAG_NEEDED", value: 8)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "flow_event_source", file: !15, line: 35, baseType: !16, size: 8, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "EVENT_SOURCE_PKT_SRC", value: 0)
!91 = !DIEnumerator(name: "EVENT_SOURCE_PKT_DEST", value: 1)
!92 = !DIEnumerator(name: "EVENT_SOURCE_USERSPACE", value: 2)
!93 = !{!94, !95, !96, !99, !101, !103, !105, !127, !124, !104}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!95 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !97, line: 24, baseType: !98)
!97 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !97, line: 21, baseType: !16)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !97, line: 27, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !107, line: 33, size: 128, elements: !108)
!107 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !106, file: !107, line: 40, baseType: !110, size: 128)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !107, line: 34, size: 128, elements: !111)
!111 = !{!112, !116, !122}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !110, file: !107, line: 35, baseType: !113, size: 128)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !110, file: !107, line: 37, baseType: !117, size: 128)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, elements: !120)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !119, line: 25, baseType: !96)
!119 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!120 = !{!121}
!121 = !DISubrange(count: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !110, file: !107, line: 38, baseType: !123, size: 128)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !125)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !119, line: 27, baseType: !104)
!125 = !{!126}
!126 = !DISubrange(count: 4)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!128 = !{!0, !129, !166, !190, !199, !205, !219, !226, !231, !237, !242, !280}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "packet_ts", scope: !2, file: !3, line: 93, type: !131, isLocal: false, isDefinition: true)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 88, size: 256, elements: !132)
!132 = !{!133, !139, !157, !161}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !3, line: 89, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !137)
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !131, file: !3, line: 90, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_id", file: !15, line: 96, size: 384, elements: !142)
!142 = !{!143, !156}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !141, file: !15, line: 97, baseType: !144, size: 352)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "network_tuple", file: !15, line: 74, size: 352, elements: !145)
!145 = !{!146, !152, !153, !154, !155}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !144, file: !15, line: 75, baseType: !147, size: 160)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_address", file: !15, line: 61, size: 160, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !147, file: !15, line: 62, baseType: !106, size: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !147, file: !15, line: 63, baseType: !96, size: 16, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !147, file: !15, line: 64, baseType: !96, size: 16, offset: 144)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !144, file: !15, line: 76, baseType: !147, size: 160, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !144, file: !15, line: 77, baseType: !96, size: 16, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ipv", scope: !144, file: !15, line: 78, baseType: !102, size: 8, offset: 336)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !144, file: !15, line: 79, baseType: !102, size: 8, offset: 344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !141, file: !15, line: 98, baseType: !104, size: 32, offset: 352)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !3, line: 91, baseType: !158, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !97, line: 31, baseType: !160)
!160 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !131, file: !3, line: 92, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 524288, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 16384)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "flow_state", scope: !2, file: !3, line: 100, type: !168, isLocal: false, isDefinition: true)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 95, size: 256, elements: !169)
!169 = !{!170, !171, !173, !189}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !3, line: 96, baseType: !134, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !168, file: !3, line: 97, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !168, file: !3, line: 98, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_state", file: !15, line: 82, size: 512, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "min_rtt", scope: !175, file: !15, line: 83, baseType: !159, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "srtt", scope: !175, file: !15, line: 84, baseType: !159, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !175, file: !15, line: 85, baseType: !159, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sent_pkts", scope: !175, file: !15, line: 86, baseType: !159, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !175, file: !15, line: 87, baseType: !159, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "rec_pkts", scope: !175, file: !15, line: 88, baseType: !159, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rec_bytes", scope: !175, file: !15, line: 89, baseType: !159, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "last_id", scope: !175, file: !15, line: 90, baseType: !104, size: 32, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "has_opened", scope: !175, file: !15, line: 91, baseType: !186, size: 8, offset: 480)
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "opening_reason", scope: !175, file: !15, line: 92, baseType: !14, size: 8, offset: 488)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !175, file: !15, line: 93, baseType: !96, size: 16, offset: 496)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !168, file: !3, line: 99, baseType: !162, size: 64, offset: 192)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "events", scope: !2, file: !3, line: 106, type: !192, isLocal: false, isDefinition: true)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 102, size: 192, elements: !193)
!193 = !{!194, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !3, line: 103, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !125)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !192, file: !3, line: 104, baseType: !195, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !192, file: !3, line: 105, baseType: !195, size: 64, offset: 128)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !201, line: 109, type: !202, isLocal: true, isDefinition: true)
!201 = !DIFile(filename: "../lib/libbpf-install/usr/include/bpf/bpf_helper_defs.h", directory: "/home/raj/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "52f02fca464a4053efa2721be82f1a3e")
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!159}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 83, type: !207, isLocal: true, isDefinition: true)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_config", file: !15, line: 46, size: 192, elements: !210)
!210 = !{!211, !212, !214, !215, !216, !217, !218}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rate_limit", scope: !209, file: !15, line: 47, baseType: !159, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_rate", scope: !209, file: !15, line: 48, baseType: !213, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixpoint64", file: !15, line: 9, baseType: !159)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "use_srtt", scope: !209, file: !15, line: 49, baseType: !186, size: 8, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "track_tcp", scope: !209, file: !15, line: 50, baseType: !186, size: 8, offset: 136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "track_icmp", scope: !209, file: !15, line: 51, baseType: !186, size: 8, offset: 144)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "localfilt", scope: !209, file: !15, line: 52, baseType: !186, size: 8, offset: 152)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !209, file: !15, line: 53, baseType: !104, size: 32, offset: 160)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !201, line: 51, type: !221, isLocal: true, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!94, !94, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !201, line: 73, type: !228, isLocal: true, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!95, !94, !224, !224, !159}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "last_warn_time", scope: !2, file: !3, line: 84, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 128, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!235 = !{!236}
!236 = !DISubrange(count: 2)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "bpf_perf_event_output", scope: !2, file: !201, line: 686, type: !239, isLocal: true, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!95, !94, !94, !159, !94, !159}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !201, line: 1816, type: !244, isLocal: true, isDefinition: true)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!95, !94, !247, !136, !104}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 4967, size: 512, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !262, !268, !273, !274, !275, !279}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !248, file: !6, line: 4971, baseType: !102, size: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !248, file: !6, line: 4974, baseType: !102, size: 8, offset: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !248, file: !6, line: 4975, baseType: !118, size: 16, offset: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !248, file: !6, line: 4976, baseType: !118, size: 16, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !248, file: !6, line: 4979, baseType: !96, size: 16, offset: 48)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !248, file: !6, line: 4984, baseType: !104, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !6, line: 4986, baseType: !257, size: 32, offset: 96)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !6, line: 4986, size: 32, elements: !258)
!258 = !{!259, !260, !261}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !257, file: !6, line: 4988, baseType: !102, size: 8)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !257, file: !6, line: 4989, baseType: !124, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !257, file: !6, line: 4992, baseType: !104, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !6, line: 4995, baseType: !263, size: 128, offset: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !6, line: 4995, size: 128, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !263, file: !6, line: 4996, baseType: !124, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !263, file: !6, line: 4997, baseType: !267, size: 128)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !125)
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !6, line: 5004, baseType: !269, size: 128, offset: 256)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !6, line: 5004, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !269, file: !6, line: 5005, baseType: !124, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !269, file: !6, line: 5006, baseType: !267, size: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !248, file: !6, line: 5010, baseType: !118, size: 16, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !248, file: !6, line: 5011, baseType: !118, size: 16, offset: 400)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !248, file: !6, line: 5012, baseType: !276, size: 48, offset: 416)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 48, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 6)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !248, file: !6, line: 5013, baseType: !276, size: 48, offset: 464)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !201, line: 83, type: !282, isLocal: true, isDefinition: true)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!95, !94, !224}
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 32, elements: !125)
!286 = !{i32 7, !"Dwarf Version", i32 5}
!287 = !{i32 2, !"Debug Info Version", i32 3}
!288 = !{i32 1, !"wchar_size", i32 4}
!289 = !{i32 7, !"frame-pointer", i32 2}
!290 = !{!"clang version 16.0.0"}
!291 = distinct !DISubprogram(name: "pping_tc_egress", scope: !3, file: !3, line: 714, type: !292, scopeLine: 715, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !384)
!292 = !DISubroutineType(types: !293)
!293 = !{!136, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !6, line: 4183, size: 1472, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !358, !359, !360, !361, !383}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !295, file: !6, line: 4184, baseType: !104, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !295, file: !6, line: 4185, baseType: !104, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !295, file: !6, line: 4186, baseType: !104, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !295, file: !6, line: 4187, baseType: !104, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !295, file: !6, line: 4188, baseType: !104, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !295, file: !6, line: 4189, baseType: !104, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !295, file: !6, line: 4190, baseType: !104, size: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !295, file: !6, line: 4191, baseType: !104, size: 32, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !295, file: !6, line: 4192, baseType: !104, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !295, file: !6, line: 4193, baseType: !104, size: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !295, file: !6, line: 4194, baseType: !104, size: 32, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !295, file: !6, line: 4195, baseType: !104, size: 32, offset: 352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !295, file: !6, line: 4196, baseType: !310, size: 160, offset: 384)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 160, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 5)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !295, file: !6, line: 4197, baseType: !104, size: 32, offset: 544)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !295, file: !6, line: 4198, baseType: !104, size: 32, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !6, line: 4199, baseType: !104, size: 32, offset: 608)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !295, file: !6, line: 4200, baseType: !104, size: 32, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !295, file: !6, line: 4201, baseType: !104, size: 32, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !295, file: !6, line: 4204, baseType: !104, size: 32, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !295, file: !6, line: 4205, baseType: !104, size: 32, offset: 736)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !295, file: !6, line: 4206, baseType: !104, size: 32, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !295, file: !6, line: 4207, baseType: !267, size: 128, offset: 800)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !295, file: !6, line: 4208, baseType: !267, size: 128, offset: 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !295, file: !6, line: 4209, baseType: !104, size: 32, offset: 1056)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !295, file: !6, line: 4210, baseType: !104, size: 32, offset: 1088)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !295, file: !6, line: 4213, baseType: !104, size: 32, offset: 1120)
!326 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !6, line: 4214, baseType: !327, size: 64, align: 64, offset: 1152)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !6, line: 4214, size: 64, align: 64, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !327, file: !6, line: 4214, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !6, line: 5041, size: 448, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !356, !357}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !331, file: !6, line: 5042, baseType: !96, size: 16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !331, file: !6, line: 5043, baseType: !96, size: 16, offset: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !331, file: !6, line: 5044, baseType: !96, size: 16, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !331, file: !6, line: 5045, baseType: !102, size: 8, offset: 48)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !331, file: !6, line: 5046, baseType: !102, size: 8, offset: 56)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !331, file: !6, line: 5047, baseType: !102, size: 8, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !331, file: !6, line: 5048, baseType: !102, size: 8, offset: 72)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !331, file: !6, line: 5049, baseType: !118, size: 16, offset: 80)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !331, file: !6, line: 5050, baseType: !118, size: 16, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !331, file: !6, line: 5051, baseType: !118, size: 16, offset: 112)
!343 = !DIDerivedType(tag: DW_TAG_member, scope: !331, file: !6, line: 5052, baseType: !344, size: 256, offset: 128)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !6, line: 5052, size: 256, elements: !345)
!345 = !{!346, !351}
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !6, line: 5053, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !6, line: 5053, size: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !347, file: !6, line: 5054, baseType: !124, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !347, file: !6, line: 5055, baseType: !124, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !6, line: 5057, baseType: !352, size: 256)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !6, line: 5057, size: 256, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !352, file: !6, line: 5058, baseType: !267, size: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !352, file: !6, line: 5059, baseType: !267, size: 128, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !331, file: !6, line: 5062, baseType: !104, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !331, file: !6, line: 5063, baseType: !124, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !295, file: !6, line: 4215, baseType: !159, size: 64, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !295, file: !6, line: 4216, baseType: !104, size: 32, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !295, file: !6, line: 4217, baseType: !104, size: 32, offset: 1312)
!361 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !6, line: 4218, baseType: !362, size: 64, align: 64, offset: 1344)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !6, line: 4218, size: 64, align: 64, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !362, file: !6, line: 4218, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !6, line: 4272, size: 640, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !366, file: !6, line: 4273, baseType: !104, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !366, file: !6, line: 4274, baseType: !104, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !6, line: 4275, baseType: !104, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !366, file: !6, line: 4276, baseType: !104, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !366, file: !6, line: 4277, baseType: !104, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !366, file: !6, line: 4278, baseType: !104, size: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !366, file: !6, line: 4280, baseType: !104, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !366, file: !6, line: 4281, baseType: !267, size: 128, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !366, file: !6, line: 4282, baseType: !104, size: 32, offset: 352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !366, file: !6, line: 4283, baseType: !104, size: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !366, file: !6, line: 4284, baseType: !104, size: 32, offset: 416)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !366, file: !6, line: 4285, baseType: !267, size: 128, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !6, line: 4286, baseType: !104, size: 32, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !366, file: !6, line: 4287, baseType: !382, size: 32, offset: 608)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !97, line: 26, baseType: !136)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !295, file: !6, line: 4219, baseType: !104, size: 32, offset: 1408)
!384 = !{!385, !386}
!385 = !DILocalVariable(name: "skb", arg: 1, scope: !291, file: !3, line: 714, type: !294)
!386 = !DILocalVariable(name: "pctx", scope: !291, file: !3, line: 716, type: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsing_context", file: !3, line: 41, size: 320, elements: !388)
!388 = !{!389, !390, !391, !396, !397, !398}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !387, file: !3, line: 42, baseType: !94, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !387, file: !3, line: 43, baseType: !94, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nh", scope: !387, file: !3, line: 44, baseType: !392, size: 64, offset: 128)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !393, line: 35, size: 64, elements: !394)
!393 = !DIFile(filename: "../lib/../include/xdp/parsing_helpers.h", directory: "/home/raj/bpf-examples/pping", checksumkind: CSK_MD5, checksum: "e41ee3c44bb7300a1b081f0ef073eeff")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !392, file: !393, line: 36, baseType: !94, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_len", scope: !387, file: !3, line: 45, baseType: !104, size: 32, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !387, file: !3, line: 46, baseType: !104, size: 32, offset: 224)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "is_egress", scope: !387, file: !3, line: 47, baseType: !186, size: 8, offset: 256)
!399 = !DILocation(line: 0, scope: !291)
!400 = !DILocation(line: 716, column: 2, scope: !291)
!401 = !DILocation(line: 716, column: 25, scope: !291)
!402 = !DILocation(line: 717, column: 30, scope: !291)
!403 = !{!404, !405, i64 76}
!404 = !{!"__sk_buff", !405, i64 0, !405, i64 4, !405, i64 8, !405, i64 12, !405, i64 16, !405, i64 20, !405, i64 24, !405, i64 28, !405, i64 32, !405, i64 36, !405, i64 40, !405, i64 44, !406, i64 48, !405, i64 68, !405, i64 72, !405, i64 76, !405, i64 80, !405, i64 84, !405, i64 88, !405, i64 92, !405, i64 96, !406, i64 100, !406, i64 116, !405, i64 132, !405, i64 136, !405, i64 140, !406, i64 144, !408, i64 152, !405, i64 160, !405, i64 164, !406, i64 168, !405, i64 176}
!405 = !{!"int", !406, i64 0}
!406 = !{!"omnipotent char", !407, i64 0}
!407 = !{!"Simple C/C++ TBAA"}
!408 = !{!"long long", !406, i64 0}
!409 = !DILocation(line: 717, column: 19, scope: !291)
!410 = !DILocation(line: 717, column: 11, scope: !291)
!411 = !DILocation(line: 716, column: 32, scope: !291)
!412 = !{!413, !414, i64 0}
!413 = !{!"parsing_context", !414, i64 0, !414, i64 8, !415, i64 16, !405, i64 24, !405, i64 28, !416, i64 32}
!414 = !{!"any pointer", !406, i64 0}
!415 = !{!"hdr_cursor", !414, i64 0}
!416 = !{!"_Bool", !406, i64 0}
!417 = !DILocation(line: 718, column: 34, scope: !291)
!418 = !{!404, !405, i64 80}
!419 = !DILocation(line: 718, column: 23, scope: !291)
!420 = !DILocation(line: 718, column: 15, scope: !291)
!421 = !{!413, !414, i64 8}
!422 = !DILocation(line: 720, column: 9, scope: !291)
!423 = !{!415, !414, i64 0}
!424 = !DILocation(line: 719, column: 19, scope: !291)
!425 = !{!404, !405, i64 0}
!426 = !{!413, !405, i64 24}
!427 = !{!413, !405, i64 28}
!428 = !{!413, !416, i64 32}
!429 = !DILocation(line: 724, column: 2, scope: !291)
!430 = !DILocation(line: 727, column: 1, scope: !291)
!431 = !DILocation(line: 726, column: 2, scope: !291)
!432 = distinct !DISubprogram(name: "pping", scope: !3, file: !3, line: 691, type: !433, scopeLine: 692, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !436)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !94, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!436 = !{!437, !438, !439, !596, !597, !598}
!437 = !DILocalVariable(name: "ctx", arg: 1, scope: !432, file: !3, line: 691, type: !94)
!438 = !DILocalVariable(name: "pctx", arg: 2, scope: !432, file: !3, line: 691, type: !435)
!439 = !DILocalVariable(name: "p_info", scope: !432, file: !3, line: 693, type: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_info", file: !3, line: 61, size: 1024, elements: !441)
!441 = !{!442, !500, !588, !589, !590, !591, !592, !593, !594, !595}
!442 = !DIDerivedType(tag: DW_TAG_member, scope: !440, file: !3, line: 62, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !3, line: 62, size: 64, elements: !444)
!444 = !{!445, !473}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "iph", scope: !443, file: !3, line: 63, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !448, line: 87, size: 160, elements: !449)
!448 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !460}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !447, file: !448, line: 89, baseType: !102, size: 4, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !447, file: !448, line: 90, baseType: !102, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !447, file: !448, line: 97, baseType: !102, size: 8, offset: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !447, file: !448, line: 98, baseType: !118, size: 16, offset: 16)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !447, file: !448, line: 99, baseType: !118, size: 16, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !447, file: !448, line: 100, baseType: !118, size: 16, offset: 48)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !447, file: !448, line: 101, baseType: !102, size: 8, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !447, file: !448, line: 102, baseType: !102, size: 8, offset: 72)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !447, file: !448, line: 103, baseType: !459, size: 16, offset: 80)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !119, line: 31, baseType: !96)
!460 = !DIDerivedType(tag: DW_TAG_member, scope: !447, file: !448, line: 104, baseType: !461, size: 64, offset: 96)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !447, file: !448, line: 104, size: 64, elements: !462)
!462 = !{!463, !468}
!463 = !DIDerivedType(tag: DW_TAG_member, scope: !461, file: !448, line: 104, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !448, line: 104, size: 64, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !464, file: !448, line: 104, baseType: !124, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !464, file: !448, line: 104, baseType: !124, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !461, file: !448, line: 104, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !448, line: 104, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !469, file: !448, line: 104, baseType: !124, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !469, file: !448, line: 104, baseType: !124, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ip6h", scope: !443, file: !3, line: 64, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !476, line: 118, size: 320, elements: !477)
!476 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "9926d49458ea1e0cc4651362e733e03e")
!477 = !{!478, !479, !480, !484, !485, !486, !487}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !475, file: !476, line: 120, baseType: !102, size: 4, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !475, file: !476, line: 121, baseType: !102, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !475, file: !476, line: 128, baseType: !481, size: 24, offset: 8)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 24, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 3)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !475, file: !476, line: 130, baseType: !118, size: 16, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !475, file: !476, line: 131, baseType: !102, size: 8, offset: 48)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !475, file: !476, line: 132, baseType: !102, size: 8, offset: 56)
!487 = !DIDerivedType(tag: DW_TAG_member, scope: !475, file: !476, line: 134, baseType: !488, size: 256, offset: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !475, file: !476, line: 134, size: 256, elements: !489)
!489 = !{!490, !495}
!490 = !DIDerivedType(tag: DW_TAG_member, scope: !488, file: !476, line: 134, baseType: !491, size: 256)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !476, line: 134, size: 256, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !491, file: !476, line: 134, baseType: !106, size: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !491, file: !476, line: 134, baseType: !106, size: 128, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !488, file: !476, line: 134, baseType: !496, size: 256)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !476, line: 134, size: 256, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !496, file: !476, line: 134, baseType: !106, size: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !496, file: !476, line: 134, baseType: !106, size: 128, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, scope: !440, file: !3, line: 66, baseType: !501, size: 64, offset: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !3, line: 66, size: 64, elements: !502)
!502 = !{!503, !527, !566}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "icmph", scope: !501, file: !3, line: 67, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr", file: !506, line: 89, size: 64, elements: !507)
!506 = !DIFile(filename: "/usr/include/linux/icmp.h", directory: "", checksumkind: CSK_MD5, checksum: "a505632898dce546638b3344627d334b")
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !505, file: !506, line: 90, baseType: !102, size: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !505, file: !506, line: 91, baseType: !102, size: 8, offset: 8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !505, file: !506, line: 92, baseType: !459, size: 16, offset: 16)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "un", scope: !505, file: !506, line: 104, baseType: !512, size: 32, offset: 32)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !506, line: 93, size: 32, elements: !513)
!513 = !{!514, !519, !520, !525}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !512, file: !506, line: 97, baseType: !515, size: 32)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !512, file: !506, line: 94, size: 32, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !515, file: !506, line: 95, baseType: !118, size: 16)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !515, file: !506, line: 96, baseType: !118, size: 16, offset: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !512, file: !506, line: 98, baseType: !124, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !512, file: !506, line: 102, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !512, file: !506, line: 99, size: 32, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !521, file: !506, line: 100, baseType: !118, size: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !521, file: !506, line: 101, baseType: !118, size: 16, offset: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !512, file: !506, line: 103, baseType: !526, size: 32)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 32, elements: !125)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6h", scope: !501, file: !3, line: 68, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp6hdr", file: !530, line: 8, size: 64, elements: !531)
!530 = !DIFile(filename: "/usr/include/linux/icmpv6.h", directory: "", checksumkind: CSK_MD5, checksum: "0310ca5584e6f44f6eea6cf040ee84b9")
!531 = !{!532, !533, !534, !535}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_type", scope: !529, file: !530, line: 10, baseType: !102, size: 8)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_code", scope: !529, file: !530, line: 11, baseType: !102, size: 8, offset: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_cksum", scope: !529, file: !530, line: 12, baseType: !459, size: 16, offset: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "icmp6_dataun", scope: !529, file: !530, line: 63, baseType: !536, size: 32, offset: 32)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !530, line: 15, size: 32, elements: !537)
!537 = !{!538, !540, !542, !543, !548, !556}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "un_data32", scope: !536, file: !530, line: 16, baseType: !539, size: 32)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !137)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "un_data16", scope: !536, file: !530, line: 17, baseType: !541, size: 32)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, elements: !235)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "un_data8", scope: !536, file: !530, line: 18, baseType: !526, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "u_echo", scope: !536, file: !530, line: 23, baseType: !544, size: 32)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_echo", file: !530, line: 20, size: 32, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !544, file: !530, line: 21, baseType: !118, size: 16)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !544, file: !530, line: 22, baseType: !118, size: 16, offset: 16)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_advt", scope: !536, file: !530, line: 40, baseType: !549, size: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_advt", file: !530, line: 25, size: 32, elements: !550)
!550 = !{!551, !552, !553, !554, !555}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !549, file: !530, line: 27, baseType: !104, size: 5, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "override", scope: !549, file: !530, line: 28, baseType: !104, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "solicited", scope: !549, file: !530, line: 29, baseType: !104, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "router", scope: !549, file: !530, line: 30, baseType: !104, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !549, file: !530, line: 31, baseType: !104, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "u_nd_ra", scope: !536, file: !530, line: 61, baseType: !557, size: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_nd_ra", file: !530, line: 42, size: 32, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !557, file: !530, line: 43, baseType: !102, size: 8)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !557, file: !530, line: 45, baseType: !102, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "router_pref", scope: !557, file: !530, line: 46, baseType: !102, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "home_agent", scope: !557, file: !530, line: 47, baseType: !102, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !557, file: !530, line: 48, baseType: !102, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 8)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "managed", scope: !557, file: !530, line: 49, baseType: !102, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 8)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rt_lifetime", scope: !557, file: !530, line: 60, baseType: !118, size: 16, offset: 16)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tcph", scope: !501, file: !3, line: 69, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !569, line: 25, size: 160, elements: !570)
!569 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "8d74bf2133e7b3dab885994b9916aa13")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !568, file: !569, line: 26, baseType: !118, size: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !568, file: !569, line: 27, baseType: !118, size: 16, offset: 16)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !568, file: !569, line: 28, baseType: !124, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !568, file: !569, line: 29, baseType: !124, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !568, file: !569, line: 31, baseType: !96, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !568, file: !569, line: 32, baseType: !96, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !568, file: !569, line: 33, baseType: !96, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !568, file: !569, line: 34, baseType: !96, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !568, file: !569, line: 35, baseType: !96, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !568, file: !569, line: 36, baseType: !96, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !568, file: !569, line: 37, baseType: !96, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !568, file: !569, line: 38, baseType: !96, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !568, file: !569, line: 39, baseType: !96, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !568, file: !569, line: 40, baseType: !96, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !568, file: !569, line: 55, baseType: !118, size: 16, offset: 112)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !568, file: !569, line: 56, baseType: !459, size: 16, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !568, file: !569, line: 57, baseType: !118, size: 16, offset: 144)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !440, file: !3, line: 71, baseType: !159, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !440, file: !3, line: 72, baseType: !104, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !440, file: !3, line: 73, baseType: !141, size: 384, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid", scope: !440, file: !3, line: 74, baseType: !141, size: 384, offset: 608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pid_valid", scope: !440, file: !3, line: 75, baseType: !186, size: 8, offset: 992)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reply_pid_valid", scope: !440, file: !3, line: 76, baseType: !186, size: 8, offset: 1000)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !440, file: !3, line: 77, baseType: !24, size: 8, offset: 1008)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "event_reason", scope: !440, file: !3, line: 78, baseType: !14, size: 8, offset: 1016)
!596 = !DILocalVariable(name: "flow", scope: !432, file: !3, line: 694, type: !174)
!597 = !DILocalVariable(name: "rev_flow", scope: !432, file: !3, line: 694, type: !174)
!598 = !DILocalVariable(name: "new_flow", scope: !432, file: !3, line: 695, type: !186)
!599 = !DILocation(line: 0, scope: !432)
!600 = !DILocation(line: 693, column: 2, scope: !432)
!601 = !DILocation(line: 693, column: 21, scope: !432)
!602 = !DILocalVariable(name: "pctx", arg: 1, scope: !603, file: !3, line: 317, type: !435)
!603 = distinct !DISubprogram(name: "parse_packet_identifier", scope: !3, file: !3, line: 317, type: !604, scopeLine: 319, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !607)
!604 = !DISubroutineType(types: !605)
!605 = !{!136, !435, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!607 = !{!602, !608, !609, !610, !611}
!608 = !DILocalVariable(name: "p_info", arg: 2, scope: !603, file: !3, line: 318, type: !606)
!609 = !DILocalVariable(name: "proto", scope: !603, file: !3, line: 320, type: !136)
!610 = !DILocalVariable(name: "err", scope: !603, file: !3, line: 320, type: !136)
!611 = !DILocalVariable(name: "eth", scope: !603, file: !3, line: 321, type: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !614, line: 168, size: 112, elements: !615)
!614 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!615 = !{!616, !618, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !613, file: !614, line: 169, baseType: !617, size: 48)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 48, elements: !277)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !613, file: !614, line: 170, baseType: !617, size: 48, offset: 48)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !613, file: !614, line: 171, baseType: !118, size: 16, offset: 96)
!620 = !DILocation(line: 0, scope: !603, inlinedAt: !621)
!621 = distinct !DILocation(line: 697, column: 7, scope: !622)
!622 = distinct !DILexicalBlock(scope: !432, file: !3, line: 697, column: 7)
!623 = !DILocation(line: 323, column: 17, scope: !603, inlinedAt: !621)
!624 = !DILocation(line: 323, column: 10, scope: !603, inlinedAt: !621)
!625 = !DILocation(line: 323, column: 15, scope: !603, inlinedAt: !621)
!626 = !{!627, !408, i64 16}
!627 = !{!"packet_info", !406, i64 0, !406, i64 8, !408, i64 16, !405, i64 24, !628, i64 28, !628, i64 76, !416, i64 124, !416, i64 125, !406, i64 126, !406, i64 127}
!628 = !{!"packet_id", !629, i64 0, !405, i64 44}
!629 = !{!"network_tuple", !630, i64 0, !630, i64 20, !632, i64 40, !406, i64 42, !406, i64 43}
!630 = !{!"flow_address", !631, i64 0, !632, i64 16, !632, i64 18}
!631 = !{!"in6_addr", !406, i64 0}
!632 = !{!"short", !406, i64 0}
!633 = !DILocation(line: 324, column: 30, scope: !603, inlinedAt: !621)
!634 = !DILocation(line: 324, column: 40, scope: !603, inlinedAt: !621)
!635 = !DILocalVariable(name: "nh", arg: 1, scope: !636, file: !393, line: 131, type: !639)
!636 = distinct !DISubprogram(name: "parse_ethhdr", scope: !393, file: !393, line: 131, type: !637, scopeLine: 134, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !641)
!637 = !DISubroutineType(types: !638)
!638 = !{!136, !639, !94, !640}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!641 = !{!635, !642, !643}
!642 = !DILocalVariable(name: "data_end", arg: 2, scope: !636, file: !393, line: 132, type: !94)
!643 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !636, file: !393, line: 133, type: !640)
!644 = !DILocation(line: 0, scope: !636, inlinedAt: !645)
!645 = distinct !DILocation(line: 324, column: 10, scope: !603, inlinedAt: !621)
!646 = !DILocalVariable(name: "nh", arg: 1, scope: !647, file: !393, line: 86, type: !639)
!647 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !393, file: !393, line: 86, type: !648, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !655)
!648 = !DISubroutineType(types: !649)
!649 = !{!136, !639, !94, !640, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !393, line: 71, size: 32, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !651, file: !393, line: 72, baseType: !654, size: 32)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, elements: !235)
!655 = !{!646, !656, !657, !658, !659, !660, !661, !667, !668}
!656 = !DILocalVariable(name: "data_end", arg: 2, scope: !647, file: !393, line: 87, type: !94)
!657 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !647, file: !393, line: 88, type: !640)
!658 = !DILocalVariable(name: "vlans", arg: 4, scope: !647, file: !393, line: 89, type: !650)
!659 = !DILocalVariable(name: "eth", scope: !647, file: !393, line: 91, type: !612)
!660 = !DILocalVariable(name: "hdrsize", scope: !647, file: !393, line: 92, type: !136)
!661 = !DILocalVariable(name: "vlh", scope: !647, file: !393, line: 93, type: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !393, line: 44, size: 32, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !663, file: !393, line: 45, baseType: !118, size: 16)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !663, file: !393, line: 46, baseType: !118, size: 16, offset: 16)
!667 = !DILocalVariable(name: "h_proto", scope: !647, file: !393, line: 94, type: !96)
!668 = !DILocalVariable(name: "i", scope: !647, file: !393, line: 95, type: !136)
!669 = !DILocation(line: 0, scope: !647, inlinedAt: !670)
!670 = distinct !DILocation(line: 136, column: 9, scope: !636, inlinedAt: !645)
!671 = !DILocation(line: 91, column: 27, scope: !647, inlinedAt: !670)
!672 = !DILocation(line: 100, column: 14, scope: !673, inlinedAt: !670)
!673 = distinct !DILexicalBlock(scope: !647, file: !393, line: 100, column: 6)
!674 = !DILocation(line: 100, column: 24, scope: !673, inlinedAt: !670)
!675 = !DILocation(line: 100, column: 6, scope: !647, inlinedAt: !670)
!676 = !DILocation(line: 106, column: 17, scope: !647, inlinedAt: !670)
!677 = !{!632, !632, i64 0}
!678 = !DILocalVariable(name: "h_proto", arg: 1, scope: !679, file: !393, line: 75, type: !96)
!679 = distinct !DISubprogram(name: "proto_is_vlan", scope: !393, file: !393, line: 75, type: !680, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{!136, !96}
!682 = !{!678}
!683 = !DILocation(line: 0, scope: !679, inlinedAt: !684)
!684 = distinct !DILocation(line: 113, column: 8, scope: !685, inlinedAt: !670)
!685 = distinct !DILexicalBlock(scope: !686, file: !393, line: 113, column: 7)
!686 = distinct !DILexicalBlock(scope: !687, file: !393, line: 112, column: 39)
!687 = distinct !DILexicalBlock(scope: !688, file: !393, line: 112, column: 2)
!688 = distinct !DILexicalBlock(scope: !647, file: !393, line: 112, column: 2)
!689 = !DILocation(line: 77, column: 20, scope: !679, inlinedAt: !684)
!690 = !DILocation(line: 77, column: 46, scope: !679, inlinedAt: !684)
!691 = !DILocation(line: 113, column: 7, scope: !686, inlinedAt: !670)
!692 = !DILocation(line: 119, column: 18, scope: !686, inlinedAt: !670)
!693 = !DILocation(line: 127, column: 10, scope: !647, inlinedAt: !670)
!694 = !DILocation(line: 327, column: 6, scope: !603, inlinedAt: !621)
!695 = !DILocation(line: 328, column: 20, scope: !696, inlinedAt: !621)
!696 = distinct !DILexicalBlock(scope: !697, file: !3, line: 327, column: 36)
!697 = distinct !DILexicalBlock(scope: !603, file: !3, line: 327, column: 6)
!698 = !DILocation(line: 328, column: 24, scope: !696, inlinedAt: !621)
!699 = !{!627, !406, i64 70}
!700 = !DILocalVariable(name: "nh", arg: 1, scope: !701, file: !393, line: 196, type: !639)
!701 = distinct !DISubprogram(name: "parse_iphdr", scope: !393, file: !393, line: 196, type: !702, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !705)
!702 = !DISubroutineType(types: !703)
!703 = !{!136, !639, !94, !704}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!705 = !{!700, !706, !707, !708, !709}
!706 = !DILocalVariable(name: "data_end", arg: 2, scope: !701, file: !393, line: 197, type: !94)
!707 = !DILocalVariable(name: "iphdr", arg: 3, scope: !701, file: !393, line: 198, type: !704)
!708 = !DILocalVariable(name: "iph", scope: !701, file: !393, line: 200, type: !446)
!709 = !DILocalVariable(name: "hdrsize", scope: !701, file: !393, line: 201, type: !136)
!710 = !DILocation(line: 0, scope: !701, inlinedAt: !711)
!711 = distinct !DILocation(line: 330, column: 4, scope: !696, inlinedAt: !621)
!712 = !DILocation(line: 203, column: 10, scope: !713, inlinedAt: !711)
!713 = distinct !DILexicalBlock(scope: !701, file: !393, line: 203, column: 6)
!714 = !DILocation(line: 203, column: 14, scope: !713, inlinedAt: !711)
!715 = !DILocation(line: 203, column: 6, scope: !701, inlinedAt: !711)
!716 = !DILocation(line: 206, column: 11, scope: !717, inlinedAt: !711)
!717 = distinct !DILexicalBlock(scope: !701, file: !393, line: 206, column: 6)
!718 = !DILocation(line: 206, column: 19, scope: !717, inlinedAt: !711)
!719 = !DILocation(line: 206, column: 6, scope: !701, inlinedAt: !711)
!720 = !DILocation(line: 209, column: 21, scope: !701, inlinedAt: !711)
!721 = !DILocation(line: 211, column: 13, scope: !722, inlinedAt: !711)
!722 = distinct !DILexicalBlock(scope: !701, file: !393, line: 211, column: 5)
!723 = !DILocation(line: 211, column: 5, scope: !701, inlinedAt: !711)
!724 = !DILocation(line: 215, column: 14, scope: !725, inlinedAt: !711)
!725 = distinct !DILexicalBlock(scope: !701, file: !393, line: 215, column: 6)
!726 = !DILocation(line: 215, column: 24, scope: !725, inlinedAt: !711)
!727 = !DILocation(line: 215, column: 6, scope: !701, inlinedAt: !711)
!728 = !DILocation(line: 218, column: 10, scope: !701, inlinedAt: !711)
!729 = !DILocation(line: 219, column: 9, scope: !701, inlinedAt: !711)
!730 = !{!414, !414, i64 0}
!731 = !DILocation(line: 221, column: 14, scope: !701, inlinedAt: !711)
!732 = !{!733, !406, i64 9}
!733 = !{!"iphdr", !406, i64 0, !406, i64 0, !406, i64 1, !632, i64 2, !632, i64 4, !632, i64 6, !406, i64 8, !406, i64 9, !632, i64 10, !406, i64 12}
!734 = !DILocation(line: 221, column: 2, scope: !701, inlinedAt: !711)
!735 = !DILocation(line: 332, column: 20, scope: !736, inlinedAt: !621)
!736 = distinct !DILexicalBlock(scope: !737, file: !3, line: 331, column: 45)
!737 = distinct !DILexicalBlock(scope: !697, file: !3, line: 331, column: 13)
!738 = !DILocation(line: 332, column: 24, scope: !736, inlinedAt: !621)
!739 = !DILocalVariable(name: "nh", arg: 1, scope: !740, file: !393, line: 174, type: !639)
!740 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !393, file: !393, line: 174, type: !741, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !744)
!741 = !DISubroutineType(types: !742)
!742 = !{!136, !639, !94, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!744 = !{!739, !745, !746, !747}
!745 = !DILocalVariable(name: "data_end", arg: 2, scope: !740, file: !393, line: 175, type: !94)
!746 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !740, file: !393, line: 176, type: !743)
!747 = !DILocalVariable(name: "ip6h", scope: !740, file: !393, line: 178, type: !474)
!748 = !DILocation(line: 0, scope: !740, inlinedAt: !749)
!749 = distinct !DILocation(line: 334, column: 4, scope: !736, inlinedAt: !621)
!750 = !DILocation(line: 184, column: 11, scope: !751, inlinedAt: !749)
!751 = distinct !DILexicalBlock(scope: !740, file: !393, line: 184, column: 6)
!752 = !DILocation(line: 184, column: 15, scope: !751, inlinedAt: !749)
!753 = !DILocation(line: 184, column: 6, scope: !740, inlinedAt: !749)
!754 = !DILocation(line: 187, column: 12, scope: !755, inlinedAt: !749)
!755 = distinct !DILexicalBlock(scope: !740, file: !393, line: 187, column: 6)
!756 = !DILocation(line: 187, column: 20, scope: !755, inlinedAt: !749)
!757 = !DILocation(line: 187, column: 6, scope: !740, inlinedAt: !749)
!758 = !DILocation(line: 190, column: 10, scope: !740, inlinedAt: !749)
!759 = !DILocation(line: 191, column: 10, scope: !740, inlinedAt: !749)
!760 = !DILocalVariable(name: "nh", arg: 1, scope: !761, file: !393, line: 139, type: !639)
!761 = distinct !DISubprogram(name: "skip_ip6hdrext", scope: !393, file: !393, line: 139, type: !762, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !764)
!762 = !DISubroutineType(types: !763)
!763 = !{!136, !639, !94, !102}
!764 = !{!760, !765, !766, !767, !769}
!765 = !DILocalVariable(name: "data_end", arg: 2, scope: !761, file: !393, line: 140, type: !94)
!766 = !DILocalVariable(name: "next_hdr_type", arg: 3, scope: !761, file: !393, line: 141, type: !102)
!767 = !DILocalVariable(name: "i", scope: !768, file: !393, line: 143, type: !136)
!768 = distinct !DILexicalBlock(scope: !761, file: !393, line: 143, column: 2)
!769 = !DILocalVariable(name: "hdr", scope: !770, file: !393, line: 144, type: !772)
!770 = distinct !DILexicalBlock(scope: !771, file: !393, line: 143, column: 47)
!771 = distinct !DILexicalBlock(scope: !768, file: !393, line: 143, column: 2)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_opt_hdr", file: !476, line: 63, size: 16, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !773, file: !476, line: 64, baseType: !102, size: 8)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "hdrlen", scope: !773, file: !476, line: 65, baseType: !102, size: 8, offset: 8)
!777 = !DILocation(line: 0, scope: !761, inlinedAt: !778)
!778 = distinct !DILocation(line: 193, column: 9, scope: !740, inlinedAt: !749)
!779 = !DILocation(line: 0, scope: !768, inlinedAt: !778)
!780 = !DILocation(line: 0, scope: !770, inlinedAt: !778)
!781 = !DILocation(line: 146, column: 11, scope: !782, inlinedAt: !778)
!782 = distinct !DILexicalBlock(scope: !770, file: !393, line: 146, column: 7)
!783 = !DILocation(line: 146, column: 15, scope: !782, inlinedAt: !778)
!784 = !DILocation(line: 146, column: 7, scope: !770, inlinedAt: !778)
!785 = !DILocation(line: 193, column: 44, scope: !740, inlinedAt: !749)
!786 = !{!787, !406, i64 6}
!787 = !{!"ipv6hdr", !406, i64 0, !406, i64 0, !406, i64 1, !632, i64 4, !406, i64 6, !406, i64 7, !406, i64 8}
!788 = !DILocation(line: 149, column: 3, scope: !770, inlinedAt: !778)
!789 = !DILocation(line: 160, column: 4, scope: !790, inlinedAt: !778)
!790 = distinct !DILexicalBlock(scope: !770, file: !393, line: 149, column: 26)
!791 = !DILocation(line: 0, scope: !790, inlinedAt: !778)
!792 = !{!793, !406, i64 1}
!793 = !{!"ipv6_opt_hdr", !406, i64 0, !406, i64 1}
!794 = !{!793, !406, i64 0}
!795 = !DILocation(line: 156, column: 4, scope: !790, inlinedAt: !778)
!796 = !DILocation(line: 340, column: 13, scope: !797, inlinedAt: !621)
!797 = distinct !DILexicalBlock(scope: !603, file: !3, line: 340, column: 6)
!798 = !{!799, !416, i64 17}
!799 = !{!"bpf_config", !408, i64 0, !408, i64 8, !416, i64 16, !416, i64 17, !416, i64 18, !416, i64 19, !405, i64 20}
!800 = !{i8 0, i8 2}
!801 = !{}
!802 = !DILocation(line: 342, column: 18, scope: !803, inlinedAt: !621)
!803 = distinct !DILexicalBlock(scope: !797, file: !3, line: 342, column: 11)
!804 = !{!799, !416, i64 18}
!805 = !DILocation(line: 346, column: 18, scope: !806, inlinedAt: !621)
!806 = distinct !DILexicalBlock(scope: !803, file: !3, line: 346, column: 11)
!807 = !DILocation(line: 346, column: 29, scope: !806, inlinedAt: !621)
!808 = !DILocation(line: 0, scope: !697, inlinedAt: !621)
!809 = !{!627, !632, i64 68}
!810 = !DILocation(line: 340, column: 23, scope: !797, inlinedAt: !621)
!811 = !DILocalVariable(name: "pctx", arg: 1, scope: !812, file: !3, line: 197, type: !435)
!812 = distinct !DISubprogram(name: "parse_tcp_identifier", scope: !3, file: !3, line: 197, type: !604, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !813)
!813 = !{!811, !814}
!814 = !DILocalVariable(name: "p_info", arg: 2, scope: !812, file: !3, line: 198, type: !606)
!815 = !DILocation(line: 0, scope: !812, inlinedAt: !816)
!816 = distinct !DILocation(line: 341, column: 9, scope: !797, inlinedAt: !621)
!817 = !DILocation(line: 200, column: 55, scope: !818, inlinedAt: !816)
!818 = distinct !DILexicalBlock(scope: !812, file: !3, line: 200, column: 6)
!819 = !DILocalVariable(name: "nh", arg: 1, scope: !820, file: !393, line: 295, type: !639)
!820 = distinct !DISubprogram(name: "parse_tcphdr", scope: !393, file: !393, line: 295, type: !821, scopeLine: 298, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !824)
!821 = !DISubroutineType(types: !822)
!822 = !{!136, !639, !94, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!824 = !{!819, !825, !826, !827, !828}
!825 = !DILocalVariable(name: "data_end", arg: 2, scope: !820, file: !393, line: 296, type: !94)
!826 = !DILocalVariable(name: "tcphdr", arg: 3, scope: !820, file: !393, line: 297, type: !823)
!827 = !DILocalVariable(name: "len", scope: !820, file: !393, line: 299, type: !136)
!828 = !DILocalVariable(name: "h", scope: !820, file: !393, line: 300, type: !567)
!829 = !DILocation(line: 0, scope: !820, inlinedAt: !830)
!830 = distinct !DILocation(line: 200, column: 6, scope: !818, inlinedAt: !816)
!831 = !DILocation(line: 302, column: 8, scope: !832, inlinedAt: !830)
!832 = distinct !DILexicalBlock(scope: !820, file: !393, line: 302, column: 6)
!833 = !DILocation(line: 302, column: 12, scope: !832, inlinedAt: !830)
!834 = !DILocation(line: 302, column: 6, scope: !820, inlinedAt: !830)
!835 = !DILocation(line: 305, column: 11, scope: !820, inlinedAt: !830)
!836 = !DILocation(line: 305, column: 16, scope: !820, inlinedAt: !830)
!837 = !DILocation(line: 307, column: 9, scope: !838, inlinedAt: !830)
!838 = distinct !DILexicalBlock(scope: !820, file: !393, line: 307, column: 5)
!839 = !DILocation(line: 307, column: 5, scope: !820, inlinedAt: !830)
!840 = !DILocation(line: 311, column: 14, scope: !841, inlinedAt: !830)
!841 = distinct !DILexicalBlock(scope: !820, file: !393, line: 311, column: 6)
!842 = !DILocation(line: 311, column: 20, scope: !841, inlinedAt: !830)
!843 = !DILocation(line: 311, column: 6, scope: !820, inlinedAt: !830)
!844 = !DILocation(line: 314, column: 10, scope: !820, inlinedAt: !830)
!845 = !DILocation(line: 315, column: 10, scope: !820, inlinedAt: !830)
!846 = !DILocation(line: 203, column: 62, scope: !847, inlinedAt: !816)
!847 = distinct !DILexicalBlock(scope: !812, file: !3, line: 203, column: 6)
!848 = !DILocation(line: 204, column: 24, scope: !847, inlinedAt: !816)
!849 = !DILocalVariable(name: "tcph", arg: 1, scope: !850, file: !3, line: 137, type: !567)
!850 = distinct !DISubprogram(name: "parse_tcp_ts", scope: !3, file: !3, line: 137, type: !851, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !853)
!851 = !DISubroutineType(types: !852)
!852 = !{!136, !567, !94, !103, !103}
!853 = !{!849, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!854 = !DILocalVariable(name: "data_end", arg: 2, scope: !850, file: !3, line: 137, type: !94)
!855 = !DILocalVariable(name: "tsval", arg: 3, scope: !850, file: !3, line: 137, type: !103)
!856 = !DILocalVariable(name: "tsecr", arg: 4, scope: !850, file: !3, line: 138, type: !103)
!857 = !DILocalVariable(name: "len", scope: !850, file: !3, line: 140, type: !136)
!858 = !DILocalVariable(name: "opt_end", scope: !850, file: !3, line: 141, type: !94)
!859 = !DILocalVariable(name: "pos", scope: !850, file: !3, line: 142, type: !101)
!860 = !DILocalVariable(name: "i", scope: !850, file: !3, line: 143, type: !102)
!861 = !DILocalVariable(name: "opt", scope: !850, file: !3, line: 143, type: !102)
!862 = !DILocalVariable(name: "opt_size", scope: !850, file: !3, line: 145, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!864 = !DILocation(line: 0, scope: !850, inlinedAt: !865)
!865 = distinct !DILocation(line: 203, column: 6, scope: !847, inlinedAt: !816)
!866 = !DILocation(line: 140, column: 18, scope: !850, inlinedAt: !865)
!867 = !DILocation(line: 140, column: 23, scope: !850, inlinedAt: !865)
!868 = !DILocation(line: 141, column: 31, scope: !850, inlinedAt: !865)
!869 = !DILocation(line: 144, column: 2, scope: !850, inlinedAt: !865)
!870 = !DILocation(line: 145, column: 3, scope: !850, inlinedAt: !865)
!871 = !DILocation(line: 147, column: 26, scope: !872, inlinedAt: !865)
!872 = distinct !DILexicalBlock(scope: !850, file: !3, line: 147, column: 6)
!873 = !DILocation(line: 151, column: 11, scope: !874, inlinedAt: !865)
!874 = distinct !DILexicalBlock(scope: !875, file: !3, line: 151, column: 7)
!875 = distinct !DILexicalBlock(scope: !876, file: !3, line: 150, column: 40)
!876 = distinct !DILexicalBlock(scope: !877, file: !3, line: 150, column: 2)
!877 = distinct !DILexicalBlock(scope: !850, file: !3, line: 150, column: 2)
!878 = !DILocation(line: 151, column: 15, scope: !874, inlinedAt: !865)
!879 = !DILocation(line: 151, column: 25, scope: !874, inlinedAt: !865)
!880 = !DILocation(line: 154, column: 9, scope: !875, inlinedAt: !865)
!881 = !{!406, !406, i64 0}
!882 = !DILocation(line: 155, column: 7, scope: !875, inlinedAt: !865)
!883 = !DILocation(line: 164, column: 11, scope: !884, inlinedAt: !865)
!884 = distinct !DILexicalBlock(scope: !875, file: !3, line: 164, column: 7)
!885 = !DILocation(line: 164, column: 15, scope: !884, inlinedAt: !865)
!886 = !DILocation(line: 164, column: 25, scope: !884, inlinedAt: !865)
!887 = !DILocation(line: 166, column: 14, scope: !875, inlinedAt: !865)
!888 = !DILocation(line: 166, column: 12, scope: !875, inlinedAt: !865)
!889 = !DILocation(line: 167, column: 7, scope: !890, inlinedAt: !865)
!890 = distinct !DILexicalBlock(scope: !875, file: !3, line: 167, column: 7)
!891 = !DILocation(line: 167, column: 16, scope: !890, inlinedAt: !865)
!892 = !DILocation(line: 167, column: 7, scope: !875, inlinedAt: !865)
!893 = !DILocation(line: 171, column: 11, scope: !894, inlinedAt: !865)
!894 = distinct !DILexicalBlock(scope: !875, file: !3, line: 171, column: 7)
!895 = !DILocation(line: 171, column: 16, scope: !894, inlinedAt: !865)
!896 = !DILocation(line: 171, column: 19, scope: !894, inlinedAt: !865)
!897 = !DILocation(line: 171, column: 28, scope: !894, inlinedAt: !865)
!898 = !DILocation(line: 171, column: 7, scope: !875, inlinedAt: !865)
!899 = !DILocation(line: 172, column: 12, scope: !900, inlinedAt: !865)
!900 = distinct !DILexicalBlock(scope: !901, file: !3, line: 172, column: 8)
!901 = distinct !DILexicalBlock(scope: !894, file: !3, line: 171, column: 35)
!902 = !DILocation(line: 172, column: 17, scope: !900, inlinedAt: !865)
!903 = !DILocation(line: 172, column: 27, scope: !900, inlinedAt: !865)
!904 = !DILocation(line: 180, column: 10, scope: !875, inlinedAt: !865)
!905 = !DILocation(line: 180, column: 7, scope: !875, inlinedAt: !865)
!906 = !DILocation(line: 181, column: 2, scope: !875, inlinedAt: !865)
!907 = !DILocation(line: 0, scope: !875, inlinedAt: !865)
!908 = !DILocation(line: 183, column: 1, scope: !850, inlinedAt: !865)
!909 = !DILocation(line: 203, column: 6, scope: !812, inlinedAt: !816)
!910 = !DILocation(line: 174, column: 13, scope: !901, inlinedAt: !865)
!911 = !{!405, !405, i64 0}
!912 = !DILocation(line: 174, column: 11, scope: !901, inlinedAt: !865)
!913 = !DILocation(line: 175, column: 28, scope: !901, inlinedAt: !865)
!914 = !DILocation(line: 175, column: 13, scope: !901, inlinedAt: !865)
!915 = !DILocation(line: 175, column: 11, scope: !901, inlinedAt: !865)
!916 = !DILocation(line: 207, column: 46, scope: !812, inlinedAt: !816)
!917 = !{!918, !632, i64 0}
!918 = !{!"tcphdr", !632, i64 0, !632, i64 2, !405, i64 4, !405, i64 8, !632, i64 12, !632, i64 12, !632, i64 13, !632, i64 13, !632, i64 13, !632, i64 13, !632, i64 13, !632, i64 13, !632, i64 13, !632, i64 13, !632, i64 14, !632, i64 16, !632, i64 18}
!919 = !DILocation(line: 207, column: 25, scope: !812, inlinedAt: !816)
!920 = !DILocation(line: 207, column: 30, scope: !812, inlinedAt: !816)
!921 = !{!627, !632, i64 44}
!922 = !DILocation(line: 208, column: 46, scope: !812, inlinedAt: !816)
!923 = !{!918, !632, i64 2}
!924 = !DILocation(line: 208, column: 25, scope: !812, inlinedAt: !816)
!925 = !DILocation(line: 208, column: 30, scope: !812, inlinedAt: !816)
!926 = !{!627, !632, i64 64}
!927 = !DILocation(line: 212, column: 24, scope: !812, inlinedAt: !816)
!928 = !DILocation(line: 212, column: 16, scope: !812, inlinedAt: !816)
!929 = !DILocation(line: 212, column: 37, scope: !812, inlinedAt: !816)
!930 = !DILocation(line: 212, column: 31, scope: !812, inlinedAt: !816)
!931 = !DILocation(line: 212, column: 29, scope: !812, inlinedAt: !816)
!932 = !DILocation(line: 212, column: 45, scope: !812, inlinedAt: !816)
!933 = !DILocation(line: 212, column: 62, scope: !812, inlinedAt: !816)
!934 = !DILocation(line: 211, column: 10, scope: !812, inlinedAt: !816)
!935 = !DILocation(line: 211, column: 20, scope: !812, inlinedAt: !816)
!936 = !{!627, !416, i64 124}
!937 = !DILocation(line: 215, column: 42, scope: !812, inlinedAt: !816)
!938 = !DILocation(line: 215, column: 10, scope: !812, inlinedAt: !816)
!939 = !DILocation(line: 215, column: 26, scope: !812, inlinedAt: !816)
!940 = !{!627, !416, i64 125}
!941 = !DILocation(line: 218, column: 20, scope: !942, inlinedAt: !816)
!942 = distinct !DILexicalBlock(scope: !812, file: !3, line: 218, column: 6)
!943 = !DILocation(line: 218, column: 6, scope: !942, inlinedAt: !816)
!944 = !DILocation(line: 218, column: 6, scope: !812, inlinedAt: !816)
!945 = !DILocation(line: 221, column: 13, scope: !946, inlinedAt: !816)
!946 = distinct !DILexicalBlock(scope: !942, file: !3, line: 221, column: 13)
!947 = !DILocation(line: 221, column: 13, scope: !942, inlinedAt: !816)
!948 = !DILocation(line: 222, column: 11, scope: !949, inlinedAt: !816)
!949 = distinct !DILexicalBlock(scope: !946, file: !3, line: 221, column: 32)
!950 = !DILocation(line: 222, column: 22, scope: !949, inlinedAt: !816)
!951 = !{!627, !406, i64 126}
!952 = !DILocation(line: 223, column: 11, scope: !949, inlinedAt: !816)
!953 = !DILocation(line: 223, column: 24, scope: !949, inlinedAt: !816)
!954 = !{!627, !406, i64 127}
!955 = !DILocation(line: 355, column: 14, scope: !956, inlinedAt: !621)
!956 = distinct !DILexicalBlock(scope: !603, file: !3, line: 355, column: 6)
!957 = !DILocation(line: 355, column: 6, scope: !603, inlinedAt: !621)
!958 = !DILocation(line: 224, column: 13, scope: !959, inlinedAt: !816)
!959 = distinct !DILexicalBlock(scope: !946, file: !3, line: 224, column: 13)
!960 = !DILocation(line: 0, scope: !959, inlinedAt: !816)
!961 = !DILocation(line: 224, column: 13, scope: !946, inlinedAt: !816)
!962 = !DILocation(line: 225, column: 22, scope: !963, inlinedAt: !816)
!963 = distinct !DILexicalBlock(scope: !959, file: !3, line: 224, column: 32)
!964 = !DILocation(line: 226, column: 40, scope: !963, inlinedAt: !816)
!965 = !DILocation(line: 226, column: 26, scope: !963, inlinedAt: !816)
!966 = !DILocation(line: 226, column: 11, scope: !963, inlinedAt: !816)
!967 = !DILocation(line: 226, column: 24, scope: !963, inlinedAt: !816)
!968 = !DILocation(line: 230, column: 22, scope: !969, inlinedAt: !816)
!969 = distinct !DILexicalBlock(scope: !959, file: !3, line: 229, column: 9)
!970 = !DILocation(line: 342, column: 29, scope: !803, inlinedAt: !621)
!971 = !DILocalVariable(name: "pctx", arg: 1, scope: !972, file: !3, line: 252, type: !435)
!972 = distinct !DISubprogram(name: "parse_icmp6_identifier", scope: !3, file: !3, line: 252, type: !604, scopeLine: 254, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !973)
!973 = !{!971, !974}
!974 = !DILocalVariable(name: "p_info", arg: 2, scope: !972, file: !3, line: 253, type: !606)
!975 = !DILocation(line: 0, scope: !972, inlinedAt: !976)
!976 = distinct !DILocation(line: 345, column: 9, scope: !803, inlinedAt: !621)
!977 = !DILocalVariable(name: "nh", arg: 1, scope: !978, file: !393, line: 224, type: !639)
!978 = distinct !DISubprogram(name: "parse_icmp6hdr", scope: !393, file: !393, line: 224, type: !979, scopeLine: 227, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !982)
!979 = !DISubroutineType(types: !980)
!980 = !{!136, !639, !94, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!982 = !{!977, !983, !984, !985}
!983 = !DILocalVariable(name: "data_end", arg: 2, scope: !978, file: !393, line: 225, type: !94)
!984 = !DILocalVariable(name: "icmp6hdr", arg: 3, scope: !978, file: !393, line: 226, type: !981)
!985 = !DILocalVariable(name: "icmp6h", scope: !978, file: !393, line: 228, type: !528)
!986 = !DILocation(line: 0, scope: !978, inlinedAt: !987)
!987 = distinct !DILocation(line: 255, column: 6, scope: !988, inlinedAt: !976)
!988 = distinct !DILexicalBlock(scope: !972, file: !3, line: 255, column: 6)
!989 = !DILocation(line: 230, column: 13, scope: !990, inlinedAt: !987)
!990 = distinct !DILexicalBlock(scope: !978, file: !393, line: 230, column: 6)
!991 = !DILocation(line: 230, column: 17, scope: !990, inlinedAt: !987)
!992 = !DILocation(line: 230, column: 6, scope: !978, inlinedAt: !987)
!993 = !DILocation(line: 255, column: 57, scope: !988, inlinedAt: !976)
!994 = !DILocation(line: 233, column: 12, scope: !978, inlinedAt: !987)
!995 = !DILocation(line: 234, column: 12, scope: !978, inlinedAt: !987)
!996 = !DILocation(line: 258, column: 22, scope: !997, inlinedAt: !976)
!997 = distinct !DILexicalBlock(scope: !972, file: !3, line: 258, column: 6)
!998 = !{!999, !406, i64 1}
!999 = !{!"icmp6hdr", !406, i64 0, !406, i64 1, !632, i64 2, !406, i64 4}
!1000 = !DILocation(line: 258, column: 33, scope: !997, inlinedAt: !976)
!1001 = !DILocation(line: 258, column: 6, scope: !972, inlinedAt: !976)
!1002 = !DILocation(line: 261, column: 22, scope: !1003, inlinedAt: !976)
!1003 = distinct !DILexicalBlock(scope: !972, file: !3, line: 261, column: 6)
!1004 = !{!999, !406, i64 0}
!1005 = !DILocation(line: 261, column: 6, scope: !972, inlinedAt: !976)
!1006 = !DILocation(line: 262, column: 44, scope: !1007, inlinedAt: !976)
!1007 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 261, column: 57)
!1008 = !DILocation(line: 262, column: 28, scope: !1007, inlinedAt: !976)
!1009 = !DILocation(line: 262, column: 15, scope: !1007, inlinedAt: !976)
!1010 = !DILocation(line: 262, column: 26, scope: !1007, inlinedAt: !976)
!1011 = !{!627, !405, i64 72}
!1012 = !DILocation(line: 263, column: 11, scope: !1007, inlinedAt: !976)
!1013 = !DILocation(line: 263, column: 21, scope: !1007, inlinedAt: !976)
!1014 = !DILocation(line: 264, column: 11, scope: !1007, inlinedAt: !976)
!1015 = !DILocation(line: 264, column: 27, scope: !1007, inlinedAt: !976)
!1016 = !DILocation(line: 265, column: 2, scope: !1007, inlinedAt: !976)
!1017 = !DILocation(line: 266, column: 50, scope: !1018, inlinedAt: !976)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 265, column: 62)
!1019 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 265, column: 13)
!1020 = !DILocation(line: 266, column: 34, scope: !1018, inlinedAt: !976)
!1021 = !DILocation(line: 266, column: 21, scope: !1018, inlinedAt: !976)
!1022 = !DILocation(line: 266, column: 32, scope: !1018, inlinedAt: !976)
!1023 = !{!627, !405, i64 120}
!1024 = !DILocation(line: 267, column: 11, scope: !1018, inlinedAt: !976)
!1025 = !DILocation(line: 267, column: 27, scope: !1018, inlinedAt: !976)
!1026 = !DILocation(line: 268, column: 11, scope: !1018, inlinedAt: !976)
!1027 = !DILocation(line: 268, column: 21, scope: !1018, inlinedAt: !976)
!1028 = !DILocation(line: 273, column: 10, scope: !972, inlinedAt: !976)
!1029 = !DILocation(line: 273, column: 21, scope: !972, inlinedAt: !976)
!1030 = !DILocation(line: 274, column: 48, scope: !972, inlinedAt: !976)
!1031 = !DILocation(line: 274, column: 25, scope: !972, inlinedAt: !976)
!1032 = !DILocation(line: 274, column: 30, scope: !972, inlinedAt: !976)
!1033 = !DILocation(line: 275, column: 25, scope: !972, inlinedAt: !976)
!1034 = !DILocation(line: 275, column: 30, scope: !972, inlinedAt: !976)
!1035 = !DILocalVariable(name: "pctx", arg: 1, scope: !1036, file: !3, line: 282, type: !435)
!1036 = distinct !DISubprogram(name: "parse_icmp_identifier", scope: !3, file: !3, line: 282, type: !604, scopeLine: 284, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1037 = !{!1035, !1038}
!1038 = !DILocalVariable(name: "p_info", arg: 2, scope: !1036, file: !3, line: 283, type: !606)
!1039 = !DILocation(line: 0, scope: !1036, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 348, column: 9, scope: !806, inlinedAt: !621)
!1041 = !DILocalVariable(name: "nh", arg: 1, scope: !1042, file: !393, line: 239, type: !639)
!1042 = distinct !DISubprogram(name: "parse_icmphdr", scope: !393, file: !393, line: 239, type: !1043, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1046)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!136, !639, !94, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!1046 = !{!1041, !1047, !1048, !1049}
!1047 = !DILocalVariable(name: "data_end", arg: 2, scope: !1042, file: !393, line: 240, type: !94)
!1048 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !1042, file: !393, line: 241, type: !1045)
!1049 = !DILocalVariable(name: "icmph", scope: !1042, file: !393, line: 243, type: !504)
!1050 = !DILocation(line: 0, scope: !1042, inlinedAt: !1051)
!1051 = distinct !DILocation(line: 285, column: 6, scope: !1052, inlinedAt: !1040)
!1052 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 285, column: 6)
!1053 = !DILocation(line: 245, column: 12, scope: !1054, inlinedAt: !1051)
!1054 = distinct !DILexicalBlock(scope: !1042, file: !393, line: 245, column: 6)
!1055 = !DILocation(line: 245, column: 16, scope: !1054, inlinedAt: !1051)
!1056 = !DILocation(line: 245, column: 6, scope: !1042, inlinedAt: !1051)
!1057 = !DILocation(line: 285, column: 56, scope: !1052, inlinedAt: !1040)
!1058 = !DILocation(line: 248, column: 11, scope: !1042, inlinedAt: !1051)
!1059 = !DILocation(line: 249, column: 11, scope: !1042, inlinedAt: !1051)
!1060 = !DILocation(line: 288, column: 21, scope: !1061, inlinedAt: !1040)
!1061 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 288, column: 6)
!1062 = !{!1063, !406, i64 1}
!1063 = !{!"icmphdr", !406, i64 0, !406, i64 1, !632, i64 2, !406, i64 4}
!1064 = !DILocation(line: 288, column: 26, scope: !1061, inlinedAt: !1040)
!1065 = !DILocation(line: 288, column: 6, scope: !1036, inlinedAt: !1040)
!1066 = !DILocation(line: 291, column: 21, scope: !1067, inlinedAt: !1040)
!1067 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 291, column: 6)
!1068 = !{!1063, !406, i64 0}
!1069 = !DILocation(line: 291, column: 6, scope: !1036, inlinedAt: !1040)
!1070 = !DILocation(line: 292, column: 51, scope: !1071, inlinedAt: !1040)
!1071 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 291, column: 40)
!1072 = !DILocation(line: 292, column: 28, scope: !1071, inlinedAt: !1040)
!1073 = !DILocation(line: 292, column: 15, scope: !1071, inlinedAt: !1040)
!1074 = !DILocation(line: 292, column: 26, scope: !1071, inlinedAt: !1040)
!1075 = !DILocation(line: 293, column: 11, scope: !1071, inlinedAt: !1040)
!1076 = !DILocation(line: 293, column: 21, scope: !1071, inlinedAt: !1040)
!1077 = !DILocation(line: 294, column: 11, scope: !1071, inlinedAt: !1040)
!1078 = !DILocation(line: 294, column: 27, scope: !1071, inlinedAt: !1040)
!1079 = !DILocation(line: 295, column: 2, scope: !1071, inlinedAt: !1040)
!1080 = !DILocation(line: 296, column: 57, scope: !1081, inlinedAt: !1040)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 295, column: 52)
!1082 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 295, column: 13)
!1083 = !DILocation(line: 296, column: 34, scope: !1081, inlinedAt: !1040)
!1084 = !DILocation(line: 296, column: 21, scope: !1081, inlinedAt: !1040)
!1085 = !DILocation(line: 296, column: 32, scope: !1081, inlinedAt: !1040)
!1086 = !DILocation(line: 297, column: 11, scope: !1081, inlinedAt: !1040)
!1087 = !DILocation(line: 297, column: 27, scope: !1081, inlinedAt: !1040)
!1088 = !DILocation(line: 298, column: 11, scope: !1081, inlinedAt: !1040)
!1089 = !DILocation(line: 298, column: 21, scope: !1081, inlinedAt: !1040)
!1090 = !DILocation(line: 303, column: 10, scope: !1036, inlinedAt: !1040)
!1091 = !DILocation(line: 303, column: 21, scope: !1036, inlinedAt: !1040)
!1092 = !DILocation(line: 304, column: 47, scope: !1036, inlinedAt: !1040)
!1093 = !DILocation(line: 304, column: 55, scope: !1036, inlinedAt: !1040)
!1094 = !DILocation(line: 304, column: 25, scope: !1036, inlinedAt: !1040)
!1095 = !DILocation(line: 304, column: 30, scope: !1036, inlinedAt: !1040)
!1096 = !DILocation(line: 305, column: 25, scope: !1036, inlinedAt: !1040)
!1097 = !DILocation(line: 305, column: 30, scope: !1036, inlinedAt: !1040)
!1098 = !DILocation(line: 219, column: 11, scope: !1099, inlinedAt: !816)
!1099 = distinct !DILexicalBlock(scope: !942, file: !3, line: 218, column: 25)
!1100 = !DILocation(line: 219, column: 22, scope: !1099, inlinedAt: !816)
!1101 = !DILocation(line: 220, column: 11, scope: !1099, inlinedAt: !816)
!1102 = !DILocation(line: 220, column: 24, scope: !1099, inlinedAt: !816)
!1103 = !DILocation(line: 357, column: 19, scope: !1104, inlinedAt: !621)
!1104 = distinct !DILexicalBlock(scope: !956, file: !3, line: 355, column: 39)
!1105 = !DILocalVariable(name: "ipv6", arg: 1, scope: !1106, file: !3, line: 113, type: !105)
!1106 = distinct !DISubprogram(name: "map_ipv4_to_ipv6", scope: !3, file: !3, line: 113, type: !1107, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1109)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !105, !124}
!1109 = !{!1105, !1110}
!1110 = !DILocalVariable(name: "ipv4", arg: 2, scope: !1106, file: !3, line: 113, type: !124)
!1111 = !DILocation(line: 0, scope: !1106, inlinedAt: !1112)
!1112 = distinct !DILocation(line: 356, column: 3, scope: !1104, inlinedAt: !621)
!1113 = !DILocation(line: 115, column: 2, scope: !1106, inlinedAt: !1112)
!1114 = !DILocation(line: 116, column: 20, scope: !1106, inlinedAt: !1112)
!1115 = !DILocation(line: 116, column: 2, scope: !1106, inlinedAt: !1112)
!1116 = !DILocation(line: 117, column: 2, scope: !1106, inlinedAt: !1112)
!1117 = !DILocation(line: 117, column: 27, scope: !1106, inlinedAt: !1112)
!1118 = !DILocation(line: 358, column: 38, scope: !1104, inlinedAt: !621)
!1119 = !DILocation(line: 359, column: 19, scope: !1104, inlinedAt: !621)
!1120 = !DILocation(line: 0, scope: !1106, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 358, column: 3, scope: !1104, inlinedAt: !621)
!1122 = !DILocation(line: 115, column: 2, scope: !1106, inlinedAt: !1121)
!1123 = !DILocation(line: 116, column: 20, scope: !1106, inlinedAt: !1121)
!1124 = !DILocation(line: 116, column: 2, scope: !1106, inlinedAt: !1121)
!1125 = !DILocation(line: 117, column: 2, scope: !1106, inlinedAt: !1121)
!1126 = !DILocation(line: 117, column: 27, scope: !1106, inlinedAt: !1121)
!1127 = !DILocation(line: 360, column: 2, scope: !1104, inlinedAt: !621)
!1128 = !DILocation(line: 361, column: 45, scope: !1129, inlinedAt: !621)
!1129 = distinct !DILexicalBlock(scope: !956, file: !3, line: 360, column: 9)
!1130 = !{i64 0, i64 16, !881, i64 0, i64 16, !881, i64 0, i64 16, !881}
!1131 = !DILocation(line: 362, column: 20, scope: !1129, inlinedAt: !621)
!1132 = !DILocation(line: 362, column: 45, scope: !1129, inlinedAt: !621)
!1133 = !DILocation(line: 127, column: 31, scope: !1134, inlinedAt: !1140)
!1134 = distinct !DISubprogram(name: "remaining_pkt_payload", scope: !3, file: !3, line: 123, type: !1135, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1137)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!104, !435}
!1137 = !{!1138, !1139}
!1138 = !DILocalVariable(name: "ctx", arg: 1, scope: !1134, file: !3, line: 123, type: !435)
!1139 = !DILocalVariable(name: "parsed_bytes", scope: !1134, file: !3, line: 127, type: !104)
!1140 = distinct !DILocation(line: 366, column: 20, scope: !603, inlinedAt: !621)
!1141 = !DILocation(line: 365, column: 24, scope: !603, inlinedAt: !621)
!1142 = !DILocalVariable(name: "dest", arg: 1, scope: !1143, file: !15, line: 167, type: !172)
!1143 = distinct !DISubprogram(name: "reverse_flow", scope: !15, file: !15, line: 167, type: !1144, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1146)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{null, !172, !172}
!1146 = !{!1142, !1147}
!1147 = !DILocalVariable(name: "src", arg: 2, scope: !1143, file: !15, line: 167, type: !172)
!1148 = !DILocation(line: 0, scope: !1143, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 365, column: 2, scope: !603, inlinedAt: !621)
!1150 = !DILocation(line: 169, column: 8, scope: !1143, inlinedAt: !1149)
!1151 = !DILocation(line: 169, column: 12, scope: !1143, inlinedAt: !1149)
!1152 = !{!629, !406, i64 42}
!1153 = !DILocation(line: 170, column: 8, scope: !1143, inlinedAt: !1149)
!1154 = !DILocation(line: 170, column: 14, scope: !1143, inlinedAt: !1149)
!1155 = !{!629, !632, i64 40}
!1156 = !DILocation(line: 171, column: 21, scope: !1143, inlinedAt: !1149)
!1157 = !{i64 0, i64 16, !881, i64 0, i64 16, !881, i64 0, i64 16, !881, i64 16, i64 2, !677, i64 18, i64 2, !677}
!1158 = !DILocation(line: 172, column: 8, scope: !1143, inlinedAt: !1149)
!1159 = !DILocation(line: 172, column: 21, scope: !1143, inlinedAt: !1149)
!1160 = !DILocation(line: 173, column: 8, scope: !1143, inlinedAt: !1149)
!1161 = !DILocation(line: 173, column: 17, scope: !1143, inlinedAt: !1149)
!1162 = !{!629, !406, i64 43}
!1163 = !DILocation(line: 0, scope: !1134, inlinedAt: !1140)
!1164 = !DILocation(line: 127, column: 42, scope: !1134, inlinedAt: !1140)
!1165 = !DILocation(line: 127, column: 35, scope: !1134, inlinedAt: !1140)
!1166 = !DILocation(line: 127, column: 23, scope: !1134, inlinedAt: !1140)
!1167 = !DILocation(line: 128, column: 29, scope: !1134, inlinedAt: !1140)
!1168 = !DILocation(line: 128, column: 9, scope: !1134, inlinedAt: !1140)
!1169 = !DILocation(line: 366, column: 10, scope: !603, inlinedAt: !621)
!1170 = !DILocation(line: 366, column: 18, scope: !603, inlinedAt: !621)
!1171 = !{!627, !405, i64 24}
!1172 = !DILocalVariable(name: "ctx", arg: 1, scope: !1173, file: !3, line: 495, type: !94)
!1173 = distinct !DISubprogram(name: "update_flow", scope: !3, file: !3, line: 495, type: !1174, scopeLine: 497, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1177)
