; ModuleID = './src/protocols/bus/bus.c'
source_filename = "./src/protocols/bus/bus.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_bus = type { %struct.nn_xbus }
%struct.nn_xbus = type { %struct.nn_sockbase, %struct.nn_dist, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_dist = type { i64, %struct.nn_list }
%struct.nn_list = type { ptr, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@nn_bus_socktype_struct = internal global %struct.nn_socktype { i32 1, i32 112, i32 0, ptr @nn_bus_create, ptr @nn_xbus_ispeer, %struct.nn_list_item { ptr inttoptr (i64 -1 to ptr), ptr inttoptr (i64 -1 to ptr) } }, align 8, !dbg !0
@nn_bus_socktype = dso_local global ptr @nn_bus_socktype_struct, align 8, !dbg !128
@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !146

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_bus_socktype_struct", scope: !2, file: !7, line: 133, type: !131, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !127, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/protocols/bus/bus.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b7decdd14af1e61e381200acd4dd165f")
!4 = !{!5, !125, !32}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_bus", file: !7, line: 34, size: 3456, elements: !8)
!7 = !DIFile(filename: "./src/protocols/bus/bus.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b7decdd14af1e61e381200acd4dd165f")
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "xbus", scope: !6, file: !7, line: 35, baseType: !10, size: 3456)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xbus", file: !11, line: 38, size: 3456, elements: !12)
!11 = !DIFile(filename: "./src/protocols/bus/xbus.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f88088650de267aee352723b18bd57ef")
!12 = !{!13, !86, !102}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !10, file: !11, line: 39, baseType: !14, size: 128)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !15, line: 123, size: 128, elements: !16)
!15 = !DIFile(filename: "./src/protocols/bus/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!16 = !{!17, !83}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !14, file: !15, line: 124, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !15, line: 84, size: 704, elements: !21)
!21 = !{!22, !27, !28, !35, !39, !40, !41, !45, !67, !68, !77}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !20, file: !15, line: 87, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !20, file: !15, line: 90, baseType: !23, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !20, file: !15, line: 97, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !26, !33}
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !15, line: 56, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !20, file: !15, line: 98, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !26, !33}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !20, file: !15, line: 99, baseType: !36, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !20, file: !15, line: 100, baseType: !36, size: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !20, file: !15, line: 104, baseType: !42, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!32, !26}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !20, file: !15, line: 108, baseType: !46, size: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!32, !26, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !51, line: 30, size: 512, elements: !52)
!51 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!52 = !{!53, !66}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !50, file: !51, line: 33, baseType: !54, size: 256)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !55, line: 39, size: 256, elements: !56)
!55 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!56 = !{!57}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !54, file: !55, line: 40, baseType: !58, size: 256)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !60, line: 24, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !62, line: 38, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !50, file: !51, line: 36, baseType: !54, size: 256, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !20, file: !15, line: 112, baseType: !46, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !20, file: !15, line: 115, baseType: !69, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!32, !26, !32, !32, !72, !74}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!76 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !20, file: !15, line: 119, baseType: !78, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!32, !26, !32, !32, !81, !82}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !14, file: !15, line: 125, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !15, line: 125, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "outpipes", scope: !10, file: !11, line: 40, baseType: !87, size: 192, offset: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_dist", file: !88, line: 37, size: 192, elements: !89)
!88 = !DIFile(filename: "./src/protocols/bus/../utils/dist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8b675b0838905739d217dd53d5a3b3af")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !87, file: !88, line: 38, baseType: !74, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !87, file: !88, line: 39, baseType: !92, size: 128, offset: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !93, line: 31, size: 128, elements: !94)
!93 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!94 = !{!95, !101}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !92, file: !93, line: 32, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !93, line: 26, size: 128, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !93, line: 27, baseType: !96, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !97, file: !93, line: 28, baseType: !96, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !92, file: !93, line: 33, baseType: !96, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "inpipes", scope: !10, file: !11, line: 41, baseType: !103, size: 3136, offset: 320)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !104, line: 37, size: 3136, elements: !105)
!104 = !DIFile(filename: "./src/protocols/bus/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !103, file: !104, line: 38, baseType: !107, size: 3136)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !108, line: 45, size: 3136, elements: !109)
!108 = !DIFile(filename: "./src/protocols/bus/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!109 = !{!110, !124}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !107, file: !108, line: 46, baseType: !111, size: 3072)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 3072, elements: !122)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !108, line: 40, size: 192, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !112, file: !108, line: 41, baseType: !92, size: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !112, file: !108, line: 42, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !108, line: 34, size: 256, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !117, file: !108, line: 35, baseType: !33, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !117, file: !108, line: 36, baseType: !32, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !117, file: !108, line: 37, baseType: !97, size: 128, offset: 128)
!122 = !{!123}
!123 = !DISubrange(count: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !107, file: !108, line: 47, baseType: !32, size: 32, offset: 3072)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !{!128, !0, !146, !151, !156, !158, !163, !168}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "nn_bus_socktype", scope: !2, file: !7, line: 142, type: !130, isLocal: false, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !15, line: 160, size: 384, elements: !132)
!132 = !{!133, !134, !135, !136, !141, !145}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !131, file: !15, line: 163, baseType: !32, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !131, file: !15, line: 164, baseType: !32, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !15, line: 167, baseType: !32, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !131, file: !15, line: 173, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!32, !81, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !131, file: !15, line: 179, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!32, !32}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !131, file: !15, line: 183, baseType: !97, size: 128, offset: 256)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !7, line: 126, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 184, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 23)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(scope: null, file: !7, line: 126, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 208, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 26)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "nn_bus_sockbase_vfptr", scope: !2, file: !7, line: 47, type: !19, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !7, line: 95, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 136, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 17)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !7, line: 112, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 240, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 30)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !7, line: 112, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 400, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 50)
!173 = !{i32 7, !"Dwarf Version", i32 5}
!174 = !{i32 2, !"Debug Info Version", i32 3}
!175 = !{i32 1, !"wchar_size", i32 4}
!176 = !{i32 8, !"PIC Level", i32 2}
!177 = !{i32 7, !"PIE Level", i32 2}
!178 = !{i32 7, !"uwtable", i32 2}
!179 = !{i32 7, !"frame-pointer", i32 2}
!180 = !{!"clang version 16.0.0"}
!181 = distinct !DISubprogram(name: "nn_bus_create", scope: !7, file: !7, line: 121, type: !138, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !182)
!182 = !{}
!183 = !DILocalVariable(name: "hint", arg: 1, scope: !181, file: !7, line: 121, type: !81)
!184 = !DILocation(line: 121, column: 33, scope: !181)
!185 = !DILocalVariable(name: "sockbase", arg: 2, scope: !181, file: !7, line: 121, type: !140)
!186 = !DILocation(line: 121, column: 60, scope: !181)
!187 = !DILocalVariable(name: "self", scope: !181, file: !7, line: 123, type: !5)
!188 = !DILocation(line: 123, column: 20, scope: !181)
!189 = !DILocation(line: 125, column: 12, scope: !181)
!190 = !DILocation(line: 125, column: 10, scope: !181)
!191 = !DILocation(line: 126, column: 5, scope: !181)
!192 = !DILocation(line: 126, column: 5, scope: !193)
!193 = distinct !DILexicalBlock(scope: !194, file: !7, line: 126, column: 5)
!194 = distinct !DILexicalBlock(scope: !181, file: !7, line: 126, column: 5)
!195 = !DILocation(line: 126, column: 5, scope: !194)
!196 = !DILocation(line: 126, column: 5, scope: !197)
!197 = distinct !DILexicalBlock(scope: !193, file: !7, line: 126, column: 5)
!198 = !DILocation(line: 127, column: 18, scope: !181)
!199 = !DILocation(line: 127, column: 48, scope: !181)
!200 = !DILocation(line: 127, column: 5, scope: !181)
!201 = !DILocation(line: 128, column: 18, scope: !181)
!202 = !DILocation(line: 128, column: 24, scope: !181)
!203 = !DILocation(line: 128, column: 29, scope: !181)
!204 = !DILocation(line: 128, column: 6, scope: !181)
!205 = !DILocation(line: 128, column: 15, scope: !181)
!206 = !DILocation(line: 130, column: 5, scope: !181)
