; ModuleID = './src/protocols/bus/xbus.c'
source_filename = "./src/protocols/bus/xbus.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_xbus = type { %struct.nn_sockbase, %struct.nn_dist, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_dist = type { i64, %struct.nn_list }
%struct.nn_list = type { ptr, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_xbus_data = type { %struct.nn_dist_data, %struct.nn_fq_data }
%struct.nn_dist_data = type { %struct.nn_list_item, ptr }
%struct.nn_fq_data = type { %struct.nn_priolist_data }
%struct.nn_priolist_data = type { ptr, i32, %struct.nn_list_item }
%struct.nn_msg = type { %struct.nn_chunkref, %struct.nn_chunkref }
%struct.nn_chunkref = type { [32 x i8] }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [27 x i8] c"./src/protocols/bus/xbus.c\00", align 1, !dbg !7

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/protocols/bus/xbus.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7c073cd082d6c761630320efa87a84d0")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 27)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "nn_xbus_socktype_struct", scope: !14, file: !2, line: 222, type: !138, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !15, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !16, globals: !134, splitDebugInlining: false, nameTableKind: None)
!15 = !DIFile(filename: "src/protocols/bus/xbus.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7c073cd082d6c761630320efa87a84d0")
!16 = !{!17, !133}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xbus", file: !19, line: 38, size: 3456, elements: !20)
!19 = !DIFile(filename: "./src/protocols/bus/xbus.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "f88088650de267aee352723b18bd57ef")
!20 = !{!21, !94, !110}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !18, file: !19, line: 39, baseType: !22, size: 128)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !23, line: 123, size: 128, elements: !24)
!23 = !DIFile(filename: "./src/protocols/bus/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!24 = !{!25, !91}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !22, file: !23, line: 124, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !23, line: 84, size: 704, elements: !29)
!29 = !{!30, !35, !36, !43, !47, !48, !49, !53, !75, !76, !85}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !28, file: !23, line: 87, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !28, file: !23, line: 90, baseType: !31, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !28, file: !23, line: 97, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !34, !41}
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !23, line: 56, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !28, file: !23, line: 98, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !34, !41}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !28, file: !23, line: 99, baseType: !44, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !28, file: !23, line: 100, baseType: !44, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !28, file: !23, line: 104, baseType: !50, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!40, !34}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !28, file: !23, line: 108, baseType: !54, size: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!40, !34, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !59, line: 30, size: 512, elements: !60)
!59 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!60 = !{!61, !74}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !58, file: !59, line: 33, baseType: !62, size: 256)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !63, line: 39, size: 256, elements: !64)
!63 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !62, file: !63, line: 40, baseType: !66, size: 256)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, elements: !72)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !68, line: 24, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !70, line: 38, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !58, file: !59, line: 36, baseType: !62, size: 256, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !28, file: !23, line: 112, baseType: !54, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !28, file: !23, line: 115, baseType: !77, size: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!40, !34, !40, !40, !80, !82}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 46, baseType: !84)
!83 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!84 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !28, file: !23, line: 119, baseType: !86, size: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!40, !34, !40, !40, !89, !90}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !22, file: !23, line: 125, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !23, line: 125, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "outpipes", scope: !18, file: !19, line: 40, baseType: !95, size: 192, offset: 128)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_dist", file: !96, line: 37, size: 192, elements: !97)
!96 = !DIFile(filename: "./src/protocols/bus/../utils/dist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8b675b0838905739d217dd53d5a3b3af")
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !95, file: !96, line: 38, baseType: !82, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !95, file: !96, line: 39, baseType: !100, size: 128, offset: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !101, line: 31, size: 128, elements: !102)
!101 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!102 = !{!103, !109}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !100, file: !101, line: 32, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !101, line: 26, size: 128, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !101, line: 27, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !105, file: !101, line: 28, baseType: !104, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !100, file: !101, line: 33, baseType: !104, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "inpipes", scope: !18, file: !19, line: 41, baseType: !111, size: 3136, offset: 320)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !112, line: 37, size: 3136, elements: !113)
!112 = !DIFile(filename: "./src/protocols/bus/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !111, file: !112, line: 38, baseType: !115, size: 3136)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !116, line: 45, size: 3136, elements: !117)
!116 = !DIFile(filename: "./src/protocols/bus/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!117 = !{!118, !132}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !115, file: !116, line: 46, baseType: !119, size: 3072)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 3072, elements: !130)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !116, line: 40, size: 192, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !120, file: !116, line: 41, baseType: !100, size: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !120, file: !116, line: 42, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !116, line: 34, size: 256, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !125, file: !116, line: 35, baseType: !41, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !125, file: !116, line: 36, baseType: !40, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !125, file: !116, line: 37, baseType: !105, size: 128, offset: 128)
!130 = !{!131}
!131 = !DISubrange(count: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !115, file: !116, line: 47, baseType: !40, size: 32, offset: 3072)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!134 = !{!0, !7, !135, !12, !153}
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "nn_xbus_socktype", scope: !14, file: !2, line: 231, type: !137, isLocal: false, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !23, line: 160, size: 384, elements: !139)
!139 = !{!140, !141, !142, !143, !148, !152}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !138, file: !23, line: 163, baseType: !40, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !138, file: !23, line: 164, baseType: !40, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !23, line: 167, baseType: !40, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !138, file: !23, line: 173, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!40, !89, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !138, file: !23, line: 179, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!40, !40}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !138, file: !23, line: 183, baseType: !105, size: 128, offset: 256)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "nn_xbus_sockbase_vfptr", scope: !14, file: !2, line: 45, type: !27, isLocal: true, isDefinition: true)
!155 = !{i32 7, !"Dwarf Version", i32 5}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{i32 1, !"wchar_size", i32 4}
!158 = !{i32 8, !"PIC Level", i32 2}
!159 = !{i32 7, !"PIE Level", i32 2}
!160 = !{i32 7, !"uwtable", i32 2}
!161 = !{i32 7, !"frame-pointer", i32 2}
!162 = !{!"clang version 16.0.0"}
!163 = distinct !DISubprogram(name: "nn_xbus_init", scope: !2, file: !2, line: 59, type: !164, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !166)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !17, !26, !89}
!166 = !{}
!167 = !DILocalVariable(name: "self", arg: 1, scope: !163, file: !2, line: 59, type: !17)
!168 = !DILocation(line: 59, column: 36, scope: !163)
!169 = !DILocalVariable(name: "vfptr", arg: 2, scope: !163, file: !2, line: 60, type: !26)
!170 = !DILocation(line: 60, column: 37, scope: !163)
!171 = !DILocalVariable(name: "hint", arg: 3, scope: !163, file: !2, line: 60, type: !89)
!172 = !DILocation(line: 60, column: 50, scope: !163)
!173 = !DILocation(line: 62, column: 24, scope: !163)
!174 = !DILocation(line: 62, column: 30, scope: !163)
!175 = !DILocation(line: 62, column: 40, scope: !163)
!176 = !DILocation(line: 62, column: 47, scope: !163)
!177 = !DILocation(line: 62, column: 5, scope: !163)
!178 = !DILocation(line: 63, column: 20, scope: !163)
!179 = !DILocation(line: 63, column: 26, scope: !163)
!180 = !DILocation(line: 63, column: 5, scope: !163)
!181 = !DILocation(line: 64, column: 18, scope: !163)
!182 = !DILocation(line: 64, column: 24, scope: !163)
!183 = !DILocation(line: 64, column: 5, scope: !163)
!184 = !DILocation(line: 65, column: 1, scope: !163)
!185 = distinct !DISubprogram(name: "nn_xbus_term", scope: !2, file: !2, line: 67, type: !186, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !166)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !17}
!188 = !DILocalVariable(name: "self", arg: 1, scope: !185, file: !2, line: 67, type: !17)
!189 = !DILocation(line: 67, column: 36, scope: !185)
!190 = !DILocation(line: 69, column: 18, scope: !185)
!191 = !DILocation(line: 69, column: 24, scope: !185)
!192 = !DILocation(line: 69, column: 5, scope: !185)
!193 = !DILocation(line: 70, column: 20, scope: !185)
!194 = !DILocation(line: 70, column: 26, scope: !185)
!195 = !DILocation(line: 70, column: 5, scope: !185)
!196 = !DILocation(line: 71, column: 24, scope: !185)
!197 = !DILocation(line: 71, column: 30, scope: !185)
!198 = !DILocation(line: 71, column: 5, scope: !185)
!199 = !DILocation(line: 72, column: 1, scope: !185)
!200 = distinct !DISubprogram(name: "nn_xbus_add", scope: !2, file: !2, line: 84, type: !38, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !166)
!201 = !DILocalVariable(name: "self", arg: 1, scope: !200, file: !2, line: 84, type: !34)
!202 = !DILocation(line: 84, column: 38, scope: !200)
!203 = !DILocalVariable(name: "pipe", arg: 2, scope: !200, file: !2, line: 84, type: !41)
!204 = !DILocation(line: 84, column: 60, scope: !200)
!205 = !DILocalVariable(name: "xbus", scope: !200, file: !2, line: 86, type: !17)
!206 = !DILocation(line: 86, column: 21, scope: !200)
!207 = !DILocalVariable(name: "data", scope: !200, file: !2, line: 87, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xbus_data", file: !19, line: 33, size: 448, elements: !210)
!210 = !{!211, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "outitem", scope: !209, file: !19, line: 34, baseType: !212, size: 192)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_dist_data", file: !96, line: 32, size: 192, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !212, file: !96, line: 33, baseType: !105, size: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !212, file: !96, line: 34, baseType: !41, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "initem", scope: !209, file: !19, line: 35, baseType: !217, size: 256, offset: 192)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq_data", file: !112, line: 33, size: 256, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !217, file: !112, line: 34, baseType: !125, size: 256)
!220 = !DILocation(line: 87, column: 26, scope: !200)
!221 = !DILocation(line: 89, column: 12, scope: !200)
!222 = !DILocation(line: 89, column: 10, scope: !200)
!223 = !DILocation(line: 91, column: 12, scope: !200)
!224 = !DILocation(line: 91, column: 10, scope: !200)
!225 = !DILocation(line: 93, column: 5, scope: !200)
!226 = !DILocation(line: 93, column: 5, scope: !227)
!227 = distinct !DILexicalBlock(scope: !228, file: !2, line: 93, column: 5)
!228 = distinct !DILexicalBlock(scope: !200, file: !2, line: 93, column: 5)
!229 = !DILocation(line: 93, column: 5, scope: !228)
!230 = !DILocation(line: 93, column: 5, scope: !231)
!231 = distinct !DILexicalBlock(scope: !227, file: !2, line: 93, column: 5)
!232 = !DILocation(line: 94, column: 17, scope: !200)
!233 = !DILocation(line: 94, column: 23, scope: !200)
!234 = !DILocation(line: 94, column: 32, scope: !200)
!235 = !DILocation(line: 94, column: 39, scope: !200)
!236 = !DILocation(line: 94, column: 45, scope: !200)
!237 = !DILocation(line: 94, column: 5, scope: !200)
!238 = !DILocation(line: 95, column: 19, scope: !200)
!239 = !DILocation(line: 95, column: 25, scope: !200)
!240 = !DILocation(line: 95, column: 35, scope: !200)
!241 = !DILocation(line: 95, column: 42, scope: !200)
!242 = !DILocation(line: 95, column: 48, scope: !200)
!243 = !DILocation(line: 95, column: 5, scope: !200)
!244 = !DILocation(line: 96, column: 22, scope: !200)
!245 = !DILocation(line: 96, column: 28, scope: !200)
!246 = !DILocation(line: 96, column: 5, scope: !200)
!247 = !DILocation(line: 98, column: 5, scope: !200)
!248 = distinct !DISubprogram(name: "nn_xbus_rm", scope: !2, file: !2, line: 101, type: !45, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !166)
!249 = !DILocalVariable(name: "self", arg: 1, scope: !248, file: !2, line: 101, type: !34)
!250 = !DILocation(line: 101, column: 38, scope: !248)
!251 = !DILocalVariable(name: "pipe", arg: 2, scope: !248, file: !2, line: 101, type: !41)
!252 = !DILocation(line: 101, column: 60, scope: !248)
!253 = !DILocalVariable(name: "xbus", scope: !248, file: !2, line: 103, type: !17)
!254 = !DILocation(line: 103, column: 21, scope: !248)
!255 = !DILocalVariable(name: "data", scope: !248, file: !2, line: 104, type: !208)
!256 = !DILocation(line: 104, column: 26, scope: !248)
!257 = !DILocation(line: 106, column: 12, scope: !248)
!258 = !DILocation(line: 106, column: 10, scope: !248)
!259 = !DILocation(line: 107, column: 29, scope: !248)
!260 = !DILocation(line: 107, column: 12, scope: !248)
!261 = !DILocation(line: 107, column: 10, scope: !248)
!262 = !DILocation(line: 109, column: 16, scope: !248)
!263 = !DILocation(line: 109, column: 22, scope: !248)
!264 = !DILocation(line: 109, column: 31, scope: !248)
!265 = !DILocation(line: 109, column: 38, scope: !248)
!266 = !DILocation(line: 109, column: 44, scope: !248)
!267 = !DILocation(line: 109, column: 5, scope: !248)
!268 = !DILocation(line: 110, column: 18, scope: !248)
!269 = !DILocation(line: 110, column: 24, scope: !248)
!270 = !DILocation(line: 110, column: 34, scope: !248)
!271 = !DILocation(line: 110, column: 41, scope: !248)
!272 = !DILocation(line: 110, column: 47, scope: !248)
!273 = !DILocation(line: 110, column: 5, scope: !248)
!274 = !DILocation(line: 112, column: 14, scope: !248)
!275 = !DILocation(line: 112, column: 5, scope: !248)
!276 = !DILocation(line: 113, column: 1, scope: !248)
!277 = distinct !DISubprogram(name: "nn_xbus_in", scope: !2, file: !2, line: 115, type: !45, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !166)
