; ModuleID = './ylog.c'
source_filename = "./ylog.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ylog_main_s = type { ptr, i32, ptr, ptr, ptr, ptr, i32, i32, ptr, i32 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }

@_ylog_gl = global %struct.ylog_main_s { ptr null, i32 1, ptr null, ptr null, ptr null, ptr null, i32 3, i32 524288, ptr null, i32 24 }, align 8, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"a\00", align 1, !dbg !30
@.str.1 = private unnamed_addr constant [9 x i8] c"./ylog.c\00", align 1, !dbg !37
@__FUNCTION__.ylog_init = private unnamed_addr constant [10 x i8] c"ylog_init\00", align 1, !dbg !42
@.str.2 = private unnamed_addr constant [23 x i8] c"Problem with file '%s'\00", align 1, !dbg !48
@.str.3 = private unnamed_addr constant [13 x i8] c"YLOG_MODULES\00", align 1, !dbg !53
@.str.4 = private unnamed_addr constant [6 x i8] c"DEBUG\00", align 1, !dbg !58
@.str.5 = private unnamed_addr constant [5 x i8] c"INFO\00", align 1, !dbg !63
@.str.6 = private unnamed_addr constant [5 x i8] c"NOTE\00", align 1, !dbg !68
@.str.7 = private unnamed_addr constant [5 x i8] c"WARN\00", align 1, !dbg !70

!43 = distinct !DIGlobalVariable(scope: null, file: !32, line: 59, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 80, elements: !46)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!46 = !{!47}
!47 = !DISubrange(count: 10)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !32, line: 59, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 184, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 23)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !32, line: 62, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 104, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 13)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !32, line: 127, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 48, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 6)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !32, line: 127, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 40, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 5)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !32, line: 127, type: !65, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(scope: null, file: !32, line: 127, type: !65, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(scope: null, file: !32, line: 127, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 4)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !32, line: 127, type: !65, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !32, line: 139, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !32, line: 153, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 152, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 19)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !32, line: 170, type: !91, isLocal: true, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 24, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 3)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !32, line: 180, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 288, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 36)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !32, line: 200, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 88, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 11)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !32, line: 200, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 272, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 34)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !32, line: 215, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 168, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 21)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(scope: null, file: !32, line: 220, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 256, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 32)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !32, line: 229, type: !33, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !32, line: 233, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 200, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 25)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ylog_main_t", file: !6, line: 312, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ylog_main_s", file: !6, line: 297, size: 576, elements: !128)
!128 = !{!129, !134, !135, !137, !194, !195, !196, !198, !199, !200}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !127, file: !6, line: 299, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !127, file: !6, line: 300, baseType: !28, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !127, file: !6, line: 301, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !127, file: !6, line: 302, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !140, line: 7, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !142, line: 49, size: 1728, elements: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !159, !161, !162, !163, !167, !169, !171, !172, !175, !177, !180, !183, !184, !185, !189, !190}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !141, file: !142, line: 51, baseType: !28, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !141, file: !142, line: 54, baseType: !136, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !141, file: !142, line: 55, baseType: !136, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !141, file: !142, line: 56, baseType: !136, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !141, file: !142, line: 57, baseType: !136, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !141, file: !142, line: 58, baseType: !136, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !141, file: !142, line: 59, baseType: !136, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !141, file: !142, line: 60, baseType: !136, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !141, file: !142, line: 61, baseType: !136, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !141, file: !142, line: 64, baseType: !136, size: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !141, file: !142, line: 65, baseType: !136, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !141, file: !142, line: 66, baseType: !136, size: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !141, file: !142, line: 68, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !142, line: 36, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !141, file: !142, line: 70, baseType: !160, size: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !141, file: !142, line: 72, baseType: !28, size: 32, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !141, file: !142, line: 73, baseType: !28, size: 32, offset: 928)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !141, file: !142, line: 74, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !165, line: 152, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!166 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !141, file: !142, line: 77, baseType: !168, size: 16, offset: 1024)
!168 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !141, file: !142, line: 78, baseType: !170, size: 8, offset: 1040)
!170 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !141, file: !142, line: 79, baseType: !81, size: 8, offset: 1048)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !141, file: !142, line: 81, baseType: !173, size: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !142, line: 43, baseType: null)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !141, file: !142, line: 89, baseType: !176, size: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !165, line: 153, baseType: !166)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !141, file: !142, line: 91, baseType: !178, size: 64, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !142, line: 37, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !141, file: !142, line: 92, baseType: !181, size: 64, offset: 1280)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !142, line: 38, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !141, file: !142, line: 93, baseType: !160, size: 64, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !141, file: !142, line: 94, baseType: !27, size: 64, offset: 1408)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !141, file: !142, line: 95, baseType: !186, size: 64, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !187, line: 46, baseType: !188)
!187 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!188 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !141, file: !142, line: 96, baseType: !28, size: 32, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !141, file: !142, line: 98, baseType: !191, size: 160, offset: 1568)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 20)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "progname", scope: !127, file: !6, line: 303, baseType: !136, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "identname", scope: !127, file: !6, line: 304, baseType: !136, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !127, file: !6, line: 305, baseType: !197, size: 32, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ylog_priority_t", file: !6, line: 278, baseType: !5)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "max_log_size", scope: !127, file: !6, line: 306, baseType: !7, size: 32, offset: 416)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !127, file: !6, line: 307, baseType: !136, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "facility", scope: !127, file: !6, line: 308, baseType: !28, size: 32, offset: 512)
!201 = !{i32 7, !"Dwarf Version", i32 5}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{i32 1, !"wchar_size", i32 4}
!204 = !{i32 8, !"PIC Level", i32 2}
!205 = !{i32 7, !"uwtable", i32 2}
!206 = !{i32 7, !"frame-pointer", i32 2}
!207 = !{!"clang version 16.0.0"}
!208 = distinct !DISubprogram(name: "ylog_init", scope: !32, file: !32, line: 23, type: !209, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !28, !136, !136, !7}
!211 = !{}
!212 = !DILocalVariable(name: "setup", arg: 1, scope: !208, file: !32, line: 23, type: !28)
!213 = !DILocation(line: 23, column: 20, scope: !208)
!214 = !DILocalVariable(name: "filename", arg: 2, scope: !208, file: !32, line: 23, type: !136)
!215 = !DILocation(line: 23, column: 33, scope: !208)
!216 = !DILocalVariable(name: "progname", arg: 3, scope: !208, file: !32, line: 23, type: !136)
!217 = !DILocation(line: 23, column: 49, scope: !208)
!218 = !DILocalVariable(name: "max_log_size", arg: 4, scope: !208, file: !32, line: 24, type: !7)
!219 = !DILocation(line: 24, column: 22, scope: !208)
!220 = !DILocalVariable(name: "pt", scope: !208, file: !32, line: 26, type: !136)
!221 = !DILocation(line: 26, column: 9, scope: !208)
!222 = !DILocalVariable(name: "i", scope: !208, file: !32, line: 27, type: !28)
!223 = !DILocation(line: 27, column: 7, scope: !208)
!224 = !DILocation(line: 29, column: 16, scope: !225)
!225 = distinct !DILexicalBlock(scope: !208, file: !32, line: 29, column: 7)
!226 = !DILocation(line: 29, column: 22, scope: !225)
!227 = !DILocation(line: 29, column: 34, scope: !225)
!228 = !DILocation(line: 29, column: 46, scope: !225)
!229 = !DILocation(line: 29, column: 37, scope: !225)
!230 = !DILocation(line: 29, column: 7, scope: !208)
!231 = !DILocation(line: 30, column: 21, scope: !225)
!232 = !DILocation(line: 30, column: 5, scope: !225)
!233 = !DILocation(line: 31, column: 3, scope: !208)
!234 = !DILocation(line: 32, column: 3, scope: !208)
!235 = !DILocation(line: 33, column: 3, scope: !208)
!236 = !DILocation(line: 34, column: 3, scope: !208)
!237 = !DILocation(line: 35, column: 17, scope: !208)
!238 = !DILocation(line: 36, column: 20, scope: !208)
!239 = !DILocation(line: 36, column: 18, scope: !208)
!240 = !DILocation(line: 37, column: 17, scope: !208)
!241 = !DILocation(line: 38, column: 21, scope: !208)
!242 = !DILocation(line: 39, column: 28, scope: !208)
!243 = !DILocation(line: 39, column: 41, scope: !208)
!244 = !DILocation(line: 39, column: 44, scope: !208)
!245 = !DILocation(line: 39, column: 57, scope: !208)
!246 = !DILocation(line: 39, column: 27, scope: !208)
!247 = !DILocation(line: 40, column: 13, scope: !208)
!248 = !DILocation(line: 39, column: 25, scope: !208)
!249 = !DILocation(line: 41, column: 7, scope: !250)
!250 = distinct !DILexicalBlock(scope: !208, file: !32, line: 41, column: 7)
!251 = !DILocation(line: 41, column: 16, scope: !250)
!252 = !DILocation(line: 41, column: 26, scope: !250)
!253 = !DILocation(line: 41, column: 19, scope: !250)
!254 = !DILocation(line: 41, column: 7, scope: !208)
!255 = !DILocation(line: 43, column: 25, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !32, line: 43, column: 11)
!257 = distinct !DILexicalBlock(scope: !250, file: !32, line: 42, column: 5)
!258 = !DILocation(line: 43, column: 17, scope: !256)
!259 = !DILocation(line: 43, column: 15, scope: !256)
!260 = !DILocation(line: 43, column: 43, scope: !256)
!261 = !DILocation(line: 43, column: 53, scope: !256)
!262 = !DILocation(line: 43, column: 56, scope: !256)
!263 = !DILocation(line: 43, column: 46, scope: !256)
!264 = !DILocation(line: 43, column: 11, scope: !257)
!265 = !DILocation(line: 44, column: 13, scope: !256)
!266 = !DILocation(line: 44, column: 16, scope: !256)
!267 = !DILocation(line: 44, column: 11, scope: !256)
!268 = !DILocation(line: 44, column: 2, scope: !256)
!269 = !DILocation(line: 45, column: 32, scope: !270)
!270 = distinct !DILexicalBlock(scope: !257, file: !32, line: 45, column: 11)
!271 = !DILocation(line: 45, column: 30, scope: !270)
!272 = !DILocation(line: 45, column: 11, scope: !257)
!273 = !DILocation(line: 46, column: 18, scope: !270)
!274 = !DILocation(line: 46, column: 28, scope: !270)
!275 = !DILocation(line: 46, column: 2, scope: !270)
!276 = !DILocation(line: 47, column: 5, scope: !257)
!277 = !DILocation(line: 48, column: 7, scope: !278)
!278 = distinct !DILexicalBlock(scope: !208, file: !32, line: 48, column: 7)
!279 = !DILocation(line: 48, column: 13, scope: !278)
!280 = !DILocation(line: 48, column: 7, scope: !208)
!281 = !DILocation(line: 50, column: 11, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !32, line: 50, column: 11)
!283 = distinct !DILexicalBlock(scope: !278, file: !32, line: 49, column: 5)
!284 = !DILocation(line: 50, column: 20, scope: !282)
!285 = !DILocation(line: 50, column: 44, scope: !282)
!286 = !DILocation(line: 50, column: 42, scope: !282)
!287 = !DILocation(line: 50, column: 75, scope: !282)
!288 = !DILocation(line: 51, column: 27, scope: !282)
!289 = !DILocation(line: 51, column: 21, scope: !282)
!290 = !DILocation(line: 51, column: 19, scope: !282)
!291 = !DILocation(line: 50, column: 11, scope: !283)
!292 = !DILocation(line: 52, column: 18, scope: !282)
!293 = !DILocation(line: 52, column: 28, scope: !282)
!294 = !DILocation(line: 52, column: 2, scope: !282)
!295 = !DILocation(line: 55, column: 4, scope: !296)
!296 = distinct !DILexicalBlock(scope: !282, file: !32, line: 54, column: 2)
!297 = !DILocation(line: 56, column: 19, scope: !296)
!298 = !DILocation(line: 57, column: 19, scope: !296)
!299 = !DILocation(line: 58, column: 18, scope: !296)
!300 = !DILocation(line: 59, column: 4, scope: !296)
!301 = !DILocation(line: 61, column: 5, scope: !283)
!302 = !DILocation(line: 62, column: 13, scope: !303)
!303 = distinct !DILexicalBlock(scope: !208, file: !32, line: 62, column: 7)
!304 = !DILocation(line: 62, column: 11, scope: !303)
!305 = !DILocation(line: 62, column: 37, scope: !303)
!306 = !DILocation(line: 62, column: 52, scope: !303)
!307 = !DILocation(line: 62, column: 45, scope: !303)
!308 = !DILocation(line: 62, column: 43, scope: !303)
!309 = !DILocation(line: 62, column: 57, scope: !303)
!310 = !DILocation(line: 63, column: 27, scope: !303)
!311 = !DILocation(line: 63, column: 25, scope: !303)
!312 = !DILocation(line: 62, column: 7, scope: !208)
!313 = !DILocation(line: 64, column: 21, scope: !303)
!314 = !DILocation(line: 64, column: 30, scope: !303)
!315 = !DILocation(line: 64, column: 5, scope: !303)
!316 = !DILocation(line: 66, column: 22, scope: !303)
!317 = !DILocation(line: 67, column: 1, scope: !208)
!318 = distinct !DISubprogram(name: "ylog_write", scope: !32, file: !32, line: 122, type: !319, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !197, !133, !28, !133, !133, null}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ybool_t", file: !22, line: 52, baseType: !21)
!322 = !DILocalVariable(name: "prio", arg: 1, scope: !318, file: !32, line: 122, type: !197)
!323 = !DILocation(line: 122, column: 36, scope: !318)
!324 = !DILocalVariable(name: "file", arg: 2, scope: !318, file: !32, line: 122, type: !133)
!325 = !DILocation(line: 122, column: 54, scope: !318)
!326 = !DILocalVariable(name: "line", arg: 3, scope: !318, file: !32, line: 122, type: !28)
!327 = !DILocation(line: 122, column: 64, scope: !318)
!328 = !DILocalVariable(name: "funcname", arg: 4, scope: !318, file: !32, line: 123, type: !133)
!329 = !DILocation(line: 123, column: 18, scope: !318)
!330 = !DILocalVariable(name: "str", arg: 5, scope: !318, file: !32, line: 123, type: !133)
!331 = !DILocation(line: 123, column: 40, scope: !318)
!332 = !DILocalVariable(name: "current_time", scope: !318, file: !32, line: 125, type: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !334, line: 10, baseType: !335)
!334 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !165, line: 160, baseType: !166)
!336 = !DILocation(line: 125, column: 10, scope: !318)
!337 = !DILocalVariable(name: "tm", scope: !318, file: !32, line: 126, type: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !340, line: 7, size: 448, elements: !341)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !339, file: !340, line: 9, baseType: !28, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !339, file: !340, line: 10, baseType: !28, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !339, file: !340, line: 11, baseType: !28, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !339, file: !340, line: 12, baseType: !28, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !339, file: !340, line: 13, baseType: !28, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !339, file: !340, line: 14, baseType: !28, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !339, file: !340, line: 15, baseType: !28, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !339, file: !340, line: 16, baseType: !28, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !339, file: !340, line: 17, baseType: !28, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !339, file: !340, line: 20, baseType: !166, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !339, file: !340, line: 21, baseType: !133, size: 64, offset: 384)
!353 = !DILocation(line: 126, column: 14, scope: !318)
!354 = !DILocalVariable(name: "msg", scope: !318, file: !32, line: 127, type: !355)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 384, elements: !61)
!356 = !DILocation(line: 127, column: 9, scope: !318)
!357 = !DILocalVariable(name: "plist", scope: !318, file: !32, line: 128, type: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !359, line: 52, baseType: !360)
!359 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !361, line: 14, baseType: !362)
!361 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stdarg.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !363, baseType: !364)
!363 = !DIFile(filename: "ylog.c", directory: "/home/raj/FineDB/lib/ylib")
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 192, elements: !82)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !365, file: !363, line: 128, baseType: !7, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !365, file: !363, line: 128, baseType: !7, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !365, file: !363, line: 128, baseType: !27, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !365, file: !363, line: 128, baseType: !27, size: 64, offset: 128)
!371 = !DILocation(line: 128, column: 11, scope: !318)
!372 = !DILocalVariable(name: "tmpstr", scope: !318, file: !32, line: 129, type: !136)
!373 = !DILocation(line: 129, column: 9, scope: !318)
!374 = !DILocalVariable(name: "tmp2", scope: !318, file: !32, line: 129, type: !136)
!375 = !DILocation(line: 129, column: 18, scope: !318)
!376 = !DILocalVariable(name: "tmp_file", scope: !318, file: !32, line: 130, type: !138)
!377 = !DILocation(line: 130, column: 9, scope: !318)
!378 = !DILocalVariable(name: "res", scope: !318, file: !32, line: 131, type: !321)
!379 = !DILocation(line: 131, column: 11, scope: !318)
!380 = !DILocalVariable(name: "i", scope: !318, file: !32, line: 132, type: !28)
!381 = !DILocation(line: 132, column: 7, scope: !318)
!382 = !DILocation(line: 134, column: 7, scope: !383)
!383 = distinct !DILexicalBlock(scope: !318, file: !32, line: 134, column: 7)
!384 = !DILocation(line: 134, column: 23, scope: !383)
!385 = !DILocation(line: 134, column: 12, scope: !383)
!386 = !DILocation(line: 134, column: 7, scope: !318)
!387 = !DILocation(line: 135, column: 5, scope: !383)
!388 = !DILocation(line: 136, column: 3, scope: !318)
!389 = !DILocation(line: 137, column: 18, scope: !318)
!390 = !DILocation(line: 137, column: 16, scope: !318)
!391 = !DILocation(line: 138, column: 8, scope: !318)
!392 = !DILocation(line: 138, column: 6, scope: !318)
!393 = !DILocation(line: 139, column: 12, scope: !318)
!394 = !DILocation(line: 139, column: 10, scope: !318)
!395 = !DILocation(line: 140, column: 10, scope: !318)
!396 = !DILocation(line: 140, column: 8, scope: !318)
!397 = !DILocation(line: 142, column: 16, scope: !398)
!398 = distinct !DILexicalBlock(scope: !318, file: !32, line: 142, column: 7)
!399 = !DILocation(line: 142, column: 22, scope: !398)
!400 = !DILocation(line: 142, column: 34, scope: !398)
!401 = !DILocation(line: 142, column: 47, scope: !398)
!402 = !DILocation(line: 142, column: 38, scope: !398)
!403 = !DILocation(line: 142, column: 7, scope: !318)
!404 = !DILocation(line: 144, column: 22, scope: !405)
!405 = distinct !DILexicalBlock(scope: !398, file: !32, line: 143, column: 5)
!406 = !DILocation(line: 145, column: 22, scope: !405)
!407 = !DILocation(line: 146, column: 5, scope: !405)
!408 = !DILocation(line: 147, column: 16, scope: !409)
!409 = distinct !DILexicalBlock(scope: !318, file: !32, line: 147, column: 7)
!410 = !DILocation(line: 147, column: 22, scope: !409)
!411 = !DILocation(line: 147, column: 37, scope: !409)
!412 = !DILocation(line: 147, column: 50, scope: !409)
!413 = !DILocation(line: 147, column: 41, scope: !409)
!414 = !DILocation(line: 147, column: 7, scope: !318)
!415 = !DILocation(line: 149, column: 22, scope: !416)
!416 = distinct !DILexicalBlock(scope: !409, file: !32, line: 148, column: 5)
!417 = !DILocation(line: 150, column: 22, scope: !416)
!418 = !DILocation(line: 151, column: 5, scope: !416)
!419 = !DILocation(line: 153, column: 44, scope: !318)
!420 = !DILocation(line: 153, column: 51, scope: !318)
!421 = !DILocation(line: 153, column: 62, scope: !318)
!422 = !DILocation(line: 154, column: 15, scope: !318)
!423 = !DILocation(line: 154, column: 6, scope: !318)
!424 = !DILocation(line: 154, column: 22, scope: !318)
!425 = !DILocation(line: 154, column: 33, scope: !318)
!426 = !DILocation(line: 154, column: 48, scope: !318)
!427 = !DILocation(line: 154, column: 54, scope: !318)
!428 = !DILocation(line: 153, column: 3, scope: !318)
!429 = !DILocation(line: 155, column: 21, scope: !318)
!430 = !DILocation(line: 155, column: 29, scope: !318)
!431 = !DILocation(line: 155, column: 3, scope: !318)
!432 = !DILocation(line: 156, column: 3, scope: !318)
!433 = !DILocation(line: 157, column: 12, scope: !318)
!434 = !DILocation(line: 157, column: 3, scope: !318)
!435 = !DILocation(line: 159, column: 16, scope: !436)
!436 = distinct !DILexicalBlock(scope: !318, file: !32, line: 159, column: 7)
!437 = !DILocation(line: 159, column: 22, scope: !436)
!438 = !DILocation(line: 159, column: 7, scope: !318)
!439 = !DILocation(line: 161, column: 24, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !32, line: 160, column: 5)
!441 = !DILocation(line: 161, column: 15, scope: !440)
!442 = !DILocation(line: 161, column: 45, scope: !440)
!443 = !DILocation(line: 162, column: 17, scope: !440)
!444 = !DILocation(line: 162, column: 8, scope: !440)
!445 = !DILocation(line: 162, column: 37, scope: !440)
!446 = !DILocation(line: 163, column: 17, scope: !440)
!447 = !DILocation(line: 161, column: 7, scope: !440)
!448 = !DILocation(line: 164, column: 14, scope: !440)
!449 = !DILocation(line: 164, column: 19, scope: !440)
!450 = !DILocation(line: 165, column: 7, scope: !440)
!451 = !DILocation(line: 165, column: 12, scope: !440)
!452 = !DILocation(line: 166, column: 7, scope: !440)
!453 = !DILocation(line: 166, column: 12, scope: !440)
!454 = !DILocation(line: 167, column: 7, scope: !440)
!455 = !DILocation(line: 167, column: 12, scope: !440)
!456 = !DILocation(line: 168, column: 7, scope: !440)
!457 = !DILocation(line: 168, column: 12, scope: !440)
!458 = !DILocation(line: 169, column: 7, scope: !440)
!459 = !DILocation(line: 169, column: 12, scope: !440)
!460 = !DILocation(line: 170, column: 13, scope: !440)
!461 = !DILocation(line: 164, column: 7, scope: !440)
!462 = !DILocation(line: 171, column: 7, scope: !440)
!463 = !DILocation(line: 172, column: 20, scope: !464)
!464 = distinct !DILexicalBlock(scope: !440, file: !32, line: 172, column: 11)
!465 = !DILocation(line: 172, column: 26, scope: !464)
!466 = !DILocation(line: 172, column: 11, scope: !440)
!467 = !DILocation(line: 174, column: 4, scope: !468)
!468 = distinct !DILexicalBlock(scope: !464, file: !32, line: 173, column: 2)
!469 = !DILocation(line: 175, column: 4, scope: !468)
!470 = !DILocation(line: 176, column: 4, scope: !468)
!471 = !DILocation(line: 178, column: 5, scope: !440)
!472 = !DILocation(line: 181, column: 6, scope: !318)
!473 = !DILocation(line: 181, column: 10, scope: !318)
!474 = !DILocation(line: 181, column: 18, scope: !318)
!475 = !DILocation(line: 181, column: 26, scope: !318)
!476 = !DILocation(line: 181, column: 30, scope: !318)
!477 = !DILocation(line: 181, column: 37, scope: !318)
!478 = !DILocation(line: 181, column: 42, scope: !318)
!479 = !DILocation(line: 181, column: 46, scope: !318)
!480 = !DILocation(line: 182, column: 6, scope: !318)
!481 = !DILocation(line: 182, column: 10, scope: !318)
!482 = !DILocation(line: 182, column: 19, scope: !318)
!483 = !DILocation(line: 182, column: 23, scope: !318)
!484 = !DILocation(line: 182, column: 31, scope: !318)
!485 = !DILocation(line: 182, column: 35, scope: !318)
!486 = !DILocation(line: 183, column: 15, scope: !318)
!487 = !DILocation(line: 183, column: 6, scope: !318)
!488 = !DILocation(line: 183, column: 35, scope: !318)
!489 = !DILocation(line: 183, column: 50, scope: !318)
!490 = !DILocation(line: 180, column: 3, scope: !318)
!491 = !DILocation(line: 184, column: 3, scope: !318)
!492 = !DILocation(line: 186, column: 16, scope: !493)
!493 = distinct !DILexicalBlock(scope: !318, file: !32, line: 186, column: 7)
!494 = !DILocation(line: 186, column: 22, scope: !493)
!495 = !DILocation(line: 186, column: 7, scope: !318)
!496 = !DILocation(line: 187, column: 14, scope: !493)
!497 = !DILocation(line: 187, column: 22, scope: !493)
!498 = !DILocation(line: 187, column: 5, scope: !493)
!499 = !DILocation(line: 189, column: 16, scope: !500)
!500 = distinct !DILexicalBlock(scope: !318, file: !32, line: 189, column: 7)
!501 = !DILocation(line: 189, column: 22, scope: !500)
!502 = !DILocation(line: 189, column: 7, scope: !318)
!503 = !DILocation(line: 190, column: 11, scope: !500)
!504 = !DILocation(line: 190, column: 19, scope: !500)
!505 = !DILocation(line: 190, column: 5, scope: !500)
!506 = !DILocation(line: 192, column: 16, scope: !507)
!507 = distinct !DILexicalBlock(scope: !318, file: !32, line: 192, column: 7)
!508 = !DILocation(line: 192, column: 22, scope: !507)
!509 = !DILocation(line: 192, column: 7, scope: !318)
!510 = !DILocation(line: 194, column: 17, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !32, line: 194, column: 11)
!512 = distinct !DILexicalBlock(scope: !507, file: !32, line: 193, column: 5)
!513 = !DILocation(line: 194, column: 34, scope: !511)
!514 = !DILocation(line: 194, column: 11, scope: !511)
!515 = !DILocation(line: 194, column: 40, scope: !511)
!516 = !DILocation(line: 194, column: 11, scope: !512)
!517 = !DILocation(line: 196, column: 20, scope: !518)
!518 = distinct !DILexicalBlock(scope: !511, file: !32, line: 195, column: 2)
!519 = !DILocation(line: 196, column: 4, scope: !518)
!520 = !DILocation(line: 197, column: 18, scope: !518)
!521 = !DILocation(line: 198, column: 19, scope: !518)
!522 = !DILocation(line: 199, column: 19, scope: !518)
!523 = !DILocation(line: 200, column: 4, scope: !518)
!524 = !DILocation(line: 202, column: 8, scope: !518)
!525 = !DILocation(line: 203, column: 2, scope: !518)
!526 = !DILocation(line: 204, column: 23, scope: !512)
!527 = !DILocation(line: 204, column: 7, scope: !512)
!528 = !DILocation(line: 205, column: 20, scope: !529)
!529 = distinct !DILexicalBlock(scope: !512, file: !32, line: 205, column: 11)
!530 = !DILocation(line: 205, column: 11, scope: !529)
!531 = !DILocation(line: 205, column: 11, scope: !512)
!532 = !DILocalVariable(name: "st", scope: !533, file: !32, line: 208, type: !534)
!533 = distinct !DILexicalBlock(scope: !529, file: !32, line: 206, column: 2)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !535, line: 26, size: 1152, elements: !536)
!535 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "3ba283bc334370fe631cbc82f5229ed7")
!536 = !{!537, !539, !541, !543, !545, !547, !549, !550, !551, !552, !554, !556, !563, !564, !565}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !534, file: !535, line: 31, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !165, line: 145, baseType: !188)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !534, file: !535, line: 36, baseType: !540, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !165, line: 148, baseType: !188)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !534, file: !535, line: 44, baseType: !542, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !165, line: 151, baseType: !188)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !534, file: !535, line: 45, baseType: !544, size: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !165, line: 150, baseType: !7)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !534, file: !535, line: 47, baseType: !546, size: 32, offset: 224)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !165, line: 146, baseType: !7)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !534, file: !535, line: 48, baseType: !548, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !165, line: 147, baseType: !7)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !534, file: !535, line: 50, baseType: !28, size: 32, offset: 288)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !534, file: !535, line: 52, baseType: !538, size: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !534, file: !535, line: 57, baseType: !164, size: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !534, file: !535, line: 61, baseType: !553, size: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !165, line: 175, baseType: !166)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !534, file: !535, line: 63, baseType: !555, size: 64, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !165, line: 180, baseType: !166)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !534, file: !535, line: 74, baseType: !557, size: 128, offset: 576)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !558, line: 11, size: 128, elements: !559)
!558 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !557, file: !558, line: 16, baseType: !335, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !557, file: !558, line: 21, baseType: !562, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !165, line: 197, baseType: !166)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !534, file: !535, line: 75, baseType: !557, size: 128, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !534, file: !535, line: 76, baseType: !557, size: 128, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !534, file: !535, line: 89, baseType: !566, size: 192, offset: 960)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 192, elements: !92)
!567 = !DILocation(line: 208, column: 16, scope: !533)
!568 = !DILocation(line: 209, column: 31, scope: !569)
!569 = distinct !DILexicalBlock(scope: !533, file: !32, line: 209, column: 8)
!570 = !DILocation(line: 209, column: 15, scope: !569)
!571 = !DILocation(line: 209, column: 9, scope: !569)
!572 = !DILocation(line: 209, column: 43, scope: !569)
!573 = !DILocation(line: 210, column: 11, scope: !569)
!574 = !DILocation(line: 210, column: 31, scope: !569)
!575 = !DILocation(line: 210, column: 22, scope: !569)
!576 = !DILocation(line: 210, column: 19, scope: !569)
!577 = !DILocation(line: 209, column: 8, scope: !533)
!578 = !DILocation(line: 212, column: 28, scope: !579)
!579 = distinct !DILexicalBlock(scope: !569, file: !32, line: 211, column: 6)
!580 = !DILocation(line: 212, column: 17, scope: !579)
!581 = !DILocation(line: 213, column: 22, scope: !579)
!582 = !DILocation(line: 214, column: 19, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !32, line: 214, column: 12)
!584 = !DILocation(line: 214, column: 12, scope: !583)
!585 = !DILocation(line: 214, column: 12, scope: !579)
!586 = !DILocation(line: 215, column: 3, scope: !583)
!587 = !DILocation(line: 216, column: 17, scope: !579)
!588 = !DILocation(line: 216, column: 15, scope: !579)
!589 = !DILocation(line: 218, column: 15, scope: !590)
!590 = distinct !DILexicalBlock(scope: !579, file: !32, line: 218, column: 8)
!591 = !DILocation(line: 218, column: 13, scope: !590)
!592 = !DILocation(line: 221, column: 17, scope: !593)
!593 = distinct !DILexicalBlock(scope: !594, file: !32, line: 219, column: 3)
!594 = distinct !DILexicalBlock(scope: !590, file: !32, line: 218, column: 8)
!595 = !DILocation(line: 221, column: 27, scope: !593)
!596 = !DILocation(line: 221, column: 31, scope: !593)
!597 = !DILocation(line: 221, column: 39, scope: !593)
!598 = !DILocation(line: 222, column: 8, scope: !593)
!599 = !DILocation(line: 222, column: 12, scope: !593)
!600 = !DILocation(line: 222, column: 19, scope: !593)
!601 = !DILocation(line: 222, column: 24, scope: !593)
!602 = !DILocation(line: 222, column: 28, scope: !593)
!603 = !DILocation(line: 222, column: 37, scope: !593)
!604 = !DILocation(line: 222, column: 41, scope: !593)
!605 = !DILocation(line: 223, column: 8, scope: !593)
!606 = !DILocation(line: 223, column: 12, scope: !593)
!607 = !DILocation(line: 223, column: 20, scope: !593)
!608 = !DILocation(line: 223, column: 24, scope: !593)
!609 = !DILocation(line: 223, column: 32, scope: !593)
!610 = !DILocation(line: 220, column: 5, scope: !593)
!611 = !DILocation(line: 224, column: 14, scope: !612)
!612 = distinct !DILexicalBlock(scope: !593, file: !32, line: 224, column: 9)
!613 = !DILocation(line: 224, column: 9, scope: !612)
!614 = !DILocation(line: 224, column: 9, scope: !593)
!615 = !DILocation(line: 225, column: 7, scope: !612)
!616 = !DILocation(line: 226, column: 3, scope: !593)
!617 = !DILocation(line: 218, column: 22, scope: !594)
!618 = !DILocation(line: 218, column: 8, scope: !594)
!619 = distinct !{!619, !620, !621}
!620 = !DILocation(line: 218, column: 8, scope: !590)
!621 = !DILocation(line: 226, column: 3, scope: !590)
!622 = !DILocation(line: 228, column: 24, scope: !579)
!623 = !DILocation(line: 228, column: 34, scope: !579)
!624 = !DILocation(line: 228, column: 8, scope: !579)
!625 = !DILocation(line: 229, column: 45, scope: !626)
!626 = distinct !DILexicalBlock(scope: !579, file: !32, line: 229, column: 12)
!627 = !DILocation(line: 229, column: 30, scope: !626)
!628 = !DILocation(line: 229, column: 28, scope: !626)
!629 = !DILocation(line: 229, column: 12, scope: !579)
!630 = !DILocation(line: 231, column: 20, scope: !631)
!631 = distinct !DILexicalBlock(scope: !626, file: !32, line: 230, column: 3)
