; ModuleID = './ytcp_server.c'
source_filename = "./ytcp_server.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ytcp_server_s = type { ptr, i32, i32, ptr, i32, i16, i32 }
%struct.ytcp_thread_s = type { i64, i32, ptr, %union.pthread_mutex_t, i32, ptr, ptr }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%union.__CONST_SOCKADDR_ARG = type { ptr }
%union.__SOCKADDR_ARG = type { ptr }

@.str = private unnamed_addr constant [5 x i8] c"ytcp\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [16 x i8] c"./ytcp_server.c\00", align 1, !dbg !7
@__FUNCTION__.ytcp_server_init = private unnamed_addr constant [17 x i8] c"ytcp_server_init\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [9 x i8] c"Entering\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [31 x i8] c"Problem during thread creation\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [8 x i8] c"Exiting\00", align 1, !dbg !28
@__FUNCTION__.ytcp_server_start = private unnamed_addr constant [18 x i8] c"ytcp_server_start\00", align 1, !dbg !33

!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 14)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 261, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !36)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 287, type: !84, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 298, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 328, type: !94, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !59, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !143, globals: !274, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "ytcp_server.c", directory: "/home/raj/FineDB/lib/ylib", checksumkind: CSK_MD5, checksum: "01ea3e45bd0a3674bb5cd3c65689ae9d")
!113 = !{!114, !122, !131}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ytcp_state_e", file: !115, line: 109, baseType: !116, size: 32, elements: !117)
!115 = !DIFile(filename: "./ytcp_server.h", directory: "/home/raj/FineDB/lib/ylib", checksumkind: CSK_MD5, checksum: "0e22595ccc4dc04dc3742369b5f1febc")
!116 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!117 = !{!118, !119, !120, !121}
!118 = !DIEnumerator(name: "YTCP_NONE", value: 0)
!119 = !DIEnumerator(name: "YTCP_WAIT", value: 1)
!120 = !DIEnumerator(name: "YTCP_RUN", value: 2)
!121 = !DIEnumerator(name: "YTCP_CLOSE", value: 3)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ylog_priority_e", file: !123, line: 267, baseType: !116, size: 32, elements: !124)
!123 = !DIFile(filename: "./ylog.h", directory: "/home/raj/FineDB/lib/ylib", checksumkind: CSK_MD5, checksum: "0a4bfecb6867d4cb83bdff3f2b1d4b13")
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIEnumerator(name: "YLOG_DEBUG", value: 0)
!126 = !DIEnumerator(name: "YLOG_INFO", value: 1)
!127 = !DIEnumerator(name: "YLOG_NOTE", value: 2)
!128 = !DIEnumerator(name: "YLOG_WARN", value: 3)
!129 = !DIEnumerator(name: "YLOG_ERR", value: 4)
!130 = !DIEnumerator(name: "YLOG_CRIT", value: 5)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !132, line: 24, baseType: !116, size: 32, elements: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "0d4e972fdeb3da9a5bc94fa41144e9f8")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!135 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!136 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!137 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!138 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!139 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!140 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!141 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!142 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!143 = !{!144, !145, !151, !160}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !146, line: 30, baseType: !147)
!146 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !148, line: 26, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !150, line: 42, baseType: !116)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !153, line: 180, size: 128, elements: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!154 = !{!155, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !152, file: !153, line: 182, baseType: !156, size: 16)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !157, line: 28, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !152, file: !153, line: 183, baseType: !89, size: 112, offset: 16)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ytcp_thread_t", file: !115, line: 148, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ytcp_thread_s", file: !115, line: 136, size: 704, elements: !163)
!163 = !{!164, !168, !170, !225, !254, !256, !257}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !162, file: !115, line: 138, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !166, line: 27, baseType: !167)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!167 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !162, file: !115, line: 139, baseType: !169, size: 32, offset: 64)
!169 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !162, file: !115, line: 140, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !173, line: 7, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !175, line: 49, size: 1728, elements: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!176 = !{!177, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !193, !195, !196, !197, !200, !201, !203, !207, !210, !212, !215, !218, !219, !220, !223, !224}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !174, file: !175, line: 51, baseType: !169, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !174, file: !175, line: 54, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !174, file: !175, line: 55, baseType: !179, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !174, file: !175, line: 56, baseType: !179, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !174, file: !175, line: 57, baseType: !179, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !174, file: !175, line: 58, baseType: !179, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !174, file: !175, line: 59, baseType: !179, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !174, file: !175, line: 60, baseType: !179, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !174, file: !175, line: 61, baseType: !179, size: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !174, file: !175, line: 64, baseType: !179, size: 64, offset: 576)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !174, file: !175, line: 65, baseType: !179, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !174, file: !175, line: 66, baseType: !179, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !174, file: !175, line: 68, baseType: !191, size: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !175, line: 36, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !174, file: !175, line: 70, baseType: !194, size: 64, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !174, file: !175, line: 72, baseType: !169, size: 32, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !174, file: !175, line: 73, baseType: !169, size: 32, offset: 928)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !174, file: !175, line: 74, baseType: !198, size: 64, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !150, line: 152, baseType: !199)
!199 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !174, file: !175, line: 77, baseType: !158, size: 16, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !174, file: !175, line: 78, baseType: !202, size: 8, offset: 1040)
!202 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !174, file: !175, line: 79, baseType: !204, size: 8, offset: 1048)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !175, line: 81, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !175, line: 43, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !174, file: !175, line: 89, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !150, line: 153, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !174, file: !175, line: 91, baseType: !213, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !175, line: 37, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !174, file: !175, line: 92, baseType: !216, size: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !175, line: 38, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !174, file: !175, line: 93, baseType: !194, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !174, file: !175, line: 94, baseType: !144, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !174, file: !175, line: 95, baseType: !221, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !222, line: 46, baseType: !167)
!222 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !174, file: !175, line: 96, baseType: !169, size: 32, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !174, file: !175, line: 98, baseType: !94, size: 160, offset: 1568)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mut_do", scope: !162, file: !115, line: 141, baseType: !226, size: 320, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !166, line: 72, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !166, line: 67, size: 320, elements: !228)
!228 = !{!229, !249, !253}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !227, file: !166, line: 69, baseType: !230, size: 320)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !231, line: 22, size: 320, elements: !232)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!232 = !{!233, !234, !235, !236, !237, !238, !240, !241}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !230, file: !231, line: 24, baseType: !169, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !230, file: !231, line: 25, baseType: !116, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !230, file: !231, line: 26, baseType: !169, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !230, file: !231, line: 28, baseType: !116, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !230, file: !231, line: 32, baseType: !169, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !230, file: !231, line: 34, baseType: !239, size: 16, offset: 160)
!239 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !230, file: !231, line: 35, baseType: !239, size: 16, offset: 176)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !230, file: !231, line: 36, baseType: !242, size: 128, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !243, line: 55, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !243, line: 51, size: 128, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !244, file: !243, line: 53, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !244, file: !243, line: 54, baseType: !247, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !227, file: !166, line: 70, baseType: !250, size: 320)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 40)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !227, file: !166, line: 71, baseType: !199, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !162, file: !115, line: 142, baseType: !255, size: 32, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ytcp_state_t", file: !115, line: 118, baseType: !114)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !115, line: 143, baseType: !144, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !162, file: !115, line: 144, baseType: !258, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ytcp_server_s", file: !115, line: 167, size: 320, elements: !260)
!260 = !{!261, !265, !266, !267, !271, !272, !273}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "threads_func", scope: !259, file: !115, line: 169, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!144, !144}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nbr_threads", scope: !259, file: !115, line: 170, baseType: !169, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "first_waiting", scope: !259, file: !115, line: 171, baseType: !169, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "vect_threads", scope: !259, file: !115, line: 172, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "yvect_t", file: !269, line: 56, baseType: !270)
!269 = !DIFile(filename: "./yvect.h", directory: "/home/raj/FineDB/lib/ylib", checksumkind: CSK_MD5, checksum: "73ac1eb655eaae5d93c48c36880d9ca2")
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !259, file: !115, line: 173, baseType: !169, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "run_loop", scope: !259, file: !115, line: 174, baseType: !239, size: 16, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "purge_cnt", scope: !259, file: !115, line: 175, baseType: !169, size: 32, offset: 256)
!274 = !{!0, !7, !12, !18, !23, !28, !33, !38, !43, !48, !50, !55, !57, !62, !67, !72, !77, !82, !87, !92, !97, !100, !102, !107, !109}
!275 = !{i32 7, !"Dwarf Version", i32 5}
!276 = !{i32 2, !"Debug Info Version", i32 3}
!277 = !{i32 1, !"wchar_size", i32 4}
!278 = !{i32 8, !"PIC Level", i32 2}
!279 = !{i32 7, !"uwtable", i32 2}
!280 = !{i32 7, !"frame-pointer", i32 2}
!281 = !{!"clang version 16.0.0"}
!282 = distinct !DISubprogram(name: "ytcp_server_init", scope: !2, file: !2, line: 23, type: !283, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !287)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !116, !262, !144}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ytcp_server_t", file: !115, line: 179, baseType: !259)
!287 = !{}
!288 = !DILocalVariable(name: "nbr_threads", arg: 1, scope: !282, file: !2, line: 23, type: !116)
!289 = !DILocation(line: 23, column: 46, scope: !282)
!290 = !DILocalVariable(name: "f", arg: 2, scope: !282, file: !2, line: 24, type: !262)
!291 = !DILocation(line: 24, column: 13, scope: !282)
!292 = !DILocalVariable(name: "data", arg: 3, scope: !282, file: !2, line: 24, type: !144)
!293 = !DILocation(line: 24, column: 30, scope: !282)
!294 = !DILocalVariable(name: "thread", scope: !282, file: !2, line: 26, type: !160)
!295 = !DILocation(line: 26, column: 18, scope: !282)
!296 = !DILocalVariable(name: "threads", scope: !282, file: !2, line: 27, type: !268)
!297 = !DILocation(line: 27, column: 11, scope: !282)
!298 = !DILocalVariable(name: "server", scope: !282, file: !2, line: 28, type: !285)
!299 = !DILocation(line: 28, column: 18, scope: !282)
!300 = !DILocalVariable(name: "i", scope: !282, file: !2, line: 29, type: !116)
!301 = !DILocation(line: 29, column: 16, scope: !282)
!302 = !DILocation(line: 31, column: 3, scope: !282)
!303 = !DILocation(line: 32, column: 18, scope: !282)
!304 = !DILocation(line: 32, column: 30, scope: !282)
!305 = !DILocation(line: 32, column: 17, scope: !282)
!306 = !DILocation(line: 32, column: 58, scope: !282)
!307 = !DILocation(line: 32, column: 15, scope: !282)
!308 = !DILocation(line: 33, column: 13, scope: !282)
!309 = !DILocation(line: 33, column: 11, scope: !282)
!310 = !DILocation(line: 34, column: 12, scope: !282)
!311 = !DILocation(line: 34, column: 10, scope: !282)
!312 = !DILocation(line: 35, column: 26, scope: !282)
!313 = !DILocation(line: 35, column: 3, scope: !282)
!314 = !DILocation(line: 35, column: 11, scope: !282)
!315 = !DILocation(line: 35, column: 24, scope: !282)
!316 = !DILocation(line: 36, column: 25, scope: !282)
!317 = !DILocation(line: 36, column: 3, scope: !282)
!318 = !DILocation(line: 36, column: 11, scope: !282)
!319 = !DILocation(line: 36, column: 23, scope: !282)
!320 = !DILocation(line: 37, column: 3, scope: !282)
!321 = !DILocation(line: 37, column: 11, scope: !282)
!322 = !DILocation(line: 37, column: 25, scope: !282)
!323 = !DILocation(line: 38, column: 26, scope: !282)
!324 = !DILocation(line: 38, column: 3, scope: !282)
!325 = !DILocation(line: 38, column: 11, scope: !282)
!326 = !DILocation(line: 38, column: 24, scope: !282)
!327 = !DILocation(line: 39, column: 3, scope: !282)
!328 = !DILocation(line: 39, column: 11, scope: !282)
!329 = !DILocation(line: 39, column: 14, scope: !282)
!330 = !DILocation(line: 40, column: 3, scope: !282)
!331 = !DILocation(line: 40, column: 11, scope: !282)
!332 = !DILocation(line: 40, column: 20, scope: !282)
!333 = !DILocation(line: 41, column: 23, scope: !282)
!334 = !DILocation(line: 41, column: 3, scope: !282)
!335 = !DILocation(line: 41, column: 11, scope: !282)
!336 = !DILocation(line: 41, column: 21, scope: !282)
!337 = !DILocation(line: 42, column: 10, scope: !338)
!338 = distinct !DILexicalBlock(scope: !282, file: !2, line: 42, column: 3)
!339 = !DILocation(line: 42, column: 8, scope: !338)
!340 = !DILocation(line: 42, column: 15, scope: !341)
!341 = distinct !DILexicalBlock(scope: !338, file: !2, line: 42, column: 3)
!342 = !DILocation(line: 42, column: 19, scope: !341)
!343 = !DILocation(line: 42, column: 17, scope: !341)
!344 = !DILocation(line: 42, column: 31, scope: !341)
!345 = !DILocation(line: 42, column: 34, scope: !341)
!346 = !DILocation(line: 42, column: 36, scope: !341)
!347 = !DILocation(line: 0, scope: !341)
!348 = !DILocation(line: 42, column: 3, scope: !338)
!349 = !DILocation(line: 44, column: 16, scope: !350)
!350 = distinct !DILexicalBlock(scope: !341, file: !2, line: 43, column: 5)
!351 = !DILocation(line: 44, column: 14, scope: !350)
!352 = !DILocation(line: 45, column: 28, scope: !350)
!353 = !DILocation(line: 45, column: 36, scope: !350)
!354 = !DILocation(line: 45, column: 7, scope: !350)
!355 = !DILocation(line: 46, column: 28, scope: !350)
!356 = !DILocation(line: 46, column: 36, scope: !350)
!357 = !DILocation(line: 46, column: 7, scope: !350)
!358 = !DILocation(line: 47, column: 28, scope: !359)
!359 = distinct !DILexicalBlock(scope: !350, file: !2, line: 47, column: 11)
!360 = !DILocation(line: 47, column: 36, scope: !359)
!361 = !DILocation(line: 48, column: 5, scope: !359)
!362 = !DILocation(line: 47, column: 11, scope: !359)
!363 = !DILocation(line: 47, column: 11, scope: !350)
!364 = !DILocation(line: 50, column: 4, scope: !365)
!365 = distinct !DILexicalBlock(scope: !359, file: !2, line: 49, column: 2)
!366 = !DILocation(line: 51, column: 4, scope: !365)
!367 = !DILocation(line: 51, column: 12, scope: !365)
!368 = !DILocation(line: 51, column: 18, scope: !365)
!369 = !DILocation(line: 52, column: 2, scope: !365)
!370 = !DILocation(line: 53, column: 7, scope: !350)
!371 = !DILocation(line: 53, column: 15, scope: !350)
!372 = !DILocation(line: 53, column: 18, scope: !350)
!373 = !DILocation(line: 54, column: 7, scope: !350)
!374 = !DILocation(line: 54, column: 15, scope: !350)
!375 = !DILocation(line: 54, column: 21, scope: !350)
!376 = !DILocation(line: 55, column: 22, scope: !350)
!377 = !DILocation(line: 55, column: 7, scope: !350)
!378 = !DILocation(line: 55, column: 15, scope: !350)
!379 = !DILocation(line: 55, column: 20, scope: !350)
!380 = !DILocation(line: 56, column: 24, scope: !350)
!381 = !DILocation(line: 56, column: 7, scope: !350)
!382 = !DILocation(line: 56, column: 15, scope: !350)
!383 = !DILocation(line: 56, column: 22, scope: !350)
!384 = !DILocation(line: 57, column: 24, scope: !350)
!385 = !DILocation(line: 57, column: 7, scope: !350)
!386 = !DILocation(line: 58, column: 5, scope: !350)
!387 = !DILocation(line: 42, column: 44, scope: !341)
!388 = !DILocation(line: 42, column: 3, scope: !341)
!389 = distinct !{!389, !348, !390}
!390 = !DILocation(line: 58, column: 5, scope: !338)
!391 = !DILocation(line: 59, column: 3, scope: !282)
!392 = !DILocation(line: 60, column: 11, scope: !282)
!393 = !DILocation(line: 60, column: 3, scope: !282)
!394 = distinct !DISubprogram(name: "_ytcp_server_thread_handle", scope: !2, file: !2, line: 245, type: !263, scopeLine: 246, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !111, retainedNodes: !287)
!395 = !DILocalVariable(name: "param", arg: 1, scope: !394, file: !2, line: 245, type: !144)
!396 = !DILocation(line: 245, column: 40, scope: !394)
!397 = !DILocalVariable(name: "thread", scope: !394, file: !2, line: 247, type: !160)
!398 = !DILocation(line: 247, column: 18, scope: !394)
!399 = !DILocation(line: 247, column: 27, scope: !394)
!400 = !DILocation(line: 249, column: 3, scope: !394)
!401 = !DILocation(line: 250, column: 3, scope: !394)
!402 = !DILocation(line: 252, column: 33, scope: !403)
!403 = distinct !DILexicalBlock(scope: !404, file: !2, line: 252, column: 11)
!404 = distinct !DILexicalBlock(scope: !405, file: !2, line: 251, column: 5)
!405 = distinct !DILexicalBlock(scope: !406, file: !2, line: 250, column: 3)
!406 = distinct !DILexicalBlock(scope: !394, file: !2, line: 250, column: 3)
!407 = !DILocation(line: 252, column: 41, scope: !403)
!408 = !DILocation(line: 252, column: 12, scope: !403)
!409 = !DILocation(line: 252, column: 11, scope: !404)
!410 = !DILocation(line: 254, column: 8, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !2, line: 254, column: 8)
!412 = distinct !DILexicalBlock(scope: !403, file: !2, line: 253, column: 2)
!413 = !DILocation(line: 254, column: 16, scope: !411)
!414 = !DILocation(line: 254, column: 22, scope: !411)
!415 = !DILocation(line: 254, column: 8, scope: !412)
!416 = !DILocation(line: 256, column: 8, scope: !417)
!417 = distinct !DILexicalBlock(scope: !411, file: !2, line: 255, column: 6)
!418 = !DILocation(line: 257, column: 8, scope: !417)
!419 = !DILocation(line: 261, column: 8, scope: !420)
!420 = distinct !DILexicalBlock(scope: !411, file: !2, line: 260, column: 6)
!421 = !DILocation(line: 262, column: 8, scope: !420)
!422 = !DILocation(line: 262, column: 16, scope: !420)
!423 = !DILocation(line: 262, column: 24, scope: !420)
!424 = !DILocation(line: 262, column: 37, scope: !420)
!425 = !DILocation(line: 263, column: 12, scope: !426)
!426 = distinct !DILexicalBlock(scope: !420, file: !2, line: 263, column: 12)
!427 = !DILocation(line: 263, column: 20, scope: !426)
!428 = !DILocation(line: 263, column: 12, scope: !420)
!429 = !DILocation(line: 264, column: 10, scope: !426)
!430 = !DILocation(line: 264, column: 18, scope: !426)
!431 = !DILocation(line: 264, column: 3, scope: !426)
!432 = !DILocation(line: 265, column: 17, scope: !433)
!433 = distinct !DILexicalBlock(scope: !426, file: !2, line: 265, column: 17)
!434 = !DILocation(line: 265, column: 25, scope: !433)
!435 = !DILocation(line: 265, column: 28, scope: !433)
!436 = !DILocation(line: 265, column: 17, scope: !426)
!437 = !DILocation(line: 266, column: 9, scope: !433)
!438 = !DILocation(line: 266, column: 17, scope: !433)
!439 = !DILocation(line: 266, column: 3, scope: !433)
!440 = !DILocation(line: 267, column: 8, scope: !420)
!441 = !DILocation(line: 267, column: 16, scope: !420)
!442 = !DILocation(line: 267, column: 23, scope: !420)
!443 = !DILocation(line: 268, column: 8, scope: !420)
!444 = !DILocation(line: 268, column: 16, scope: !420)
!445 = !DILocation(line: 268, column: 19, scope: !420)
!446 = !DILocation(line: 269, column: 8, scope: !420)
!447 = !DILocation(line: 269, column: 16, scope: !420)
!448 = !DILocation(line: 269, column: 22, scope: !420)
!449 = !DILocation(line: 270, column: 8, scope: !420)
!450 = !DILocation(line: 272, column: 2, scope: !412)
!451 = !DILocation(line: 250, column: 3, scope: !405)
!452 = distinct !{!452, !453, !454}
!453 = !DILocation(line: 250, column: 3, scope: !406)
!454 = !DILocation(line: 273, column: 5, scope: !406)
!455 = distinct !DISubprogram(name: "ytcp_server_start", scope: !2, file: !2, line: 67, type: !456, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !287)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !285, !169}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "yerr_t", file: !459, line: 23, baseType: !169)
!459 = !DIFile(filename: "./yerror.h", directory: "/home/raj/FineDB/lib/ylib", checksumkind: CSK_MD5, checksum: "4851c124a64e017d0b9d8820f73f7100")
!460 = !DILocalVariable(name: "server", arg: 1, scope: !455, file: !2, line: 67, type: !285)
!461 = !DILocation(line: 67, column: 41, scope: !455)
!462 = !DILocalVariable(name: "port", arg: 2, scope: !455, file: !2, line: 67, type: !169)
!463 = !DILocation(line: 67, column: 53, scope: !455)
!464 = !DILocalVariable(name: "addr", scope: !455, file: !2, line: 69, type: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !146, line: 245, size: 128, elements: !466)
!466 = !{!467, !468, !472, !476}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !465, file: !146, line: 247, baseType: !156, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !465, file: !146, line: 248, baseType: !469, size: 16, offset: 16)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !146, line: 123, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !148, line: 25, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !150, line: 40, baseType: !158)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !465, file: !146, line: 249, baseType: !473, size: 32, offset: 32)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !146, line: 31, size: 32, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !473, file: !146, line: 33, baseType: !145, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !465, file: !146, line: 252, baseType: !477, size: 64, offset: 64)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 64, elements: !31)
!478 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!479 = !DILocation(line: 69, column: 22, scope: !455)
!480 = !DILocalVariable(name: "addr_size", scope: !455, file: !2, line: 70, type: !116)
!481 = !DILocation(line: 70, column: 16, scope: !455)
!482 = !DILocalVariable(name: "fd", scope: !455, file: !2, line: 71, type: !169)
!483 = !DILocation(line: 71, column: 7, scope: !455)
!484 = !DILocalVariable(name: "on", scope: !455, file: !2, line: 72, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!486 = !DILocation(line: 72, column: 13, scope: !455)
!487 = !DILocation(line: 74, column: 3, scope: !455)
!488 = !DILocation(line: 75, column: 21, scope: !489)
!489 = distinct !DILexicalBlock(scope: !455, file: !2, line: 75, column: 7)
!490 = !DILocation(line: 75, column: 8, scope: !489)
!491 = !DILocation(line: 75, column: 16, scope: !489)
!492 = !DILocation(line: 75, column: 19, scope: !489)
!493 = !DILocation(line: 75, column: 54, scope: !489)
!494 = !DILocation(line: 75, column: 7, scope: !455)
!495 = !DILocation(line: 77, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !489, file: !2, line: 76, column: 5)
!497 = !DILocation(line: 78, column: 7, scope: !496)
!498 = !DILocation(line: 80, column: 18, scope: !499)
!499 = distinct !DILexicalBlock(scope: !455, file: !2, line: 80, column: 7)
!500 = !DILocation(line: 80, column: 26, scope: !499)
!501 = !DILocation(line: 80, column: 7, scope: !499)
!502 = !DILocation(line: 80, column: 80, scope: !499)
!503 = !DILocation(line: 80, column: 7, scope: !455)
!504 = !DILocation(line: 81, column: 5, scope: !499)
!505 = !DILocation(line: 82, column: 18, scope: !506)
!506 = distinct !DILexicalBlock(scope: !455, file: !2, line: 82, column: 7)
!507 = !DILocation(line: 82, column: 26, scope: !506)
!508 = !DILocation(line: 82, column: 7, scope: !506)
!509 = !DILocation(line: 82, column: 80, scope: !506)
!510 = !DILocation(line: 82, column: 7, scope: !455)
!511 = !DILocation(line: 83, column: 5, scope: !506)
!512 = !DILocation(line: 84, column: 13, scope: !455)
!513 = !DILocation(line: 85, column: 20, scope: !455)
!514 = !DILocation(line: 85, column: 3, scope: !455)
!515 = !DILocation(line: 86, column: 26, scope: !455)
!516 = !DILocation(line: 86, column: 8, scope: !455)
!517 = !DILocation(line: 86, column: 17, scope: !455)
!518 = !DILocation(line: 86, column: 24, scope: !455)
!519 = !DILocation(line: 87, column: 8, scope: !455)
!520 = !DILocation(line: 87, column: 19, scope: !455)
!521 = !DILocation(line: 88, column: 25, scope: !455)
!522 = !DILocation(line: 88, column: 19, scope: !455)
!523 = !DILocation(line: 88, column: 8, scope: !455)
!524 = !DILocation(line: 88, column: 17, scope: !455)
!525 = !DILocation(line: 89, column: 12, scope: !526)
!526 = distinct !DILexicalBlock(scope: !455, file: !2, line: 89, column: 7)
!527 = !DILocation(line: 89, column: 20, scope: !526)
!528 = !DILocation(line: 89, column: 24, scope: !526)
!529 = !DILocation(line: 89, column: 49, scope: !526)
!530 = !DILocation(line: 89, column: 7, scope: !526)
!531 = !DILocation(line: 89, column: 60, scope: !526)
!532 = !DILocation(line: 89, column: 7, scope: !455)
!533 = !DILocation(line: 91, column: 7, scope: !534)
!534 = distinct !DILexicalBlock(scope: !526, file: !2, line: 90, column: 5)
!535 = !DILocation(line: 92, column: 7, scope: !534)
!536 = !DILocation(line: 94, column: 14, scope: !537)
!537 = distinct !DILexicalBlock(scope: !455, file: !2, line: 94, column: 7)
!538 = !DILocation(line: 94, column: 22, scope: !537)
!539 = !DILocation(line: 94, column: 7, scope: !537)
!540 = !DILocation(line: 94, column: 7, scope: !455)
!541 = !DILocation(line: 96, column: 7, scope: !542)
!542 = distinct !DILexicalBlock(scope: !537, file: !2, line: 95, column: 5)
