; ModuleID = '/home/raj/coturn/src/apps/relay/dtls_listener.c'
source_filename = "/home/raj/coturn/src/apps/relay/dtls_listener.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.listener_server = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr, ptr }
%struct._ip_range_list = type { ptr, i64 }

!160 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_KEEP", value: 2)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !162, line: 47, baseType: !104, size: 32, elements: !163)
!162 = !DIFile(filename: "src/apps/common/ns_turn_utils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "74cb4019b1eb9d8e2b879df518b15a25")
!163 = !{!164, !165, !166, !167}
!164 = !DIEnumerator(name: "TURN_LOG_LEVEL_INFO", value: 0)
!165 = !DIEnumerator(name: "TURN_LOG_LEVEL_CONTROL", value: 1)
!166 = !DIEnumerator(name: "TURN_LOG_LEVEL_WARNING", value: 2)
!167 = !DIEnumerator(name: "TURN_LOG_LEVEL_ERROR", value: 3)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !169, line: 24, baseType: !104, size: 32, elements: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "0d4e972fdeb3da9a5bc94fa41144e9f8")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179}
!171 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!172 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!173 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!174 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!175 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!176 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!177 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!178 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!179 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 40, baseType: !104, size: 32, elements: !182)
!181 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!183 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!184 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!185 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!186 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!187 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!188 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!189 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!190 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!191 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!192 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!193 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!194 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!195 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!196 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!197 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!198 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!199 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!200 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!201 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!202 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!203 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!204 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!205 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!206 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!207 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!208 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!209 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!210 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 202, baseType: !104, size: 32, elements: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!214 = !DIEnumerator(name: "MSG_OOB", value: 1)
!215 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!216 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!217 = !DIEnumerator(name: "MSG_TRYHARD", value: 4)
!218 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!219 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!220 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!221 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!222 = !DIEnumerator(name: "MSG_EOR", value: 128)
!223 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!224 = !DIEnumerator(name: "MSG_FIN", value: 512)
!225 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!226 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!227 = !DIEnumerator(name: "MSG_RST", value: 4096)
!228 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!229 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!230 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!231 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!232 = !DIEnumerator(name: "MSG_BATCH", value: 262144)
!233 = !DIEnumerator(name: "MSG_ZEROCOPY", value: 67108864)
!234 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!235 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!236 = !{!98, !237, !996, !96, !997, !998, !1000, !394, !1002, !937, !1003, !794, !589, !1005, !1006, !360, !469, !416, !478, !468, !460, !407}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "dtls_listener_relay_server_type", file: !239, line: 49, baseType: !240)
!239 = !DIFile(filename: "src/apps/relay/dtls_listener.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0781c076e4412130d98f5f3bddf10861")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtls_listener_relay_server_info", file: !2, line: 52, size: 9856, elements: !241)
!241 = !{!242, !246, !309, !406, !942, !943, !944, !945, !946, !989, !990}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !240, file: !2, line: 53, baseType: !243, size: 8200)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8200, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 1025)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !240, file: !2, line: 54, baseType: !247, size: 224, offset: 8224)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !248, line: 48, baseType: !249)
!248 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!249 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !248, line: 44, size: 224, elements: !250)
!250 = !{!251, !262, !284}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !249, file: !248, line: 45, baseType: !252, size: 128)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !212, line: 180, size: 128, elements: !253)
!253 = !{!254, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !252, file: !212, line: 182, baseType: !255, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !256, line: 28, baseType: !257)
!256 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!257 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !252, file: !212, line: 183, baseType: !259, size: 112, offset: 16)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 14)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !249, file: !248, line: 46, baseType: !263, size: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !181, line: 245, size: 128, elements: !264)
!264 = !{!265, !266, !272, !279}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !263, file: !181, line: 247, baseType: !255, size: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !263, file: !181, line: 248, baseType: !267, size: 16, offset: 16)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !181, line: 123, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !269, line: 25, baseType: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !271, line: 40, baseType: !257)
!271 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !263, file: !181, line: 249, baseType: !273, size: 32, offset: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !181, line: 31, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !273, file: !181, line: 33, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !181, line: 30, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !269, line: 26, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !271, line: 42, baseType: !104)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !263, file: !181, line: 252, baseType: !280, size: 64, offset: 64)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 64, elements: !282)
!281 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!282 = !{!283}
!283 = !DISubrange(count: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !249, file: !248, line: 47, baseType: !285, size: 224)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !181, line: 260, size: 224, elements: !286)
!286 = !{!287, !288, !289, !290, !308}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !285, file: !181, line: 262, baseType: !255, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !285, file: !181, line: 263, baseType: !267, size: 16, offset: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !285, file: !181, line: 264, baseType: !277, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !285, file: !181, line: 265, baseType: !291, size: 128, offset: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !181, line: 219, size: 128, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !291, file: !181, line: 226, baseType: !294, size: 128)
!294 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !291, file: !181, line: 221, size: 128, elements: !295)
!295 = !{!296, !302, !304}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !294, file: !181, line: 223, baseType: !297, size: 128)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 128, elements: !300)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !269, line: 24, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !271, line: 38, baseType: !281)
!300 = !{!301}
!301 = !DISubrange(count: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !294, file: !181, line: 224, baseType: !303, size: 128)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 128, elements: !282)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !294, file: !181, line: 225, baseType: !305, size: 128)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 128, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 4)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !285, file: !181, line: 266, baseType: !277, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !240, file: !2, line: 55, baseType: !310, size: 64, offset: 8448)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !117, line: 120, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !117, line: 119, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !314, line: 135, size: 536064, elements: !315)
!314 = !DIFile(filename: "src/apps/relay/ns_ioalib_impl.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "39ae1828625a6763b6269ecb34869b6c")
!315 = !{!316, !321, !325, !326, !327, !332, !337, !366, !371, !372, !373, !374, !375, !376, !379, !381, !385, !387, !397, !398, !399, !400, !401, !403}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !313, file: !314, line: 137, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "super_memory_t", file: !319, line: 49, baseType: !320)
!319 = !DIFile(filename: "src/apps/relay/ns_sm.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "9025fd46a533d33a213551fd581f5b89")
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "_super_memory", file: !319, line: 48, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !313, file: !314, line: 138, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !324, line: 217, flags: DIFlagFwdDecl)
!324 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!325 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate_eb", scope: !313, file: !314, line: 139, baseType: !96, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !313, file: !314, line: 140, baseType: !96, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !313, file: !314, line: 141, baseType: !328, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnipports", file: !330, line: 50, baseType: !331)
!330 = !DIFile(filename: "src/apps/relay/turn_ports.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "11983eef23ed630198ed333562550552")
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_turnipports", file: !330, line: 49, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "map_rtcp", scope: !313, file: !314, line: 142, baseType: !333, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !335, line: 46, baseType: !336)
!335 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !335, line: 45, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !313, file: !314, line: 143, baseType: !338, size: 128, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list", file: !314, line: 81, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list", file: !314, line: 78, size: 128, elements: !340)
!340 = !{!341, !365}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !339, file: !314, line: 79, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list_elem", file: !314, line: 76, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list_elem", file: !314, line: 73, size: 524288, elements: !345)
!345 = !{!346, !348}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !314, line: 74, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !344, file: !314, line: 75, baseType: !349, size: 524224, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !350, line: 48, baseType: !351)
!350 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !350, line: 42, size: 524224, elements: !352)
!352 = !{!353, !355, !359, !363, !364}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !351, file: !350, line: 43, baseType: !354, size: 32)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 32, elements: !306)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !351, file: !350, line: 44, baseType: !356, size: 524056, offset: 32)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 524056, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 65507)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !351, file: !350, line: 45, baseType: !360, size: 64, offset: 524096)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !361, line: 46, baseType: !362)
!361 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!362 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !351, file: !350, line: 46, baseType: !268, size: 16, offset: 524160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !351, file: !350, line: 47, baseType: !298, size: 8, offset: 524176)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tsz", scope: !339, file: !314, line: 80, baseType: !360, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !313, file: !314, line: 144, baseType: !367, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !369, line: 185, baseType: !370)
!369 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !369, line: 185, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !313, file: !314, line: 145, baseType: !367, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !313, file: !314, line: 147, baseType: !367, size: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !313, file: !314, line: 149, baseType: !367, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !313, file: !314, line: 153, baseType: !367, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !313, file: !314, line: 156, baseType: !367, size: 64, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !313, file: !314, line: 158, baseType: !377, size: 32, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !378, line: 108, baseType: !277)
!378 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !313, file: !314, line: 159, baseType: !380, size: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !117, line: 122, baseType: !98)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg", scope: !313, file: !314, line: 160, baseType: !382, size: 524296, offset: 960)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 524296, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 65537)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timer_intervals", scope: !313, file: !314, line: 161, baseType: !386, size: 448, offset: 525280)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 448, elements: !260)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timers", scope: !313, file: !314, line: 162, baseType: !388, size: 1792, offset: 525760)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 1792, elements: !260)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !390, line: 8, size: 128, elements: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!391 = !{!392, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !389, file: !390, line: 14, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !271, line: 160, baseType: !394)
!394 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !389, file: !390, line: 15, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !271, line: 162, baseType: !394)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !313, file: !314, line: 164, baseType: !243, size: 8200, offset: 527552)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !313, file: !314, line: 165, baseType: !96, size: 32, offset: 535776)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !313, file: !314, line: 166, baseType: !360, size: 64, offset: 535808)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_counter", scope: !313, file: !314, line: 167, baseType: !360, size: 64, offset: 535872)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !313, file: !314, line: 168, baseType: !402, size: 64, offset: 535936)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rch", scope: !313, file: !314, line: 169, baseType: !404, size: 64, offset: 536000)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !405, line: 45, baseType: !98)
!405 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !240, file: !2, line: 56, baseType: !407, size: 64, offset: 8512)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_turnserver", file: !111, line: 99, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_turnserver", file: !111, line: 111, size: 3456, elements: !410)
!410 = !{!411, !413, !418, !423, !424, !425, !426, !427, !428, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !443, !448, !454, !456, !789, !800, !805, !810, !811, !812, !813, !814, !871, !876, !877, !878, !879, !886, !900, !901, !902, !903, !904, !905, !926, !927, !928, !929, !930, !935, !936, !938, !939, !941}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !409, file: !111, line: 113, baseType: !412, size: 8)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnserver_id", file: !111, line: 67, baseType: !298)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_counter", scope: !409, file: !111, line: 115, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnsession_id", file: !415, line: 62, baseType: !416)
!415 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !269, line: 27, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !271, line: 45, baseType: !362)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sessions_map", scope: !409, file: !111, line: 116, baseType: !419, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !421, line: 43, baseType: !422)
!421 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !421, line: 42, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !409, file: !111, line: 118, baseType: !377, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !409, file: !111, line: 120, baseType: !310, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !409, file: !111, line: 121, baseType: !96, size: 32, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !409, file: !111, line: 122, baseType: !96, size: 32, offset: 352)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rfc5780", scope: !409, file: !111, line: 123, baseType: !96, size: 32, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "check_origin", scope: !409, file: !111, line: 124, baseType: !429, size: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "vintp", file: !378, line: 106, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !378, line: 105, baseType: !96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "stale_nonce", scope: !409, file: !111, line: 125, baseType: !429, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_allocate_lifetime", scope: !409, file: !111, line: 126, baseType: !429, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "channel_lifetime", scope: !409, file: !111, line: 127, baseType: !429, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "permission_lifetime", scope: !409, file: !111, line: 128, baseType: !429, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "stun_only", scope: !409, file: !111, line: 129, baseType: !429, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "no_stun", scope: !409, file: !111, line: 130, baseType: !429, size: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "no_software_attribute", scope: !409, file: !111, line: 131, baseType: !429, size: 64, offset: 896)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "web_admin_listen_on_workers", scope: !409, file: !111, line: 132, baseType: !429, size: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "secure_stun", scope: !409, file: !111, line: 133, baseType: !429, size: 64, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !409, file: !111, line: 134, baseType: !442, size: 32, offset: 1088)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_credential_type", file: !103, line: 59, baseType: !102)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "alt_addr_cb", scope: !409, file: !111, line: 135, baseType: !444, size: 64, offset: 1152)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_alt_addr_cb", file: !111, line: 59, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!96, !402, !402}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sm_cb", scope: !409, file: !111, line: 136, baseType: !449, size: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_message_cb", file: !111, line: 60, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!96, !310, !453, !402, !402}
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !117, line: 124, baseType: !98)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dont_fragment", scope: !409, file: !111, line: 137, baseType: !455, size: 32, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "dont_fragment_option_t", file: !111, line: 96, baseType: !110)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !409, file: !111, line: 138, baseType: !457, size: 64, offset: 1344)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!96, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ts_ur_super_session", file: !117, line: 47, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts_ur_super_session", file: !415, line: 68, size: 152448, elements: !463)
!463 = !{!464, !465, !466, !467, !609, !716, !717, !718, !719, !720, !724, !725, !729, !734, !735, !740, !741, !742, !743, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !786, !787, !788}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !462, file: !415, line: 69, baseType: !98, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !462, file: !415, line: 70, baseType: !414, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !462, file: !415, line: 71, baseType: !377, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "client_socket", scope: !462, file: !415, line: 72, baseType: !468, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !117, line: 116, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !117, line: 115, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !314, line: 179, size: 2880, elements: !472)
!472 = !{!473, !474, !476, !477, !501, !505, !506, !507, !509, !511, !515, !516, !517, !518, !519, !520, !521, !522, !523, !526, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !558, !559, !590, !591, !596, !597, !601, !606, !607, !608}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !471, file: !314, line: 181, baseType: !96, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parent_s", scope: !471, file: !314, line: 182, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !471, file: !314, line: 183, baseType: !277, size: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sockets_container", scope: !471, file: !314, line: 184, baseType: !478, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map", file: !421, line: 183, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_addr_map", file: !421, line: 177, size: 1441856, elements: !481)
!481 = !{!482, !500}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !480, file: !421, line: 178, baseType: !483, size: 1441792)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 1441792, elements: !498)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_list_header", file: !421, line: 175, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_list_header", file: !421, line: 171, size: 1408, elements: !486)
!486 = !{!487, !495, !497}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "main_list", scope: !485, file: !421, line: 172, baseType: !488, size: 1280)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 1280, elements: !306)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_elem", file: !421, line: 169, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_elem", file: !421, line: 166, size: 320, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !490, file: !421, line: 167, baseType: !247, size: 224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !490, file: !421, line: 168, baseType: !494, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map_value_type", file: !421, line: 161, baseType: !362)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "extra_list", scope: !485, file: !421, line: 173, baseType: !496, size: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !485, file: !421, line: 174, baseType: !360, size: 64, offset: 1344)
!498 = !{!499}
!499 = !DISubrange(count: 1024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !480, file: !421, line: 179, baseType: !416, size: 64, offset: 1441792)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !471, file: !314, line: 185, baseType: !502, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferevent", file: !504, line: 113, flags: DIFlagFwdDecl)
!504 = !DIFile(filename: "/usr/include/event2/bufferevent.h", directory: "", checksumkind: CSK_MD5, checksum: "15bb43c26b2c9058b6c64d44779c7263")
!505 = !DIDerivedType(tag: DW_TAG_member, name: "defer_nbh", scope: !471, file: !314, line: 186, baseType: !453, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !471, file: !314, line: 187, baseType: !96, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !471, file: !314, line: 188, baseType: !508, size: 32, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_TYPE", file: !117, line: 98, baseType: !116)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !471, file: !314, line: 189, baseType: !510, size: 32, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_APP_TYPE", file: !117, line: 112, baseType: !129)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !471, file: !314, line: 190, baseType: !512, size: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !369, line: 184, baseType: !514)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !369, line: 184, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegs", scope: !471, file: !314, line: 191, baseType: !277, size: 32, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "in_write", scope: !471, file: !314, line: 192, baseType: !96, size: 32, offset: 608)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !471, file: !314, line: 193, baseType: !96, size: 32, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_known", scope: !471, file: !314, line: 194, baseType: !96, size: 32, offset: 672)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !471, file: !314, line: 195, baseType: !247, size: 224, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !471, file: !314, line: 196, baseType: !96, size: 32, offset: 928)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !471, file: !314, line: 197, baseType: !247, size: 224, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !471, file: !314, line: 198, baseType: !310, size: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "read_event", scope: !471, file: !314, line: 199, baseType: !524, size: 64, offset: 1280)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !324, line: 276, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !471, file: !314, line: 200, baseType: !527, size: 64, offset: 1344)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_event_handler", file: !117, line: 199, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !468, !96, !531, !98, !96}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_data", file: !117, line: 132, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_net_data", file: !117, line: 127, size: 384, elements: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !533, file: !117, line: 128, baseType: !247, size: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nbh", scope: !533, file: !117, line: 129, baseType: !453, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "recv_ttl", scope: !533, file: !117, line: 130, baseType: !96, size: 32, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "recv_tos", scope: !533, file: !117, line: 131, baseType: !96, size: 32, offset: 352)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "read_ctx", scope: !471, file: !314, line: 201, baseType: !98, size: 64, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !471, file: !314, line: 202, baseType: !96, size: 32, offset: 1472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !471, file: !314, line: 203, baseType: !460, size: 64, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "current_df_relay_flag", scope: !471, file: !314, line: 204, baseType: !96, size: 32, offset: 1600)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_use_df", scope: !471, file: !314, line: 206, baseType: !96, size: 32, offset: 1632)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tobeclosed", scope: !471, file: !314, line: 207, baseType: !96, size: 32, offset: 1664)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "broken", scope: !471, file: !314, line: 208, baseType: !96, size: 32, offset: 1696)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "default_ttl", scope: !471, file: !314, line: 209, baseType: !96, size: 32, offset: 1728)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "current_ttl", scope: !471, file: !314, line: 210, baseType: !96, size: 32, offset: 1760)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "default_tos", scope: !471, file: !314, line: 211, baseType: !96, size: 32, offset: 1792)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "current_tos", scope: !471, file: !314, line: 212, baseType: !96, size: 32, offset: 1824)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !471, file: !314, line: 213, baseType: !338, size: 128, offset: 1856)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !471, file: !314, line: 214, baseType: !377, size: 32, offset: 1984)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "data_traffic", scope: !471, file: !314, line: 215, baseType: !553, size: 128, offset: 2048)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "traffic_bytes", file: !314, line: 174, size: 128, elements: !554)
!554 = !{!555, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_read", scope: !553, file: !314, line: 175, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !103, line: 67, baseType: !362)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_write", scope: !553, file: !314, line: 176, baseType: !556, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "control_traffic", scope: !471, file: !314, line: 216, baseType: !553, size: 128, offset: 2176)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sub_session", scope: !471, file: !314, line: 219, baseType: !560, size: 64, offset: 2304)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection", file: !117, line: 50, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection", file: !141, line: 85, size: 960, elements: !563)
!563 = !{!564, !566, !568, !569, !570, !571, !572, !573, !581, !582, !583}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !562, file: !141, line: 87, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "TC_STATE", file: !141, line: 76, baseType: !140)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !562, file: !141, line: 88, baseType: !567, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_id", file: !141, line: 78, baseType: !277)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !562, file: !141, line: 89, baseType: !247, size: 224, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "client_s", scope: !562, file: !141, line: 90, baseType: !468, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "peer_s", scope: !562, file: !141, line: 91, baseType: !468, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "peer_conn_timeout", scope: !562, file: !141, line: 92, baseType: !380, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bind_timeout", scope: !562, file: !141, line: 93, baseType: !380, size: 64, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !562, file: !141, line: 94, baseType: !574, size: 96, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !103, line: 52, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 47, size: 96, elements: !576)
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !575, file: !103, line: 51, baseType: !578, size: 96)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 96, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 12)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !562, file: !141, line: 95, baseType: !98, size: 64, offset: 704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !562, file: !141, line: 96, baseType: !96, size: 32, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ub_to_client", scope: !562, file: !141, line: 97, baseType: !584, size: 128, offset: 832)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "unsent_buffer", file: !141, line: 83, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 80, size: 128, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !585, file: !141, line: 81, baseType: !360, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !585, file: !141, line: 82, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bev", scope: !471, file: !314, line: 221, baseType: !502, size: 64, offset: 2368)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cb", scope: !471, file: !314, line: 222, baseType: !592, size: 64, offset: 2432)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "connect_cb", file: !117, line: 135, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !96, !98}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "conn_arg", scope: !471, file: !314, line: 223, baseType: !98, size: 64, offset: 2496)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "list_ev", scope: !471, file: !314, line: 225, baseType: !598, size: 64, offset: 2560)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "evconnlistener", file: !600, line: 69, flags: DIFlagFwdDecl)
!600 = !DIFile(filename: "src/apps/relay/turn_admin_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "72080e29702b34b58984e3ea957f1f4c")
!601 = !DIDerivedType(tag: DW_TAG_member, name: "acb", scope: !471, file: !314, line: 226, baseType: !602, size: 64, offset: 2624)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "accept_cb", file: !117, line: 137, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !468, !98}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "acbarg", scope: !471, file: !314, line: 227, baseType: !98, size: 64, offset: 2688)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "special_session", scope: !471, file: !314, line: 229, baseType: !98, size: 64, offset: 2752)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "special_session_size", scope: !471, file: !314, line: 230, baseType: !360, size: 64, offset: 2816)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !462, file: !415, line: 73, baseType: !610, size: 141120, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation", file: !141, line: 186, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_allocation", file: !141, line: 176, size: 141120, elements: !612)
!612 = !{!613, !614, !615, !669, !679, !681, !707, !708, !709}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !611, file: !141, line: 177, baseType: !96, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !611, file: !141, line: 178, baseType: !574, size: 96, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "addr_to_perm", scope: !611, file: !141, line: 179, baseType: !616, size: 125440, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_hashtable", file: !141, line: 166, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_hashtable", file: !141, line: 164, size: 125440, elements: !618)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !617, file: !141, line: 165, baseType: !620, size: 125440)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 125440, elements: !282)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_array", file: !141, line: 162, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_array", file: !141, line: 158, size: 15680, elements: !623)
!623 = !{!624, !665, !666}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "main_slots", scope: !622, file: !141, line: 159, baseType: !625, size: 15552)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 15552, elements: !646)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_slot", file: !141, line: 156, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_slot", file: !141, line: 154, size: 5184, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !627, file: !141, line: 155, baseType: !630, size: 5184)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_info", file: !141, line: 152, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_info", file: !141, line: 143, size: 5184, elements: !632)
!632 = !{!633, !634, !658, !659, !660, !661, !662, !663}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !631, file: !141, line: 144, baseType: !96, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !631, file: !141, line: 145, baseType: !635, size: 4608, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map", file: !421, line: 117, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map", file: !421, line: 115, size: 4608, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !636, file: !421, line: 116, baseType: !639, size: 4608)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 4608, elements: !282)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map_array", file: !421, line: 113, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map_array", file: !421, line: 107, size: 576, elements: !642)
!642 = !{!643, !648, !651, !652, !655}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "main_keys", scope: !641, file: !421, line: 108, baseType: !644, size: 192)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 192, elements: !646)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !421, line: 47, baseType: !416)
!646 = !{!647}
!647 = !DISubrange(count: 3)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "main_values", scope: !641, file: !421, line: 109, baseType: !649, size: 192, offset: 192)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, elements: !646)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !421, line: 48, baseType: !362)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !641, file: !421, line: 110, baseType: !360, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "extra_keys", scope: !641, file: !421, line: 111, baseType: !653, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !641, file: !421, line: 112, baseType: !656, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !631, file: !141, line: 146, baseType: !247, size: 224, offset: 4672)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !631, file: !141, line: 147, baseType: !377, size: 32, offset: 4896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !631, file: !141, line: 148, baseType: !380, size: 64, offset: 4928)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !631, file: !141, line: 149, baseType: !98, size: 64, offset: 4992)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !631, file: !141, line: 150, baseType: !96, size: 32, offset: 5056)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !631, file: !141, line: 151, baseType: !664, size: 64, offset: 5120)
!664 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !622, file: !141, line: 160, baseType: !360, size: 64, offset: 15552)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slots", scope: !622, file: !141, line: 161, baseType: !667, size: 64, offset: 15616)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions", scope: !611, file: !141, line: 180, baseType: !670, size: 384, offset: 125568)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 384, elements: !677)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "relay_endpoint_session", file: !141, line: 55, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 50, size: 192, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !672, file: !141, line: 52, baseType: !468, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !672, file: !141, line: 53, baseType: !377, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !672, file: !141, line: 54, baseType: !380, size: 64, offset: 128)
!677 = !{!678}
!678 = !DISubrange(count: 2)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions_failure", scope: !611, file: !141, line: 181, baseType: !680, size: 64, offset: 125952)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, elements: !677)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !611, file: !141, line: 182, baseType: !682, size: 14848, offset: 126016)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map", file: !141, line: 136, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_map", file: !141, line: 134, size: 14848, elements: !684)
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !683, file: !141, line: 135, baseType: !686, size: 14848)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 14848, elements: !282)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map_array", file: !141, line: 132, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chn_map_array", file: !141, line: 128, size: 1856, elements: !689)
!689 = !{!690, !703, !704}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "main_chns", scope: !688, file: !141, line: 129, baseType: !691, size: 1728)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 1728, elements: !646)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_info", file: !141, line: 121, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_info", file: !141, line: 112, size: 576, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !693, file: !141, line: 113, baseType: !268, size: 16)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !693, file: !141, line: 114, baseType: !96, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !693, file: !141, line: 115, baseType: !268, size: 16, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !693, file: !141, line: 116, baseType: !247, size: 224, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !693, file: !141, line: 117, baseType: !377, size: 32, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !693, file: !141, line: 118, baseType: !380, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !693, file: !141, line: 119, baseType: !98, size: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_channel", scope: !693, file: !141, line: 120, baseType: !98, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !688, file: !141, line: 130, baseType: !360, size: 64, offset: 1728)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "extra_chns", scope: !688, file: !141, line: 131, baseType: !705, size: 64, offset: 1792)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !611, file: !141, line: 183, baseType: !98, size: 64, offset: 140864)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_connections", scope: !611, file: !141, line: 184, baseType: !419, size: 64, offset: 140928)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "tcs", scope: !611, file: !141, line: 185, baseType: !710, size: 128, offset: 140992)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_list", file: !141, line: 103, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection_list", file: !141, line: 100, size: 128, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !711, file: !141, line: 101, baseType: !360, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !711, file: !141, line: 102, baseType: !715, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_allocated_timeout_ev", scope: !462, file: !415, line: 74, baseType: !380, size: 64, offset: 141376)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !462, file: !415, line: 75, baseType: !96, size: 32, offset: 141440)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "is_tcp_relay", scope: !462, file: !415, line: 76, baseType: !96, size: 32, offset: 141472)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_closed", scope: !462, file: !415, line: 77, baseType: !96, size: 32, offset: 141504)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !462, file: !415, line: 79, baseType: !721, size: 136, offset: 141536)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 136, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 17)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_expiration_time", scope: !462, file: !415, line: 80, baseType: !377, size: 32, offset: 141696)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !462, file: !415, line: 81, baseType: !726, size: 4104, offset: 141728)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 4104, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 513)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey", scope: !462, file: !415, line: 82, baseType: !730, size: 512, offset: 145832)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !103, line: 64, baseType: !731)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 512, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey_set", scope: !462, file: !415, line: 83, baseType: !96, size: 32, offset: 146368)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !462, file: !415, line: 84, baseType: !736, size: 2056, offset: 146400)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !103, line: 66, baseType: !737)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 2056, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 257)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "quota_used", scope: !462, file: !415, line: 85, baseType: !96, size: 32, offset: 148480)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !462, file: !415, line: 86, baseType: !96, size: 32, offset: 148512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "max_session_time_auth", scope: !462, file: !415, line: 87, baseType: !377, size: 32, offset: 148544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "realm_options", scope: !462, file: !415, line: 89, baseType: !744, size: 1152, offset: 148608)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !117, line: 142, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !415, line: 53, size: 1152, elements: !746)
!746 = !{!747, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !745, file: !415, line: 55, baseType: !748, size: 1024)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !745, file: !415, line: 57, baseType: !752, size: 128, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !415, line: 51, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !415, line: 45, size: 128, elements: !754)
!754 = !{!755, !757, !758}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !753, file: !415, line: 47, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !556)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !753, file: !415, line: 48, baseType: !431, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !753, file: !415, line: 49, baseType: !431, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "origin_set", scope: !462, file: !415, line: 90, baseType: !96, size: 32, offset: 149760)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !462, file: !415, line: 91, baseType: !748, size: 1024, offset: 149792)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !462, file: !415, line: 93, baseType: !277, size: 32, offset: 150816)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !462, file: !415, line: 94, baseType: !277, size: 32, offset: 150848)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !462, file: !415, line: 95, baseType: !277, size: 32, offset: 150880)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !462, file: !415, line: 96, baseType: !277, size: 32, offset: 150912)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_packets", scope: !462, file: !415, line: 97, baseType: !416, size: 64, offset: 150976)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_packets", scope: !462, file: !415, line: 98, baseType: !416, size: 64, offset: 151040)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_bytes", scope: !462, file: !415, line: 99, baseType: !416, size: 64, offset: 151104)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_bytes", scope: !462, file: !415, line: 100, baseType: !416, size: 64, offset: 151168)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !462, file: !415, line: 101, baseType: !416, size: 64, offset: 151232)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !462, file: !415, line: 102, baseType: !360, size: 64, offset: 151296)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !462, file: !415, line: 103, baseType: !360, size: 64, offset: 151360)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !462, file: !415, line: 104, baseType: !277, size: 32, offset: 151424)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !462, file: !415, line: 105, baseType: !277, size: 32, offset: 151456)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !462, file: !415, line: 106, baseType: !277, size: 32, offset: 151488)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !462, file: !415, line: 107, baseType: !277, size: 32, offset: 151520)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_packets", scope: !462, file: !415, line: 108, baseType: !277, size: 32, offset: 151552)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_packets", scope: !462, file: !415, line: 109, baseType: !277, size: 32, offset: 151584)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_bytes", scope: !462, file: !415, line: 110, baseType: !277, size: 32, offset: 151616)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_bytes", scope: !462, file: !415, line: 111, baseType: !277, size: 32, offset: 151648)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !462, file: !415, line: 112, baseType: !416, size: 64, offset: 151680)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !462, file: !415, line: 113, baseType: !360, size: 64, offset: 151744)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !462, file: !415, line: 114, baseType: !360, size: 64, offset: 151808)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !462, file: !415, line: 116, baseType: !96, size: 32, offset: 151872)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_id", scope: !462, file: !415, line: 117, baseType: !785, size: 64, offset: 151936)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "mobile_id_t", file: !415, line: 66, baseType: !416)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "old_mobile_id", scope: !462, file: !415, line: 118, baseType: !785, size: 64, offset: 152000)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "s_mobile_id", scope: !462, file: !415, line: 119, baseType: !50, size: 264, offset: 152064)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !462, file: !415, line: 121, baseType: !556, size: 64, offset: 152384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "userkeycb", scope: !409, file: !111, line: 139, baseType: !790, size: 64, offset: 1408)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_user_key_cb", file: !111, line: 102, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !412, !442, !96, !795, !794, !794, !796, !531, !416, !795}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_username_resume_cb", file: !111, line: 101, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !96, !96, !96, !794, !794, !407, !416, !531, !794}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "chquotacb", scope: !409, file: !111, line: 140, baseType: !801, size: 64, offset: 1472)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "check_new_allocation_quota_cb", file: !111, line: 103, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!96, !794, !96, !794}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "raqcb", scope: !409, file: !111, line: 141, baseType: !806, size: 64, offset: 1536)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "release_allocation_quota_cb", file: !111, line: 104, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !794, !96, !794}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip_set", scope: !409, file: !111, line: 142, baseType: !96, size: 32, offset: 1600)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip", scope: !409, file: !111, line: 143, baseType: !247, size: 224, offset: 1632)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "allow_loopback_peers", scope: !409, file: !111, line: 144, baseType: !429, size: 64, offset: 1856)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "no_multicast_peers", scope: !409, file: !111, line: 145, baseType: !429, size: 64, offset: 1920)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "send_turn_session_info", scope: !409, file: !111, line: 146, baseType: !815, size: 64, offset: 1984)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_turn_session_info_cb", file: !111, line: 106, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!96, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "turn_session_info", file: !415, line: 134, size: 15040, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !830, !834, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !864, !865, !867, !868, !869, !870}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !820, file: !415, line: 135, baseType: !414, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !820, file: !415, line: 136, baseType: !96, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !820, file: !415, line: 137, baseType: !377, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !820, file: !415, line: 138, baseType: !377, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !820, file: !415, line: 139, baseType: !508, size: 32, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "peer_protocol", scope: !820, file: !415, line: 140, baseType: !508, size: 32, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tls_method", scope: !820, file: !415, line: 141, baseType: !829, size: 136, offset: 224)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !722)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cipher", scope: !820, file: !415, line: 142, baseType: !831, size: 520, offset: 360)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 65)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_data", scope: !820, file: !415, line: 143, baseType: !835, size: 768, offset: 896)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_data", file: !415, line: 132, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_data", file: !415, line: 129, size: 768, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !836, file: !415, line: 130, baseType: !247, size: 224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !836, file: !415, line: 131, baseType: !831, size: 520, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr_data", scope: !820, file: !415, line: 144, baseType: !835, size: 768, offset: 1664)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv4", scope: !820, file: !415, line: 145, baseType: !835, size: 768, offset: 2432)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv6", scope: !820, file: !415, line: 146, baseType: !835, size: 768, offset: 3200)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !820, file: !415, line: 147, baseType: !726, size: 4104, offset: 3968)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !820, file: !415, line: 148, baseType: !96, size: 32, offset: 8096)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !820, file: !415, line: 150, baseType: !416, size: 64, offset: 8128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !820, file: !415, line: 151, baseType: !416, size: 64, offset: 8192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !820, file: !415, line: 152, baseType: !416, size: 64, offset: 8256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !820, file: !415, line: 153, baseType: !416, size: 64, offset: 8320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !820, file: !415, line: 154, baseType: !277, size: 32, offset: 8384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !820, file: !415, line: 155, baseType: !277, size: 32, offset: 8416)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !820, file: !415, line: 156, baseType: !277, size: 32, offset: 8448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !820, file: !415, line: 157, baseType: !416, size: 64, offset: 8512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !820, file: !415, line: 158, baseType: !416, size: 64, offset: 8576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !820, file: !415, line: 159, baseType: !416, size: 64, offset: 8640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !820, file: !415, line: 160, baseType: !416, size: 64, offset: 8704)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !820, file: !415, line: 161, baseType: !277, size: 32, offset: 8768)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !820, file: !415, line: 162, baseType: !277, size: 32, offset: 8800)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !820, file: !415, line: 163, baseType: !277, size: 32, offset: 8832)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !820, file: !415, line: 165, baseType: !96, size: 32, offset: 8864)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_data", scope: !820, file: !415, line: 167, baseType: !861, size: 3840, offset: 8896)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 3840, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 5)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_size", scope: !820, file: !415, line: 168, baseType: !360, size: 64, offset: 12736)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_data", scope: !820, file: !415, line: 169, baseType: !866, size: 64, offset: 12800)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_size", scope: !820, file: !415, line: 170, baseType: !360, size: 64, offset: 12864)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !820, file: !415, line: 172, baseType: !748, size: 1024, offset: 12928)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !820, file: !415, line: 173, baseType: !748, size: 1024, offset: 13952)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !820, file: !415, line: 175, baseType: !556, size: 64, offset: 14976)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "send_https_socket", scope: !409, file: !111, line: 147, baseType: !872, size: 64, offset: 2048)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_https_socket_cb", file: !111, line: 107, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !468}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "no_udp_relay", scope: !409, file: !111, line: 150, baseType: !429, size: 64, offset: 2112)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "no_tcp_relay", scope: !409, file: !111, line: 151, baseType: !429, size: 64, offset: 2176)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_relay_connections", scope: !409, file: !111, line: 152, baseType: !419, size: 64, offset: 2240)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "send_socket_to_relay", scope: !409, file: !111, line: 153, baseType: !880, size: 64, offset: 2304)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_socket_to_relay_cb", file: !111, line: 105, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!96, !412, !416, !884, !468, !96, !885, !531, !96}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "MESSAGE_TO_RELAY_TYPE", file: !111, line: 76, baseType: !149)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_servers_list", scope: !409, file: !111, line: 157, baseType: !887, size: 64, offset: 2368)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_server_addrs_list_t", file: !111, line: 53, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_server_addrs_list", file: !111, line: 47, size: 256, elements: !890)
!890 = !{!891, !892, !894}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !889, file: !111, line: 48, baseType: !402, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !111, line: 49, baseType: !893, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !360)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !889, file: !111, line: 50, baseType: !895, size: 128, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_mutex", file: !117, line: 60, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_mutex", file: !117, line: 55, size: 128, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !896, file: !117, line: 56, baseType: !277, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !896, file: !117, line: 57, baseType: !98, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "as_counter", scope: !409, file: !111, line: 158, baseType: !360, size: 64, offset: 2432)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tls_alternate_servers_list", scope: !409, file: !111, line: 159, baseType: !887, size: 64, offset: 2496)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "tls_as_counter", scope: !409, file: !111, line: 160, baseType: !360, size: 64, offset: 2560)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "aux_servers_list", scope: !409, file: !111, line: 161, baseType: !887, size: 64, offset: 2624)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "self_udp_balance", scope: !409, file: !111, line: 162, baseType: !96, size: 32, offset: 2688)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ip_whitelist", scope: !409, file: !111, line: 165, baseType: !906, size: 64, offset: 2752)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !117, line: 159, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !117, line: 154, size: 128, elements: !909)
!909 = !{!910, !925}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !908, file: !117, line: 155, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !117, line: 152, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !117, line: 146, size: 6624, elements: !914)
!914 = !{!915, !917, !919}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !913, file: !117, line: 147, baseType: !916, size: 2056)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2056, elements: !738)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !913, file: !117, line: 148, baseType: !918, size: 4104, offset: 2056)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4104, elements: !727)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !913, file: !117, line: 149, baseType: !920, size: 448, offset: 6176)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !248, line: 53, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !248, line: 50, size: 448, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !921, file: !248, line: 51, baseType: !247, size: 224)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !921, file: !248, line: 52, baseType: !247, size: 224, offset: 224)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !908, file: !117, line: 156, baseType: !360, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ip_blacklist", scope: !409, file: !111, line: 166, baseType: !906, size: 64, offset: 2816)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mobility", scope: !409, file: !111, line: 169, baseType: !429, size: 64, offset: 2880)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_connections_map", scope: !409, file: !111, line: 170, baseType: !419, size: 64, offset: 2944)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "server_relay", scope: !409, file: !111, line: 173, baseType: !96, size: 32, offset: 3008)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_bps_func", scope: !409, file: !111, line: 176, baseType: !931, size: 64, offset: 3072)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocate_bps_cb", file: !111, line: 109, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!556, !556, !96}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !409, file: !111, line: 179, baseType: !96, size: 32, offset: 3136)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "oauth_server_name", scope: !409, file: !111, line: 180, baseType: !937, size: 64, offset: 3200)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "acme_redirect", scope: !409, file: !111, line: 183, baseType: !937, size: 64, offset: 3264)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "allocation_default_address_family", scope: !409, file: !111, line: 186, baseType: !940, size: 32, offset: 3328)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !111, line: 84, baseType: !156)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "log_binding", scope: !409, file: !111, line: 189, baseType: !429, size: 64, offset: 3392)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !240, file: !2, line: 57, baseType: !96, size: 32, offset: 8576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "udp_listen_ev", scope: !240, file: !2, line: 58, baseType: !524, size: 64, offset: 8640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "udp_listen_s", scope: !240, file: !2, line: 59, baseType: !468, size: 64, offset: 8704)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "children_ss", scope: !240, file: !2, line: 60, baseType: !478, size: 64, offset: 8768)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !240, file: !2, line: 61, baseType: !947, size: 896, offset: 8832)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "message_to_relay", file: !314, line: 114, size: 896, elements: !948)
!948 = !{!949, !950, !966}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !947, file: !314, line: 115, baseType: !885, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "relay_server", scope: !947, file: !314, line: 116, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "relay_server", file: !314, line: 101, size: 4032, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !952, file: !314, line: 102, baseType: !412, size: 8)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !952, file: !314, line: 103, baseType: !317, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !952, file: !314, line: 104, baseType: !322, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !952, file: !314, line: 105, baseType: !502, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !952, file: !314, line: 106, baseType: !502, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "auth_in_buf", scope: !952, file: !314, line: 107, baseType: !502, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "auth_out_buf", scope: !952, file: !314, line: 108, baseType: !502, size: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ioa_eng", scope: !952, file: !314, line: 109, baseType: !310, size: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !952, file: !314, line: 110, baseType: !408, size: 3456, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !952, file: !314, line: 111, baseType: !964, size: 64, offset: 3968)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !965, line: 27, baseType: !362)
!965 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!966 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !947, file: !314, line: 121, baseType: !967, size: 768, offset: 128)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !947, file: !314, line: 117, size: 768, elements: !968)
!968 = !{!969, !975, !985}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !967, file: !314, line: 118, baseType: !970, size: 512)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "socket_message", file: !111, line: 86, size: 512, elements: !971)
!971 = !{!972, !973, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !970, file: !111, line: 87, baseType: !468, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !970, file: !111, line: 88, baseType: !532, size: 384, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "can_resume", scope: !970, file: !111, line: 89, baseType: !96, size: 32, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cb_sm", scope: !967, file: !314, line: 119, baseType: !976, size: 768)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cb_socket_message", file: !314, line: 87, size: 768, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !984}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !976, file: !314, line: 88, baseType: !412, size: 8)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "connection_id", scope: !976, file: !314, line: 89, baseType: !567, size: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !976, file: !314, line: 90, baseType: !574, size: 96, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !976, file: !314, line: 91, baseType: !468, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "message_integrity", scope: !976, file: !314, line: 92, baseType: !96, size: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !976, file: !314, line: 93, baseType: !532, size: 384, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "can_resume", scope: !976, file: !314, line: 94, baseType: !96, size: 32, offset: 704)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "csm", scope: !967, file: !314, line: 120, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cancelled_session_message", file: !314, line: 97, size: 64, elements: !987)
!987 = !{!988}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !986, file: !314, line: 98, baseType: !414, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "slen0", scope: !240, file: !2, line: 62, baseType: !96, size: 32, offset: 9728)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "connect_cb", scope: !240, file: !2, line: 63, baseType: !991, size: 64, offset: 9792)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_new_connection_event_handler", file: !314, line: 127, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!96, !310, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !212, line: 33, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !271, line: 210, baseType: !104)
!1009 = !{!0, !7, !13, !18, !23, !28, !33, !38, !43, !48, !53, !58, !63, !68, !71, !76, !81, !86, !91, !1010, !1012, !1017, !1020, !1022, !1027, !1032, !1034, !1036, !1041, !1044, !1049, !1051, !1056, !1061, !1066, !1071, !1073, !1075, !1077, !1082, !1084, !1086, !1091, !1096, !1101, !1104, !1106}
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !2, line: 700, type: !78, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !2, line: 717, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 35)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !2, line: 727, type: !1019, isLocal: true, isDefinition: true)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !89)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !2, line: 819, type: !35, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !2, line: 858, type: !1024, isLocal: true, isDefinition: true)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 40)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !2, line: 871, type: !1029, isLocal: true, isDefinition: true)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 29)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !2, line: 874, type: !1019, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !2, line: 877, type: !73, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !2, line: 480, type: !1038, isLocal: true, isDefinition: true)
