; ModuleID = '/home/raj/coturn/src/apps/relay/http_server.c'
source_filename = "/home/raj/coturn/src/apps/relay/http_server.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ioa_socket = type { i32, ptr, i32, ptr, ptr, ptr, i32, i32, i32, ptr, i32, i32, i32, i32, %union.ioa_addr, i32, %union.ioa_addr, ptr, ptr, ptr, ptr, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, %struct._stun_buffer_list, i32, %struct.traffic_bytes, %struct.traffic_bytes, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%union.ioa_addr = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._stun_buffer_list = type { ptr, i64 }
%struct.traffic_bytes = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct.http_request = type { i32, ptr, ptr }
%struct.http_headers = type { ptr, ptr }
%struct.headers_list = type { i64, ptr, ptr }
%struct.str_buffer = type { i64, i64, ptr }

@get_http_date_header.buffer_date = internal global [256 x i8] zeroinitializer, align 16, !dbg !0
@get_http_date_header.buffer_header = internal global [1025 x i8] zeroinitializer, align 16, !dbg !106
@get_http_date_header.wds = internal global [7 x ptr] [ptr @.str, ptr @.str.1, ptr @.str.2, ptr @.str.3, ptr @.str.4, ptr @.str.5, ptr @.str.6], align 16, !dbg !128

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "buffer_date", scope: !2, file: !3, line: 82, type: !226, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "get_http_date_header", scope: !3, file: !3, line: 80, type: !4, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !225)
!3 = !DIFile(filename: "src/apps/relay/http_server.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "3b116eae77bbd16ad431b17bf60eaea2")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C11, file: !10, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !55, globals: !105, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "/home/raj/coturn/src/apps/relay/http_server.c", directory: "/home/raj/coturn/build", checksumkind: CSK_MD5, checksum: "3b116eae77bbd16ad431b17bf60eaea2")
!11 = !{!12, !26, !37, !46}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_TYPE", file: !13, line: 85, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!16 = !DIEnumerator(name: "UNKNOWN_SOCKET", value: 0)
!17 = !DIEnumerator(name: "TCP_SOCKET", value: 6)
!18 = !DIEnumerator(name: "UDP_SOCKET", value: 17)
!19 = !DIEnumerator(name: "TLS_SOCKET", value: 56)
!20 = !DIEnumerator(name: "SCTP_SOCKET", value: 132)
!21 = !DIEnumerator(name: "TLS_SCTP_SOCKET", value: 133)
!22 = !DIEnumerator(name: "DTLS_SOCKET", value: 250)
!23 = !DIEnumerator(name: "TCP_SOCKET_PROXY", value: 253)
!24 = !DIEnumerator(name: "TENTATIVE_SCTP_SOCKET", value: 254)
!25 = !DIEnumerator(name: "TENTATIVE_TCP_SOCKET", value: 255)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_APP_TYPE", file: !13, line: 100, baseType: !14, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36}
!28 = !DIEnumerator(name: "UNKNOWN_APP_SOCKET", value: 0)
!29 = !DIEnumerator(name: "CLIENT_SOCKET", value: 1)
!30 = !DIEnumerator(name: "HTTP_CLIENT_SOCKET", value: 2)
!31 = !DIEnumerator(name: "HTTPS_CLIENT_SOCKET", value: 3)
!32 = !DIEnumerator(name: "RELAY_SOCKET", value: 4)
!33 = !DIEnumerator(name: "RELAY_RTCP_SOCKET", value: 5)
!34 = !DIEnumerator(name: "TCP_CLIENT_DATA_SOCKET", value: 6)
!35 = !DIEnumerator(name: "TCP_RELAY_DATA_SOCKET", value: 7)
!36 = !DIEnumerator(name: "LISTENER_SOCKET", value: 8)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_TC_STATE", file: !38, line: 67, baseType: !14, size: 32, elements: !39)
!38 = !DIFile(filename: "src/server/ns_turn_allocation.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0cb2cf61c9ec5dd3030a6e5a6f8d4af1")
!39 = !{!40, !41, !42, !43, !44, !45}
!40 = !DIEnumerator(name: "TC_STATE_UNKNOWN", value: 0)
!41 = !DIEnumerator(name: "TC_STATE_CLIENT_TO_PEER_CONNECTING", value: 1)
!42 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTING", value: 2)
!43 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTED", value: 3)
!44 = !DIEnumerator(name: "TC_STATE_READY", value: 4)
!45 = !DIEnumerator(name: "TC_STATE_FAILED", value: 5)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_HTTP_REQUEST_TYPE", file: !47, line: 47, baseType: !14, size: 32, elements: !48)
!47 = !DIFile(filename: "src/apps/relay/http_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "87bf7bb31da00743240048b59ab9f531")
!48 = !{!49, !50, !51, !52, !53, !54}
!49 = !DIEnumerator(name: "HRT_UNKNOWN", value: 0)
!50 = !DIEnumerator(name: "HRT_GET", value: 1)
!51 = !DIEnumerator(name: "HRT_HEAD", value: 2)
!52 = !DIEnumerator(name: "HRT_POST", value: 3)
!53 = !DIEnumerator(name: "HRT_PUT", value: 4)
!54 = !DIEnumerator(name: "HRT_DELETE", value: 5)
!55 = !{!56, !96, !62, !92, !102, !103, !68, !64, !104, !86, !94}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_request", file: !47, line: 60, size: 192, elements: !58)
!58 = !{!59, !61, !63}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !57, file: !47, line: 61, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "HTTP_REQUEST_TYPE", file: !47, line: 56, baseType: !46)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !57, file: !47, line: 62, baseType: !62, size: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "headers", scope: !57, file: !47, line: 63, baseType: !64, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "http_headers", file: !3, line: 48, size: 128, elements: !66)
!66 = !{!67, !85}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "uri_headers", scope: !65, file: !3, line: 49, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evkeyvalq", file: !70, line: 65, size: 128, elements: !71)
!70 = !DIFile(filename: "/usr/include/event2/keyvalq_struct.h", directory: "", checksumkind: CSK_MD5, checksum: "3f1344c5fa5cf428f71ec6c13956ba71")
!71 = !{!72, !84}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !69, file: !70, line: 65, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evkeyval", file: !70, line: 58, size: 256, elements: !75)
!75 = !{!76, !82, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !70, line: 59, baseType: !77, size: 128)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !70, line: 59, size: 128, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !77, file: !70, line: 59, baseType: !73, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !77, file: !70, line: 59, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !74, file: !70, line: 61, baseType: !62, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !74, file: !70, line: 62, baseType: !62, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !69, file: !70, line: 65, baseType: !81, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "post_headers", scope: !65, file: !3, line: 50, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "headers_list", file: !3, line: 42, size: 192, elements: !88)
!88 = !{!89, !93, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !87, file: !3, line: 43, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!92 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !87, file: !3, line: 44, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !87, file: !3, line: 45, baseType: !94, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "str_buffer", file: !3, line: 321, size: 192, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !97, file: !3, line: 322, baseType: !90, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !97, file: !3, line: 323, baseType: !90, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !97, file: !3, line: 324, baseType: !62, size: 64, offset: 128)
!102 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !{!0, !106, !111, !116, !118, !120, !122, !124, !126, !128, !133, !135, !137, !139, !141, !143, !145, !147, !149, !151, !153, !155, !157, !162, !167, !172, !177, !182, !184, !186, !191, !193, !195, !198, !203, !208, !213, !216, !218, !223}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "buffer_header", scope: !2, file: !3, line: 83, type: !108, isLocal: true, isDefinition: true)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8200, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1025)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !3, line: 84, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 4)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !3, line: 84, type: !113, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !3, line: 84, type: !113, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !3, line: 84, type: !113, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !3, line: 84, type: !113, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !3, line: 84, type: !113, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !3, line: 84, type: !113, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "wds", scope: !2, file: !3, line: 84, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 448, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 7)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !3, line: 85, type: !113, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "mons", scope: !2, file: !3, line: 85, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 768, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 12)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !3, line: 93, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 208, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 26)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !3, line: 95, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 88, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 11)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !3, line: 213, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 40, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 5)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !3, line: 216, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 48, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 6)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !3, line: 219, type: !179, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !3, line: 222, type: !174, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !3, line: 225, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 8)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !3, line: 353, type: !113, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !3, line: 360, type: !188, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !3, line: 65, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !160)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !3, line: 66, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1416, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 177)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !3, line: 67, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 784, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 98)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !3, line: 67, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 200, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 25)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !3, line: 152, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 56, elements: !131)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !3, line: 186, type: !174, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !3, line: 112, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 16, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 2)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !3, line: 117, type: !220, isLocal: true, isDefinition: true)
!225 = !{}
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 256)
!229 = !{i32 7, !"Dwarf Version", i32 5}
!230 = !{i32 2, !"Debug Info Version", i32 3}
!231 = !{i32 1, !"wchar_size", i32 4}
!232 = !{i32 8, !"PIC Level", i32 2}
!233 = !{i32 7, !"PIE Level", i32 2}
!234 = !{i32 7, !"uwtable", i32 2}
!235 = !{i32 7, !"frame-pointer", i32 2}
!236 = !{!"clang version 16.0.0"}
!237 = distinct !DISubprogram(name: "handle_http_echo", scope: !3, file: !3, line: 76, type: !238, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !225)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !240}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !13, line: 116, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !13, line: 115, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !244, line: 179, size: 2880, elements: !245)
!244 = !DIFile(filename: "src/apps/relay/ns_ioalib_impl.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "39ae1828625a6763b6269ecb34869b6c")
!245 = !{!246, !247, !249, !254, !337, !341, !343, !344, !346, !348, !353, !354, !355, !356, !357, !358, !359, !360, !452, !455, !468, !469, !470, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !710, !711, !712, !713, !718, !719, !722, !727, !728, !729}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !243, file: !244, line: 181, baseType: !103, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent_s", scope: !243, file: !244, line: 182, baseType: !248, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !243, file: !244, line: 183, baseType: !250, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !251, line: 26, baseType: !252)
!251 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !253, line: 42, baseType: !14)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sockets_container", scope: !243, file: !244, line: 184, baseType: !255, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map", file: !257, line: 183, baseType: !258)
!257 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_addr_map", file: !257, line: 177, size: 1441856, elements: !259)
!259 = !{!260, !334}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !258, file: !257, line: 178, baseType: !261, size: 1441792)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1441792, elements: !332)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_list_header", file: !257, line: 175, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_list_header", file: !257, line: 171, size: 1408, elements: !264)
!264 = !{!265, !329, !331}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "main_list", scope: !263, file: !257, line: 172, baseType: !266, size: 1280)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1280, elements: !114)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_elem", file: !257, line: 169, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_elem", file: !257, line: 166, size: 320, elements: !269)
!269 = !{!270, !327}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !268, file: !257, line: 167, baseType: !271, size: 224)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !272, line: 48, baseType: !273)
!272 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!273 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 44, size: 224, elements: !274)
!274 = !{!275, !287, !304}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !273, file: !272, line: 45, baseType: !276, size: 128)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !277, line: 180, size: 128, elements: !278)
!277 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!278 = !{!279, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !276, file: !277, line: 182, baseType: !280, size: 16)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !281, line: 28, baseType: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!282 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !276, file: !277, line: 183, baseType: !284, size: 112, offset: 16)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 112, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 14)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !273, file: !272, line: 46, baseType: !288, size: 128)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !289, line: 245, size: 128, elements: !290)
!289 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!290 = !{!291, !292, !296, !301}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !288, file: !289, line: 247, baseType: !280, size: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !288, file: !289, line: 248, baseType: !293, size: 16, offset: 16)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !289, line: 123, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !251, line: 25, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !253, line: 40, baseType: !282)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !288, file: !289, line: 249, baseType: !297, size: 32, offset: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !289, line: 31, size: 32, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !297, file: !289, line: 33, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !289, line: 30, baseType: !250)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !288, file: !289, line: 252, baseType: !302, size: 64, offset: 64)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 64, elements: !189)
!303 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !273, file: !272, line: 47, baseType: !305, size: 224)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !289, line: 260, size: 224, elements: !306)
!306 = !{!307, !308, !309, !310, !326}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !305, file: !289, line: 262, baseType: !280, size: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !305, file: !289, line: 263, baseType: !293, size: 16, offset: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !305, file: !289, line: 264, baseType: !250, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !305, file: !289, line: 265, baseType: !311, size: 128, offset: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !289, line: 219, size: 128, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !311, file: !289, line: 226, baseType: !314, size: 128)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !311, file: !289, line: 221, size: 128, elements: !315)
!315 = !{!316, !322, !324}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !314, file: !289, line: 223, baseType: !317, size: 128)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 128, elements: !320)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !251, line: 24, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !253, line: 38, baseType: !303)
!320 = !{!321}
!321 = !DISubrange(count: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !314, file: !289, line: 224, baseType: !323, size: 128)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 128, elements: !189)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !314, file: !289, line: 225, baseType: !325, size: 128)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 128, elements: !114)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !305, file: !289, line: 266, baseType: !250, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !268, file: !257, line: 168, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map_value_type", file: !257, line: 161, baseType: !92)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "extra_list", scope: !263, file: !257, line: 173, baseType: !330, size: 64, offset: 1280)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !263, file: !257, line: 174, baseType: !90, size: 64, offset: 1344)
!332 = !{!333}
!333 = !DISubrange(count: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !258, file: !257, line: 179, baseType: !335, size: 64, offset: 1441792)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !251, line: 27, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !253, line: 45, baseType: !92)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !243, file: !244, line: 185, baseType: !338, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferevent", file: !340, line: 113, flags: DIFlagFwdDecl)
!340 = !DIFile(filename: "/usr/include/event2/bufferevent.h", directory: "", checksumkind: CSK_MD5, checksum: "15bb43c26b2c9058b6c64d44779c7263")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "defer_nbh", scope: !243, file: !244, line: 186, baseType: !342, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !13, line: 124, baseType: !104)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !243, file: !244, line: 187, baseType: !103, size: 32, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !243, file: !244, line: 188, baseType: !345, size: 32, offset: 416)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_TYPE", file: !13, line: 98, baseType: !12)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !243, file: !244, line: 189, baseType: !347, size: 32, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_APP_TYPE", file: !13, line: 112, baseType: !26)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !243, file: !244, line: 190, baseType: !349, size: 64, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !351, line: 184, baseType: !352)
!351 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !351, line: 184, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegs", scope: !243, file: !244, line: 191, baseType: !250, size: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "in_write", scope: !243, file: !244, line: 192, baseType: !103, size: 32, offset: 608)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !243, file: !244, line: 193, baseType: !103, size: 32, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_known", scope: !243, file: !244, line: 194, baseType: !103, size: 32, offset: 672)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !243, file: !244, line: 195, baseType: !271, size: 224, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !243, file: !244, line: 196, baseType: !103, size: 32, offset: 928)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !243, file: !244, line: 197, baseType: !271, size: 224, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !243, file: !244, line: 198, baseType: !361, size: 64, offset: 1216)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !13, line: 120, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !13, line: 119, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !244, line: 135, size: 536064, elements: !365)
!365 = !{!366, !371, !375, !376, !377, !382, !387, !413, !417, !418, !419, !420, !421, !422, !425, !427, !431, !433, !443, !444, !445, !446, !447, !449}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !364, file: !244, line: 137, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "super_memory_t", file: !369, line: 49, baseType: !370)
!369 = !DIFile(filename: "src/apps/relay/ns_sm.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "9025fd46a533d33a213551fd581f5b89")
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_super_memory", file: !369, line: 48, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !364, file: !244, line: 138, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !374, line: 217, flags: DIFlagFwdDecl)
!374 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!375 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate_eb", scope: !364, file: !244, line: 139, baseType: !103, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !364, file: !244, line: 140, baseType: !103, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !364, file: !244, line: 141, baseType: !378, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnipports", file: !380, line: 50, baseType: !381)
!380 = !DIFile(filename: "src/apps/relay/turn_ports.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "11983eef23ed630198ed333562550552")
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_turnipports", file: !380, line: 49, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "map_rtcp", scope: !364, file: !244, line: 142, baseType: !383, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !385, line: 46, baseType: !386)
!385 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !385, line: 45, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !364, file: !244, line: 143, baseType: !388, size: 128, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list", file: !244, line: 81, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list", file: !244, line: 78, size: 128, elements: !390)
!390 = !{!391, !412}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !389, file: !244, line: 79, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list_elem", file: !244, line: 76, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list_elem", file: !244, line: 73, size: 524288, elements: !395)
!395 = !{!396, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !244, line: 74, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !394, file: !244, line: 75, baseType: !399, size: 524224, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !400, line: 48, baseType: !401)
!400 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !400, line: 42, size: 524224, elements: !402)
!402 = !{!403, !405, !409, !410, !411}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !401, file: !400, line: 43, baseType: !404, size: 32)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 32, elements: !114)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !401, file: !400, line: 44, baseType: !406, size: 524056, offset: 32)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 524056, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 65507)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !401, file: !400, line: 45, baseType: !90, size: 64, offset: 524096)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !401, file: !400, line: 46, baseType: !294, size: 16, offset: 524160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !401, file: !400, line: 47, baseType: !318, size: 8, offset: 524176)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tsz", scope: !389, file: !244, line: 80, baseType: !90, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !364, file: !244, line: 144, baseType: !414, size: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !351, line: 185, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !351, line: 185, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !364, file: !244, line: 145, baseType: !414, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !364, file: !244, line: 147, baseType: !414, size: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !364, file: !244, line: 149, baseType: !414, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !364, file: !244, line: 153, baseType: !414, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !364, file: !244, line: 156, baseType: !414, size: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !364, file: !244, line: 158, baseType: !423, size: 32, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !424, line: 108, baseType: !250)
!424 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!425 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !364, file: !244, line: 159, baseType: !426, size: 64, offset: 896)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !13, line: 122, baseType: !104)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg", scope: !364, file: !244, line: 160, baseType: !428, size: 524296, offset: 960)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 524296, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 65537)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timer_intervals", scope: !364, file: !244, line: 161, baseType: !432, size: 448, offset: 525280)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 448, elements: !285)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timers", scope: !364, file: !244, line: 162, baseType: !434, size: 1792, offset: 525760)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 1792, elements: !285)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !436, line: 8, size: 128, elements: !437)
!436 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!437 = !{!438, !441}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !435, file: !436, line: 14, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !253, line: 160, baseType: !440)
!440 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !435, file: !436, line: 15, baseType: !442, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !253, line: 162, baseType: !440)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !364, file: !244, line: 164, baseType: !108, size: 8200, offset: 527552)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !364, file: !244, line: 165, baseType: !103, size: 32, offset: 535776)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !364, file: !244, line: 166, baseType: !90, size: 64, offset: 535808)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_counter", scope: !364, file: !244, line: 167, baseType: !90, size: 64, offset: 535872)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !364, file: !244, line: 168, baseType: !448, size: 64, offset: 535936)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "rch", scope: !364, file: !244, line: 169, baseType: !450, size: 64, offset: 536000)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !451, line: 45, baseType: !104)
!451 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "read_event", scope: !243, file: !244, line: 199, baseType: !453, size: 64, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !374, line: 276, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !243, file: !244, line: 200, baseType: !456, size: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_event_handler", file: !13, line: 199, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !240, !103, !460, !104, !103}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_data", file: !13, line: 132, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_net_data", file: !13, line: 127, size: 384, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !462, file: !13, line: 128, baseType: !271, size: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nbh", scope: !462, file: !13, line: 129, baseType: !342, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "recv_ttl", scope: !462, file: !13, line: 130, baseType: !103, size: 32, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "recv_tos", scope: !462, file: !13, line: 131, baseType: !103, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "read_ctx", scope: !243, file: !244, line: 201, baseType: !104, size: 64, offset: 1408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !243, file: !244, line: 202, baseType: !103, size: 32, offset: 1472)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !243, file: !244, line: 203, baseType: !471, size: 64, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ts_ur_super_session", file: !13, line: 47, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts_ur_super_session", file: !474, line: 68, size: 152448, elements: !475)
!474 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!475 = !{!476, !477, !479, !480, !481, !617, !618, !619, !620, !621, !625, !626, !630, !635, !636, !641, !642, !643, !644, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !689, !690, !694}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !473, file: !474, line: 69, baseType: !104, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !473, file: !474, line: 70, baseType: !478, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnsession_id", file: !474, line: 62, baseType: !335)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !473, file: !474, line: 71, baseType: !423, size: 32, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "client_socket", scope: !473, file: !474, line: 72, baseType: !240, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !473, file: !474, line: 73, baseType: !482, size: 141120, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation", file: !38, line: 186, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_allocation", file: !38, line: 176, size: 141120, elements: !484)
!484 = !{!485, !486, !493, !546, !554, !556, !582, !583, !587}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !483, file: !38, line: 177, baseType: !103, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !483, file: !38, line: 178, baseType: !487, size: 96, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !488, line: 52, baseType: !489)
!488 = !DIFile(filename: "src/client/ns_turn_msg.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "43c56357294df21a547ee0716fe3769d")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 47, size: 96, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !489, file: !488, line: 51, baseType: !492, size: 96)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 96, elements: !160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "addr_to_perm", scope: !483, file: !38, line: 179, baseType: !494, size: 125440, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_hashtable", file: !38, line: 166, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_hashtable", file: !38, line: 164, size: 125440, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !495, file: !38, line: 165, baseType: !498, size: 125440)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 125440, elements: !189)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_array", file: !38, line: 162, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_array", file: !38, line: 158, size: 15680, elements: !501)
!501 = !{!502, !542, !543}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "main_slots", scope: !500, file: !38, line: 159, baseType: !503, size: 15552)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 15552, elements: !524)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_slot", file: !38, line: 156, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_slot", file: !38, line: 154, size: 5184, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !505, file: !38, line: 155, baseType: !508, size: 5184)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_info", file: !38, line: 152, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_info", file: !38, line: 143, size: 5184, elements: !510)
!510 = !{!511, !512, !536, !537, !538, !539, !540, !541}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !509, file: !38, line: 144, baseType: !103, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !509, file: !38, line: 145, baseType: !513, size: 4608, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map", file: !257, line: 117, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map", file: !257, line: 115, size: 4608, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !514, file: !257, line: 116, baseType: !517, size: 4608)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 4608, elements: !189)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map_array", file: !257, line: 113, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map_array", file: !257, line: 107, size: 576, elements: !520)
!520 = !{!521, !526, !529, !530, !533}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "main_keys", scope: !519, file: !257, line: 108, baseType: !522, size: 192)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 192, elements: !524)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !257, line: 47, baseType: !335)
!524 = !{!525}
!525 = !DISubrange(count: 3)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "main_values", scope: !519, file: !257, line: 109, baseType: !527, size: 192, offset: 192)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 192, elements: !524)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !257, line: 48, baseType: !92)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !519, file: !257, line: 110, baseType: !90, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "extra_keys", scope: !519, file: !257, line: 111, baseType: !531, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !519, file: !257, line: 112, baseType: !534, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !509, file: !38, line: 146, baseType: !271, size: 224, offset: 4672)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !509, file: !38, line: 147, baseType: !423, size: 32, offset: 4896)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !509, file: !38, line: 148, baseType: !426, size: 64, offset: 4928)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !509, file: !38, line: 149, baseType: !104, size: 64, offset: 4992)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !509, file: !38, line: 150, baseType: !103, size: 32, offset: 5056)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !509, file: !38, line: 151, baseType: !102, size: 64, offset: 5120)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !500, file: !38, line: 160, baseType: !90, size: 64, offset: 15552)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slots", scope: !500, file: !38, line: 161, baseType: !544, size: 64, offset: 15616)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions", scope: !483, file: !38, line: 180, baseType: !547, size: 384, offset: 125568)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 384, elements: !221)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "relay_endpoint_session", file: !38, line: 55, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 50, size: 192, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !549, file: !38, line: 52, baseType: !240, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !549, file: !38, line: 53, baseType: !423, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !549, file: !38, line: 54, baseType: !426, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions_failure", scope: !483, file: !38, line: 181, baseType: !555, size: 64, offset: 125952)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 64, elements: !221)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !483, file: !38, line: 182, baseType: !557, size: 14848, offset: 126016)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map", file: !38, line: 136, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_map", file: !38, line: 134, size: 14848, elements: !559)
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !558, file: !38, line: 135, baseType: !561, size: 14848)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 14848, elements: !189)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map_array", file: !38, line: 132, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chn_map_array", file: !38, line: 128, size: 1856, elements: !564)
!564 = !{!565, !578, !579}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "main_chns", scope: !563, file: !38, line: 129, baseType: !566, size: 1728)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 1728, elements: !524)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_info", file: !38, line: 121, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_info", file: !38, line: 112, size: 576, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !568, file: !38, line: 113, baseType: !294, size: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !568, file: !38, line: 114, baseType: !103, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !568, file: !38, line: 115, baseType: !294, size: 16, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !568, file: !38, line: 116, baseType: !271, size: 224, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !568, file: !38, line: 117, baseType: !423, size: 32, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !568, file: !38, line: 118, baseType: !426, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !568, file: !38, line: 119, baseType: !104, size: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_channel", scope: !568, file: !38, line: 120, baseType: !104, size: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !563, file: !38, line: 130, baseType: !90, size: 64, offset: 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "extra_chns", scope: !563, file: !38, line: 131, baseType: !580, size: 64, offset: 1792)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !483, file: !38, line: 183, baseType: !104, size: 64, offset: 140864)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_connections", scope: !483, file: !38, line: 184, baseType: !584, size: 64, offset: 140928)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !257, line: 43, baseType: !586)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !257, line: 42, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tcs", scope: !483, file: !38, line: 185, baseType: !588, size: 128, offset: 140992)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_list", file: !38, line: 103, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection_list", file: !38, line: 100, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !589, file: !38, line: 101, baseType: !90, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !589, file: !38, line: 102, baseType: !593, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection", file: !13, line: 50, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection", file: !38, line: 85, size: 960, elements: !597)
!597 = !{!598, !600, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !596, file: !38, line: 87, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "TC_STATE", file: !38, line: 76, baseType: !37)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !596, file: !38, line: 88, baseType: !601, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_id", file: !38, line: 78, baseType: !250)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !596, file: !38, line: 89, baseType: !271, size: 224, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "client_s", scope: !596, file: !38, line: 90, baseType: !240, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "peer_s", scope: !596, file: !38, line: 91, baseType: !240, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "peer_conn_timeout", scope: !596, file: !38, line: 92, baseType: !426, size: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bind_timeout", scope: !596, file: !38, line: 93, baseType: !426, size: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !596, file: !38, line: 94, baseType: !487, size: 96, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !596, file: !38, line: 95, baseType: !104, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !596, file: !38, line: 96, baseType: !103, size: 32, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ub_to_client", scope: !596, file: !38, line: 97, baseType: !611, size: 128, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "unsent_buffer", file: !38, line: 83, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 80, size: 128, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !612, file: !38, line: 81, baseType: !90, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !612, file: !38, line: 82, baseType: !616, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_allocated_timeout_ev", scope: !473, file: !474, line: 74, baseType: !426, size: 64, offset: 141376)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !473, file: !474, line: 75, baseType: !103, size: 32, offset: 141440)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "is_tcp_relay", scope: !473, file: !474, line: 76, baseType: !103, size: 32, offset: 141472)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_closed", scope: !473, file: !474, line: 77, baseType: !103, size: 32, offset: 141504)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !473, file: !474, line: 79, baseType: !622, size: 136, offset: 141536)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 136, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 17)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_expiration_time", scope: !473, file: !474, line: 80, baseType: !423, size: 32, offset: 141696)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !473, file: !474, line: 81, baseType: !627, size: 4104, offset: 141728)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 4104, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 513)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey", scope: !473, file: !474, line: 82, baseType: !631, size: 512, offset: 145832)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !488, line: 64, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 512, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey_set", scope: !473, file: !474, line: 83, baseType: !103, size: 32, offset: 146368)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !473, file: !474, line: 84, baseType: !637, size: 2056, offset: 146400)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !488, line: 66, baseType: !638)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 2056, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 257)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "quota_used", scope: !473, file: !474, line: 85, baseType: !103, size: 32, offset: 148480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !473, file: !474, line: 86, baseType: !103, size: 32, offset: 148512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "max_session_time_auth", scope: !473, file: !474, line: 87, baseType: !423, size: 32, offset: 148544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "realm_options", scope: !473, file: !474, line: 89, baseType: !645, size: 1152, offset: 148608)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !13, line: 142, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !474, line: 53, size: 1152, elements: !647)
!647 = !{!648, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !474, line: 55, baseType: !649, size: 1024)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 1024, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !646, file: !474, line: 57, baseType: !653, size: 128, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !474, line: 51, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !474, line: 45, size: 128, elements: !655)
!655 = !{!656, !659, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !654, file: !474, line: 47, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !488, line: 67, baseType: !92)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !654, file: !474, line: 48, baseType: !660, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !424, line: 105, baseType: !103)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !654, file: !474, line: 49, baseType: !660, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "origin_set", scope: !473, file: !474, line: 90, baseType: !103, size: 32, offset: 149760)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !473, file: !474, line: 91, baseType: !649, size: 1024, offset: 149792)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !473, file: !474, line: 93, baseType: !250, size: 32, offset: 150816)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !473, file: !474, line: 94, baseType: !250, size: 32, offset: 150848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !473, file: !474, line: 95, baseType: !250, size: 32, offset: 150880)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !473, file: !474, line: 96, baseType: !250, size: 32, offset: 150912)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_packets", scope: !473, file: !474, line: 97, baseType: !335, size: 64, offset: 150976)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_packets", scope: !473, file: !474, line: 98, baseType: !335, size: 64, offset: 151040)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_bytes", scope: !473, file: !474, line: 99, baseType: !335, size: 64, offset: 151104)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_bytes", scope: !473, file: !474, line: 100, baseType: !335, size: 64, offset: 151168)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !473, file: !474, line: 101, baseType: !335, size: 64, offset: 151232)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !473, file: !474, line: 102, baseType: !90, size: 64, offset: 151296)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !473, file: !474, line: 103, baseType: !90, size: 64, offset: 151360)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !473, file: !474, line: 104, baseType: !250, size: 32, offset: 151424)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !473, file: !474, line: 105, baseType: !250, size: 32, offset: 151456)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !473, file: !474, line: 106, baseType: !250, size: 32, offset: 151488)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !473, file: !474, line: 107, baseType: !250, size: 32, offset: 151520)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_packets", scope: !473, file: !474, line: 108, baseType: !250, size: 32, offset: 151552)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_packets", scope: !473, file: !474, line: 109, baseType: !250, size: 32, offset: 151584)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_bytes", scope: !473, file: !474, line: 110, baseType: !250, size: 32, offset: 151616)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_bytes", scope: !473, file: !474, line: 111, baseType: !250, size: 32, offset: 151648)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !473, file: !474, line: 112, baseType: !335, size: 64, offset: 151680)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !473, file: !474, line: 113, baseType: !90, size: 64, offset: 151744)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !473, file: !474, line: 114, baseType: !90, size: 64, offset: 151808)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !473, file: !474, line: 116, baseType: !103, size: 32, offset: 151872)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_id", scope: !473, file: !474, line: 117, baseType: !688, size: 64, offset: 151936)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "mobile_id_t", file: !474, line: 66, baseType: !335)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "old_mobile_id", scope: !473, file: !474, line: 118, baseType: !688, size: 64, offset: 152000)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "s_mobile_id", scope: !473, file: !474, line: 119, baseType: !691, size: 264, offset: 152064)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 264, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 33)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !473, file: !474, line: 121, baseType: !658, size: 64, offset: 152384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "current_df_relay_flag", scope: !243, file: !244, line: 204, baseType: !103, size: 32, offset: 1600)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_use_df", scope: !243, file: !244, line: 206, baseType: !103, size: 32, offset: 1632)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tobeclosed", scope: !243, file: !244, line: 207, baseType: !103, size: 32, offset: 1664)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "broken", scope: !243, file: !244, line: 208, baseType: !103, size: 32, offset: 1696)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "default_ttl", scope: !243, file: !244, line: 209, baseType: !103, size: 32, offset: 1728)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "current_ttl", scope: !243, file: !244, line: 210, baseType: !103, size: 32, offset: 1760)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_tos", scope: !243, file: !244, line: 211, baseType: !103, size: 32, offset: 1792)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "current_tos", scope: !243, file: !244, line: 212, baseType: !103, size: 32, offset: 1824)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !243, file: !244, line: 213, baseType: !388, size: 128, offset: 1856)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !243, file: !244, line: 214, baseType: !423, size: 32, offset: 1984)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data_traffic", scope: !243, file: !244, line: 215, baseType: !706, size: 128, offset: 2048)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "traffic_bytes", file: !244, line: 174, size: 128, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_read", scope: !706, file: !244, line: 175, baseType: !658, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_write", scope: !706, file: !244, line: 176, baseType: !658, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "control_traffic", scope: !243, file: !244, line: 216, baseType: !706, size: 128, offset: 2176)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sub_session", scope: !243, file: !244, line: 219, baseType: !594, size: 64, offset: 2304)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bev", scope: !243, file: !244, line: 221, baseType: !338, size: 64, offset: 2368)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cb", scope: !243, file: !244, line: 222, baseType: !714, size: 64, offset: 2432)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "connect_cb", file: !13, line: 135, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !103, !104}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "conn_arg", scope: !243, file: !244, line: 223, baseType: !104, size: 64, offset: 2496)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "list_ev", scope: !243, file: !244, line: 225, baseType: !720, size: 64, offset: 2560)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "evconnlistener", file: !244, line: 225, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "acb", scope: !243, file: !244, line: 226, baseType: !723, size: 64, offset: 2624)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "accept_cb", file: !13, line: 137, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !240, !104}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "acbarg", scope: !243, file: !244, line: 227, baseType: !104, size: 64, offset: 2688)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "special_session", scope: !243, file: !244, line: 229, baseType: !104, size: 64, offset: 2752)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "special_session_size", scope: !243, file: !244, line: 230, baseType: !90, size: 64, offset: 2816)
!730 = !DILocalVariable(name: "s", arg: 1, scope: !237, file: !3, line: 76, type: !240)
!731 = !DILocation(line: 76, column: 41, scope: !237)
!732 = !DILocation(line: 77, column: 18, scope: !237)
!733 = !DILocation(line: 77, column: 2, scope: !237)
!734 = !DILocation(line: 78, column: 1, scope: !237)
!735 = distinct !DISubprogram(name: "write_http_echo", scope: !3, file: !3, line: 55, type: !238, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !225)
!736 = !DILocalVariable(name: "s", arg: 1, scope: !735, file: !3, line: 55, type: !240)
!737 = !DILocation(line: 55, column: 47, scope: !735)
!738 = !DILocation(line: 57, column: 5, scope: !739)
!739 = distinct !DILexicalBlock(scope: !735, file: !3, line: 57, column: 5)
!740 = !DILocation(line: 57, column: 7, scope: !739)
!741 = !DILocation(line: 57, column: 33, scope: !739)
!742 = !DILocation(line: 57, column: 11, scope: !739)
!743 = !DILocation(line: 57, column: 5, scope: !735)
!744 = !DILocalVariable(name: "sat", scope: !745, file: !3, line: 58, type: !347)
!745 = distinct !DILexicalBlock(scope: !739, file: !3, line: 57, column: 37)
!746 = !DILocation(line: 58, column: 19, scope: !745)
!747 = !DILocation(line: 58, column: 49, scope: !745)
!748 = !DILocation(line: 58, column: 25, scope: !745)
!749 = !DILocation(line: 59, column: 7, scope: !750)
!750 = distinct !DILexicalBlock(scope: !745, file: !3, line: 59, column: 6)
!751 = !DILocation(line: 59, column: 11, scope: !750)
!752 = !DILocation(line: 59, column: 34, scope: !750)
!753 = !DILocation(line: 59, column: 38, scope: !750)
!754 = !DILocation(line: 59, column: 42, scope: !750)
!755 = !DILocation(line: 59, column: 6, scope: !745)
!756 = !DILocalVariable(name: "nbh_http", scope: !757, file: !3, line: 60, type: !342)
!757 = distinct !DILexicalBlock(scope: !750, file: !3, line: 59, column: 67)
!758 = !DILocation(line: 60, column: 30, scope: !757)
!759 = !DILocation(line: 60, column: 69, scope: !757)
!760 = !DILocation(line: 60, column: 72, scope: !757)
!761 = !DILocation(line: 60, column: 41, scope: !757)
!762 = !DILocalVariable(name: "len_http", scope: !757, file: !3, line: 61, type: !90)
!763 = !DILocation(line: 61, column: 11, scope: !757)
!764 = !DILocation(line: 61, column: 50, scope: !757)
!765 = !DILocation(line: 61, column: 22, scope: !757)
!766 = !DILocalVariable(name: "data", scope: !757, file: !3, line: 62, type: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!768 = !DILocation(line: 62, column: 13, scope: !757)
!769 = !DILocation(line: 62, column: 44, scope: !757)
!770 = !DILocation(line: 62, column: 20, scope: !757)
!771 = !DILocalVariable(name: "data_http", scope: !757, file: !3, line: 63, type: !108)
!772 = !DILocation(line: 63, column: 9, scope: !757)
!773 = !DILocalVariable(name: "content_http", scope: !757, file: !3, line: 64, type: !108)
!774 = !DILocation(line: 64, column: 9, scope: !757)
!775 = !DILocalVariable(name: "title", scope: !757, file: !3, line: 65, type: !6)
!776 = !DILocation(line: 65, column: 16, scope: !757)
!777 = !DILocation(line: 66, column: 13, scope: !757)
!778 = !DILocation(line: 66, column: 246, scope: !757)
!779 = !DILocation(line: 66, column: 252, scope: !757)
!780 = !DILocation(line: 66, column: 4, scope: !757)
!781 = !DILocation(line: 67, column: 13, scope: !757)
!782 = !DILocation(line: 67, column: 179, scope: !757)
!783 = !DILocation(line: 67, column: 172, scope: !757)
!784 = !DILocation(line: 67, column: 167, scope: !757)
!785 = !DILocation(line: 67, column: 193, scope: !757)
!786 = !DILocation(line: 67, column: 4, scope: !757)
!787 = !DILocation(line: 68, column: 22, scope: !757)
!788 = !DILocation(line: 68, column: 15, scope: !757)
!789 = !DILocation(line: 68, column: 13, scope: !757)
!790 = !DILocation(line: 69, column: 10, scope: !757)
!791 = !DILocation(line: 69, column: 20, scope: !757)
!792 = !DILocation(line: 69, column: 25, scope: !757)
!793 = !DILocation(line: 69, column: 4, scope: !757)
!794 = !DILocation(line: 70, column: 32, scope: !757)
!795 = !DILocation(line: 70, column: 41, scope: !757)
!796 = !DILocation(line: 70, column: 4, scope: !757)
!797 = !DILocation(line: 71, column: 34, scope: !757)
!798 = !DILocation(line: 71, column: 43, scope: !757)
!799 = !DILocation(line: 71, column: 4, scope: !757)
!800 = !DILocation(line: 72, column: 3, scope: !757)
!801 = !DILocation(line: 73, column: 2, scope: !745)
!802 = !DILocation(line: 74, column: 1, scope: !735)
!803 = !DILocalVariable(name: "now", scope: !2, file: !3, line: 87, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !805, line: 10, baseType: !439)
!805 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!806 = !DILocation(line: 87, column: 9, scope: !2)
!807 = !DILocation(line: 87, column: 15, scope: !2)
!808 = !DILocalVariable(name: "gmtm", scope: !2, file: !3, line: 88, type: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !811, line: 7, size: 448, elements: !812)
!811 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !810, file: !811, line: 9, baseType: !103, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !810, file: !811, line: 10, baseType: !103, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !810, file: !811, line: 11, baseType: !103, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !810, file: !811, line: 12, baseType: !103, size: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !810, file: !811, line: 13, baseType: !103, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !810, file: !811, line: 14, baseType: !103, size: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !810, file: !811, line: 15, baseType: !103, size: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !810, file: !811, line: 16, baseType: !103, size: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !810, file: !811, line: 17, baseType: !103, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !810, file: !811, line: 20, baseType: !440, size: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !810, file: !811, line: 21, baseType: !6, size: 64, offset: 384)
!824 = !DILocation(line: 88, column: 13, scope: !2)
!825 = !DILocation(line: 88, column: 20, scope: !2)
!826 = !DILocation(line: 90, column: 18, scope: !2)
!827 = !DILocation(line: 91, column: 16, scope: !2)
!828 = !DILocation(line: 92, column: 5, scope: !829)
!829 = distinct !DILexicalBlock(scope: !2, file: !3, line: 92, column: 5)
!830 = !DILocation(line: 92, column: 5, scope: !2)
!831 = !DILocation(line: 93, column: 78, scope: !832)
!832 = distinct !DILexicalBlock(scope: !829, file: !3, line: 92, column: 11)
!833 = !DILocation(line: 93, column: 84, scope: !832)
!834 = !DILocation(line: 93, column: 74, scope: !832)
!835 = !DILocation(line: 93, column: 94, scope: !832)
!836 = !DILocation(line: 93, column: 100, scope: !832)
!837 = !DILocation(line: 93, column: 114, scope: !832)
!838 = !DILocation(line: 93, column: 120, scope: !832)
!839 = !DILocation(line: 93, column: 109, scope: !832)
!840 = !DILocation(line: 93, column: 129, scope: !832)
!841 = !DILocation(line: 93, column: 135, scope: !832)
!842 = !DILocation(line: 93, column: 142, scope: !832)
!843 = !DILocation(line: 93, column: 149, scope: !832)
!844 = !DILocation(line: 93, column: 155, scope: !832)
!845 = !DILocation(line: 93, column: 164, scope: !832)
!846 = !DILocation(line: 93, column: 170, scope: !832)
!847 = !DILocation(line: 93, column: 178, scope: !832)
!848 = !DILocation(line: 93, column: 184, scope: !832)
!849 = !DILocation(line: 93, column: 3, scope: !832)
!850 = !DILocation(line: 94, column: 37, scope: !832)
!851 = !DILocation(line: 95, column: 3, scope: !832)
!852 = !DILocation(line: 96, column: 41, scope: !832)
!853 = !DILocation(line: 97, column: 2, scope: !832)
!854 = !DILocation(line: 99, column: 2, scope: !2)
!855 = distinct !DISubprogram(name: "parse_http_request", scope: !3, file: !3, line: 204, type: !856, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !225)
!856 = !DISubroutineType(types: !857)
!857 = !{!56, !62}
!858 = !DILocalVariable(name: "request", arg: 1, scope: !855, file: !3, line: 204, type: !62)
!859 = !DILocation(line: 204, column: 47, scope: !855)
!860 = !DILocalVariable(name: "ret", scope: !855, file: !3, line: 206, type: !56)
!861 = !DILocation(line: 206, column: 23, scope: !855)
!862 = !DILocation(line: 208, column: 5, scope: !863)
!863 = distinct !DILexicalBlock(scope: !855, file: !3, line: 208, column: 5)
!864 = !DILocation(line: 208, column: 5, scope: !855)
!865 = !DILocation(line: 210, column: 31, scope: !866)
!866 = distinct !DILexicalBlock(scope: !863, file: !3, line: 208, column: 14)
!867 = !DILocation(line: 210, column: 7, scope: !866)
!868 = !DILocation(line: 211, column: 9, scope: !866)
!869 = !DILocation(line: 211, column: 3, scope: !866)
!870 = !DILocation(line: 213, column: 13, scope: !871)
!871 = distinct !DILexicalBlock(scope: !866, file: !3, line: 213, column: 6)
!872 = !DILocation(line: 213, column: 6, scope: !871)
!873 = !DILocation(line: 213, column: 32, scope: !871)
!874 = !DILocation(line: 213, column: 29, scope: !871)
!875 = !DILocation(line: 213, column: 6, scope: !866)
!876 = !DILocation(line: 214, column: 4, scope: !877)
!877 = distinct !DILexicalBlock(scope: !871, file: !3, line: 213, column: 41)
!878 = !DILocation(line: 214, column: 9, scope: !877)
!879 = !DILocation(line: 214, column: 15, scope: !877)
!880 = !DILocation(line: 215, column: 31, scope: !877)
!881 = !DILocation(line: 215, column: 35, scope: !877)
!882 = !DILocation(line: 215, column: 42, scope: !877)
!883 = !DILocation(line: 215, column: 10, scope: !877)
!884 = !DILocation(line: 215, column: 8, scope: !877)
!885 = !DILocation(line: 216, column: 3, scope: !877)
!886 = !DILocation(line: 216, column: 20, scope: !887)
!887 = distinct !DILexicalBlock(scope: !871, file: !3, line: 216, column: 13)
!888 = !DILocation(line: 216, column: 13, scope: !887)
