; ModuleID = '/home/raj/coturn/src/apps/relay/libtelnet.c'
source_filename = "/home/raj/coturn/src/apps/relay/libtelnet.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.telnet_t = type { ptr, ptr, ptr, ptr, ptr, i64, i64, i32, i8, i8, i8 }
%union.telnet_event_t = type { %struct.error_t }
%struct.error_t = type { i32, ptr, ptr, ptr, i32, i32 }
%struct.data_t = type { i32, ptr, i64 }
%struct.iac_t = type { i32, i8 }
%struct.telnet_rfc1143_t = type { i8, i8 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }
%struct.negotiate_t = type { i32, i8 }
%struct.subnegotiate_t = type { i32, ptr, i64, i8 }
%struct.telnet_telopt_t = type { i16, i8, i8 }
%struct.zmp_t = type { i32, ptr, i64 }
%struct.ttype_t = type { i32, i8, ptr }
%struct.environ_t = type { i32, ptr, i64, i8 }
%struct.telnet_environ_t = type { i8, ptr, ptr }
%struct.mssp_t = type { i32, ptr, i64 }

@telnet_vprintf.CRLF = internal constant [2 x i8] c"\0D\0A", align 1, !dbg !0
@telnet_vprintf.CRNUL = internal constant [2 x i8] c"\0D\00", align 1, !dbg !179
@__func__.telnet_vprintf = private unnamed_addr constant [15 x i8] c"telnet_vprintf\00", align 1, !dbg !184
@.str = private unnamed_addr constant [20 x i8] c"malloc() failed: %s\00", align 1, !dbg !189
@__func__.telnet_raw_vprintf = private unnamed_addr constant [19 x i8] c"telnet_raw_vprintf\00", align 1, !dbg !194

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CRLF", scope: !2, file: !3, line: 1359, type: !181, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "telnet_vprintf", scope: !3, file: !3, line: 1358, type: !4, scopeLine: 1358, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !171, retainedNodes: !204)
!3 = !DIFile(filename: "src/apps/relay/libtelnet.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "7be7bbf7ad757e34f57d78a35b0e72d1")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !58, !163}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_t", file: !9, line: 65, baseType: !10)
!9 = !DIFile(filename: "src/apps/relay/libtelnet.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "f2ce4ff3537f2db009dc531f503a1443")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telnet_t", file: !3, line: 74, size: 512, elements: !11)
!11 = !{!12, !14, !25, !138, !144, !146, !147, !148, !160, !161, !162}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ud", scope: !10, file: !3, line: 76, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "telopts", scope: !10, file: !3, line: 78, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_telopt_t", file: !9, line: 71, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telnet_telopt_t", file: !9, line: 357, size: 32, elements: !19)
!19 = !{!20, !22, !24}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "telopt", scope: !18, file: !9, line: 358, baseType: !21, size: 16)
!21 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !18, file: !9, line: 359, baseType: !23, size: 8, offset: 16)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "him", scope: !18, file: !9, line: 360, baseType: !23, size: 8, offset: 24)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !10, file: !3, line: 80, baseType: !26, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_event_handler_t", file: !9, line: 351, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !7, !30, !13}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_event_t", file: !9, line: 68, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "telnet_event_t", file: !9, line: 234, size: 320, elements: !33)
!33 = !{!34, !53, !65, !83, !88, !93, !100, !107, !113, !118, !132}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !32, file: !9, line: 243, baseType: !35, size: 32)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "telnet_event_type_t", file: !9, line: 203, baseType: !36, size: 32, elements: !37)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!38 = !DIEnumerator(name: "TELNET_EV_DATA", value: 0)
!39 = !DIEnumerator(name: "TELNET_EV_SEND", value: 1)
!40 = !DIEnumerator(name: "TELNET_EV_IAC", value: 2)
!41 = !DIEnumerator(name: "TELNET_EV_WILL", value: 3)
!42 = !DIEnumerator(name: "TELNET_EV_WONT", value: 4)
!43 = !DIEnumerator(name: "TELNET_EV_DO", value: 5)
!44 = !DIEnumerator(name: "TELNET_EV_DONT", value: 6)
!45 = !DIEnumerator(name: "TELNET_EV_SUBNEGOTIATION", value: 7)
!46 = !DIEnumerator(name: "TELNET_EV_COMPRESS", value: 8)
!47 = !DIEnumerator(name: "TELNET_EV_ZMP", value: 9)
!48 = !DIEnumerator(name: "TELNET_EV_TTYPE", value: 10)
!49 = !DIEnumerator(name: "TELNET_EV_ENVIRON", value: 11)
!50 = !DIEnumerator(name: "TELNET_EV_MSSP", value: 12)
!51 = !DIEnumerator(name: "TELNET_EV_WARNING", value: 13)
!52 = !DIEnumerator(name: "TELNET_EV_ERROR", value: 14)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !32, file: !9, line: 252, baseType: !54, size: 192)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_t", file: !9, line: 248, size: 192, elements: !55)
!55 = !{!56, !57, !61}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !54, file: !9, line: 249, baseType: !35, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !54, file: !9, line: 250, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !9, line: 251, baseType: !62, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!64 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !32, file: !9, line: 264, baseType: !66, size: 320)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_t", file: !9, line: 257, size: 320, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !66, file: !9, line: 258, baseType: !35, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !66, file: !9, line: 259, baseType: !58, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !66, file: !9, line: 260, baseType: !58, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !66, file: !9, line: 261, baseType: !58, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !66, file: !9, line: 262, baseType: !6, size: 32, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "errcode", scope: !66, file: !9, line: 263, baseType: !74, size: 32, offset: 288)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_error_t", file: !9, line: 198, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "telnet_error_t", file: !9, line: 190, baseType: !36, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82}
!77 = !DIEnumerator(name: "TELNET_EOK", value: 0)
!78 = !DIEnumerator(name: "TELNET_EBADVAL", value: 1)
!79 = !DIEnumerator(name: "TELNET_ENOMEM", value: 2)
!80 = !DIEnumerator(name: "TELNET_EOVERFLOW", value: 3)
!81 = !DIEnumerator(name: "TELNET_EPROTOCOL", value: 4)
!82 = !DIEnumerator(name: "TELNET_ECOMPRESS", value: 5)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "iac", scope: !32, file: !9, line: 272, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iac_t", file: !9, line: 269, size: 64, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !84, file: !9, line: 270, baseType: !35, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !84, file: !9, line: 271, baseType: !23, size: 8, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !32, file: !9, line: 280, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "negotiate_t", file: !9, line: 277, size: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !89, file: !9, line: 278, baseType: !35, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "telopt", scope: !89, file: !9, line: 279, baseType: !23, size: 8, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !32, file: !9, line: 290, baseType: !94, size: 256)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subnegotiate_t", file: !9, line: 285, size: 256, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !94, file: !9, line: 286, baseType: !35, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !94, file: !9, line: 287, baseType: !58, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !94, file: !9, line: 288, baseType: !62, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "telopt", scope: !94, file: !9, line: 289, baseType: !23, size: 8, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "zmp", scope: !32, file: !9, line: 299, baseType: !101, size: 192)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zmp_t", file: !9, line: 295, size: 192, elements: !102)
!102 = !{!103, !104, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !101, file: !9, line: 296, baseType: !35, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !101, file: !9, line: 297, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !101, file: !9, line: 298, baseType: !62, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ttype", scope: !32, file: !9, line: 308, baseType: !108, size: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ttype_t", file: !9, line: 304, size: 128, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !108, file: !9, line: 305, baseType: !35, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !108, file: !9, line: 306, baseType: !23, size: 8, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !9, line: 307, baseType: !58, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !32, file: !9, line: 317, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "compress_t", file: !9, line: 313, size: 64, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !114, file: !9, line: 314, baseType: !35, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !114, file: !9, line: 315, baseType: !23, size: 8, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "environ", scope: !32, file: !9, line: 327, baseType: !119, size: 256)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "environ_t", file: !9, line: 322, size: 256, elements: !120)
!120 = !{!121, !122, !130, !131}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !119, file: !9, line: 323, baseType: !35, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !119, file: !9, line: 324, baseType: !123, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telnet_environ_t", file: !9, line: 225, size: 192, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !9, line: 226, baseType: !23, size: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !125, file: !9, line: 227, baseType: !58, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !125, file: !9, line: 228, baseType: !58, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !119, file: !9, line: 325, baseType: !62, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !119, file: !9, line: 326, baseType: !23, size: 8, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mssp", scope: !32, file: !9, line: 336, baseType: !133, size: 192)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mssp_t", file: !9, line: 332, size: 192, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_type", scope: !133, file: !9, line: 333, baseType: !35, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !133, file: !9, line: 334, baseType: !123, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !133, file: !9, line: 335, baseType: !62, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !10, file: !3, line: 86, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telnet_rfc1143_t", file: !3, line: 104, size: 16, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "telopt", scope: !140, file: !3, line: 105, baseType: !23, size: 8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !3, line: 106, baseType: !23, size: 8, offset: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !10, file: !3, line: 88, baseType: !145, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !10, file: !3, line: 90, baseType: !62, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pos", scope: !10, file: !3, line: 92, baseType: !62, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !10, file: !3, line: 94, baseType: !149, size: 32, offset: 448)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "telnet_state_t", file: !3, line: 60, baseType: !36, size: 32, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159}
!151 = !DIEnumerator(name: "TELNET_STATE_DATA", value: 0)
!152 = !DIEnumerator(name: "TELNET_STATE_IAC", value: 1)
!153 = !DIEnumerator(name: "TELNET_STATE_WILL", value: 2)
!154 = !DIEnumerator(name: "TELNET_STATE_WONT", value: 3)
!155 = !DIEnumerator(name: "TELNET_STATE_DO", value: 4)
!156 = !DIEnumerator(name: "TELNET_STATE_DONT", value: 5)
!157 = !DIEnumerator(name: "TELNET_STATE_SB", value: 6)
!158 = !DIEnumerator(name: "TELNET_STATE_SB_DATA", value: 7)
!159 = !DIEnumerator(name: "TELNET_STATE_SB_DATA_IAC", value: 8)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !10, file: !3, line: 96, baseType: !23, size: 8, offset: 480)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sb_telopt", scope: !10, file: !3, line: 98, baseType: !23, size: 8, offset: 488)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "q_size", scope: !10, file: !3, line: 100, baseType: !23, size: 8, offset: 496)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !165)
!165 = !{!166, !168, !169, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !164, file: !167, line: 1355, baseType: !36, size: 32)
!167 = !DIFile(filename: "src/apps/relay/libtelnet.c", directory: "/home/raj/coturn")
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !164, file: !167, line: 1355, baseType: !36, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !164, file: !167, line: 1355, baseType: !13, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !164, file: !167, line: 1355, baseType: !13, size: 64, offset: 128)
!171 = distinct !DICompileUnit(language: DW_LANG_C11, file: !172, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !173, retainedTypes: !174, globals: !178, splitDebugInlining: false, nameTableKind: None)
!172 = !DIFile(filename: "/home/raj/coturn/src/apps/relay/libtelnet.c", directory: "/home/raj/coturn/build", checksumkind: CSK_MD5, checksum: "7be7bbf7ad757e34f57d78a35b0e72d1")
!173 = !{!35, !75, !149}
!174 = !{!7, !58, !60, !62, !145, !6, !105, !36, !175, !176}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_rfc1143_t", file: !3, line: 107, baseType: !140)
!178 = !{!0, !179, !184, !189, !194, !199, !209, !217, !222, !227, !232, !237, !239, !242, !247, !252, !257, !262, !267, !272, !274, !279, !284, !289, !294, !299, !301, !306, !311, !313, !315, !317, !319, !321}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "CRNUL", scope: !2, file: !3, line: 1360, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 16, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 2)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1370, type: !186, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 120, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 15)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1371, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 20)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1435, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 152, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 19)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "SEND", scope: !201, file: !3, line: 1483, type: !205, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "telnet_ttype_send", scope: !3, file: !3, line: 1482, type: !202, scopeLine: 1482, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !171, retainedNodes: !204)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !7}
!204 = !{}
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 48, elements: !207)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!207 = !{!208}
!208 = !DISubrange(count: 6)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "IS", scope: !211, file: !3, line: 1490, type: !214, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "telnet_ttype_is", scope: !3, file: !3, line: 1489, type: !212, scopeLine: 1489, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !171, retainedNodes: !204)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !7, !58}
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 32, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 4)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1074, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 72, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 9)
