; ModuleID = '/home/raj/coturn/src/apps/relay/netengine.c'
source_filename = "/home/raj/coturn/src/apps/relay/netengine.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%struct.listener_server = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr, ptr }
%struct._ip_range_list = type { ptr, i64 }

!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_TYPE", file: !58, line: 85, baseType: !7, size: 32, elements: !59)
!58 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!60 = !DIEnumerator(name: "UNKNOWN_SOCKET", value: 0)
!61 = !DIEnumerator(name: "TCP_SOCKET", value: 6)
!62 = !DIEnumerator(name: "UDP_SOCKET", value: 17)
!63 = !DIEnumerator(name: "TLS_SOCKET", value: 56)
!64 = !DIEnumerator(name: "SCTP_SOCKET", value: 132)
!65 = !DIEnumerator(name: "TLS_SCTP_SOCKET", value: 133)
!66 = !DIEnumerator(name: "DTLS_SOCKET", value: 250)
!67 = !DIEnumerator(name: "TCP_SOCKET_PROXY", value: 253)
!68 = !DIEnumerator(name: "TENTATIVE_SCTP_SOCKET", value: 254)
!69 = !DIEnumerator(name: "TENTATIVE_TCP_SOCKET", value: 255)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_APP_TYPE", file: !58, line: 100, baseType: !7, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80}
!72 = !DIEnumerator(name: "UNKNOWN_APP_SOCKET", value: 0)
!73 = !DIEnumerator(name: "CLIENT_SOCKET", value: 1)
!74 = !DIEnumerator(name: "HTTP_CLIENT_SOCKET", value: 2)
!75 = !DIEnumerator(name: "HTTPS_CLIENT_SOCKET", value: 3)
!76 = !DIEnumerator(name: "RELAY_SOCKET", value: 4)
!77 = !DIEnumerator(name: "RELAY_RTCP_SOCKET", value: 5)
!78 = !DIEnumerator(name: "TCP_CLIENT_DATA_SOCKET", value: 6)
!79 = !DIEnumerator(name: "TCP_RELAY_DATA_SOCKET", value: 7)
!80 = !DIEnumerator(name: "LISTENER_SOCKET", value: 8)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_TC_STATE", file: !82, line: 67, baseType: !7, size: 32, elements: !83)
!82 = !DIFile(filename: "src/server/ns_turn_allocation.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0cb2cf61c9ec5dd3030a6e5a6f8d4af1")
!83 = !{!84, !85, !86, !87, !88, !89}
!84 = !DIEnumerator(name: "TC_STATE_UNKNOWN", value: 0)
!85 = !DIEnumerator(name: "TC_STATE_CLIENT_TO_PEER_CONNECTING", value: 1)
!86 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTING", value: 2)
!87 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTED", value: 3)
!88 = !DIEnumerator(name: "TC_STATE_READY", value: 4)
!89 = !DIEnumerator(name: "TC_STATE_FAILED", value: 5)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MESSAGE_TO_RELAY_TYPE", file: !40, line: 69, baseType: !7, size: 32, elements: !91)
!91 = !{!92, !93, !94, !95, !96}
!92 = !DIEnumerator(name: "RMT_UNKNOWN", value: 0)
!93 = !DIEnumerator(name: "RMT_SOCKET", value: 1)
!94 = !DIEnumerator(name: "RMT_CB_SOCKET", value: 2)
!95 = !DIEnumerator(name: "RMT_MOBILE_SOCKET", value: 3)
!96 = !DIEnumerator(name: "RMT_CANCEL_SESSION", value: 4)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bufferevent_options", file: !98, line: 157, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "/usr/include/event2/bufferevent.h", directory: "", checksumkind: CSK_MD5, checksum: "15bb43c26b2c9058b6c64d44779c7263")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "BEV_OPT_CLOSE_ON_FREE", value: 1)
!101 = !DIEnumerator(name: "BEV_OPT_THREADSAFE", value: 2)
!102 = !DIEnumerator(name: "BEV_OPT_DEFER_CALLBACKS", value: 4)
!103 = !DIEnumerator(name: "BEV_OPT_UNLOCK_CALLBACKS", value: 8)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MESSAGE_TO_LISTENER_TYPE", file: !6, line: 131, baseType: !7, size: 32, elements: !105)
!105 = !{!106, !107}
!106 = !DIEnumerator(name: "LMT_UNKNOWN", value: 0)
!107 = !DIEnumerator(name: "LMT_TO_CLIENT", value: 1)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 37, baseType: !7, size: 32, elements: !110)
!109 = !DIFile(filename: "/usr/include/pthread.h", directory: "", checksumkind: CSK_MD5, checksum: "5205981c6f80cc3dc1e81231df63d8ef")
!110 = !{!111, !112}
!111 = !DIEnumerator(name: "PTHREAD_CREATE_JOINABLE", value: 0)
!112 = !DIEnumerator(name: "PTHREAD_CREATE_DETACHED", value: 1)
!113 = !{!114, !202, !518, !522, !524, !383, !386, !230, !437, !164, !31, !525, !390, !7, !526, !219, !687, !391, !176, !392, !1027, !1032}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "update_ssl_ctx_cb_args_t", file: !116, line: 305, baseType: !117)
!116 = !DIFile(filename: "src/apps/relay/netengine.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1547e26a6cbd9138a782ea8bcf937c15")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "update_ssl_ctx_cb_args", file: !116, line: 301, size: 192, elements: !118)
!118 = !{!119, !284, !517}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !117, file: !116, line: 302, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !58, line: 120, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !58, line: 119, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !124, line: 135, size: 536064, elements: !125)
!124 = !DIFile(filename: "src/apps/relay/ns_ioalib_impl.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "39ae1828625a6763b6269ecb34869b6c")
!125 = !{!126, !131, !134, !135, !136, !141, !146, !185, !190, !191, !192, !193, !194, !195, !200, !203, !208, !212, !222, !226, !227, !228, !229, !281}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !123, file: !124, line: 137, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "super_memory_t", file: !129, line: 49, baseType: !130)
!129 = !DIFile(filename: "src/apps/relay/ns_sm.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "9025fd46a533d33a213551fd581f5b89")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_super_memory", file: !129, line: 48, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !123, file: !124, line: 138, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !98, line: 118, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate_eb", scope: !123, file: !124, line: 139, baseType: !31, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !123, file: !124, line: 140, baseType: !31, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !123, file: !124, line: 141, baseType: !137, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnipports", file: !139, line: 50, baseType: !140)
!139 = !DIFile(filename: "src/apps/relay/turn_ports.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "11983eef23ed630198ed333562550552")
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_turnipports", file: !139, line: 49, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "map_rtcp", scope: !123, file: !124, line: 142, baseType: !142, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !144, line: 46, baseType: !145)
!144 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !144, line: 45, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !123, file: !124, line: 143, baseType: !147, size: 128, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list", file: !124, line: 81, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list", file: !124, line: 78, size: 128, elements: !149)
!149 = !{!150, !184}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !148, file: !124, line: 79, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list_elem", file: !124, line: 76, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list_elem", file: !124, line: 73, size: 524288, elements: !154)
!154 = !{!155, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !124, line: 74, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !153, file: !124, line: 75, baseType: !158, size: 524224, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !159, line: 48, baseType: !160)
!159 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !159, line: 42, size: 524224, elements: !161)
!161 = !{!162, !171, !175, !179, !183}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !160, file: !159, line: 43, baseType: !163, size: 32)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 32, elements: !169)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !165, line: 24, baseType: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !167, line: 38, baseType: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !{!170}
!170 = !DISubrange(count: 4)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !160, file: !159, line: 44, baseType: !172, size: 524056, offset: 32)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 524056, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 65507)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !160, file: !159, line: 45, baseType: !176, size: 64, offset: 524096)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !177, line: 46, baseType: !178)
!177 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!178 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !160, file: !159, line: 46, baseType: !180, size: 16, offset: 524160)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !165, line: 25, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !167, line: 40, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !160, file: !159, line: 47, baseType: !164, size: 8, offset: 524176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tsz", scope: !148, file: !124, line: 80, baseType: !176, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !123, file: !124, line: 144, baseType: !186, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !188, line: 185, baseType: !189)
!188 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !188, line: 185, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !123, file: !124, line: 145, baseType: !186, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !123, file: !124, line: 147, baseType: !186, size: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !123, file: !124, line: 149, baseType: !186, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !123, file: !124, line: 153, baseType: !186, size: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !123, file: !124, line: 156, baseType: !186, size: 64, offset: 768)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !123, file: !124, line: 158, baseType: !196, size: 32, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !197, line: 108, baseType: !198)
!197 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !165, line: 26, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !167, line: 42, baseType: !7)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !123, file: !124, line: 159, baseType: !201, size: 64, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !58, line: 122, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg", scope: !123, file: !124, line: 160, baseType: !204, size: 524296, offset: 960)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 524296, elements: !206)
!205 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!206 = !{!207}
!207 = !DISubrange(count: 65537)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timer_intervals", scope: !123, file: !124, line: 161, baseType: !209, size: 448, offset: 525280)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 448, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 14)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timers", scope: !123, file: !124, line: 162, baseType: !213, size: 1792, offset: 525760)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1792, elements: !210)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !215, line: 8, size: 128, elements: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!216 = !{!217, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !214, file: !215, line: 14, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !167, line: 160, baseType: !219)
!219 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !214, file: !215, line: 15, baseType: !221, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !167, line: 162, baseType: !219)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !123, file: !124, line: 164, baseType: !223, size: 8200, offset: 527552)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 8200, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 1025)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !123, file: !124, line: 165, baseType: !31, size: 32, offset: 535776)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !123, file: !124, line: 166, baseType: !176, size: 64, offset: 535808)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_counter", scope: !123, file: !124, line: 167, baseType: !176, size: 64, offset: 535872)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !123, file: !124, line: 168, baseType: !230, size: 64, offset: 535936)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !232, line: 48, baseType: !233)
!232 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!233 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !232, line: 44, size: 224, elements: !234)
!234 = !{!235, !244, !260}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !233, file: !232, line: 45, baseType: !236, size: 128)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !237, line: 180, size: 128, elements: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!238 = !{!239, !242}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !236, file: !237, line: 182, baseType: !240, size: 16)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !241, line: 28, baseType: !182)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !236, file: !237, line: 183, baseType: !243, size: 112, offset: 16)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 112, elements: !210)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !233, file: !232, line: 46, baseType: !245, size: 128)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !246, line: 245, size: 128, elements: !247)
!246 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!247 = !{!248, !249, !251, !256}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !245, file: !246, line: 247, baseType: !240, size: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !245, file: !246, line: 248, baseType: !250, size: 16, offset: 16)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !246, line: 123, baseType: !180)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !245, file: !246, line: 249, baseType: !252, size: 32, offset: 32)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !246, line: 31, size: 32, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !252, file: !246, line: 33, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !246, line: 30, baseType: !198)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !245, file: !246, line: 252, baseType: !257, size: 64, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 8)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !233, file: !232, line: 47, baseType: !261, size: 224)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !246, line: 260, size: 224, elements: !262)
!262 = !{!263, !264, !265, !266, !280}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !261, file: !246, line: 262, baseType: !240, size: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !261, file: !246, line: 263, baseType: !250, size: 16, offset: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !261, file: !246, line: 264, baseType: !198, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !261, file: !246, line: 265, baseType: !267, size: 128, offset: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !246, line: 219, size: 128, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !267, file: !246, line: 226, baseType: !270, size: 128)
!270 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !267, file: !246, line: 221, size: 128, elements: !271)
!271 = !{!272, !276, !278}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !270, file: !246, line: 223, baseType: !273, size: 128)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !270, file: !246, line: 224, baseType: !277, size: 128)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 128, elements: !258)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !270, file: !246, line: 225, baseType: !279, size: 128)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, elements: !169)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !261, file: !246, line: 266, baseType: !198, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "rch", scope: !123, file: !124, line: 169, baseType: !282, size: 64, offset: 536000)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !283, line: 45, baseType: !202)
!283 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !117, file: !116, line: 303, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_params_t", file: !6, line: 341, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_params_", file: !6, line: 174, size: 132992, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !297, !298, !302, !303, !304, !305, !309, !310, !311, !312, !313, !314, !315, !319, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !367, !368, !369, !370, !371, !398, !419, !420, !422, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !438, !439, !440, !441, !442, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !472, !473, !475, !476, !477, !478, !479, !480, !507, !508, !509, !511, !513, !514, !515, !516}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !287, file: !6, line: 178, baseType: !186, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !287, file: !6, line: 180, baseType: !186, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !287, file: !6, line: 183, baseType: !186, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !287, file: !6, line: 185, baseType: !186, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !287, file: !6, line: 190, baseType: !186, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !287, file: !6, line: 192, baseType: !186, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dh_key_size", scope: !287, file: !6, line: 196, baseType: !296, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH_KEY_SIZE", file: !6, line: 121, baseType: !5)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !287, file: !6, line: 198, baseType: !223, size: 8200, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ec_curve_name", scope: !287, file: !6, line: 199, baseType: !299, size: 264, offset: 8616)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 264, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 33)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ca_cert_file", scope: !287, file: !6, line: 201, baseType: !223, size: 8200, offset: 8880)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "cert_file", scope: !287, file: !6, line: 202, baseType: !223, size: 8200, offset: 17080)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_file", scope: !287, file: !6, line: 203, baseType: !223, size: 8200, offset: 25280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tls_password", scope: !287, file: !6, line: 204, baseType: !306, size: 4104, offset: 33480)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 4104, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 513)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dh_file", scope: !287, file: !6, line: 205, baseType: !223, size: 8200, offset: 37584)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "no_tlsv1", scope: !287, file: !6, line: 207, baseType: !31, size: 32, offset: 45792)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "no_tlsv1_1", scope: !287, file: !6, line: 208, baseType: !31, size: 32, offset: 45824)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "no_tlsv1_2", scope: !287, file: !6, line: 209, baseType: !31, size: 32, offset: 45856)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "no_tls", scope: !287, file: !6, line: 210, baseType: !31, size: 32, offset: 45888)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "no_dtls", scope: !287, file: !6, line: 211, baseType: !31, size: 32, offset: 45920)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_update_ev", scope: !287, file: !6, line: 213, baseType: !316, size: 64, offset: 45952)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !318, line: 276, flags: DIFlagFwdDecl)
!318 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tls_mutex", scope: !287, file: !6, line: 214, baseType: !320, size: 320, offset: 46016)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !321, line: 72, baseType: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 67, size: 320, elements: !323)
!323 = !{!324, !344, !348}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !322, file: !321, line: 69, baseType: !325, size: 320)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !326, line: 22, size: 320, elements: !327)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!327 = !{!328, !329, !330, !331, !332, !333, !335, !336}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !325, file: !326, line: 24, baseType: !31, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !325, file: !326, line: 25, baseType: !7, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !325, file: !326, line: 26, baseType: !31, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !325, file: !326, line: 28, baseType: !7, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !325, file: !326, line: 32, baseType: !31, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !325, file: !326, line: 34, baseType: !334, size: 16, offset: 160)
!334 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !325, file: !326, line: 35, baseType: !334, size: 16, offset: 176)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !325, file: !326, line: 36, baseType: !337, size: 128, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !338, line: 55, baseType: !339)
!338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !338, line: 51, size: 128, elements: !340)
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !339, file: !338, line: 53, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !339, file: !338, line: 54, baseType: !342, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !322, file: !321, line: 70, baseType: !345, size: 320)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 320, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 40)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !322, file: !321, line: 71, baseType: !219, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !287, file: !6, line: 218, baseType: !31, size: 32, offset: 46336)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "turn_daemon", scope: !287, file: !6, line: 219, baseType: !31, size: 32, offset: 46368)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "no_software_attribute", scope: !287, file: !6, line: 220, baseType: !31, size: 32, offset: 46400)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "web_admin_listen_on_workers", scope: !287, file: !6, line: 221, baseType: !31, size: 32, offset: 46432)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_use_config_file", scope: !287, file: !6, line: 223, baseType: !31, size: 32, offset: 46464)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pidfile", scope: !287, file: !6, line: 225, baseType: !223, size: 8200, offset: 46496)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "acme_redirect", scope: !287, file: !6, line: 226, baseType: !223, size: 8200, offset: 54696)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "listener_port", scope: !287, file: !6, line: 230, baseType: !31, size: 32, offset: 62912)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tls_listener_port", scope: !287, file: !6, line: 231, baseType: !31, size: 32, offset: 62944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "alt_listener_port", scope: !287, file: !6, line: 232, baseType: !31, size: 32, offset: 62976)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "alt_tls_listener_port", scope: !287, file: !6, line: 233, baseType: !31, size: 32, offset: 63008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_proxy_port", scope: !287, file: !6, line: 234, baseType: !31, size: 32, offset: 63040)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rfc5780", scope: !287, file: !6, line: 235, baseType: !31, size: 32, offset: 63072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "no_udp", scope: !287, file: !6, line: 237, baseType: !31, size: 32, offset: 63104)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "no_tcp", scope: !287, file: !6, line: 238, baseType: !31, size: 32, offset: 63136)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_use_proxy", scope: !287, file: !6, line: 239, baseType: !31, size: 32, offset: 63168)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "no_tcp_relay", scope: !287, file: !6, line: 241, baseType: !366, size: 32, offset: 63200)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !197, line: 105, baseType: !31)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "no_udp_relay", scope: !287, file: !6, line: 242, baseType: !366, size: 32, offset: 63232)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "listener_ifname", scope: !287, file: !6, line: 244, baseType: !223, size: 8200, offset: 63264)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "redis_statsdb", scope: !287, file: !6, line: 246, baseType: !223, size: 8200, offset: 71464)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "use_redis_statsdb", scope: !287, file: !6, line: 247, baseType: !31, size: 32, offset: 79680)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !287, file: !6, line: 249, baseType: !372, size: 832, offset: 79744)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "listener_server", file: !6, line: 144, size: 832, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !381, !382, !385, !387, !388, !389, !396, !397}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rtcpmap", scope: !372, file: !6, line: 145, baseType: !142, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !372, file: !6, line: 146, baseType: !137, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !372, file: !6, line: 147, baseType: !132, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ioa_eng", scope: !372, file: !6, line: 148, baseType: !120, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !372, file: !6, line: 149, baseType: !379, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferevent", file: !98, line: 113, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !372, file: !6, line: 150, baseType: !379, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !372, file: !6, line: 151, baseType: !383, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "encaddrs", scope: !372, file: !6, line: 152, baseType: !386, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "addrs_number", scope: !372, file: !6, line: 153, baseType: !176, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "services_number", scope: !372, file: !6, line: 154, baseType: !176, size: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "udp_services", scope: !372, file: !6, line: 155, baseType: !390, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "dtls_listener_relay_server_type", file: !394, line: 49, baseType: !395)
!394 = !DIFile(filename: "src/apps/relay/dtls_listener.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0781c076e4412130d98f5f3bddf10861")
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "dtls_listener_relay_server_info", file: !394, line: 48, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_services", scope: !372, file: !6, line: 156, baseType: !390, size: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "aux_udp_services", scope: !372, file: !6, line: 157, baseType: !390, size: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ip_whitelist", scope: !287, file: !6, line: 251, baseType: !399, size: 128, offset: 80576)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !58, line: 159, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !58, line: 154, size: 128, elements: !401)
!401 = !{!402, !418}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !400, file: !58, line: 155, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !58, line: 152, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !58, line: 146, size: 6624, elements: !406)
!406 = !{!407, !411, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !405, file: !58, line: 147, baseType: !408, size: 2056)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 2056, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 257)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !405, file: !58, line: 148, baseType: !306, size: 4104, offset: 2056)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !405, file: !58, line: 149, baseType: !413, size: 448, offset: 6176)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !232, line: 53, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 50, size: 448, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !414, file: !232, line: 51, baseType: !231, size: 224)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !414, file: !232, line: 52, baseType: !231, size: 224, offset: 224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !400, file: !58, line: 156, baseType: !176, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ip_blacklist", scope: !287, file: !6, line: 252, baseType: !399, size: 128, offset: 80704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "net_engine_version", scope: !287, file: !6, line: 254, baseType: !421, size: 32, offset: 80832)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_ENG_VERSION", file: !6, line: 170, baseType: !13)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "net_engine_version_txt", scope: !287, file: !6, line: 255, baseType: !423, size: 256, offset: 80896)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 256, elements: !169)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "min_port", scope: !287, file: !6, line: 259, baseType: !180, size: 16, offset: 81152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "max_port", scope: !287, file: !6, line: 260, baseType: !180, size: 16, offset: 81168)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "check_origin", scope: !287, file: !6, line: 262, baseType: !366, size: 32, offset: 81184)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "no_multicast_peers", scope: !287, file: !6, line: 264, baseType: !366, size: 32, offset: 81216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "allow_loopback_peers", scope: !287, file: !6, line: 265, baseType: !366, size: 32, offset: 81248)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !287, file: !6, line: 267, baseType: !223, size: 8200, offset: 81280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !287, file: !6, line: 269, baseType: !176, size: 64, offset: 89536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !287, file: !6, line: 270, baseType: !383, size: 64, offset: 89600)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !287, file: !6, line: 271, baseType: !31, size: 32, offset: 89664)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip", scope: !287, file: !6, line: 276, baseType: !230, size: 64, offset: 89728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "general_relay_servers_number", scope: !287, file: !6, line: 278, baseType: !437, size: 8, offset: 89792)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnserver_id", file: !40, line: 67, baseType: !164)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "udp_relay_servers_number", scope: !287, file: !6, line: 279, baseType: !437, size: 8, offset: 89800)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "oauth_server_name", scope: !287, file: !6, line: 283, baseType: !223, size: 8200, offset: 89808)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !287, file: !6, line: 284, baseType: !223, size: 8200, offset: 98008)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !287, file: !6, line: 285, baseType: !31, size: 32, offset: 106208)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "aux_servers_list", scope: !287, file: !6, line: 289, baseType: !443, size: 256, offset: 106240)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_server_addrs_list_t", file: !40, line: 53, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_server_addrs_list", file: !40, line: 47, size: 256, elements: !445)
!445 = !{!446, !447, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !444, file: !40, line: 48, baseType: !230, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !444, file: !40, line: 49, baseType: !448, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !176)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !444, file: !40, line: 50, baseType: !450, size: 128, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_mutex", file: !58, line: 60, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_mutex", file: !58, line: 55, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !451, file: !58, line: 56, baseType: !198, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !451, file: !58, line: 57, baseType: !202, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "udp_self_balance", scope: !287, file: !6, line: 290, baseType: !31, size: 32, offset: 106496)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_servers_list", scope: !287, file: !6, line: 294, baseType: !443, size: 256, offset: 106560)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tls_alternate_servers_list", scope: !287, file: !6, line: 295, baseType: !443, size: 256, offset: 106816)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "stop_turn_server", scope: !287, file: !6, line: 297, baseType: !31, size: 32, offset: 107072)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "stun_only", scope: !287, file: !6, line: 301, baseType: !366, size: 32, offset: 107104)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "no_stun", scope: !287, file: !6, line: 302, baseType: !366, size: 32, offset: 107136)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "secure_stun", scope: !287, file: !6, line: 303, baseType: !366, size: 32, offset: 107168)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "server_relay", scope: !287, file: !6, line: 304, baseType: !31, size: 32, offset: 107200)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !287, file: !6, line: 305, baseType: !31, size: 32, offset: 107232)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rest_api_separator", scope: !287, file: !6, line: 306, baseType: !205, size: 8, offset: 107264)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "stale_nonce", scope: !287, file: !6, line: 307, baseType: !366, size: 32, offset: 107296)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_allocate_lifetime", scope: !287, file: !6, line: 308, baseType: !366, size: 32, offset: 107328)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "channel_lifetime", scope: !287, file: !6, line: 309, baseType: !366, size: 32, offset: 107360)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "permission_lifetime", scope: !287, file: !6, line: 310, baseType: !366, size: 32, offset: 107392)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mobility", scope: !287, file: !6, line: 311, baseType: !366, size: 32, offset: 107424)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !287, file: !6, line: 312, baseType: !471, size: 32, offset: 107456)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_credential_type", file: !23, line: 59, baseType: !22)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "use_auth_secret_with_timestamp", scope: !287, file: !6, line: 313, baseType: !31, size: 32, offset: 107488)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !287, file: !6, line: 314, baseType: !474, size: 64, offset: 107520)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !23, line: 67, baseType: !178)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bps_capacity", scope: !287, file: !6, line: 315, baseType: !474, size: 64, offset: 107584)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bps_capacity_allocated", scope: !287, file: !6, line: 316, baseType: !474, size: 64, offset: 107648)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !287, file: !6, line: 317, baseType: !366, size: 32, offset: 107712)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !287, file: !6, line: 318, baseType: !366, size: 32, offset: 107744)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prometheus", scope: !287, file: !6, line: 320, baseType: !31, size: 32, offset: 107776)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "default_users_db", scope: !287, file: !6, line: 326, baseType: !481, size: 8512, offset: 107840)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "default_users_db_t", file: !30, line: 167, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_default_users_db_t", file: !30, line: 159, size: 8512, elements: !483)
!483 = !{!484, !486, !491}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "userdb_type", scope: !482, file: !30, line: 161, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "TURN_USERDB_TYPE", file: !30, line: 117, baseType: !29)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_users_db", scope: !482, file: !30, line: 163, baseType: !487, size: 8200, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "persistent_users_db_t", file: !30, line: 157, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_persistent_users_db_t", file: !30, line: 155, size: 8200, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "userdb", scope: !488, file: !30, line: 156, baseType: !223, size: 8200)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ram_db", scope: !482, file: !30, line: 165, baseType: !492, size: 256, offset: 8256)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "ram_users_db_t", file: !30, line: 153, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ram_users_db_t", file: !30, line: 149, size: 256, elements: !494)
!494 = !{!495, !496, !501}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "users_number", scope: !493, file: !30, line: 150, baseType: !176, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "static_accounts", scope: !493, file: !30, line: 151, baseType: !497, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map", file: !499, line: 227, baseType: !500)
!499 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_string_map", file: !499, line: 226, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "static_auth_secrets", scope: !493, file: !30, line: 152, baseType: !502, size: 128, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "secrets_list_t", file: !30, line: 143, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_secrets_list", file: !30, line: 139, size: 128, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "secrets", scope: !503, file: !30, line: 140, baseType: !383, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !503, file: !30, line: 141, baseType: !176, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !287, file: !6, line: 330, baseType: !178, size: 64, offset: 116352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "secret_key_file", scope: !287, file: !6, line: 333, baseType: !223, size: 8200, offset: 116416)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "secret_key", scope: !287, file: !6, line: 334, baseType: !510, size: 8200, offset: 124616)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 8200, elements: !224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "allocation_default_address_family", scope: !287, file: !6, line: 335, baseType: !512, size: 32, offset: 132832)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !40, line: 84, baseType: !39)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "no_auth_pings", scope: !287, file: !6, line: 336, baseType: !31, size: 32, offset: 132864)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "no_dynamic_ip_list", scope: !287, file: !6, line: 337, baseType: !31, size: 32, offset: 132896)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "no_dynamic_realms", scope: !287, file: !6, line: 338, baseType: !31, size: 32, offset: 132928)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "log_binding", scope: !287, file: !6, line: 340, baseType: !366, size: 32, offset: 132960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !116, line: 304, baseType: !316, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "event_callback_fn", file: !318, line: 1014, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !31, !334, !202}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "authserver_id", file: !116, line: 42, baseType: !168)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "relay_server", file: !124, line: 101, size: 4032, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !1025}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !527, file: !124, line: 102, baseType: !437, size: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !527, file: !124, line: 103, baseType: !127, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !527, file: !124, line: 104, baseType: !132, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !527, file: !124, line: 105, baseType: !379, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !527, file: !124, line: 106, baseType: !379, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "auth_in_buf", scope: !527, file: !124, line: 107, baseType: !379, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "auth_out_buf", scope: !527, file: !124, line: 108, baseType: !379, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ioa_eng", scope: !527, file: !124, line: 109, baseType: !120, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !527, file: !124, line: 110, baseType: !538, size: 3456, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_turnserver", file: !40, line: 99, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_turnserver", file: !40, line: 111, size: 3456, elements: !540)
!540 = !{!541, !542, !547, !551, !552, !553, !554, !555, !556, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !574, !580, !582, !905, !916, !921, !926, !927, !928, !929, !930, !987, !992, !993, !994, !995, !1002, !1004, !1005, !1006, !1007, !1008, !1009, !1011, !1012, !1013, !1014, !1015, !1020, !1021, !1022, !1023, !1024}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !539, file: !40, line: 113, baseType: !437, size: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_counter", scope: !539, file: !40, line: 115, baseType: !543, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnsession_id", file: !544, line: 62, baseType: !545)
!544 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !165, line: 27, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !167, line: 45, baseType: !178)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sessions_map", scope: !539, file: !40, line: 116, baseType: !548, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !499, line: 43, baseType: !550)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !499, line: 42, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !539, file: !40, line: 118, baseType: !196, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !539, file: !40, line: 120, baseType: !120, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !539, file: !40, line: 121, baseType: !31, size: 32, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !539, file: !40, line: 122, baseType: !31, size: 32, offset: 352)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rfc5780", scope: !539, file: !40, line: 123, baseType: !31, size: 32, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "check_origin", scope: !539, file: !40, line: 124, baseType: !557, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "vintp", file: !197, line: 106, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "stale_nonce", scope: !539, file: !40, line: 125, baseType: !557, size: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "max_allocate_lifetime", scope: !539, file: !40, line: 126, baseType: !557, size: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "channel_lifetime", scope: !539, file: !40, line: 127, baseType: !557, size: 64, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "permission_lifetime", scope: !539, file: !40, line: 128, baseType: !557, size: 64, offset: 704)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "stun_only", scope: !539, file: !40, line: 129, baseType: !557, size: 64, offset: 768)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "no_stun", scope: !539, file: !40, line: 130, baseType: !557, size: 64, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "no_software_attribute", scope: !539, file: !40, line: 131, baseType: !557, size: 64, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "web_admin_listen_on_workers", scope: !539, file: !40, line: 132, baseType: !557, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "secure_stun", scope: !539, file: !40, line: 133, baseType: !557, size: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !539, file: !40, line: 134, baseType: !471, size: 32, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "alt_addr_cb", scope: !539, file: !40, line: 135, baseType: !570, size: 64, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_alt_addr_cb", file: !40, line: 59, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!31, !230, !230}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sm_cb", scope: !539, file: !40, line: 136, baseType: !575, size: 64, offset: 1216)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_message_cb", file: !40, line: 60, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!31, !120, !579, !230, !230}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !58, line: 124, baseType: !202)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dont_fragment", scope: !539, file: !40, line: 137, baseType: !581, size: 32, offset: 1280)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "dont_fragment_option_t", file: !40, line: 96, baseType: !52)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !539, file: !40, line: 138, baseType: !583, size: 64, offset: 1344)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!31, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "ts_ur_super_session", file: !58, line: 47, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts_ur_super_session", file: !544, line: 68, size: 152448, elements: !589)
!589 = !{!590, !591, !592, !593, !729, !836, !837, !838, !839, !840, !844, !845, !847, !852, !853, !856, !857, !858, !859, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !902, !903, !904}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !588, file: !544, line: 69, baseType: !202, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !588, file: !544, line: 70, baseType: !543, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !588, file: !544, line: 71, baseType: !196, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "client_socket", scope: !588, file: !544, line: 72, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !58, line: 116, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !58, line: 115, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !124, line: 179, size: 2880, elements: !598)
!598 = !{!599, !600, !602, !603, !627, !628, !629, !630, !632, !634, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !678, !679, !710, !711, !716, !717, !721, !726, !727, !728}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !597, file: !124, line: 181, baseType: !31, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "parent_s", scope: !597, file: !124, line: 182, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !597, file: !124, line: 183, baseType: !198, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sockets_container", scope: !597, file: !124, line: 184, baseType: !604, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map", file: !499, line: 183, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_addr_map", file: !499, line: 177, size: 1441856, elements: !607)
!607 = !{!608, !626}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !606, file: !499, line: 178, baseType: !609, size: 1441792)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 1441792, elements: !624)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_list_header", file: !499, line: 175, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_list_header", file: !499, line: 171, size: 1408, elements: !612)
!612 = !{!613, !621, !623}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "main_list", scope: !611, file: !499, line: 172, baseType: !614, size: 1280)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 1280, elements: !169)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_elem", file: !499, line: 169, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_elem", file: !499, line: 166, size: 320, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !616, file: !499, line: 167, baseType: !231, size: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !616, file: !499, line: 168, baseType: !620, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map_value_type", file: !499, line: 161, baseType: !178)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "extra_list", scope: !611, file: !499, line: 173, baseType: !622, size: 64, offset: 1280)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !611, file: !499, line: 174, baseType: !176, size: 64, offset: 1344)
!624 = !{!625}
!625 = !DISubrange(count: 1024)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !606, file: !499, line: 179, baseType: !545, size: 64, offset: 1441792)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !597, file: !124, line: 185, baseType: !379, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "defer_nbh", scope: !597, file: !124, line: 186, baseType: !579, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !597, file: !124, line: 187, baseType: !31, size: 32, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !597, file: !124, line: 188, baseType: !631, size: 32, offset: 416)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_TYPE", file: !58, line: 98, baseType: !57)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !597, file: !124, line: 189, baseType: !633, size: 32, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_APP_TYPE", file: !58, line: 112, baseType: !70)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !597, file: !124, line: 190, baseType: !635, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !188, line: 184, baseType: !637)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !188, line: 184, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegs", scope: !597, file: !124, line: 191, baseType: !198, size: 32, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "in_write", scope: !597, file: !124, line: 192, baseType: !31, size: 32, offset: 608)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !597, file: !124, line: 193, baseType: !31, size: 32, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_known", scope: !597, file: !124, line: 194, baseType: !31, size: 32, offset: 672)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !597, file: !124, line: 195, baseType: !231, size: 224, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !597, file: !124, line: 196, baseType: !31, size: 32, offset: 928)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !597, file: !124, line: 197, baseType: !231, size: 224, offset: 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !597, file: !124, line: 198, baseType: !120, size: 64, offset: 1216)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "read_event", scope: !597, file: !124, line: 199, baseType: !316, size: 64, offset: 1280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !597, file: !124, line: 200, baseType: !648, size: 64, offset: 1344)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_event_handler", file: !58, line: 199, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !594, !31, !652, !202, !31}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_data", file: !58, line: 132, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_net_data", file: !58, line: 127, size: 384, elements: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !654, file: !58, line: 128, baseType: !231, size: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nbh", scope: !654, file: !58, line: 129, baseType: !579, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "recv_ttl", scope: !654, file: !58, line: 130, baseType: !31, size: 32, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "recv_tos", scope: !654, file: !58, line: 131, baseType: !31, size: 32, offset: 352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "read_ctx", scope: !597, file: !124, line: 201, baseType: !202, size: 64, offset: 1408)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !597, file: !124, line: 202, baseType: !31, size: 32, offset: 1472)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !597, file: !124, line: 203, baseType: !586, size: 64, offset: 1536)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "current_df_relay_flag", scope: !597, file: !124, line: 204, baseType: !31, size: 32, offset: 1600)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_use_df", scope: !597, file: !124, line: 206, baseType: !31, size: 32, offset: 1632)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tobeclosed", scope: !597, file: !124, line: 207, baseType: !31, size: 32, offset: 1664)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "broken", scope: !597, file: !124, line: 208, baseType: !31, size: 32, offset: 1696)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "default_ttl", scope: !597, file: !124, line: 209, baseType: !31, size: 32, offset: 1728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "current_ttl", scope: !597, file: !124, line: 210, baseType: !31, size: 32, offset: 1760)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "default_tos", scope: !597, file: !124, line: 211, baseType: !31, size: 32, offset: 1792)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "current_tos", scope: !597, file: !124, line: 212, baseType: !31, size: 32, offset: 1824)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !597, file: !124, line: 213, baseType: !147, size: 128, offset: 1856)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !597, file: !124, line: 214, baseType: !196, size: 32, offset: 1984)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "data_traffic", scope: !597, file: !124, line: 215, baseType: !674, size: 128, offset: 2048)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "traffic_bytes", file: !124, line: 174, size: 128, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_read", scope: !674, file: !124, line: 175, baseType: !474, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_write", scope: !674, file: !124, line: 176, baseType: !474, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "control_traffic", scope: !597, file: !124, line: 216, baseType: !674, size: 128, offset: 2176)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sub_session", scope: !597, file: !124, line: 219, baseType: !680, size: 64, offset: 2304)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection", file: !58, line: 50, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection", file: !82, line: 85, size: 960, elements: !683)
!683 = !{!684, !686, !688, !689, !690, !691, !692, !693, !701, !702, !703}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !682, file: !82, line: 87, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "TC_STATE", file: !82, line: 76, baseType: !81)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !682, file: !82, line: 88, baseType: !687, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_id", file: !82, line: 78, baseType: !198)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !682, file: !82, line: 89, baseType: !231, size: 224, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "client_s", scope: !682, file: !82, line: 90, baseType: !594, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "peer_s", scope: !682, file: !82, line: 91, baseType: !594, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "peer_conn_timeout", scope: !682, file: !82, line: 92, baseType: !201, size: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bind_timeout", scope: !682, file: !82, line: 93, baseType: !201, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !682, file: !82, line: 94, baseType: !694, size: 96, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !23, line: 52, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 47, size: 96, elements: !696)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !695, file: !23, line: 51, baseType: !698, size: 96)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 96, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 12)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !682, file: !82, line: 95, baseType: !202, size: 64, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !682, file: !82, line: 96, baseType: !31, size: 32, offset: 768)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ub_to_client", scope: !682, file: !82, line: 97, baseType: !704, size: 128, offset: 832)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "unsent_buffer", file: !82, line: 83, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 80, size: 128, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !705, file: !82, line: 81, baseType: !176, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !705, file: !82, line: 82, baseType: !709, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bev", scope: !597, file: !124, line: 221, baseType: !379, size: 64, offset: 2368)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cb", scope: !597, file: !124, line: 222, baseType: !712, size: 64, offset: 2432)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "connect_cb", file: !58, line: 135, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !31, !202}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "conn_arg", scope: !597, file: !124, line: 223, baseType: !202, size: 64, offset: 2496)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "list_ev", scope: !597, file: !124, line: 225, baseType: !718, size: 64, offset: 2560)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "evconnlistener", file: !720, line: 69, flags: DIFlagFwdDecl)
!720 = !DIFile(filename: "src/apps/relay/turn_admin_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "72080e29702b34b58984e3ea957f1f4c")
!721 = !DIDerivedType(tag: DW_TAG_member, name: "acb", scope: !597, file: !124, line: 226, baseType: !722, size: 64, offset: 2624)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "accept_cb", file: !58, line: 137, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !594, !202}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "acbarg", scope: !597, file: !124, line: 227, baseType: !202, size: 64, offset: 2688)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "special_session", scope: !597, file: !124, line: 229, baseType: !202, size: 64, offset: 2752)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "special_session_size", scope: !597, file: !124, line: 230, baseType: !176, size: 64, offset: 2816)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !588, file: !544, line: 73, baseType: !730, size: 141120, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation", file: !82, line: 186, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_allocation", file: !82, line: 176, size: 141120, elements: !732)
!732 = !{!733, !734, !735, !789, !799, !801, !827, !828, !829}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !731, file: !82, line: 177, baseType: !31, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !731, file: !82, line: 178, baseType: !694, size: 96, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "addr_to_perm", scope: !731, file: !82, line: 179, baseType: !736, size: 125440, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_hashtable", file: !82, line: 166, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_hashtable", file: !82, line: 164, size: 125440, elements: !738)
!738 = !{!739}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !737, file: !82, line: 165, baseType: !740, size: 125440)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 125440, elements: !258)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_array", file: !82, line: 162, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_array", file: !82, line: 158, size: 15680, elements: !743)
!743 = !{!744, !785, !786}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "main_slots", scope: !742, file: !82, line: 159, baseType: !745, size: 15552)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 15552, elements: !766)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_slot", file: !82, line: 156, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_slot", file: !82, line: 154, size: 5184, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !747, file: !82, line: 155, baseType: !750, size: 5184)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_info", file: !82, line: 152, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_info", file: !82, line: 143, size: 5184, elements: !752)
!752 = !{!753, !754, !778, !779, !780, !781, !782, !783}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !751, file: !82, line: 144, baseType: !31, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !751, file: !82, line: 145, baseType: !755, size: 4608, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map", file: !499, line: 117, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map", file: !499, line: 115, size: 4608, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !756, file: !499, line: 116, baseType: !759, size: 4608)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 4608, elements: !258)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map_array", file: !499, line: 113, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map_array", file: !499, line: 107, size: 576, elements: !762)
!762 = !{!763, !768, !771, !772, !775}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "main_keys", scope: !761, file: !499, line: 108, baseType: !764, size: 192)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 192, elements: !766)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !499, line: 47, baseType: !545)
!766 = !{!767}
!767 = !DISubrange(count: 3)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "main_values", scope: !761, file: !499, line: 109, baseType: !769, size: 192, offset: 192)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 192, elements: !766)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !499, line: 48, baseType: !178)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !761, file: !499, line: 110, baseType: !176, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "extra_keys", scope: !761, file: !499, line: 111, baseType: !773, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !761, file: !499, line: 112, baseType: !776, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !751, file: !82, line: 146, baseType: !231, size: 224, offset: 4672)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !751, file: !82, line: 147, baseType: !196, size: 32, offset: 4896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !751, file: !82, line: 148, baseType: !201, size: 64, offset: 4928)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !751, file: !82, line: 149, baseType: !202, size: 64, offset: 4992)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !751, file: !82, line: 150, baseType: !31, size: 32, offset: 5056)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !751, file: !82, line: 151, baseType: !784, size: 64, offset: 5120)
!784 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !742, file: !82, line: 160, baseType: !176, size: 64, offset: 15552)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slots", scope: !742, file: !82, line: 161, baseType: !787, size: 64, offset: 15616)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions", scope: !731, file: !82, line: 180, baseType: !790, size: 384, offset: 125568)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 384, elements: !797)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "relay_endpoint_session", file: !82, line: 55, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 50, size: 192, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !792, file: !82, line: 52, baseType: !594, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !792, file: !82, line: 53, baseType: !196, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !792, file: !82, line: 54, baseType: !201, size: 64, offset: 128)
!797 = !{!798}
!798 = !DISubrange(count: 2)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions_failure", scope: !731, file: !82, line: 181, baseType: !800, size: 64, offset: 125952)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !797)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !731, file: !82, line: 182, baseType: !802, size: 14848, offset: 126016)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map", file: !82, line: 136, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_map", file: !82, line: 134, size: 14848, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !803, file: !82, line: 135, baseType: !806, size: 14848)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 14848, elements: !258)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map_array", file: !82, line: 132, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chn_map_array", file: !82, line: 128, size: 1856, elements: !809)
!809 = !{!810, !823, !824}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "main_chns", scope: !808, file: !82, line: 129, baseType: !811, size: 1728)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 1728, elements: !766)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_info", file: !82, line: 121, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_info", file: !82, line: 112, size: 576, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !813, file: !82, line: 113, baseType: !180, size: 16)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !813, file: !82, line: 114, baseType: !31, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !813, file: !82, line: 115, baseType: !180, size: 16, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !813, file: !82, line: 116, baseType: !231, size: 224, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !813, file: !82, line: 117, baseType: !196, size: 32, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !813, file: !82, line: 118, baseType: !201, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !813, file: !82, line: 119, baseType: !202, size: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_channel", scope: !813, file: !82, line: 120, baseType: !202, size: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !808, file: !82, line: 130, baseType: !176, size: 64, offset: 1728)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "extra_chns", scope: !808, file: !82, line: 131, baseType: !825, size: 64, offset: 1792)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !731, file: !82, line: 183, baseType: !202, size: 64, offset: 140864)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_connections", scope: !731, file: !82, line: 184, baseType: !548, size: 64, offset: 140928)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tcs", scope: !731, file: !82, line: 185, baseType: !830, size: 128, offset: 140992)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_list", file: !82, line: 103, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection_list", file: !82, line: 100, size: 128, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !831, file: !82, line: 101, baseType: !176, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !831, file: !82, line: 102, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_allocated_timeout_ev", scope: !588, file: !544, line: 74, baseType: !201, size: 64, offset: 141376)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !588, file: !544, line: 75, baseType: !31, size: 32, offset: 141440)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "is_tcp_relay", scope: !588, file: !544, line: 76, baseType: !31, size: 32, offset: 141472)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_closed", scope: !588, file: !544, line: 77, baseType: !31, size: 32, offset: 141504)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !588, file: !544, line: 79, baseType: !841, size: 136, offset: 141536)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 136, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 17)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_expiration_time", scope: !588, file: !544, line: 80, baseType: !196, size: 32, offset: 141696)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !588, file: !544, line: 81, baseType: !846, size: 4104, offset: 141728)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 4104, elements: !307)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey", scope: !588, file: !544, line: 82, baseType: !848, size: 512, offset: 145832)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !23, line: 64, baseType: !849)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 512, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey_set", scope: !588, file: !544, line: 83, baseType: !31, size: 32, offset: 146368)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !588, file: !544, line: 84, baseType: !854, size: 2056, offset: 146400)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !23, line: 66, baseType: !855)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 2056, elements: !409)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "quota_used", scope: !588, file: !544, line: 85, baseType: !31, size: 32, offset: 148480)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !588, file: !544, line: 86, baseType: !31, size: 32, offset: 148512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "max_session_time_auth", scope: !588, file: !544, line: 87, baseType: !196, size: 32, offset: 148544)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "realm_options", scope: !588, file: !544, line: 89, baseType: !860, size: 1152, offset: 148608)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !58, line: 142, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !544, line: 53, size: 1152, elements: !862)
!862 = !{!863, !867}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !861, file: !544, line: 55, baseType: !864, size: 1024)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 1024, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !861, file: !544, line: 57, baseType: !868, size: 128, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !544, line: 51, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !544, line: 45, size: 128, elements: !870)
!870 = !{!871, !873, !874}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !869, file: !544, line: 47, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !869, file: !544, line: 48, baseType: !366, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !869, file: !544, line: 49, baseType: !366, size: 32, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "origin_set", scope: !588, file: !544, line: 90, baseType: !31, size: 32, offset: 149760)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !588, file: !544, line: 91, baseType: !864, size: 1024, offset: 149792)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !588, file: !544, line: 93, baseType: !198, size: 32, offset: 150816)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !588, file: !544, line: 94, baseType: !198, size: 32, offset: 150848)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !588, file: !544, line: 95, baseType: !198, size: 32, offset: 150880)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !588, file: !544, line: 96, baseType: !198, size: 32, offset: 150912)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_packets", scope: !588, file: !544, line: 97, baseType: !545, size: 64, offset: 150976)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_packets", scope: !588, file: !544, line: 98, baseType: !545, size: 64, offset: 151040)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_bytes", scope: !588, file: !544, line: 99, baseType: !545, size: 64, offset: 151104)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_bytes", scope: !588, file: !544, line: 100, baseType: !545, size: 64, offset: 151168)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !588, file: !544, line: 101, baseType: !545, size: 64, offset: 151232)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !588, file: !544, line: 102, baseType: !176, size: 64, offset: 151296)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !588, file: !544, line: 103, baseType: !176, size: 64, offset: 151360)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !588, file: !544, line: 104, baseType: !198, size: 32, offset: 151424)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !588, file: !544, line: 105, baseType: !198, size: 32, offset: 151456)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !588, file: !544, line: 106, baseType: !198, size: 32, offset: 151488)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !588, file: !544, line: 107, baseType: !198, size: 32, offset: 151520)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_packets", scope: !588, file: !544, line: 108, baseType: !198, size: 32, offset: 151552)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_packets", scope: !588, file: !544, line: 109, baseType: !198, size: 32, offset: 151584)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_bytes", scope: !588, file: !544, line: 110, baseType: !198, size: 32, offset: 151616)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_bytes", scope: !588, file: !544, line: 111, baseType: !198, size: 32, offset: 151648)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !588, file: !544, line: 112, baseType: !545, size: 64, offset: 151680)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !588, file: !544, line: 113, baseType: !176, size: 64, offset: 151744)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !588, file: !544, line: 114, baseType: !176, size: 64, offset: 151808)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !588, file: !544, line: 116, baseType: !31, size: 32, offset: 151872)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_id", scope: !588, file: !544, line: 117, baseType: !901, size: 64, offset: 151936)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "mobile_id_t", file: !544, line: 66, baseType: !545)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "old_mobile_id", scope: !588, file: !544, line: 118, baseType: !901, size: 64, offset: 152000)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "s_mobile_id", scope: !588, file: !544, line: 119, baseType: !299, size: 264, offset: 152064)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !588, file: !544, line: 121, baseType: !474, size: 64, offset: 152384)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "userkeycb", scope: !539, file: !40, line: 139, baseType: !906, size: 64, offset: 1408)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_user_key_cb", file: !40, line: 102, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!524, !437, !471, !31, !910, !524, !524, !911, !652, !545, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_username_resume_cb", file: !40, line: 101, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !31, !31, !31, !524, !524, !915, !545, !652, !524}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "chquotacb", scope: !539, file: !40, line: 140, baseType: !917, size: 64, offset: 1472)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "check_new_allocation_quota_cb", file: !40, line: 103, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!31, !524, !31, !524}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "raqcb", scope: !539, file: !40, line: 141, baseType: !922, size: 64, offset: 1536)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "release_allocation_quota_cb", file: !40, line: 104, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !524, !31, !524}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip_set", scope: !539, file: !40, line: 142, baseType: !31, size: 32, offset: 1600)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip", scope: !539, file: !40, line: 143, baseType: !231, size: 224, offset: 1632)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "allow_loopback_peers", scope: !539, file: !40, line: 144, baseType: !557, size: 64, offset: 1856)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "no_multicast_peers", scope: !539, file: !40, line: 145, baseType: !557, size: 64, offset: 1920)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "send_turn_session_info", scope: !539, file: !40, line: 146, baseType: !931, size: 64, offset: 1984)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_turn_session_info_cb", file: !40, line: 106, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!31, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "turn_session_info", file: !544, line: 134, size: 15040, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943, !944, !946, !950, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !980, !981, !983, !984, !985, !986}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !936, file: !544, line: 135, baseType: !543, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !936, file: !544, line: 136, baseType: !31, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !936, file: !544, line: 137, baseType: !196, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !936, file: !544, line: 138, baseType: !196, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !936, file: !544, line: 139, baseType: !631, size: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "peer_protocol", scope: !936, file: !544, line: 140, baseType: !631, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tls_method", scope: !936, file: !544, line: 141, baseType: !945, size: 136, offset: 224)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 136, elements: !842)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cipher", scope: !936, file: !544, line: 142, baseType: !947, size: 520, offset: 360)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 520, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 65)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_data", scope: !936, file: !544, line: 143, baseType: !951, size: 768, offset: 896)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_data", file: !544, line: 132, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_data", file: !544, line: 129, size: 768, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !952, file: !544, line: 130, baseType: !231, size: 224)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !952, file: !544, line: 131, baseType: !947, size: 520, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr_data", scope: !936, file: !544, line: 144, baseType: !951, size: 768, offset: 1664)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv4", scope: !936, file: !544, line: 145, baseType: !951, size: 768, offset: 2432)
