; ModuleID = '/home/raj/coturn/src/apps/relay/ns_ioalib_engine_impl.c'
source_filename = "/home/raj/coturn/src/apps/relay/ns_ioalib_engine_impl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ioa_socket = type { i32, ptr, i32, ptr, ptr, ptr, i32, i32, i32, ptr, i32, i32, i32, i32, %union.ioa_addr, i32, %union.ioa_addr, ptr, ptr, ptr, ptr, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, %struct._stun_buffer_list, i32, %struct.traffic_bytes, %struct.traffic_bytes, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64 }
%union.ioa_addr = type { %struct.sockaddr_in6 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._stun_buffer_list = type { ptr, i64 }
%struct.traffic_bytes = type { i64, i64 }
%struct.timeval = type { i64, i64 }
%struct._ioa_engine = type { ptr, ptr, i32, i32, ptr, ptr, %struct._stun_buffer_list, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, [65537 x i8], [14 x i32], [14 x %struct.timeval], [1025 x i8], i32, i64, i64, ptr, ptr }
%struct._super_memory = type { %union.pthread_mutex_t, ptr, ptr, i64, i64, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct._timer_event = type { ptr, ptr, ptr, ptr, ptr }

!126 = !DIFile(filename: "src/client/ns_turn_msg.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "43c56357294df21a547ee0716fe3769d")
!127 = !{!128, !129, !130, !131}
!128 = !DIEnumerator(name: "TURN_CREDENTIALS_NONE", value: 0)
!129 = !DIEnumerator(name: "TURN_CREDENTIALS_LONG_TERM", value: 1)
!130 = !DIEnumerator(name: "TURN_CREDENTIALS_SHORT_TERM", value: 2)
!131 = !DIEnumerator(name: "TURN_CREDENTIALS_UNDEFINED", value: 3)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !133, line: 92, baseType: !7, size: 32, elements: !134)
!133 = !DIFile(filename: "src/server/ns_turn_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6e53554bfe42393e23ac816233e245b8")
!134 = !{!135, !136, !137}
!135 = !DIEnumerator(name: "DONT_FRAGMENT_UNSUPPORTED", value: 0)
!136 = !DIEnumerator(name: "DONT_FRAGMENT_SUPPORTED", value: 1)
!137 = !DIEnumerator(name: "DONT_FRAGMENT_SUPPORT_EMULATED", value: 2)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MESSAGE_TO_RELAY_TYPE", file: !133, line: 69, baseType: !7, size: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144}
!140 = !DIEnumerator(name: "RMT_UNKNOWN", value: 0)
!141 = !DIEnumerator(name: "RMT_SOCKET", value: 1)
!142 = !DIEnumerator(name: "RMT_CB_SOCKET", value: 2)
!143 = !DIEnumerator(name: "RMT_MOBILE_SOCKET", value: 3)
!144 = !DIEnumerator(name: "RMT_CANCEL_SESSION", value: 4)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !133, line: 79, baseType: !7, size: 32, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV4", value: 0)
!148 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV6", value: 1)
!149 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_KEEP", value: 2)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bufferevent_ssl_state", file: !151, line: 49, baseType: !7, size: 32, elements: !152)
!151 = !DIFile(filename: "/usr/include/event2/bufferevent_ssl.h", directory: "", checksumkind: CSK_MD5, checksum: "2075d2613c3a73b079f2494c8715d1b3")
!152 = !{!153, !154, !155}
!153 = !DIEnumerator(name: "BUFFEREVENT_SSL_OPEN", value: 0)
!154 = !DIEnumerator(name: "BUFFEREVENT_SSL_CONNECTING", value: 1)
!155 = !DIEnumerator(name: "BUFFEREVENT_SSL_ACCEPTING", value: 2)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_TURN_TLS_TYPE", file: !157, line: 118, baseType: !7, size: 32, elements: !158)
!157 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!158 = !{!159, !160, !161, !162, !163, !164}
!159 = !DIEnumerator(name: "TURN_TLS_NO", value: 0)
!160 = !DIEnumerator(name: "TURN_TLS_SSL23", value: 1)
!161 = !DIEnumerator(name: "TURN_TLS_v1_0", value: 2)
!162 = !DIEnumerator(name: "TURN_TLS_v1_1", value: 3)
!163 = !DIEnumerator(name: "TURN_TLS_v1_2", value: 4)
!164 = !DIEnumerator(name: "TURN_TLS_TOTAL", value: 5)
!165 = !{!166, !370, !214, !318, !372, !274, !292, !373, !388, !389, !726, !728, !729, !415, !211, !189, !272, !217, !730, !732, !742, !744, !746, !756, !950, !219, !248, !464, !952, !536, !223, !173, !7, !213, !216, !288, !452, !953, !959, !428, !207, !962}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !6, line: 120, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !6, line: 119, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !170, line: 135, size: 536064, elements: !171)
!170 = !DIFile(filename: "src/apps/relay/ns_ioalib_impl.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "39ae1828625a6763b6269ecb34869b6c")
!171 = !{!172, !227, !231, !232, !233, !238, !243, !277, !282, !283, !284, !285, !286, !287, !290, !293, !297, !301, !310, !314, !315, !316, !317, !367}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !169, file: !170, line: 137, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "super_memory_t", file: !175, line: 49, baseType: !176)
!175 = !DIFile(filename: "src/apps/relay/ns_sm.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "9025fd46a533d33a213551fd581f5b89")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_super_memory", file: !177, line: 3875, size: 640, elements: !178)
!177 = !DIFile(filename: "src/apps/relay/ns_ioalib_engine_impl.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "88ade6994da00511ad9ed92cbb0b9ebb")
!178 = !{!179, !212, !215, !220, !221, !222}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_sm", scope: !176, file: !177, line: 3876, baseType: !180, size: 320)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !181, line: 72, baseType: !182)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !181, line: 67, size: 320, elements: !183)
!183 = !{!184, !205, !210}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !182, file: !181, line: 69, baseType: !185, size: 320)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !186, line: 22, size: 320, elements: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!187 = !{!188, !190, !191, !192, !193, !194, !196, !197}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !185, file: !186, line: 24, baseType: !189, size: 32)
!189 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !185, file: !186, line: 25, baseType: !7, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !185, file: !186, line: 26, baseType: !189, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !185, file: !186, line: 28, baseType: !7, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !185, file: !186, line: 32, baseType: !189, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !185, file: !186, line: 34, baseType: !195, size: 16, offset: 160)
!195 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !185, file: !186, line: 35, baseType: !195, size: 16, offset: 176)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !185, file: !186, line: 36, baseType: !198, size: 128, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !199, line: 55, baseType: !200)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !199, line: 51, size: 128, elements: !201)
!201 = !{!202, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !200, file: !199, line: 53, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !200, file: !199, line: 54, baseType: !203, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !182, file: !181, line: 70, baseType: !206, size: 320)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 320, elements: !208)
!207 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!208 = !{!209}
!209 = !DISubrange(count: 40)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !182, file: !181, line: 71, baseType: !211, size: 64)
!211 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "super_memory", scope: !176, file: !177, line: 3877, baseType: !213, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sm_allocated", scope: !176, file: !177, line: 3878, baseType: !216, size: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !218, line: 46, baseType: !219)
!218 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!219 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sm_total_sz", scope: !176, file: !177, line: 3879, baseType: !217, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sm_chunk", scope: !176, file: !177, line: 3880, baseType: !217, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !176, file: !177, line: 3881, baseType: !223, size: 32, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !224, line: 26, baseType: !225)
!224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !226, line: 42, baseType: !7)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !169, file: !170, line: 138, baseType: !228, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !230, line: 217, flags: DIFlagFwdDecl)
!230 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!231 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate_eb", scope: !169, file: !170, line: 139, baseType: !189, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !169, file: !170, line: 140, baseType: !189, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !169, file: !170, line: 141, baseType: !234, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnipports", file: !236, line: 50, baseType: !237)
!236 = !DIFile(filename: "src/apps/relay/turn_ports.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "11983eef23ed630198ed333562550552")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_turnipports", file: !236, line: 49, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "map_rtcp", scope: !169, file: !170, line: 142, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !241, line: 46, baseType: !242)
!241 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !241, line: 45, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !169, file: !170, line: 143, baseType: !244, size: 128, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list", file: !170, line: 81, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list", file: !170, line: 78, size: 128, elements: !246)
!246 = !{!247, !276}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !245, file: !170, line: 79, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list_elem", file: !170, line: 76, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list_elem", file: !170, line: 73, size: 524288, elements: !251)
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !170, line: 74, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !170, line: 75, baseType: !255, size: 524224, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !256, line: 48, baseType: !257)
!256 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !256, line: 42, size: 524224, elements: !258)
!258 = !{!259, !266, !270, !271, !275}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !257, file: !256, line: 43, baseType: !260, size: 32)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 32, elements: !264)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !224, line: 24, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !226, line: 38, baseType: !263)
!263 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!264 = !{!265}
!265 = !DISubrange(count: 4)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !257, file: !256, line: 44, baseType: !267, size: 524056, offset: 32)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 524056, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 65507)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !257, file: !256, line: 45, baseType: !217, size: 64, offset: 524096)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !257, file: !256, line: 46, baseType: !272, size: 16, offset: 524160)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !224, line: 25, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !226, line: 40, baseType: !274)
!274 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !257, file: !256, line: 47, baseType: !261, size: 8, offset: 524176)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tsz", scope: !245, file: !170, line: 80, baseType: !217, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !169, file: !170, line: 144, baseType: !278, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !280, line: 185, baseType: !281)
!280 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !280, line: 185, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !169, file: !170, line: 145, baseType: !278, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !169, file: !170, line: 147, baseType: !278, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !169, file: !170, line: 149, baseType: !278, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !169, file: !170, line: 153, baseType: !278, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !169, file: !170, line: 156, baseType: !278, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !169, file: !170, line: 158, baseType: !288, size: 32, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !289, line: 108, baseType: !223)
!289 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !169, file: !170, line: 159, baseType: !291, size: 64, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !6, line: 122, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg", scope: !169, file: !170, line: 160, baseType: !294, size: 524296, offset: 960)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 524296, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 65537)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timer_intervals", scope: !169, file: !170, line: 161, baseType: !298, size: 448, offset: 525280)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 448, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 14)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timers", scope: !169, file: !170, line: 162, baseType: !302, size: 1792, offset: 525760)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 1792, elements: !299)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !304, line: 8, size: 128, elements: !305)
!304 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !303, file: !304, line: 14, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !226, line: 160, baseType: !211)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !303, file: !304, line: 15, baseType: !309, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !226, line: 162, baseType: !211)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !169, file: !170, line: 164, baseType: !311, size: 8200, offset: 527552)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 8200, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 1025)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !169, file: !170, line: 165, baseType: !189, size: 32, offset: 535776)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !169, file: !170, line: 166, baseType: !217, size: 64, offset: 535808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_counter", scope: !169, file: !170, line: 167, baseType: !217, size: 64, offset: 535872)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !169, file: !170, line: 168, baseType: !318, size: 64, offset: 535936)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !320, line: 48, baseType: !321)
!320 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !320, line: 44, size: 224, elements: !322)
!322 = !{!323, !331, !346}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !321, file: !320, line: 45, baseType: !324, size: 128)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !102, line: 180, size: 128, elements: !325)
!325 = !{!326, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !324, file: !102, line: 182, baseType: !327, size: 16)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !328, line: 28, baseType: !274)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !324, file: !102, line: 183, baseType: !330, size: 112, offset: 16)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 112, elements: !299)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !321, file: !320, line: 46, baseType: !332, size: 128)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !47, line: 245, size: 128, elements: !333)
!333 = !{!334, !335, !337, !342}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !332, file: !47, line: 247, baseType: !327, size: 16)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !332, file: !47, line: 248, baseType: !336, size: 16, offset: 16)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !47, line: 123, baseType: !272)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !332, file: !47, line: 249, baseType: !338, size: 32, offset: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !47, line: 31, size: 32, elements: !339)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !338, file: !47, line: 33, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !47, line: 30, baseType: !223)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !332, file: !47, line: 252, baseType: !343, size: 64, offset: 64)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !321, file: !320, line: 47, baseType: !347, size: 224)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !47, line: 260, size: 224, elements: !348)
!348 = !{!349, !350, !351, !352, !366}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !347, file: !47, line: 262, baseType: !327, size: 16)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !347, file: !47, line: 263, baseType: !336, size: 16, offset: 16)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !347, file: !47, line: 264, baseType: !223, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !347, file: !47, line: 265, baseType: !353, size: 128, offset: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !47, line: 219, size: 128, elements: !354)
!354 = !{!355}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !353, file: !47, line: 226, baseType: !356, size: 128)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !47, line: 221, size: 128, elements: !357)
!357 = !{!358, !362, !364}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !356, file: !47, line: 223, baseType: !359, size: 128)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 128, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 16)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !356, file: !47, line: 224, baseType: !363, size: 128)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, elements: !344)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !356, file: !47, line: 225, baseType: !365, size: 128)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 128, elements: !264)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !347, file: !47, line: 266, baseType: !223, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rch", scope: !169, file: !170, line: 169, baseType: !368, size: 64, offset: 536000)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !369, line: 45, baseType: !292)
!369 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer_event", file: !170, line: 240, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timer_event", file: !170, line: 233, size: 320, elements: !376)
!376 = !{!377, !380, !381, !386, !387}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !375, file: !170, line: 235, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !230, line: 276, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !375, file: !170, line: 236, baseType: !166, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !375, file: !170, line: 237, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_event_handler", file: !6, line: 204, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !166, !292}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !375, file: !170, line: 238, baseType: !292, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "txt", scope: !375, file: !170, line: 239, baseType: !214, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !126, line: 67, baseType: !219)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !6, line: 115, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !170, line: 179, size: 2880, elements: !392)
!392 = !{!393, !394, !396, !397, !424, !427, !429, !430, !432, !434, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !461, !462, !463, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !706, !707, !708, !709, !714, !715, !718, !723, !724, !725}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !391, file: !170, line: 181, baseType: !189, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parent_s", scope: !391, file: !170, line: 182, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !391, file: !170, line: 183, baseType: !223, size: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sockets_container", scope: !391, file: !170, line: 184, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map", file: !400, line: 183, baseType: !401)
!400 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_addr_map", file: !400, line: 177, size: 1441856, elements: !402)
!402 = !{!403, !421}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !401, file: !400, line: 178, baseType: !404, size: 1441792)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 1441792, elements: !419)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_list_header", file: !400, line: 175, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_list_header", file: !400, line: 171, size: 1408, elements: !407)
!407 = !{!408, !416, !418}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "main_list", scope: !406, file: !400, line: 172, baseType: !409, size: 1280)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 1280, elements: !264)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_elem", file: !400, line: 169, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_elem", file: !400, line: 166, size: 320, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !411, file: !400, line: 167, baseType: !319, size: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !411, file: !400, line: 168, baseType: !415, size: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map_value_type", file: !400, line: 161, baseType: !219)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "extra_list", scope: !406, file: !400, line: 173, baseType: !417, size: 64, offset: 1280)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !406, file: !400, line: 174, baseType: !217, size: 64, offset: 1344)
!419 = !{!420}
!420 = !DISubrange(count: 1024)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !401, file: !400, line: 179, baseType: !422, size: 64, offset: 1441792)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !224, line: 27, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !226, line: 45, baseType: !219)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !391, file: !170, line: 185, baseType: !425, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferevent", file: !90, line: 113, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "defer_nbh", scope: !391, file: !170, line: 186, baseType: !428, size: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !6, line: 124, baseType: !292)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !391, file: !170, line: 187, baseType: !189, size: 32, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !391, file: !170, line: 188, baseType: !431, size: 32, offset: 416)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_TYPE", file: !6, line: 98, baseType: !5)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !391, file: !170, line: 189, baseType: !433, size: 32, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_APP_TYPE", file: !6, line: 112, baseType: !19)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !391, file: !170, line: 190, baseType: !435, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !280, line: 184, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !280, line: 184, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegs", scope: !391, file: !170, line: 191, baseType: !223, size: 32, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "in_write", scope: !391, file: !170, line: 192, baseType: !189, size: 32, offset: 608)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !391, file: !170, line: 193, baseType: !189, size: 32, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_known", scope: !391, file: !170, line: 194, baseType: !189, size: 32, offset: 672)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !391, file: !170, line: 195, baseType: !319, size: 224, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !391, file: !170, line: 196, baseType: !189, size: 32, offset: 928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !391, file: !170, line: 197, baseType: !319, size: 224, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !391, file: !170, line: 198, baseType: !166, size: 64, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "read_event", scope: !391, file: !170, line: 199, baseType: !378, size: 64, offset: 1280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !391, file: !170, line: 200, baseType: !448, size: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_event_handler", file: !6, line: 199, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !452, !189, !453, !292, !189}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !6, line: 116, baseType: !389)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_data", file: !6, line: 132, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_net_data", file: !6, line: 127, size: 384, elements: !456)
!456 = !{!457, !458, !459, !460}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !455, file: !6, line: 128, baseType: !319, size: 224)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nbh", scope: !455, file: !6, line: 129, baseType: !428, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "recv_ttl", scope: !455, file: !6, line: 130, baseType: !189, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "recv_tos", scope: !455, file: !6, line: 131, baseType: !189, size: 32, offset: 352)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "read_ctx", scope: !391, file: !170, line: 201, baseType: !292, size: 64, offset: 1408)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !391, file: !170, line: 202, baseType: !189, size: 32, offset: 1472)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !391, file: !170, line: 203, baseType: !464, size: 64, offset: 1536)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ts_ur_super_session", file: !6, line: 47, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts_ur_super_session", file: !467, line: 68, size: 152448, elements: !468)
!467 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!468 = !{!469, !470, !472, !473, !474, !614, !615, !616, !617, !618, !622, !623, !627, !632, !633, !638, !639, !640, !641, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !685, !686, !690}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !466, file: !467, line: 69, baseType: !292, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !466, file: !467, line: 70, baseType: !471, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnsession_id", file: !467, line: 62, baseType: !422)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !466, file: !467, line: 71, baseType: !288, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "client_socket", scope: !466, file: !467, line: 72, baseType: !452, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !466, file: !467, line: 73, baseType: !475, size: 141120, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation", file: !31, line: 186, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_allocation", file: !31, line: 176, size: 141120, elements: !477)
!477 = !{!478, !479, !487, !541, !551, !553, !579, !580, !584}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !476, file: !31, line: 177, baseType: !189, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !476, file: !31, line: 178, baseType: !480, size: 96, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !126, line: 52, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 47, size: 96, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !481, file: !126, line: 51, baseType: !484, size: 96)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 96, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 12)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "addr_to_perm", scope: !476, file: !31, line: 179, baseType: !488, size: 125440, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_hashtable", file: !31, line: 166, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_hashtable", file: !31, line: 164, size: 125440, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !489, file: !31, line: 165, baseType: !492, size: 125440)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 125440, elements: !344)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_array", file: !31, line: 162, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_array", file: !31, line: 158, size: 15680, elements: !495)
!495 = !{!496, !537, !538}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "main_slots", scope: !494, file: !31, line: 159, baseType: !497, size: 15552)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 15552, elements: !518)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_slot", file: !31, line: 156, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_slot", file: !31, line: 154, size: 5184, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !499, file: !31, line: 155, baseType: !502, size: 5184)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_info", file: !31, line: 152, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_info", file: !31, line: 143, size: 5184, elements: !504)
!504 = !{!505, !506, !530, !531, !532, !533, !534, !535}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !503, file: !31, line: 144, baseType: !189, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !503, file: !31, line: 145, baseType: !507, size: 4608, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map", file: !400, line: 117, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map", file: !400, line: 115, size: 4608, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !508, file: !400, line: 116, baseType: !511, size: 4608)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 4608, elements: !344)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map_array", file: !400, line: 113, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map_array", file: !400, line: 107, size: 576, elements: !514)
!514 = !{!515, !520, !523, !524, !527}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "main_keys", scope: !513, file: !400, line: 108, baseType: !516, size: 192)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 192, elements: !518)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !400, line: 47, baseType: !422)
!518 = !{!519}
!519 = !DISubrange(count: 3)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "main_values", scope: !513, file: !400, line: 109, baseType: !521, size: 192, offset: 192)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 192, elements: !518)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !400, line: 48, baseType: !219)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !513, file: !400, line: 110, baseType: !217, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "extra_keys", scope: !513, file: !400, line: 111, baseType: !525, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !513, file: !400, line: 112, baseType: !528, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !503, file: !31, line: 146, baseType: !319, size: 224, offset: 4672)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !503, file: !31, line: 147, baseType: !288, size: 32, offset: 4896)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !503, file: !31, line: 148, baseType: !291, size: 64, offset: 4928)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !503, file: !31, line: 149, baseType: !292, size: 64, offset: 4992)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !503, file: !31, line: 150, baseType: !189, size: 32, offset: 5056)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !503, file: !31, line: 151, baseType: !536, size: 64, offset: 5120)
!536 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !494, file: !31, line: 160, baseType: !217, size: 64, offset: 15552)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slots", scope: !494, file: !31, line: 161, baseType: !539, size: 64, offset: 15616)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions", scope: !476, file: !31, line: 180, baseType: !542, size: 384, offset: 125568)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 384, elements: !549)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "relay_endpoint_session", file: !31, line: 55, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 50, size: 192, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !544, file: !31, line: 52, baseType: !452, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !544, file: !31, line: 53, baseType: !288, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !544, file: !31, line: 54, baseType: !291, size: 64, offset: 128)
!549 = !{!550}
!550 = !DISubrange(count: 2)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions_failure", scope: !476, file: !31, line: 181, baseType: !552, size: 64, offset: 125952)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !549)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !476, file: !31, line: 182, baseType: !554, size: 14848, offset: 126016)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map", file: !31, line: 136, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_map", file: !31, line: 134, size: 14848, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !555, file: !31, line: 135, baseType: !558, size: 14848)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 14848, elements: !344)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map_array", file: !31, line: 132, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chn_map_array", file: !31, line: 128, size: 1856, elements: !561)
!561 = !{!562, !575, !576}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "main_chns", scope: !560, file: !31, line: 129, baseType: !563, size: 1728)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1728, elements: !518)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_info", file: !31, line: 121, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_info", file: !31, line: 112, size: 576, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !565, file: !31, line: 113, baseType: !272, size: 16)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !565, file: !31, line: 114, baseType: !189, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !565, file: !31, line: 115, baseType: !272, size: 16, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !565, file: !31, line: 116, baseType: !319, size: 224, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !565, file: !31, line: 117, baseType: !288, size: 32, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !565, file: !31, line: 118, baseType: !291, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !565, file: !31, line: 119, baseType: !292, size: 64, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_channel", scope: !565, file: !31, line: 120, baseType: !292, size: 64, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !560, file: !31, line: 130, baseType: !217, size: 64, offset: 1728)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "extra_chns", scope: !560, file: !31, line: 131, baseType: !577, size: 64, offset: 1792)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !476, file: !31, line: 183, baseType: !292, size: 64, offset: 140864)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_connections", scope: !476, file: !31, line: 184, baseType: !581, size: 64, offset: 140928)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !400, line: 43, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !400, line: 42, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tcs", scope: !476, file: !31, line: 185, baseType: !585, size: 128, offset: 140992)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_list", file: !31, line: 103, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection_list", file: !31, line: 100, size: 128, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !586, file: !31, line: 101, baseType: !217, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !586, file: !31, line: 102, baseType: !590, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection", file: !6, line: 50, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection", file: !31, line: 85, size: 960, elements: !594)
!594 = !{!595, !597, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !593, file: !31, line: 87, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "TC_STATE", file: !31, line: 76, baseType: !30)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !593, file: !31, line: 88, baseType: !598, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_id", file: !31, line: 78, baseType: !223)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !593, file: !31, line: 89, baseType: !319, size: 224, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "client_s", scope: !593, file: !31, line: 90, baseType: !452, size: 64, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "peer_s", scope: !593, file: !31, line: 91, baseType: !452, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "peer_conn_timeout", scope: !593, file: !31, line: 92, baseType: !291, size: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bind_timeout", scope: !593, file: !31, line: 93, baseType: !291, size: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !593, file: !31, line: 94, baseType: !480, size: 96, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !593, file: !31, line: 95, baseType: !292, size: 64, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !593, file: !31, line: 96, baseType: !189, size: 32, offset: 768)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ub_to_client", scope: !593, file: !31, line: 97, baseType: !608, size: 128, offset: 832)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "unsent_buffer", file: !31, line: 83, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 80, size: 128, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !609, file: !31, line: 81, baseType: !217, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !609, file: !31, line: 82, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_allocated_timeout_ev", scope: !466, file: !467, line: 74, baseType: !291, size: 64, offset: 141376)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !466, file: !467, line: 75, baseType: !189, size: 32, offset: 141440)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "is_tcp_relay", scope: !466, file: !467, line: 76, baseType: !189, size: 32, offset: 141472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_closed", scope: !466, file: !467, line: 77, baseType: !189, size: 32, offset: 141504)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !466, file: !467, line: 79, baseType: !619, size: 136, offset: 141536)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 136, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 17)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_expiration_time", scope: !466, file: !467, line: 80, baseType: !288, size: 32, offset: 141696)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !466, file: !467, line: 81, baseType: !624, size: 4104, offset: 141728)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 4104, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 513)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey", scope: !466, file: !467, line: 82, baseType: !628, size: 512, offset: 145832)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !126, line: 64, baseType: !629)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 512, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey_set", scope: !466, file: !467, line: 83, baseType: !189, size: 32, offset: 146368)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !466, file: !467, line: 84, baseType: !634, size: 2056, offset: 146400)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !126, line: 66, baseType: !635)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 2056, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 257)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "quota_used", scope: !466, file: !467, line: 85, baseType: !189, size: 32, offset: 148480)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !466, file: !467, line: 86, baseType: !189, size: 32, offset: 148512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "max_session_time_auth", scope: !466, file: !467, line: 87, baseType: !288, size: 32, offset: 148544)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "realm_options", scope: !466, file: !467, line: 89, baseType: !642, size: 1152, offset: 148608)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !6, line: 142, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !467, line: 53, size: 1152, elements: !644)
!644 = !{!645, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !467, line: 55, baseType: !646, size: 1024)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1024, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !643, file: !467, line: 57, baseType: !650, size: 128, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !467, line: 51, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !467, line: 45, size: 128, elements: !652)
!652 = !{!653, !655, !657}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !651, file: !467, line: 47, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !388)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !651, file: !467, line: 48, baseType: !656, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !289, line: 105, baseType: !189)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !651, file: !467, line: 49, baseType: !656, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "origin_set", scope: !466, file: !467, line: 90, baseType: !189, size: 32, offset: 149760)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !466, file: !467, line: 91, baseType: !646, size: 1024, offset: 149792)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !466, file: !467, line: 93, baseType: !223, size: 32, offset: 150816)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !466, file: !467, line: 94, baseType: !223, size: 32, offset: 150848)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !466, file: !467, line: 95, baseType: !223, size: 32, offset: 150880)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !466, file: !467, line: 96, baseType: !223, size: 32, offset: 150912)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_packets", scope: !466, file: !467, line: 97, baseType: !422, size: 64, offset: 150976)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_packets", scope: !466, file: !467, line: 98, baseType: !422, size: 64, offset: 151040)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_bytes", scope: !466, file: !467, line: 99, baseType: !422, size: 64, offset: 151104)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_bytes", scope: !466, file: !467, line: 100, baseType: !422, size: 64, offset: 151168)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !466, file: !467, line: 101, baseType: !422, size: 64, offset: 151232)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !466, file: !467, line: 102, baseType: !217, size: 64, offset: 151296)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !466, file: !467, line: 103, baseType: !217, size: 64, offset: 151360)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !466, file: !467, line: 104, baseType: !223, size: 32, offset: 151424)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !466, file: !467, line: 105, baseType: !223, size: 32, offset: 151456)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !466, file: !467, line: 106, baseType: !223, size: 32, offset: 151488)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !466, file: !467, line: 107, baseType: !223, size: 32, offset: 151520)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_packets", scope: !466, file: !467, line: 108, baseType: !223, size: 32, offset: 151552)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_packets", scope: !466, file: !467, line: 109, baseType: !223, size: 32, offset: 151584)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_bytes", scope: !466, file: !467, line: 110, baseType: !223, size: 32, offset: 151616)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_bytes", scope: !466, file: !467, line: 111, baseType: !223, size: 32, offset: 151648)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !466, file: !467, line: 112, baseType: !422, size: 64, offset: 151680)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !466, file: !467, line: 113, baseType: !217, size: 64, offset: 151744)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !466, file: !467, line: 114, baseType: !217, size: 64, offset: 151808)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !466, file: !467, line: 116, baseType: !189, size: 32, offset: 151872)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_id", scope: !466, file: !467, line: 117, baseType: !684, size: 64, offset: 151936)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "mobile_id_t", file: !467, line: 66, baseType: !422)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "old_mobile_id", scope: !466, file: !467, line: 118, baseType: !684, size: 64, offset: 152000)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "s_mobile_id", scope: !466, file: !467, line: 119, baseType: !687, size: 264, offset: 152064)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 264, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 33)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !466, file: !467, line: 121, baseType: !388, size: 64, offset: 152384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "current_df_relay_flag", scope: !391, file: !170, line: 204, baseType: !189, size: 32, offset: 1600)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_use_df", scope: !391, file: !170, line: 206, baseType: !189, size: 32, offset: 1632)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tobeclosed", scope: !391, file: !170, line: 207, baseType: !189, size: 32, offset: 1664)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "broken", scope: !391, file: !170, line: 208, baseType: !189, size: 32, offset: 1696)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "default_ttl", scope: !391, file: !170, line: 209, baseType: !189, size: 32, offset: 1728)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "current_ttl", scope: !391, file: !170, line: 210, baseType: !189, size: 32, offset: 1760)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "default_tos", scope: !391, file: !170, line: 211, baseType: !189, size: 32, offset: 1792)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "current_tos", scope: !391, file: !170, line: 212, baseType: !189, size: 32, offset: 1824)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !391, file: !170, line: 213, baseType: !244, size: 128, offset: 1856)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !391, file: !170, line: 214, baseType: !288, size: 32, offset: 1984)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data_traffic", scope: !391, file: !170, line: 215, baseType: !702, size: 128, offset: 2048)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "traffic_bytes", file: !170, line: 174, size: 128, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_read", scope: !702, file: !170, line: 175, baseType: !388, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_write", scope: !702, file: !170, line: 176, baseType: !388, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "control_traffic", scope: !391, file: !170, line: 216, baseType: !702, size: 128, offset: 2176)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sub_session", scope: !391, file: !170, line: 219, baseType: !591, size: 64, offset: 2304)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bev", scope: !391, file: !170, line: 221, baseType: !425, size: 64, offset: 2368)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cb", scope: !391, file: !170, line: 222, baseType: !710, size: 64, offset: 2432)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "connect_cb", file: !6, line: 135, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !189, !292}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "conn_arg", scope: !391, file: !170, line: 223, baseType: !292, size: 64, offset: 2496)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "list_ev", scope: !391, file: !170, line: 225, baseType: !716, size: 64, offset: 2560)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "evconnlistener", file: !170, line: 225, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "acb", scope: !391, file: !170, line: 226, baseType: !719, size: 64, offset: 2624)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "accept_cb", file: !6, line: 137, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !452, !292}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "acbarg", scope: !391, file: !170, line: 227, baseType: !292, size: 64, offset: 2688)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "special_session", scope: !391, file: !170, line: 229, baseType: !292, size: 64, offset: 2752)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "special_session_size", scope: !391, file: !170, line: 230, baseType: !217, size: 64, offset: 2816)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !102, line: 33, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !226, line: 210, baseType: !7)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !102, line: 277, size: 128, elements: !734)
!734 = !{!735, !736, !737, !738}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !733, file: !102, line: 279, baseType: !217, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !733, file: !102, line: 284, baseType: !189, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !733, file: !102, line: 285, baseType: !189, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !733, file: !102, line: 287, baseType: !739, offset: 128)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: -1)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "recv_ttl_t", file: !177, line: 1985, baseType: !263)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "recv_tos_t", file: !177, line: 1986, baseType: !263)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "turn_sock_extended_err", file: !177, line: 78, size: 128, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ee_errno", scope: !747, file: !177, line: 79, baseType: !223, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ee_origin", scope: !747, file: !177, line: 80, baseType: !261, size: 8, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ee_type", scope: !747, file: !177, line: 81, baseType: !261, size: 8, offset: 40)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ee_code", scope: !747, file: !177, line: 82, baseType: !261, size: 8, offset: 48)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ee_pad", scope: !747, file: !177, line: 83, baseType: !261, size: 8, offset: 56)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ee_info", scope: !747, file: !177, line: 84, baseType: !223, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ee_data", scope: !747, file: !177, line: 85, baseType: !223, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_turnserver", file: !133, line: 99, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_turnserver", file: !133, line: 111, size: 3456, elements: !759)
!759 = !{!760, !762, !763, !764, !765, !766, !767, !768, !769, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !783, !788, !793, !795, !799, !809, !814, !819, !820, !821, !822, !823, !880, !885, !886, !887, !888, !895, !909, !910, !911, !912, !913, !914, !935, !936, !937, !938, !939, !944, !945, !946, !947, !949}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !758, file: !133, line: 113, baseType: !761, size: 8)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnserver_id", file: !133, line: 67, baseType: !261)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_counter", scope: !758, file: !133, line: 115, baseType: !471, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sessions_map", scope: !758, file: !133, line: 116, baseType: !581, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !758, file: !133, line: 118, baseType: !288, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !758, file: !133, line: 120, baseType: !166, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !758, file: !133, line: 121, baseType: !189, size: 32, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !758, file: !133, line: 122, baseType: !189, size: 32, offset: 352)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rfc5780", scope: !758, file: !133, line: 123, baseType: !189, size: 32, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "check_origin", scope: !758, file: !133, line: 124, baseType: !770, size: 64, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "vintp", file: !289, line: 106, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stale_nonce", scope: !758, file: !133, line: 125, baseType: !770, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "max_allocate_lifetime", scope: !758, file: !133, line: 126, baseType: !770, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "channel_lifetime", scope: !758, file: !133, line: 127, baseType: !770, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "permission_lifetime", scope: !758, file: !133, line: 128, baseType: !770, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stun_only", scope: !758, file: !133, line: 129, baseType: !770, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "no_stun", scope: !758, file: !133, line: 130, baseType: !770, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "no_software_attribute", scope: !758, file: !133, line: 131, baseType: !770, size: 64, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "web_admin_listen_on_workers", scope: !758, file: !133, line: 132, baseType: !770, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "secure_stun", scope: !758, file: !133, line: 133, baseType: !770, size: 64, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !758, file: !133, line: 134, baseType: !782, size: 32, offset: 1088)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_credential_type", file: !126, line: 59, baseType: !125)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "alt_addr_cb", scope: !758, file: !133, line: 135, baseType: !784, size: 64, offset: 1152)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_alt_addr_cb", file: !133, line: 59, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!189, !318, !318}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sm_cb", scope: !758, file: !133, line: 136, baseType: !789, size: 64, offset: 1216)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_message_cb", file: !133, line: 60, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!189, !166, !428, !318, !318}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dont_fragment", scope: !758, file: !133, line: 137, baseType: !794, size: 32, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "dont_fragment_option_t", file: !133, line: 96, baseType: !132)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !758, file: !133, line: 138, baseType: !796, size: 64, offset: 1344)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!189, !464}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "userkeycb", scope: !758, file: !133, line: 139, baseType: !800, size: 64, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_user_key_cb", file: !133, line: 102, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!372, !761, !782, !189, !804, !372, !372, !805, !453, !422, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_username_resume_cb", file: !133, line: 101, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !189, !189, !189, !372, !372, !756, !422, !453, !372}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "chquotacb", scope: !758, file: !133, line: 140, baseType: !810, size: 64, offset: 1472)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "check_new_allocation_quota_cb", file: !133, line: 103, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!189, !372, !189, !372}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "raqcb", scope: !758, file: !133, line: 141, baseType: !815, size: 64, offset: 1536)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "release_allocation_quota_cb", file: !133, line: 104, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !372, !189, !372}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip_set", scope: !758, file: !133, line: 142, baseType: !189, size: 32, offset: 1600)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip", scope: !758, file: !133, line: 143, baseType: !319, size: 224, offset: 1632)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "allow_loopback_peers", scope: !758, file: !133, line: 144, baseType: !770, size: 64, offset: 1856)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "no_multicast_peers", scope: !758, file: !133, line: 145, baseType: !770, size: 64, offset: 1920)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "send_turn_session_info", scope: !758, file: !133, line: 146, baseType: !824, size: 64, offset: 1984)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_turn_session_info_cb", file: !133, line: 106, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!189, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "turn_session_info", file: !467, line: 134, size: 15040, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !839, !843, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !873, !874, !876, !877, !878, !879}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !829, file: !467, line: 135, baseType: !471, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !829, file: !467, line: 136, baseType: !189, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !829, file: !467, line: 137, baseType: !288, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !829, file: !467, line: 138, baseType: !288, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !829, file: !467, line: 139, baseType: !431, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "peer_protocol", scope: !829, file: !467, line: 140, baseType: !431, size: 32, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tls_method", scope: !829, file: !467, line: 141, baseType: !838, size: 136, offset: 224)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 136, elements: !620)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cipher", scope: !829, file: !467, line: 142, baseType: !840, size: 520, offset: 360)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 520, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 65)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_data", scope: !829, file: !467, line: 143, baseType: !844, size: 768, offset: 896)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_data", file: !467, line: 132, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_data", file: !467, line: 129, size: 768, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !845, file: !467, line: 130, baseType: !319, size: 224)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !845, file: !467, line: 131, baseType: !840, size: 520, offset: 224)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr_data", scope: !829, file: !467, line: 144, baseType: !844, size: 768, offset: 1664)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv4", scope: !829, file: !467, line: 145, baseType: !844, size: 768, offset: 2432)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv6", scope: !829, file: !467, line: 146, baseType: !844, size: 768, offset: 3200)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !829, file: !467, line: 147, baseType: !624, size: 4104, offset: 3968)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !829, file: !467, line: 148, baseType: !189, size: 32, offset: 8096)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !829, file: !467, line: 150, baseType: !422, size: 64, offset: 8128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !829, file: !467, line: 151, baseType: !422, size: 64, offset: 8192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !829, file: !467, line: 152, baseType: !422, size: 64, offset: 8256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !829, file: !467, line: 153, baseType: !422, size: 64, offset: 8320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !829, file: !467, line: 154, baseType: !223, size: 32, offset: 8384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !829, file: !467, line: 155, baseType: !223, size: 32, offset: 8416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !829, file: !467, line: 156, baseType: !223, size: 32, offset: 8448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !829, file: !467, line: 157, baseType: !422, size: 64, offset: 8512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !829, file: !467, line: 158, baseType: !422, size: 64, offset: 8576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !829, file: !467, line: 159, baseType: !422, size: 64, offset: 8640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !829, file: !467, line: 160, baseType: !422, size: 64, offset: 8704)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !829, file: !467, line: 161, baseType: !223, size: 32, offset: 8768)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !829, file: !467, line: 162, baseType: !223, size: 32, offset: 8800)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !829, file: !467, line: 163, baseType: !223, size: 32, offset: 8832)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !829, file: !467, line: 165, baseType: !189, size: 32, offset: 8864)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_data", scope: !829, file: !467, line: 167, baseType: !870, size: 3840, offset: 8896)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 3840, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 5)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_size", scope: !829, file: !467, line: 168, baseType: !217, size: 64, offset: 12736)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_data", scope: !829, file: !467, line: 169, baseType: !875, size: 64, offset: 12800)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_size", scope: !829, file: !467, line: 170, baseType: !217, size: 64, offset: 12864)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !829, file: !467, line: 172, baseType: !646, size: 1024, offset: 12928)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !829, file: !467, line: 173, baseType: !646, size: 1024, offset: 13952)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !829, file: !467, line: 175, baseType: !388, size: 64, offset: 14976)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "send_https_socket", scope: !758, file: !133, line: 147, baseType: !881, size: 64, offset: 2048)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_https_socket_cb", file: !133, line: 107, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !452}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "no_udp_relay", scope: !758, file: !133, line: 150, baseType: !770, size: 64, offset: 2112)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "no_tcp_relay", scope: !758, file: !133, line: 151, baseType: !770, size: 64, offset: 2176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_relay_connections", scope: !758, file: !133, line: 152, baseType: !581, size: 64, offset: 2240)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "send_socket_to_relay", scope: !758, file: !133, line: 153, baseType: !889, size: 64, offset: 2304)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_socket_to_relay_cb", file: !133, line: 105, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!189, !761, !422, !893, !452, !189, !894, !453, !189}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "MESSAGE_TO_RELAY_TYPE", file: !133, line: 76, baseType: !138)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_servers_list", scope: !758, file: !133, line: 157, baseType: !896, size: 64, offset: 2368)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_server_addrs_list_t", file: !133, line: 53, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_server_addrs_list", file: !133, line: 47, size: 256, elements: !899)
!899 = !{!900, !901, !903}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !898, file: !133, line: 48, baseType: !318, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !898, file: !133, line: 49, baseType: !902, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !217)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !898, file: !133, line: 50, baseType: !904, size: 128, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_mutex", file: !6, line: 60, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_mutex", file: !6, line: 55, size: 128, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !905, file: !6, line: 56, baseType: !223, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !905, file: !6, line: 57, baseType: !292, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "as_counter", scope: !758, file: !133, line: 158, baseType: !217, size: 64, offset: 2432)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "tls_alternate_servers_list", scope: !758, file: !133, line: 159, baseType: !896, size: 64, offset: 2496)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "tls_as_counter", scope: !758, file: !133, line: 160, baseType: !217, size: 64, offset: 2560)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "aux_servers_list", scope: !758, file: !133, line: 161, baseType: !896, size: 64, offset: 2624)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "self_udp_balance", scope: !758, file: !133, line: 162, baseType: !189, size: 32, offset: 2688)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ip_whitelist", scope: !758, file: !133, line: 165, baseType: !915, size: 64, offset: 2752)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !6, line: 159, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !6, line: 154, size: 128, elements: !918)
!918 = !{!919, !934}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !917, file: !6, line: 155, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !6, line: 152, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !6, line: 146, size: 6624, elements: !923)
!923 = !{!924, !926, !928}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !922, file: !6, line: 147, baseType: !925, size: 2056)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 2056, elements: !636)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !922, file: !6, line: 148, baseType: !927, size: 4104, offset: 2056)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 4104, elements: !625)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !922, file: !6, line: 149, baseType: !929, size: 448, offset: 6176)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !320, line: 53, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 50, size: 448, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !930, file: !320, line: 51, baseType: !319, size: 224)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !930, file: !320, line: 52, baseType: !319, size: 224, offset: 224)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !917, file: !6, line: 156, baseType: !217, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ip_blacklist", scope: !758, file: !133, line: 166, baseType: !915, size: 64, offset: 2816)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mobility", scope: !758, file: !133, line: 169, baseType: !770, size: 64, offset: 2880)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_connections_map", scope: !758, file: !133, line: 170, baseType: !581, size: 64, offset: 2944)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "server_relay", scope: !758, file: !133, line: 173, baseType: !189, size: 32, offset: 3008)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_bps_func", scope: !758, file: !133, line: 176, baseType: !940, size: 64, offset: 3072)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocate_bps_cb", file: !133, line: 109, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!388, !388, !189}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !758, file: !133, line: 179, baseType: !189, size: 32, offset: 3136)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "oauth_server_name", scope: !758, file: !133, line: 180, baseType: !370, size: 64, offset: 3200)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "acme_redirect", scope: !758, file: !133, line: 183, baseType: !370, size: 64, offset: 3264)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "allocation_default_address_family", scope: !758, file: !133, line: 186, baseType: !948, size: 32, offset: 3328)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !133, line: 84, baseType: !145)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "log_binding", scope: !758, file: !133, line: 189, baseType: !770, size: 64, offset: 3392)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssl_info_callback_t", file: !177, line: 1418, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !957, !189, !189}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !960, line: 108, baseType: !961)
!960 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !226, line: 194, baseType: !211)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "TURN_TLS_TYPE", file: !157, line: 131, baseType: !156)
!963 = !{!0, !964, !970, !975, !980, !985, !990, !992, !997, !999, !1004, !1009, !1014, !1016, !1021, !1026, !1028, !1030, !1035, !1040, !1042, !1047, !1049, !1052, !1057, !1062, !1065, !1067, !1069, !1071, !1076, !1078, !1083, !1088, !1093, !1095, !1100, !1102, !1104, !1109, !1111, !1116, !1118, !1123, !1128, !1131, !1133, !1138, !1140, !1142, !1145, !1150, !1152, !1157, !1162, !1165, !1170, !1175, !1180, !1182, !1187, !1189, !1194, !1199, !1201, !1204, !1209, !1212, !1214, !1216, !1218, !1220, !1225, !1230, !1235, !1237, !1239, !1242, !1244, !1246, !1248, !1250, !1255, !1260, !1262, !1267, !1272, !1274, !1277, !1279, !1281, !1283, !1288, !1290, !1295, !1300, !1305, !1307, !1309, !1314, !1319, !1321, !1323, !1325, !1327, !1332, !1334, !1337, !1339, !1342, !1345, !1347, !1349, !1354, !1359, !1362, !1364, !1366, !1368, !1370, !1372, !1374, !1376, !1381, !1383, !1388, !1390, !1392, !1394, !1396, !1399, !1401, !1403, !1405, !1407, !1409, !1411, !1413, !1415, !1417, !1420, !1422, !1424, !1426, !1428, !1431, !1436, !1439, !1444, !1449, !1451, !1453, !1455, !1457, !1459, !1461, !1463, !1465, !1467}
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "capabilities_checked", scope: !966, file: !177, line: 365, type: !189, isLocal: true, isDefinition: true)
!966 = distinct !DISubprogram(name: "create_ioa_engine", scope: !177, file: !177, line: 356, type: !967, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !969)
!967 = !DISubroutineType(types: !968)
!968 = !{!166, !173, !228, !234, !370, !217, !213, !189, !189, !370}
!969 = !{}
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !177, line: 387, type: !972, isLocal: true, isDefinition: true)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 248, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 31)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !177, line: 387, type: !977, isLocal: true, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 144, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 18)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !177, line: 390, type: !982, isLocal: true, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 448, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 56)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !177, line: 401, type: !987, isLocal: true, isDefinition: true)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 280, elements: !988)
!988 = !{!989}
!989 = !DISubrange(count: 35)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !177, line: 419, type: !840, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !177, line: 436, type: !994, isLocal: true, isDefinition: true)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 256, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 32)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !177, line: 443, type: !330, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !177, line: 750, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 200, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 25)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !177, line: 760, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 160, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 20)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !177, line: 777, type: !1011, isLocal: true, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 184, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 23)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !177, line: 787, type: !1006, isLocal: true, isDefinition: true)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !177, line: 829, type: !1018, isLocal: true, isDefinition: true)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 88, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 11)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !177, line: 840, type: !1023, isLocal: true, isDefinition: true)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 104, elements: !1024)
!1024 = !{!1025}
!1025 = !DISubrange(count: 13)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !177, line: 897, type: !1018, isLocal: true, isDefinition: true)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(scope: null, file: !177, line: 905, type: !1018, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !177, line: 984, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 216, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 27)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1014, type: !1037, isLocal: true, isDefinition: true)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 56, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 7)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1099, type: !838, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1102, type: !1044, isLocal: true, isDefinition: true)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 208, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 26)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1109, type: !1044, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1109, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 200, elements: !1002)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1120, type: !1054, isLocal: true, isDefinition: true)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 224, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 28)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1515, type: !1059, isLocal: true, isDefinition: true)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 416, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 52)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1515, type: !1064, isLocal: true, isDefinition: true)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 136, elements: !620)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1520, type: !1059, isLocal: true, isDefinition: true)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1521, type: !687, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1563, type: !1011, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1566, type: !1073, isLocal: true, isDefinition: true)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 408, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 51)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !177, line: 1566, type: !977, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
