; ModuleID = '/home/raj/coturn/src/apps/relay/tls_listener.c'
source_filename = "/home/raj/coturn/src/apps/relay/tls_listener.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.listener_server = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr, ptr }
%struct._ip_range_list = type { ptr, i64 }

!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_APP_TYPE", file: !144, line: 100, baseType: !124, size: 32, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166}
!158 = !DIEnumerator(name: "UNKNOWN_APP_SOCKET", value: 0)
!159 = !DIEnumerator(name: "CLIENT_SOCKET", value: 1)
!160 = !DIEnumerator(name: "HTTP_CLIENT_SOCKET", value: 2)
!161 = !DIEnumerator(name: "HTTPS_CLIENT_SOCKET", value: 3)
!162 = !DIEnumerator(name: "RELAY_SOCKET", value: 4)
!163 = !DIEnumerator(name: "RELAY_RTCP_SOCKET", value: 5)
!164 = !DIEnumerator(name: "TCP_CLIENT_DATA_SOCKET", value: 6)
!165 = !DIEnumerator(name: "TCP_RELAY_DATA_SOCKET", value: 7)
!166 = !DIEnumerator(name: "LISTENER_SOCKET", value: 8)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_TC_STATE", file: !168, line: 67, baseType: !124, size: 32, elements: !169)
!168 = !DIFile(filename: "src/server/ns_turn_allocation.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0cb2cf61c9ec5dd3030a6e5a6f8d4af1")
!169 = !{!170, !171, !172, !173, !174, !175}
!170 = !DIEnumerator(name: "TC_STATE_UNKNOWN", value: 0)
!171 = !DIEnumerator(name: "TC_STATE_CLIENT_TO_PEER_CONNECTING", value: 1)
!172 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTING", value: 2)
!173 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTED", value: 3)
!174 = !DIEnumerator(name: "TC_STATE_READY", value: 4)
!175 = !DIEnumerator(name: "TC_STATE_FAILED", value: 5)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !123, line: 79, baseType: !124, size: 32, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV4", value: 0)
!179 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV6", value: 1)
!180 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_KEEP", value: 2)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !182, line: 47, baseType: !124, size: 32, elements: !183)
!182 = !DIFile(filename: "src/apps/common/ns_turn_utils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "74cb4019b1eb9d8e2b879df518b15a25")
!183 = !{!184, !185, !186, !187}
!184 = !DIEnumerator(name: "TURN_LOG_LEVEL_INFO", value: 0)
!185 = !DIEnumerator(name: "TURN_LOG_LEVEL_CONTROL", value: 1)
!186 = !DIEnumerator(name: "TURN_LOG_LEVEL_WARNING", value: 2)
!187 = !DIEnumerator(name: "TURN_LOG_LEVEL_ERROR", value: 3)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !189, line: 24, baseType: !124, size: 32, elements: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "", checksumkind: CSK_MD5, checksum: "0d4e972fdeb3da9a5bc94fa41144e9f8")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199}
!191 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!192 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!193 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!194 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!195 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!196 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!197 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!198 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!199 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !201, line: 40, baseType: !124, size: 32, elements: !202)
!201 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!203 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!204 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!205 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!206 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!207 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!208 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!209 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!210 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!211 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!212 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!213 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!214 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!215 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!216 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!217 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!218 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!219 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!220 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!221 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!222 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!223 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!224 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!225 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!226 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!227 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!228 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!229 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!230 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!231 = !{!232, !954, !992, !993, !995, !322, !378, !811}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "tls_listener_relay_server_type", file: !234, line: 47, baseType: !235)
!234 = !DIFile(filename: "src/apps/relay/tls_listener.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "600378d89e7e6850884a9f7c884c23e9")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tls_listener_relay_server_info", file: !2, line: 46, size: 9728, elements: !236)
!236 = !{!237, !241, !305, !404, !405, !409, !410, !985, !991}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !235, file: !2, line: 48, baseType: !238, size: 8200)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8200, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 1025)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !235, file: !2, line: 49, baseType: !242, size: 224, offset: 8224)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !243, line: 48, baseType: !244)
!243 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !243, line: 44, size: 224, elements: !245)
!245 = !{!246, !258, !280}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !244, file: !243, line: 45, baseType: !247, size: 128)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !248, line: 180, size: 128, elements: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!249 = !{!250, !254}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !247, file: !248, line: 182, baseType: !251, size: 16)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !252, line: 28, baseType: !253)
!252 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!253 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !247, file: !248, line: 183, baseType: !255, size: 112, offset: 16)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 14)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !244, file: !243, line: 46, baseType: !259, size: 128)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !201, line: 245, size: 128, elements: !260)
!260 = !{!261, !262, !268, !275}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !259, file: !201, line: 247, baseType: !251, size: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !259, file: !201, line: 248, baseType: !263, size: 16, offset: 16)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !201, line: 123, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !265, line: 25, baseType: !266)
!265 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 40, baseType: !253)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !259, file: !201, line: 249, baseType: !269, size: 32, offset: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !201, line: 31, size: 32, elements: !270)
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !269, file: !201, line: 33, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !201, line: 30, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !265, line: 26, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !267, line: 42, baseType: !124)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !259, file: !201, line: 252, baseType: !276, size: 64, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 64, elements: !278)
!277 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!278 = !{!279}
!279 = !DISubrange(count: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !244, file: !243, line: 47, baseType: !281, size: 224)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !201, line: 260, size: 224, elements: !282)
!282 = !{!283, !284, !285, !286, !304}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !281, file: !201, line: 262, baseType: !251, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !281, file: !201, line: 263, baseType: !263, size: 16, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !281, file: !201, line: 264, baseType: !273, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !281, file: !201, line: 265, baseType: !287, size: 128, offset: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !201, line: 219, size: 128, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !287, file: !201, line: 226, baseType: !290, size: 128)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !201, line: 221, size: 128, elements: !291)
!291 = !{!292, !298, !300}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !290, file: !201, line: 223, baseType: !293, size: 128)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 128, elements: !296)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !265, line: 24, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !267, line: 38, baseType: !277)
!296 = !{!297}
!297 = !DISubrange(count: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !290, file: !201, line: 224, baseType: !299, size: 128)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 128, elements: !278)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !290, file: !201, line: 225, baseType: !301, size: 128)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 128, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 4)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !281, file: !201, line: 266, baseType: !273, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !235, file: !2, line: 50, baseType: !306, size: 64, offset: 8448)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !144, line: 120, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !144, line: 119, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !310, line: 135, size: 536064, elements: !311)
!310 = !DIFile(filename: "src/apps/relay/ns_ioalib_impl.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "39ae1828625a6763b6269ecb34869b6c")
!311 = !{!312, !317, !321, !323, !324, !329, !334, !363, !368, !369, !370, !371, !372, !373, !376, !379, !383, !385, !395, !396, !397, !398, !399, !401}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !309, file: !310, line: 137, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "super_memory_t", file: !315, line: 49, baseType: !316)
!315 = !DIFile(filename: "src/apps/relay/ns_sm.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "9025fd46a533d33a213551fd581f5b89")
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_super_memory", file: !315, line: 48, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !309, file: !310, line: 138, baseType: !318, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !320, line: 217, flags: DIFlagFwdDecl)
!320 = !DIFile(filename: "/usr/include/event2/event.h", directory: "", checksumkind: CSK_MD5, checksum: "90db4fa73456052afa8984291985dfd5")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate_eb", scope: !309, file: !310, line: 139, baseType: !322, size: 32, offset: 128)
!322 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !309, file: !310, line: 140, baseType: !322, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !309, file: !310, line: 141, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnipports", file: !327, line: 50, baseType: !328)
!327 = !DIFile(filename: "src/apps/relay/turn_ports.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "11983eef23ed630198ed333562550552")
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_turnipports", file: !327, line: 49, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "map_rtcp", scope: !309, file: !310, line: 142, baseType: !330, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !332, line: 46, baseType: !333)
!332 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !332, line: 45, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !309, file: !310, line: 143, baseType: !335, size: 128, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list", file: !310, line: 81, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list", file: !310, line: 78, size: 128, elements: !337)
!337 = !{!338, !362}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !336, file: !310, line: 79, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list_elem", file: !310, line: 76, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list_elem", file: !310, line: 73, size: 524288, elements: !342)
!342 = !{!343, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !310, line: 74, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !341, file: !310, line: 75, baseType: !346, size: 524224, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !347, line: 48, baseType: !348)
!347 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !347, line: 42, size: 524224, elements: !349)
!349 = !{!350, !352, !356, !360, !361}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !348, file: !347, line: 43, baseType: !351, size: 32)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 32, elements: !302)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !348, file: !347, line: 44, baseType: !353, size: 524056, offset: 32)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 524056, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 65507)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !348, file: !347, line: 45, baseType: !357, size: 64, offset: 524096)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 46, baseType: !359)
!358 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!359 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !348, file: !347, line: 46, baseType: !264, size: 16, offset: 524160)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !348, file: !347, line: 47, baseType: !294, size: 8, offset: 524176)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tsz", scope: !336, file: !310, line: 80, baseType: !357, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !309, file: !310, line: 144, baseType: !364, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !366, line: 185, baseType: !367)
!366 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !366, line: 185, flags: DIFlagFwdDecl)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !309, file: !310, line: 145, baseType: !364, size: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !309, file: !310, line: 147, baseType: !364, size: 64, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !309, file: !310, line: 149, baseType: !364, size: 64, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !309, file: !310, line: 153, baseType: !364, size: 64, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !309, file: !310, line: 156, baseType: !364, size: 64, offset: 768)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !309, file: !310, line: 158, baseType: !374, size: 32, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !375, line: 108, baseType: !273)
!375 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !309, file: !310, line: 159, baseType: !377, size: 64, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !144, line: 122, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg", scope: !309, file: !310, line: 160, baseType: !380, size: 524296, offset: 960)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 524296, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 65537)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timer_intervals", scope: !309, file: !310, line: 161, baseType: !384, size: 448, offset: 525280)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 448, elements: !256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timers", scope: !309, file: !310, line: 162, baseType: !386, size: 1792, offset: 525760)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1792, elements: !256)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !388, line: 8, size: 128, elements: !389)
!388 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!389 = !{!390, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !387, file: !388, line: 14, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !267, line: 160, baseType: !392)
!392 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !387, file: !388, line: 15, baseType: !394, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !267, line: 162, baseType: !392)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !309, file: !310, line: 164, baseType: !238, size: 8200, offset: 527552)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !309, file: !310, line: 165, baseType: !322, size: 32, offset: 535776)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !309, file: !310, line: 166, baseType: !357, size: 64, offset: 535808)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_counter", scope: !309, file: !310, line: 167, baseType: !357, size: 64, offset: 535872)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !309, file: !310, line: 168, baseType: !400, size: 64, offset: 535936)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rch", scope: !309, file: !310, line: 169, baseType: !402, size: 64, offset: 536000)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !403, line: 45, baseType: !378)
!403 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!404 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !235, file: !2, line: 51, baseType: !322, size: 32, offset: 8512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !235, file: !2, line: 52, baseType: !406, size: 64, offset: 8576)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "evconnlistener", file: !408, line: 69, flags: DIFlagFwdDecl)
!408 = !DIFile(filename: "src/apps/relay/turn_admin_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "72080e29702b34b58984e3ea957f1f4c")
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sctp_l", scope: !235, file: !2, line: 53, baseType: !406, size: 64, offset: 8640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !235, file: !2, line: 54, baseType: !411, size: 896, offset: 8704)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "message_to_relay", file: !310, line: 114, size: 896, elements: !412)
!412 = !{!413, !415, !962}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !411, file: !310, line: 115, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "MESSAGE_TO_RELAY_TYPE", file: !123, line: 76, baseType: !122)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "relay_server", scope: !411, file: !310, line: 116, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "relay_server", file: !310, line: 101, size: 4032, elements: !418)
!418 = !{!419, !421, !422, !423, !427, !428, !429, !430, !431, !959}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !417, file: !310, line: 102, baseType: !420, size: 8)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnserver_id", file: !123, line: 67, baseType: !294)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !417, file: !310, line: 103, baseType: !313, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !417, file: !310, line: 104, baseType: !318, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !417, file: !310, line: 105, baseType: !424, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferevent", file: !426, line: 113, flags: DIFlagFwdDecl)
!426 = !DIFile(filename: "/usr/include/event2/bufferevent.h", directory: "", checksumkind: CSK_MD5, checksum: "15bb43c26b2c9058b6c64d44779c7263")
!427 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !417, file: !310, line: 106, baseType: !424, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "auth_in_buf", scope: !417, file: !310, line: 107, baseType: !424, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "auth_out_buf", scope: !417, file: !310, line: 108, baseType: !424, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ioa_eng", scope: !417, file: !310, line: 109, baseType: !306, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !417, file: !310, line: 110, baseType: !432, size: 3456, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_turnserver", file: !123, line: 99, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_turnserver", file: !123, line: 111, size: 3456, elements: !434)
!434 = !{!435, !436, !441, !446, !447, !448, !449, !450, !451, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !466, !471, !477, !479, !806, !818, !823, !828, !829, !830, !831, !832, !889, !894, !895, !896, !897, !903, !917, !918, !919, !920, !921, !922, !943, !944, !945, !946, !947, !952, !953, !955, !956, !958}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !433, file: !123, line: 113, baseType: !420, size: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_counter", scope: !433, file: !123, line: 115, baseType: !437, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnsession_id", file: !438, line: 62, baseType: !439)
!438 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !265, line: 27, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !267, line: 45, baseType: !359)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sessions_map", scope: !433, file: !123, line: 116, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !444, line: 43, baseType: !445)
!444 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !444, line: 42, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !433, file: !123, line: 118, baseType: !374, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !433, file: !123, line: 120, baseType: !306, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !433, file: !123, line: 121, baseType: !322, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fingerprint", scope: !433, file: !123, line: 122, baseType: !322, size: 32, offset: 352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rfc5780", scope: !433, file: !123, line: 123, baseType: !322, size: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "check_origin", scope: !433, file: !123, line: 124, baseType: !452, size: 64, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "vintp", file: !375, line: 106, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !375, line: 105, baseType: !322)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "stale_nonce", scope: !433, file: !123, line: 125, baseType: !452, size: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "max_allocate_lifetime", scope: !433, file: !123, line: 126, baseType: !452, size: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "channel_lifetime", scope: !433, file: !123, line: 127, baseType: !452, size: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "permission_lifetime", scope: !433, file: !123, line: 128, baseType: !452, size: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "stun_only", scope: !433, file: !123, line: 129, baseType: !452, size: 64, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "no_stun", scope: !433, file: !123, line: 130, baseType: !452, size: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "no_software_attribute", scope: !433, file: !123, line: 131, baseType: !452, size: 64, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "web_admin_listen_on_workers", scope: !433, file: !123, line: 132, baseType: !452, size: 64, offset: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "secure_stun", scope: !433, file: !123, line: 133, baseType: !452, size: 64, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !433, file: !123, line: 134, baseType: !465, size: 32, offset: 1088)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_credential_type", file: !132, line: 59, baseType: !131)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "alt_addr_cb", scope: !433, file: !123, line: 135, baseType: !467, size: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_alt_addr_cb", file: !123, line: 59, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!322, !400, !400}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sm_cb", scope: !433, file: !123, line: 136, baseType: !472, size: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_message_cb", file: !123, line: 60, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!322, !306, !476, !400, !400}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !144, line: 124, baseType: !378)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dont_fragment", scope: !433, file: !123, line: 137, baseType: !478, size: 32, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "dont_fragment_option_t", file: !123, line: 96, baseType: !138)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !433, file: !123, line: 138, baseType: !480, size: 64, offset: 1344)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!322, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ts_ur_super_session", file: !144, line: 47, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ts_ur_super_session", file: !438, line: 68, size: 152448, elements: !486)
!486 = !{!487, !488, !489, !490, !626, !733, !734, !735, !736, !737, !741, !742, !746, !751, !752, !757, !758, !759, !760, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !803, !804, !805}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !485, file: !438, line: 69, baseType: !378, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !485, file: !438, line: 70, baseType: !437, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !485, file: !438, line: 71, baseType: !374, size: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "client_socket", scope: !485, file: !438, line: 72, baseType: !491, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket_handle", file: !144, line: 116, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_socket", file: !144, line: 115, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_socket", file: !310, line: 179, size: 2880, elements: !495)
!495 = !{!496, !497, !499, !500, !524, !525, !526, !527, !529, !531, !535, !536, !537, !538, !539, !540, !541, !542, !543, !546, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !578, !579, !610, !611, !616, !617, !618, !623, !624, !625}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !494, file: !310, line: 181, baseType: !322, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "parent_s", scope: !494, file: !310, line: 182, baseType: !498, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !494, file: !310, line: 183, baseType: !273, size: 32, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sockets_container", scope: !494, file: !310, line: 184, baseType: !501, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map", file: !444, line: 183, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_addr_map", file: !444, line: 177, size: 1441856, elements: !504)
!504 = !{!505, !523}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lists", scope: !503, file: !444, line: 178, baseType: !506, size: 1441792)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 1441792, elements: !521)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_list_header", file: !444, line: 175, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_list_header", file: !444, line: 171, size: 1408, elements: !509)
!509 = !{!510, !518, !520}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "main_list", scope: !508, file: !444, line: 172, baseType: !511, size: 1280)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 1280, elements: !302)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_elem", file: !444, line: 169, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_elem", file: !444, line: 166, size: 320, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !513, file: !444, line: 167, baseType: !242, size: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !513, file: !444, line: 168, baseType: !517, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_addr_map_value_type", file: !444, line: 161, baseType: !359)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "extra_list", scope: !508, file: !444, line: 173, baseType: !519, size: 64, offset: 1280)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !508, file: !444, line: 174, baseType: !357, size: 64, offset: 1344)
!521 = !{!522}
!522 = !DISubrange(count: 1024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !503, file: !444, line: 179, baseType: !439, size: 64, offset: 1441792)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !494, file: !310, line: 185, baseType: !424, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "defer_nbh", scope: !494, file: !310, line: 186, baseType: !476, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !494, file: !310, line: 187, baseType: !322, size: 32, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !494, file: !310, line: 188, baseType: !528, size: 32, offset: 416)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_TYPE", file: !144, line: 98, baseType: !143)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !494, file: !310, line: 189, baseType: !530, size: 32, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_APP_TYPE", file: !144, line: 112, baseType: !156)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !494, file: !310, line: 190, baseType: !532, size: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !366, line: 184, baseType: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !366, line: 184, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegs", scope: !494, file: !310, line: 191, baseType: !273, size: 32, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "in_write", scope: !494, file: !310, line: 192, baseType: !322, size: 32, offset: 608)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !494, file: !310, line: 193, baseType: !322, size: 32, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_known", scope: !494, file: !310, line: 194, baseType: !322, size: 32, offset: 672)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr", scope: !494, file: !310, line: 195, baseType: !242, size: 224, offset: 704)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !494, file: !310, line: 196, baseType: !322, size: 32, offset: 928)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr", scope: !494, file: !310, line: 197, baseType: !242, size: 224, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !494, file: !310, line: 198, baseType: !306, size: 64, offset: 1216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "read_event", scope: !494, file: !310, line: 199, baseType: !544, size: 64, offset: 1280)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !320, line: 276, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "read_cb", scope: !494, file: !310, line: 200, baseType: !547, size: 64, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_event_handler", file: !144, line: 199, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !491, !322, !551, !378, !322}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_net_data", file: !144, line: 132, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_net_data", file: !144, line: 127, size: 384, elements: !554)
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !553, file: !144, line: 128, baseType: !242, size: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nbh", scope: !553, file: !144, line: 129, baseType: !476, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "recv_ttl", scope: !553, file: !144, line: 130, baseType: !322, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "recv_tos", scope: !553, file: !144, line: 131, baseType: !322, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "read_ctx", scope: !494, file: !310, line: 201, baseType: !378, size: 64, offset: 1408)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !494, file: !310, line: 202, baseType: !322, size: 32, offset: 1472)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !494, file: !310, line: 203, baseType: !483, size: 64, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "current_df_relay_flag", scope: !494, file: !310, line: 204, baseType: !322, size: 32, offset: 1600)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_use_df", scope: !494, file: !310, line: 206, baseType: !322, size: 32, offset: 1632)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tobeclosed", scope: !494, file: !310, line: 207, baseType: !322, size: 32, offset: 1664)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "broken", scope: !494, file: !310, line: 208, baseType: !322, size: 32, offset: 1696)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "default_ttl", scope: !494, file: !310, line: 209, baseType: !322, size: 32, offset: 1728)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "current_ttl", scope: !494, file: !310, line: 210, baseType: !322, size: 32, offset: 1760)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "default_tos", scope: !494, file: !310, line: 211, baseType: !322, size: 32, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "current_tos", scope: !494, file: !310, line: 212, baseType: !322, size: 32, offset: 1824)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !494, file: !310, line: 213, baseType: !335, size: 128, offset: 1856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !494, file: !310, line: 214, baseType: !374, size: 32, offset: 1984)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data_traffic", scope: !494, file: !310, line: 215, baseType: !573, size: 128, offset: 2048)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "traffic_bytes", file: !310, line: 174, size: 128, elements: !574)
!574 = !{!575, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_read", scope: !573, file: !310, line: 175, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !132, line: 67, baseType: !359)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie_bytes_write", scope: !573, file: !310, line: 176, baseType: !576, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "control_traffic", scope: !494, file: !310, line: 216, baseType: !573, size: 128, offset: 2176)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sub_session", scope: !494, file: !310, line: 219, baseType: !580, size: 64, offset: 2304)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection", file: !144, line: 50, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection", file: !168, line: 85, size: 960, elements: !583)
!583 = !{!584, !586, !588, !589, !590, !591, !592, !593, !601, !602, !603}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !582, file: !168, line: 87, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "TC_STATE", file: !168, line: 76, baseType: !167)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !582, file: !168, line: 88, baseType: !587, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_id", file: !168, line: 78, baseType: !273)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !582, file: !168, line: 89, baseType: !242, size: 224, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "client_s", scope: !582, file: !168, line: 90, baseType: !491, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "peer_s", scope: !582, file: !168, line: 91, baseType: !491, size: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "peer_conn_timeout", scope: !582, file: !168, line: 92, baseType: !377, size: 64, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bind_timeout", scope: !582, file: !168, line: 93, baseType: !377, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !582, file: !168, line: 94, baseType: !594, size: 96, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_tid", file: !132, line: 52, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 47, size: 96, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tsx_id", scope: !595, file: !132, line: 51, baseType: !598, size: 96)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 96, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 12)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !582, file: !168, line: 95, baseType: !378, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !582, file: !168, line: 96, baseType: !322, size: 32, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ub_to_client", scope: !582, file: !168, line: 97, baseType: !604, size: 128, offset: 832)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "unsent_buffer", file: !168, line: 83, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 80, size: 128, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !605, file: !168, line: 81, baseType: !357, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !605, file: !168, line: 82, baseType: !609, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "conn_bev", scope: !494, file: !310, line: 221, baseType: !424, size: 64, offset: 2368)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "conn_cb", scope: !494, file: !310, line: 222, baseType: !612, size: 64, offset: 2432)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "connect_cb", file: !144, line: 135, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !322, !378}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "conn_arg", scope: !494, file: !310, line: 223, baseType: !378, size: 64, offset: 2496)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "list_ev", scope: !494, file: !310, line: 225, baseType: !406, size: 64, offset: 2560)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "acb", scope: !494, file: !310, line: 226, baseType: !619, size: 64, offset: 2624)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "accept_cb", file: !144, line: 137, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !491, !378}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "acbarg", scope: !494, file: !310, line: 227, baseType: !378, size: 64, offset: 2688)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "special_session", scope: !494, file: !310, line: 229, baseType: !378, size: 64, offset: 2752)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "special_session_size", scope: !494, file: !310, line: 230, baseType: !357, size: 64, offset: 2816)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !485, file: !438, line: 73, baseType: !627, size: 141120, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocation", file: !168, line: 186, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_allocation", file: !168, line: 176, size: 141120, elements: !629)
!629 = !{!630, !631, !632, !686, !696, !698, !724, !725, !726}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "is_valid", scope: !628, file: !168, line: 177, baseType: !322, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !628, file: !168, line: 178, baseType: !594, size: 96, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "addr_to_perm", scope: !628, file: !168, line: 179, baseType: !633, size: 125440, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_hashtable", file: !168, line: 166, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_hashtable", file: !168, line: 164, size: 125440, elements: !635)
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !634, file: !168, line: 165, baseType: !637, size: 125440)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 125440, elements: !278)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_array", file: !168, line: 162, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_array", file: !168, line: 158, size: 15680, elements: !640)
!640 = !{!641, !682, !683}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "main_slots", scope: !639, file: !168, line: 159, baseType: !642, size: 15552)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 15552, elements: !663)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_slot", file: !168, line: 156, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_slot", file: !168, line: 154, size: 5184, elements: !645)
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !644, file: !168, line: 155, baseType: !647, size: 5184)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_permission_info", file: !168, line: 152, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_permission_info", file: !168, line: 143, size: 5184, elements: !649)
!649 = !{!650, !651, !675, !676, !677, !678, !679, !680}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !648, file: !168, line: 144, baseType: !322, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !648, file: !168, line: 145, baseType: !652, size: 4608, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map", file: !444, line: 117, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map", file: !444, line: 115, size: 4608, elements: !654)
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !653, file: !444, line: 116, baseType: !656, size: 4608)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 4608, elements: !278)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "lm_map_array", file: !444, line: 113, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_lm_map_array", file: !444, line: 107, size: 576, elements: !659)
!659 = !{!660, !665, !668, !669, !672}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "main_keys", scope: !658, file: !444, line: 108, baseType: !661, size: 192)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 192, elements: !663)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !444, line: 47, baseType: !439)
!663 = !{!664}
!664 = !DISubrange(count: 3)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "main_values", scope: !658, file: !444, line: 109, baseType: !666, size: 192, offset: 192)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 192, elements: !663)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !444, line: 48, baseType: !359)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !658, file: !444, line: 110, baseType: !357, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "extra_keys", scope: !658, file: !444, line: 111, baseType: !670, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !658, file: !444, line: 112, baseType: !673, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !648, file: !168, line: 146, baseType: !242, size: 224, offset: 4672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !648, file: !168, line: 147, baseType: !374, size: 32, offset: 4896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !648, file: !168, line: 148, baseType: !377, size: 64, offset: 4928)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !648, file: !168, line: 149, baseType: !378, size: 64, offset: 4992)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !648, file: !168, line: 150, baseType: !322, size: 32, offset: 5056)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !648, file: !168, line: 151, baseType: !681, size: 64, offset: 5120)
!681 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !639, file: !168, line: 160, baseType: !357, size: 64, offset: 15552)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slots", scope: !639, file: !168, line: 161, baseType: !684, size: 64, offset: 15616)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions", scope: !628, file: !168, line: 180, baseType: !687, size: 384, offset: 125568)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 384, elements: !694)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "relay_endpoint_session", file: !168, line: 55, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 50, size: 192, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !689, file: !168, line: 52, baseType: !491, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !689, file: !168, line: 53, baseType: !374, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !689, file: !168, line: 54, baseType: !377, size: 64, offset: 128)
!694 = !{!695}
!695 = !DISubrange(count: 2)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "relay_sessions_failure", scope: !628, file: !168, line: 181, baseType: !697, size: 64, offset: 125952)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 64, elements: !694)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "chns", scope: !628, file: !168, line: 182, baseType: !699, size: 14848, offset: 126016)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map", file: !168, line: 136, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_map", file: !168, line: 134, size: 14848, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !700, file: !168, line: 135, baseType: !703, size: 14848)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 14848, elements: !278)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_map_array", file: !168, line: 132, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chn_map_array", file: !168, line: 128, size: 1856, elements: !706)
!706 = !{!707, !720, !721}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "main_chns", scope: !705, file: !168, line: 129, baseType: !708, size: 1728)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 1728, elements: !663)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ch_info", file: !168, line: 121, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ch_info", file: !168, line: 112, size: 576, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "chnum", scope: !710, file: !168, line: 113, baseType: !264, size: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !710, file: !168, line: 114, baseType: !322, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !710, file: !168, line: 115, baseType: !264, size: 16, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "peer_addr", scope: !710, file: !168, line: 116, baseType: !242, size: 224, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !710, file: !168, line: 117, baseType: !374, size: 32, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime_ev", scope: !710, file: !168, line: 118, baseType: !377, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !710, file: !168, line: 119, baseType: !378, size: 64, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_channel", scope: !710, file: !168, line: 120, baseType: !378, size: 64, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "extra_sz", scope: !705, file: !168, line: 130, baseType: !357, size: 64, offset: 1728)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "extra_chns", scope: !705, file: !168, line: 131, baseType: !722, size: 64, offset: 1792)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !628, file: !168, line: 183, baseType: !378, size: 64, offset: 140864)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_connections", scope: !628, file: !168, line: 184, baseType: !442, size: 64, offset: 140928)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tcs", scope: !628, file: !168, line: 185, baseType: !727, size: 128, offset: 140992)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_connection_list", file: !168, line: 103, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tcp_connection_list", file: !168, line: 100, size: 128, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !728, file: !168, line: 101, baseType: !357, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !728, file: !168, line: 102, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_allocated_timeout_ev", scope: !485, file: !438, line: 74, baseType: !377, size: 64, offset: 141376)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !485, file: !438, line: 75, baseType: !322, size: 32, offset: 141440)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "is_tcp_relay", scope: !485, file: !438, line: 76, baseType: !322, size: 32, offset: 141472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "to_be_closed", scope: !485, file: !438, line: 77, baseType: !322, size: 32, offset: 141504)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !485, file: !438, line: 79, baseType: !738, size: 136, offset: 141536)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 136, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 17)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_expiration_time", scope: !485, file: !438, line: 80, baseType: !374, size: 32, offset: 141696)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !485, file: !438, line: 81, baseType: !743, size: 4104, offset: 141728)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 4104, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 513)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey", scope: !485, file: !438, line: 82, baseType: !747, size: 512, offset: 145832)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !132, line: 64, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 512, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "hmackey_set", scope: !485, file: !438, line: 83, baseType: !322, size: 32, offset: 146368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !485, file: !438, line: 84, baseType: !753, size: 2056, offset: 146400)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !132, line: 66, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 2056, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 257)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "quota_used", scope: !485, file: !438, line: 85, baseType: !322, size: 32, offset: 148480)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !485, file: !438, line: 86, baseType: !322, size: 32, offset: 148512)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "max_session_time_auth", scope: !485, file: !438, line: 87, baseType: !374, size: 32, offset: 148544)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "realm_options", scope: !485, file: !438, line: 89, baseType: !761, size: 1152, offset: 148608)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !144, line: 142, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !438, line: 53, size: 1152, elements: !763)
!763 = !{!764, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !762, file: !438, line: 55, baseType: !765, size: 1024)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !762, file: !438, line: 57, baseType: !769, size: 128, offset: 1024)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !438, line: 51, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !438, line: 45, size: 128, elements: !771)
!771 = !{!772, !774, !775}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !770, file: !438, line: 47, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !770, file: !438, line: 48, baseType: !454, size: 32, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !770, file: !438, line: 49, baseType: !454, size: 32, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "origin_set", scope: !485, file: !438, line: 90, baseType: !322, size: 32, offset: 149760)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !485, file: !438, line: 91, baseType: !765, size: 1024, offset: 149792)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !485, file: !438, line: 93, baseType: !273, size: 32, offset: 150816)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !485, file: !438, line: 94, baseType: !273, size: 32, offset: 150848)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !485, file: !438, line: 95, baseType: !273, size: 32, offset: 150880)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !485, file: !438, line: 96, baseType: !273, size: 32, offset: 150912)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_packets", scope: !485, file: !438, line: 97, baseType: !439, size: 64, offset: 150976)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_packets", scope: !485, file: !438, line: 98, baseType: !439, size: 64, offset: 151040)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "t_received_bytes", scope: !485, file: !438, line: 99, baseType: !439, size: 64, offset: 151104)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "t_sent_bytes", scope: !485, file: !438, line: 100, baseType: !439, size: 64, offset: 151168)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !485, file: !438, line: 101, baseType: !439, size: 64, offset: 151232)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !485, file: !438, line: 102, baseType: !357, size: 64, offset: 151296)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !485, file: !438, line: 103, baseType: !357, size: 64, offset: 151360)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !485, file: !438, line: 104, baseType: !273, size: 32, offset: 151424)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !485, file: !438, line: 105, baseType: !273, size: 32, offset: 151456)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !485, file: !438, line: 106, baseType: !273, size: 32, offset: 151488)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !485, file: !438, line: 107, baseType: !273, size: 32, offset: 151520)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_packets", scope: !485, file: !438, line: 108, baseType: !273, size: 32, offset: 151552)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_packets", scope: !485, file: !438, line: 109, baseType: !273, size: 32, offset: 151584)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_received_bytes", scope: !485, file: !438, line: 110, baseType: !273, size: 32, offset: 151616)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "t_peer_sent_bytes", scope: !485, file: !438, line: 111, baseType: !273, size: 32, offset: 151648)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !485, file: !438, line: 112, baseType: !439, size: 64, offset: 151680)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !485, file: !438, line: 113, baseType: !357, size: 64, offset: 151744)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !485, file: !438, line: 114, baseType: !357, size: 64, offset: 151808)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !485, file: !438, line: 116, baseType: !322, size: 32, offset: 151872)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_id", scope: !485, file: !438, line: 117, baseType: !802, size: 64, offset: 151936)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "mobile_id_t", file: !438, line: 66, baseType: !439)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "old_mobile_id", scope: !485, file: !438, line: 118, baseType: !802, size: 64, offset: 152000)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "s_mobile_id", scope: !485, file: !438, line: 119, baseType: !80, size: 264, offset: 152064)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !485, file: !438, line: 121, baseType: !576, size: 64, offset: 152384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "userkeycb", scope: !433, file: !123, line: 139, baseType: !807, size: 64, offset: 1408)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_user_key_cb", file: !123, line: 102, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!811, !420, !465, !322, !812, !811, !811, !813, !551, !439, !812}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_username_resume_cb", file: !123, line: 101, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !322, !322, !322, !811, !811, !817, !439, !551, !811}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "chquotacb", scope: !433, file: !123, line: 140, baseType: !819, size: 64, offset: 1472)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "check_new_allocation_quota_cb", file: !123, line: 103, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{!322, !811, !322, !811}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "raqcb", scope: !433, file: !123, line: 141, baseType: !824, size: 64, offset: 1536)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "release_allocation_quota_cb", file: !123, line: 104, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !811, !322, !811}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip_set", scope: !433, file: !123, line: 142, baseType: !322, size: 32, offset: 1600)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "external_ip", scope: !433, file: !123, line: 143, baseType: !242, size: 224, offset: 1632)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "allow_loopback_peers", scope: !433, file: !123, line: 144, baseType: !452, size: 64, offset: 1856)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "no_multicast_peers", scope: !433, file: !123, line: 145, baseType: !452, size: 64, offset: 1920)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "send_turn_session_info", scope: !433, file: !123, line: 146, baseType: !833, size: 64, offset: 1984)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_turn_session_info_cb", file: !123, line: 106, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!322, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "turn_session_info", file: !438, line: 134, size: 15040, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !848, !852, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !882, !883, !885, !886, !887, !888}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !838, file: !438, line: 135, baseType: !437, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !838, file: !438, line: 136, baseType: !322, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !838, file: !438, line: 137, baseType: !374, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !838, file: !438, line: 138, baseType: !374, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !838, file: !438, line: 139, baseType: !528, size: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "peer_protocol", scope: !838, file: !438, line: 140, baseType: !528, size: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tls_method", scope: !838, file: !438, line: 141, baseType: !847, size: 136, offset: 224)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !739)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cipher", scope: !838, file: !438, line: 142, baseType: !849, size: 520, offset: 360)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 65)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_data", scope: !838, file: !438, line: 143, baseType: !853, size: 768, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_data", file: !438, line: 132, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_data", file: !438, line: 129, size: 768, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !854, file: !438, line: 130, baseType: !242, size: 224)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !854, file: !438, line: 131, baseType: !849, size: 520, offset: 224)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr_data", scope: !838, file: !438, line: 144, baseType: !853, size: 768, offset: 1664)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv4", scope: !838, file: !438, line: 145, baseType: !853, size: 768, offset: 2432)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv6", scope: !838, file: !438, line: 146, baseType: !853, size: 768, offset: 3200)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !838, file: !438, line: 147, baseType: !743, size: 4104, offset: 3968)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !838, file: !438, line: 148, baseType: !322, size: 32, offset: 8096)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !838, file: !438, line: 150, baseType: !439, size: 64, offset: 8128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !838, file: !438, line: 151, baseType: !439, size: 64, offset: 8192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !838, file: !438, line: 152, baseType: !439, size: 64, offset: 8256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !838, file: !438, line: 153, baseType: !439, size: 64, offset: 8320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !838, file: !438, line: 154, baseType: !273, size: 32, offset: 8384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !838, file: !438, line: 155, baseType: !273, size: 32, offset: 8416)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !838, file: !438, line: 156, baseType: !273, size: 32, offset: 8448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !838, file: !438, line: 157, baseType: !439, size: 64, offset: 8512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !838, file: !438, line: 158, baseType: !439, size: 64, offset: 8576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !838, file: !438, line: 159, baseType: !439, size: 64, offset: 8640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !838, file: !438, line: 160, baseType: !439, size: 64, offset: 8704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !838, file: !438, line: 161, baseType: !273, size: 32, offset: 8768)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !838, file: !438, line: 162, baseType: !273, size: 32, offset: 8800)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !838, file: !438, line: 163, baseType: !273, size: 32, offset: 8832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !838, file: !438, line: 165, baseType: !322, size: 32, offset: 8864)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_data", scope: !838, file: !438, line: 167, baseType: !879, size: 3840, offset: 8896)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 3840, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 5)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_size", scope: !838, file: !438, line: 168, baseType: !357, size: 64, offset: 12736)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_data", scope: !838, file: !438, line: 169, baseType: !884, size: 64, offset: 12800)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_size", scope: !838, file: !438, line: 170, baseType: !357, size: 64, offset: 12864)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !838, file: !438, line: 172, baseType: !765, size: 1024, offset: 12928)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !838, file: !438, line: 173, baseType: !765, size: 1024, offset: 13952)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !838, file: !438, line: 175, baseType: !576, size: 64, offset: 14976)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "send_https_socket", scope: !433, file: !123, line: 147, baseType: !890, size: 64, offset: 2048)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_https_socket_cb", file: !123, line: 107, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !491}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "no_udp_relay", scope: !433, file: !123, line: 150, baseType: !452, size: 64, offset: 2112)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "no_tcp_relay", scope: !433, file: !123, line: 151, baseType: !452, size: 64, offset: 2176)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_relay_connections", scope: !433, file: !123, line: 152, baseType: !442, size: 64, offset: 2240)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "send_socket_to_relay", scope: !433, file: !123, line: 153, baseType: !898, size: 64, offset: 2304)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "send_socket_to_relay_cb", file: !123, line: 105, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!322, !420, !439, !902, !491, !322, !414, !551, !322}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_servers_list", scope: !433, file: !123, line: 157, baseType: !904, size: 64, offset: 2368)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_server_addrs_list_t", file: !123, line: 53, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_server_addrs_list", file: !123, line: 47, size: 256, elements: !907)
!907 = !{!908, !909, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !906, file: !123, line: 48, baseType: !400, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !906, file: !123, line: 49, baseType: !910, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !906, file: !123, line: 50, baseType: !912, size: 128, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_mutex", file: !144, line: 60, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_mutex", file: !144, line: 55, size: 128, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !913, file: !144, line: 56, baseType: !273, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !913, file: !144, line: 57, baseType: !378, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "as_counter", scope: !433, file: !123, line: 158, baseType: !357, size: 64, offset: 2432)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tls_alternate_servers_list", scope: !433, file: !123, line: 159, baseType: !904, size: 64, offset: 2496)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tls_as_counter", scope: !433, file: !123, line: 160, baseType: !357, size: 64, offset: 2560)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "aux_servers_list", scope: !433, file: !123, line: 161, baseType: !904, size: 64, offset: 2624)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "self_udp_balance", scope: !433, file: !123, line: 162, baseType: !322, size: 32, offset: 2688)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ip_whitelist", scope: !433, file: !123, line: 165, baseType: !923, size: 64, offset: 2752)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !144, line: 159, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !144, line: 154, size: 128, elements: !926)
!926 = !{!927, !942}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !925, file: !144, line: 155, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !144, line: 152, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !144, line: 146, size: 6624, elements: !931)
!931 = !{!932, !934, !936}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !930, file: !144, line: 147, baseType: !933, size: 2056)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2056, elements: !755)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !930, file: !144, line: 148, baseType: !935, size: 4104, offset: 2056)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4104, elements: !744)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !930, file: !144, line: 149, baseType: !937, size: 448, offset: 6176)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !243, line: 53, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 50, size: 448, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !938, file: !243, line: 51, baseType: !242, size: 224)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !938, file: !243, line: 52, baseType: !242, size: 224, offset: 224)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !925, file: !144, line: 156, baseType: !357, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ip_blacklist", scope: !433, file: !123, line: 166, baseType: !923, size: 64, offset: 2816)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mobility", scope: !433, file: !123, line: 169, baseType: !452, size: 64, offset: 2880)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mobile_connections_map", scope: !433, file: !123, line: 170, baseType: !442, size: 64, offset: 2944)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "server_relay", scope: !433, file: !123, line: 173, baseType: !322, size: 32, offset: 3008)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_bps_func", scope: !433, file: !123, line: 176, baseType: !948, size: 64, offset: 3072)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocate_bps_cb", file: !123, line: 109, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!576, !576, !322}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "oauth", scope: !433, file: !123, line: 179, baseType: !322, size: 32, offset: 3136)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "oauth_server_name", scope: !433, file: !123, line: 180, baseType: !954, size: 64, offset: 3200)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "acme_redirect", scope: !433, file: !123, line: 183, baseType: !954, size: 64, offset: 3264)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "allocation_default_address_family", scope: !433, file: !123, line: 186, baseType: !957, size: 32, offset: 3328)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !123, line: 84, baseType: !176)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "log_binding", scope: !433, file: !123, line: 189, baseType: !452, size: 64, offset: 3392)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !417, file: !310, line: 111, baseType: !960, size: 64, offset: 3968)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !961, line: 27, baseType: !359)
!961 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!962 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !411, file: !310, line: 121, baseType: !963, size: 768, offset: 128)
!963 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !411, file: !310, line: 117, size: 768, elements: !964)
!964 = !{!965, !971, !981}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !963, file: !310, line: 118, baseType: !966, size: 512)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "socket_message", file: !123, line: 86, size: 512, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !966, file: !123, line: 87, baseType: !491, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !966, file: !123, line: 88, baseType: !552, size: 384, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "can_resume", scope: !966, file: !123, line: 89, baseType: !322, size: 32, offset: 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cb_sm", scope: !963, file: !310, line: 119, baseType: !972, size: 768)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cb_socket_message", file: !310, line: 87, size: 768, elements: !973)
!973 = !{!974, !975, !976, !977, !978, !979, !980}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !972, file: !310, line: 88, baseType: !420, size: 8)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "connection_id", scope: !972, file: !310, line: 89, baseType: !587, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !972, file: !310, line: 90, baseType: !594, size: 96, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !972, file: !310, line: 91, baseType: !491, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "message_integrity", scope: !972, file: !310, line: 92, baseType: !322, size: 32, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !972, file: !310, line: 93, baseType: !552, size: 384, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "can_resume", scope: !972, file: !310, line: 94, baseType: !322, size: 32, offset: 704)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "csm", scope: !963, file: !310, line: 120, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cancelled_session_message", file: !310, line: 97, size: 64, elements: !983)
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !982, file: !310, line: 98, baseType: !437, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "connect_cb", scope: !235, file: !2, line: 55, baseType: !986, size: 64, offset: 9600)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_new_connection_event_handler", file: !310, line: 127, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!322, !306, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "relay_server", scope: !235, file: !2, line: 56, baseType: !416, size: 64, offset: 9664)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!996 = !{!0, !7, !13, !18, !23, !28, !33, !38, !43, !48, !53, !58, !63, !68, !73, !78, !83, !88, !93, !98, !101, !103, !108, !110, !115, !117}
!997 = !{i32 7, !"Dwarf Version", i32 5}
!998 = !{i32 2, !"Debug Info Version", i32 3}
!999 = !{i32 1, !"wchar_size", i32 4}
!1000 = !{i32 8, !"PIC Level", i32 2}
!1001 = !{i32 7, !"PIE Level", i32 2}
!1002 = !{i32 7, !"uwtable", i32 2}
!1003 = !{i32 7, !"frame-pointer", i32 2}
!1004 = !{!"clang version 16.0.0"}
!1005 = distinct !DISubprogram(name: "create_tls_listener_server", scope: !2, file: !2, line: 346, type: !1006, scopeLine: 351, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !119, retainedNodes: !1008)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!232, !954, !954, !322, !322, !306, !986, !416}
!1008 = !{}
!1009 = !DILocalVariable(name: "ifname", arg: 1, scope: !1005, file: !2, line: 346, type: !954)
!1010 = !DILocation(line: 346, column: 72, scope: !1005)
!1011 = !DILocalVariable(name: "local_address", arg: 2, scope: !1005, file: !2, line: 347, type: !954)
!1012 = !DILocation(line: 347, column: 17, scope: !1005)
!1013 = !DILocalVariable(name: "port", arg: 3, scope: !1005, file: !2, line: 347, type: !322)
!1014 = !DILocation(line: 347, column: 36, scope: !1005)
!1015 = !DILocalVariable(name: "verbose", arg: 4, scope: !1005, file: !2, line: 347, type: !322)
!1016 = !DILocation(line: 347, column: 46, scope: !1005)
!1017 = !DILocalVariable(name: "e", arg: 5, scope: !1005, file: !2, line: 348, type: !306)
!1018 = !DILocation(line: 348, column: 23, scope: !1005)
!1019 = !DILocalVariable(name: "send_socket", arg: 6, scope: !1005, file: !2, line: 349, type: !986)
!1020 = !DILocation(line: 349, column: 45, scope: !1005)
!1021 = !DILocalVariable(name: "relay_server", arg: 7, scope: !1005, file: !2, line: 350, type: !416)
!1022 = !DILocation(line: 350, column: 26, scope: !1005)
!1023 = !DILocalVariable(name: "server", scope: !1005, file: !2, line: 353, type: !232)
!1024 = !DILocation(line: 353, column: 34, scope: !1005)
!1025 = !DILocation(line: 354, column: 38, scope: !1005)
!1026 = !DILocation(line: 356, column: 18, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1005, file: !2, line: 356, column: 6)
!1028 = !DILocation(line: 356, column: 26, scope: !1027)
!1029 = !DILocation(line: 356, column: 34, scope: !1027)
!1030 = !DILocation(line: 356, column: 49, scope: !1027)
!1031 = !DILocation(line: 356, column: 55, scope: !1027)
!1032 = !DILocation(line: 356, column: 64, scope: !1027)
!1033 = !DILocation(line: 357, column: 4, scope: !1027)
!1034 = !DILocation(line: 357, column: 17, scope: !1027)
!1035 = !DILocation(line: 356, column: 6, scope: !1027)
!1036 = !DILocation(line: 357, column: 31, scope: !1027)
!1037 = !DILocation(line: 356, column: 6, scope: !1005)
!1038 = !DILocation(line: 358, column: 3, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 357, column: 36)
!1040 = !DILocation(line: 360, column: 10, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 359, column: 9)
!1042 = !DILocation(line: 360, column: 3, scope: !1041)
!1043 = !DILocation(line: 362, column: 1, scope: !1005)
!1044 = distinct !DISubprogram(name: "init_server", scope: !2, file: !2, line: 311, type: !1045, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !119, retainedNodes: !1008)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!322, !232, !954, !954, !322, !322, !306, !986, !416}
!1047 = !DILocalVariable(name: "server", arg: 1, scope: !1044, file: !2, line: 311, type: !232)
