; ModuleID = '/home/raj/coturn/src/apps/relay/turn_admin_server.c'
source_filename = "/home/raj/coturn/src/apps/relay/turn_admin_server.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }
%struct.listener_server = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i64, i64, ptr, ptr, ptr }
%struct._ip_range_list = type { ptr, i64 }

!155 = !DIFile(filename: "src/apps/relay/userdb.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "ef7aa3b34af7515d3cf1275f8bfd0947")
!156 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!157 = !{!158, !159, !160, !161, !162, !163}
!158 = !DIEnumerator(name: "TURN_USERDB_TYPE_UNKNOWN", value: -1)
!159 = !DIEnumerator(name: "TURN_USERDB_TYPE_SQLITE", value: 0)
!160 = !DIEnumerator(name: "TURN_USERDB_TYPE_PQ", value: 1)
!161 = !DIEnumerator(name: "TURN_USERDB_TYPE_MYSQL", value: 2)
!162 = !DIEnumerator(name: "TURN_USERDB_TYPE_MONGO", value: 3)
!163 = !DIEnumerator(name: "TURN_USERDB_TYPE_REDIS", value: 4)
!164 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "bufferevent_flush_mode", file: !14, line: 598, baseType: !7, size: 32, elements: !165)
!165 = !{!166, !167, !168}
!166 = !DIEnumerator(name: "BEV_NORMAL", value: 0)
!167 = !DIEnumerator(name: "BEV_FLUSH", value: 1)
!168 = !DIEnumerator(name: "BEV_FINISHED", value: 2)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_HTTP_REQUEST_TYPE", file: !170, line: 47, baseType: !7, size: 32, elements: !171)
!170 = !DIFile(filename: "src/apps/relay/http_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "87bf7bb31da00743240048b59ab9f531")
!171 = !{!172, !173, !174, !175, !176, !177}
!172 = !DIEnumerator(name: "HRT_UNKNOWN", value: 0)
!173 = !DIEnumerator(name: "HRT_GET", value: 1)
!174 = !DIEnumerator(name: "HRT_HEAD", value: 2)
!175 = !DIEnumerator(name: "HRT_POST", value: 3)
!176 = !DIEnumerator(name: "HRT_PUT", value: 4)
!177 = !DIEnumerator(name: "HRT_DELETE", value: 5)
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_AS_FORM", file: !179, line: 1476, baseType: !7, size: 32, elements: !180)
!179 = !DIFile(filename: "src/apps/relay/turn_admin_server.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "dd2f8149dd56108b29bfe313ce85a315")
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193}
!181 = !DIEnumerator(name: "AS_FORM_LOGON", value: 0)
!182 = !DIEnumerator(name: "AS_FORM_LOGOUT", value: 1)
!183 = !DIEnumerator(name: "AS_FORM_PC", value: 2)
!184 = !DIEnumerator(name: "AS_FORM_HOME", value: 3)
!185 = !DIEnumerator(name: "AS_FORM_TOGGLE", value: 4)
!186 = !DIEnumerator(name: "AS_FORM_UPDATE", value: 5)
!187 = !DIEnumerator(name: "AS_FORM_PS", value: 6)
!188 = !DIEnumerator(name: "AS_FORM_USERS", value: 7)
!189 = !DIEnumerator(name: "AS_FORM_SS", value: 8)
!190 = !DIEnumerator(name: "AS_FORM_OS", value: 9)
!191 = !DIEnumerator(name: "AS_FORM_OAUTH", value: 10)
!192 = !DIEnumerator(name: "AS_FORM_OAUTH_SHOW_KEYS", value: 11)
!193 = !DIEnumerator(name: "AS_FORM_UNKNOWN", value: 12)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SHATYPE", file: !195, line: 160, baseType: !156, size: 32, elements: !196)
!195 = !DIFile(filename: "src/client/ns_turn_msg_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "4d8c44ae9e82b7a50b86805787352690")
!196 = !{!197, !198, !199, !200, !201, !202}
!197 = !DIEnumerator(name: "SHATYPE_ERROR", value: -1)
!198 = !DIEnumerator(name: "SHATYPE_DEFAULT", value: 0)
!199 = !DIEnumerator(name: "SHATYPE_SHA1", value: 0)
!200 = !DIEnumerator(name: "SHATYPE_SHA256", value: 1)
!201 = !DIEnumerator(name: "SHATYPE_SHA384", value: 2)
!202 = !DIEnumerator(name: "SHATYPE_SHA512", value: 3)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENC_ALG", file: !195, line: 177, baseType: !156, size: 32, elements: !204)
!204 = !{!205, !206, !207, !208, !209}
!205 = !DIEnumerator(name: "ENC_ALG_ERROR", value: -1)
!206 = !DIEnumerator(name: "ENC_ALG_DEFAULT", value: 0)
!207 = !DIEnumerator(name: "A256GCM", value: 0)
!208 = !DIEnumerator(name: "A128GCM", value: 1)
!209 = !DIEnumerator(name: "ENC_ALG_NUM", value: 2)
!210 = !{!211, !218, !219, !220, !350, !352, !353, !156, !354, !355, !356, !455, !7, !228, !231, !457, !461, !476, !477, !472, !474, !338, !478, !479, !349, !225, !233, !226, !482, !494}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !214, line: 24, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !216, line: 38, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!217 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "turn_session_info", file: !222, line: 134, size: 15040, elements: !223)
!222 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!223 = !{!224, !229, !230, !235, !236, !238, !239, !244, !248, !310, !311, !312, !313, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !337, !340, !342, !343, !347, !348}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !221, file: !222, line: 135, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnsession_id", file: !222, line: 62, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !214, line: 27, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !216, line: 45, baseType: !228)
!228 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !221, file: !222, line: 136, baseType: !156, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !221, file: !222, line: 137, baseType: !231, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !232, line: 108, baseType: !233)
!232 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !214, line: 26, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !216, line: 42, baseType: !7)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "expiration_time", scope: !221, file: !222, line: 138, baseType: !231, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !221, file: !222, line: 139, baseType: !237, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET_TYPE", file: !64, line: 98, baseType: !63)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "peer_protocol", scope: !221, file: !222, line: 140, baseType: !237, size: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tls_method", scope: !221, file: !222, line: 141, baseType: !240, size: 136, offset: 224)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 136, elements: !242)
!241 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!242 = !{!243}
!243 = !DISubrange(count: 17)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cipher", scope: !221, file: !222, line: 142, baseType: !245, size: 520, offset: 360)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 520, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 65)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "local_addr_data", scope: !221, file: !222, line: 143, baseType: !249, size: 768, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_data", file: !222, line: 132, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_addr_data", file: !222, line: 129, size: 768, elements: !251)
!251 = !{!252, !309}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !250, file: !222, line: 130, baseType: !253, size: 224)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !254, line: 48, baseType: !255)
!254 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !254, line: 44, size: 224, elements: !256)
!256 = !{!257, !269, !286}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !255, file: !254, line: 45, baseType: !258, size: 128)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !259, line: 180, size: 128, elements: !260)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!260 = !{!261, !265}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !258, file: !259, line: 182, baseType: !262, size: 16)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !263, line: 28, baseType: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!264 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !258, file: !259, line: 183, baseType: !266, size: 112, offset: 16)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 112, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 14)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !255, file: !254, line: 46, baseType: !270, size: 128)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !33, line: 245, size: 128, elements: !271)
!271 = !{!272, !273, !277, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !270, file: !33, line: 247, baseType: !262, size: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !270, file: !33, line: 248, baseType: !274, size: 16, offset: 16)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !33, line: 123, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !214, line: 25, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !216, line: 40, baseType: !264)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !270, file: !33, line: 249, baseType: !278, size: 32, offset: 32)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !33, line: 31, size: 32, elements: !279)
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !278, file: !33, line: 33, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !33, line: 30, baseType: !233)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !270, file: !33, line: 252, baseType: !283, size: 64, offset: 64)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !255, file: !254, line: 47, baseType: !287, size: 224)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !33, line: 260, size: 224, elements: !288)
!288 = !{!289, !290, !291, !292, !308}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !287, file: !33, line: 262, baseType: !262, size: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !287, file: !33, line: 263, baseType: !274, size: 16, offset: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !287, file: !33, line: 264, baseType: !233, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !287, file: !33, line: 265, baseType: !293, size: 128, offset: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !33, line: 219, size: 128, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !293, file: !33, line: 226, baseType: !296, size: 128)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !33, line: 221, size: 128, elements: !297)
!297 = !{!298, !302, !304}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !296, file: !33, line: 223, baseType: !299, size: 128)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !296, file: !33, line: 224, baseType: !303, size: 128)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 128, elements: !284)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !296, file: !33, line: 225, baseType: !305, size: 128)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 128, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 4)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !287, file: !33, line: 266, baseType: !233, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !250, file: !222, line: 131, baseType: !245, size: 520, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "remote_addr_data", scope: !221, file: !222, line: 144, baseType: !249, size: 768, offset: 1664)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv4", scope: !221, file: !222, line: 145, baseType: !249, size: 768, offset: 2432)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_data_ipv6", scope: !221, file: !222, line: 146, baseType: !249, size: 768, offset: 3200)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !221, file: !222, line: 147, baseType: !314, size: 4104, offset: 3968)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 4104, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 513)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "enforce_fingerprints", scope: !221, file: !222, line: 148, baseType: !156, size: 32, offset: 8096)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "received_packets", scope: !221, file: !222, line: 150, baseType: !226, size: 64, offset: 8128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !221, file: !222, line: 151, baseType: !226, size: 64, offset: 8192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "received_bytes", scope: !221, file: !222, line: 152, baseType: !226, size: 64, offset: 8256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sent_bytes", scope: !221, file: !222, line: 153, baseType: !226, size: 64, offset: 8320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "received_rate", scope: !221, file: !222, line: 154, baseType: !233, size: 32, offset: 8384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sent_rate", scope: !221, file: !222, line: 155, baseType: !233, size: 32, offset: 8416)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "total_rate", scope: !221, file: !222, line: 156, baseType: !233, size: 32, offset: 8448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_packets", scope: !221, file: !222, line: 157, baseType: !226, size: 64, offset: 8512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_packets", scope: !221, file: !222, line: 158, baseType: !226, size: 64, offset: 8576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_bytes", scope: !221, file: !222, line: 159, baseType: !226, size: 64, offset: 8640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_bytes", scope: !221, file: !222, line: 160, baseType: !226, size: 64, offset: 8704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "peer_received_rate", scope: !221, file: !222, line: 161, baseType: !233, size: 32, offset: 8768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "peer_sent_rate", scope: !221, file: !222, line: 162, baseType: !233, size: 32, offset: 8800)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "peer_total_rate", scope: !221, file: !222, line: 163, baseType: !233, size: 32, offset: 8832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "is_mobile", scope: !221, file: !222, line: 165, baseType: !156, size: 32, offset: 8864)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_data", scope: !221, file: !222, line: 167, baseType: !334, size: 3840, offset: 8896)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 3840, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 5)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "main_peers_size", scope: !221, file: !222, line: 168, baseType: !338, size: 64, offset: 12736)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !339, line: 46, baseType: !228)
!339 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_data", scope: !221, file: !222, line: 169, baseType: !341, size: 64, offset: 12800)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "extra_peers_size", scope: !221, file: !222, line: 170, baseType: !338, size: 64, offset: 12864)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !221, file: !222, line: 172, baseType: !344, size: 1024, offset: 12928)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 1024, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !221, file: !222, line: 173, baseType: !344, size: 1024, offset: 13952)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !221, file: !222, line: 175, baseType: !349, size: 64, offset: 14976)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !105, line: 67, baseType: !228)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_key_type", file: !351, line: 47, baseType: !226)
!351 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map_value_type", file: !351, line: 48, baseType: !228)
!353 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cli_session", file: !179, line: 101, size: 2688, elements: !358)
!358 = !{!359, !360, !361, !362, !365, !366, !370, !424, !425, !426}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !357, file: !179, line: 102, baseType: !156, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "auth_completed", scope: !357, file: !179, line: 103, baseType: !156, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cmds", scope: !357, file: !179, line: 104, baseType: !338, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !357, file: !179, line: 105, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferevent", file: !14, line: 113, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !357, file: !179, line: 106, baseType: !253, size: 224, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !357, file: !179, line: 107, baseType: !367, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_t", file: !122, line: 65, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "telnet_t", file: !122, line: 65, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !357, file: !179, line: 108, baseType: !371, size: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !373, line: 7, baseType: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !375, line: 49, size: 1728, elements: !376)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !392, !394, !395, !396, !398, !399, !401, !405, !408, !410, !413, !416, !417, !418, !419, !420}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !374, file: !375, line: 51, baseType: !156, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !374, file: !375, line: 54, baseType: !354, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !374, file: !375, line: 55, baseType: !354, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !374, file: !375, line: 56, baseType: !354, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !374, file: !375, line: 57, baseType: !354, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !374, file: !375, line: 58, baseType: !354, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !374, file: !375, line: 59, baseType: !354, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !374, file: !375, line: 60, baseType: !354, size: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !374, file: !375, line: 61, baseType: !354, size: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !374, file: !375, line: 64, baseType: !354, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !374, file: !375, line: 65, baseType: !354, size: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !374, file: !375, line: 66, baseType: !354, size: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !374, file: !375, line: 68, baseType: !390, size: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !375, line: 36, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !374, file: !375, line: 70, baseType: !393, size: 64, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !374, file: !375, line: 72, baseType: !156, size: 32, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !374, file: !375, line: 73, baseType: !156, size: 32, offset: 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !374, file: !375, line: 74, baseType: !397, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !216, line: 152, baseType: !353)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !374, file: !375, line: 77, baseType: !264, size: 16, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !374, file: !375, line: 78, baseType: !400, size: 8, offset: 1040)
!400 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !374, file: !375, line: 79, baseType: !402, size: 8, offset: 1048)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 8, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 1)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !374, file: !375, line: 81, baseType: !406, size: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !375, line: 43, baseType: null)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !374, file: !375, line: 89, baseType: !409, size: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !216, line: 153, baseType: !353)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !374, file: !375, line: 91, baseType: !411, size: 64, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !375, line: 37, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !374, file: !375, line: 92, baseType: !414, size: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !375, line: 38, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !374, file: !375, line: 93, baseType: !393, size: 64, offset: 1344)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !374, file: !375, line: 94, baseType: !219, size: 64, offset: 1408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !374, file: !375, line: 95, baseType: !338, size: 64, offset: 1472)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !374, file: !375, line: 96, baseType: !156, size: 32, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !374, file: !375, line: 98, baseType: !421, size: 160, offset: 1568)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 160, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 20)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !357, file: !179, line: 109, baseType: !344, size: 1024, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !357, file: !179, line: 110, baseType: !344, size: 1024, offset: 1600)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rp", scope: !357, file: !179, line: 111, baseType: !427, size: 64, offset: 2624)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_params_t", file: !155, line: 55, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_params_t", file: !155, line: 64, size: 1344, elements: !430)
!430 = !{!431, !432, !446}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "is_default_realm", scope: !429, file: !155, line: 66, baseType: !156, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !429, file: !155, line: 68, baseType: !433, size: 1152, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !64, line: 142, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !222, line: 53, size: 1152, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !434, file: !222, line: 55, baseType: !344, size: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !434, file: !222, line: 57, baseType: !438, size: 128, offset: 1024)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !222, line: 51, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !222, line: 45, size: 128, elements: !440)
!440 = !{!441, !443, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !439, file: !222, line: 47, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !349)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !439, file: !222, line: 48, baseType: !444, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !232, line: 105, baseType: !156)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !439, file: !222, line: 49, baseType: !444, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !429, file: !155, line: 70, baseType: !447, size: 128, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_status_t", file: !155, line: 52, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_status_t", file: !155, line: 57, size: 128, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "total_current_allocs", scope: !448, file: !155, line: 59, baseType: !444, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_counters", scope: !448, file: !155, line: 60, baseType: !452, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map", file: !351, line: 227, baseType: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_string_map", file: !351, line: 226, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "foreachcb_arg_type", file: !351, line: 53, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!156, !350, !352, !219}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ps_arg", file: !179, line: 414, size: 640, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !473, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !462, file: !179, line: 415, baseType: !356, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !462, file: !179, line: 416, baseType: !338, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !462, file: !179, line: 417, baseType: !231, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !462, file: !179, line: 418, baseType: !455, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pname", scope: !462, file: !179, line: 419, baseType: !455, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match", scope: !462, file: !179, line: 420, baseType: !156, size: 32, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !462, file: !179, line: 421, baseType: !452, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "user_counters", scope: !462, file: !179, line: 422, baseType: !472, size: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "user_names", scope: !462, file: !179, line: 423, baseType: !474, size: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "users_number", scope: !462, file: !179, line: 424, baseType: !338, size: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_key_type", file: !351, line: 224, baseType: !354)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_value_type", file: !351, line: 225, baseType: !219)
!478 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !480, line: 26, baseType: !481)
!480 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !216, line: 41, baseType: !156)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "admin_session", file: !484, line: 56, size: 2432, elements: !485)
!484 = !DIFile(filename: "src/apps/relay/turn_admin_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "72080e29702b34b58984e3ea957f1f4c")
!485 = !{!486, !487, !491, !492, !493}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "as_ok", scope: !483, file: !484, line: 57, baseType: !156, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "as_login", scope: !483, file: !484, line: 58, baseType: !488, size: 264, offset: 32)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 264, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 33)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "as_realm", scope: !483, file: !484, line: 59, baseType: !344, size: 1024, offset: 296)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "as_eff_realm", scope: !483, file: !484, line: 60, baseType: !344, size: 1024, offset: 1320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_user_sessions", scope: !483, file: !484, line: 61, baseType: !338, size: 64, offset: 2368)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "https_ps_arg", file: !179, line: 2272, size: 448, elements: !496)
!496 = !{!497, !500, !501, !502, !503, !504, !505}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sb", scope: !495, file: !179, line: 2273, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "str_buffer", file: !170, line: 74, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !495, file: !179, line: 2274, baseType: !338, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ct", scope: !495, file: !179, line: 2275, baseType: !231, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "client_protocol", scope: !495, file: !179, line: 2276, baseType: !455, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "user_pattern", scope: !495, file: !179, line: 2277, baseType: !455, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "max_sessions", scope: !495, file: !179, line: 2278, baseType: !338, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !495, file: !179, line: 2279, baseType: !225, size: 64, offset: 384)
!506 = !{!0, !507, !509, !511, !516, !518, !520, !522, !524, !529, !534, !537, !539, !544, !546, !551, !556, !561, !570, !575, !577, !579, !584, !586, !591, !596, !601, !606, !611, !616, !618, !623, !628, !633, !638, !752, !754, !756, !758, !761, !766, !771, !774, !779, !781, !784, !789, !794, !796, !801, !803, !805, !810, !812, !814, !817, !828, !830, !835, !840, !842, !844, !846, !848, !850, !852, !854, !856, !858, !863, !866, !868, !870, !872, !877, !879, !881, !883, !885, !887, !889, !891, !893, !895, !897, !899, !901, !903, !905, !907, !909, !911, !913, !915, !917, !919, !921, !923, !925, !927, !932, !934, !936, !938, !940, !942, !947, !952, !957, !962, !967, !969, !974, !979, !984, !986, !988, !990, !992, !997, !1002, !1005, !1007, !1012, !1017, !1020, !1022, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1071, !1073, !1075, !1080, !1082, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !1145, !1147, !1149, !1151, !1153, !1155, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1175, !1177, !1179, !1181, !1183, !1185, !1187, !1189, !1191, !1193, !1198, !1200, !1202, !1204, !1206, !1208, !1210, !1212, !1214, !1216, !1221, !1223, !1225, !1227, !1229, !1231, !1233, !1235, !1237, !1239, !1241, !1243, !1245, !1247, !1249, !1251, !1253, !1255, !1257, !1259, !1261, !1266, !1268, !1270, !1272, !1274, !1276, !1278, !1280, !1285, !1287, !1289, !1291, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1308, !1310, !1312, !1314, !1316, !1319, !1324, !1326, !1328, !1330, !1332, !1334, !1336, !1338, !1340, !1342, !1344, !1346, !1348, !1350, !1352, !1354, !1356, !1358, !1360, !1362, !1364, !1366, !1368, !1370, !1372, !1374, !1376, !1378, !1380, !1382, !1384, !1386, !1391, !1687, !1692, !1694, !1696, !1698, !1703, !1705, !1707, !1712, !1714, !1716, !1718, !1723, !1729, !1734, !1736, !1738, !1740, !1742, !1744, !1746, !1748, !1750, !1752, !1754, !1756, !1758, !1760, !1762, !1770, !1772, !1774, !1776, !1778, !1780, !1782, !1785, !1788, !1790, !1795, !1797, !1799, !1801, !1803, !1808, !1810, !1812, !1814, !1816, !1818, !1820, !1822, !1824, !1826, !1828, !1830, !1832, !1834, !1839, !1841, !1843, !1845, !1848, !1850, !1855, !1860, !1865, !1867, !1869, !1871, !1873, !1875, !1877, !1879, !1884, !1886, !1888, !1890, !1892, !1894, !1896, !1898, !1900, !1902, !1904, !1906, !1908, !1910, !1912, !1914, !1916, !1918, !1920, !1925, !1927, !1932, !1934, !1936, !1941, !1943, !1945, !1947, !1949, !1951, !1953, !1955, !1957, !1959, !1961, !1963, !1965, !1967, !1969, !1971, !1973, !1975, !1977, !1982, !1984, !1986, !1988, !1990, !1992, !1994, !1996, !1998, !2000, !2002, !2004, !2006, !2008, !2010, !2012, !2014, !2016, !2018, !2020, !2022, !2024, !2026, !2028, !2030, !2032, !2034, !2036, !2038, !2040, !2042, !2044, !2046, !2048, !2050, !2052, !2054, !2056, !2058, !2060, !2062, !2064, !2066, !2068, !2070, !2072, !2074, !2076, !2078, !2080, !2082, !2087, !2089, !2091, !2096, !2098, !2100, !2102, !2104, !2106, !2108, !2110, !2112, !2114, !2116, !2118, !2120, !2122, !2124, !2126, !2128, !2130, !2132, !2134}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "cli_addr_set", scope: !2, file: !179, line: 83, type: !156, isLocal: false, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "cli_port", scope: !2, file: !179, line: 85, type: !156, isLocal: false, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "cli_password", scope: !2, file: !179, line: 87, type: !513, isLocal: false, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 1032, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 129)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "cli_max_output_sessions", scope: !2, file: !179, line: 89, type: !156, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "use_web_admin", scope: !2, file: !179, line: 92, type: !156, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "web_admin_addr_set", scope: !2, file: !179, line: 95, type: !156, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "web_admin_port", scope: !2, file: !179, line: 97, type: !156, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !179, line: 185, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 96, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 12)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !179, line: 186, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 80, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 10)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !179, line: 187, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !284)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !179, line: 188, type: !526, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !179, line: 189, type: !541, isLocal: true, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 104, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 13)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !179, line: 190, type: !541, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !179, line: 191, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 152, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 19)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !179, line: 192, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 168, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 21)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !179, line: 193, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 72, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 9)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "tcmds", scope: !2, file: !179, line: 184, type: !563, isLocal: false, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1280, elements: !532)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "toggleable_command", file: !179, line: 179, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !564, file: !179, line: 180, baseType: !455, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !179, line: 181, baseType: !568, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "vintp", file: !232, line: 106, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1322, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 240, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 30)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1352, type: !531, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1353, type: !488, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1366, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 272, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 34)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1370, type: !572, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1376, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 216, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 27)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1385, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 56, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 7)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1386, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 192, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 24)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1391, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 248, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 31)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1394, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 352, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 44)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1409, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 224, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 28)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1414, type: !598, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1431, type: !620, isLocal: true, isDefinition: true)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 296, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 37)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1431, type: !625, isLocal: true, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 232, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 29)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !179, line: 3803, type: !630, isLocal: true, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 344, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 43)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !179, line: 3803, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 280, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 35)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "adminserver", scope: !2, file: !179, line: 78, type: !640, isLocal: false, isDefinition: true)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "admin_server", file: !484, line: 64, size: 704, elements: !641)
!641 = !{!642, !643, !646, !736, !737, !741, !742, !743, !744, !745, !749}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "listen_fd", scope: !640, file: !484, line: 65, baseType: !156, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !640, file: !484, line: 66, baseType: !644, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !14, line: 118, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !640, file: !484, line: 67, baseType: !647, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine_handle", file: !64, line: 120, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_engine", file: !64, line: 119, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ioa_engine", file: !651, line: 135, size: 536064, elements: !652)
!651 = !DIFile(filename: "src/apps/relay/ns_ioalib_impl.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "39ae1828625a6763b6269ecb34869b6c")
!652 = !{!653, !658, !659, !660, !661, !666, !671, !697, !702, !703, !704, !705, !706, !707, !708, !710, !714, !716, !725, !729, !730, !731, !732, !733}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sm", scope: !650, file: !651, line: 137, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "super_memory_t", file: !656, line: 49, baseType: !657)
!656 = !DIFile(filename: "src/apps/relay/ns_sm.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "9025fd46a533d33a213551fd581f5b89")
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "_super_memory", file: !656, line: 48, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "event_base", scope: !650, file: !651, line: 138, baseType: !644, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate_eb", scope: !650, file: !651, line: 139, baseType: !156, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !650, file: !651, line: 140, baseType: !156, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !650, file: !651, line: 141, baseType: !662, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "turnipports", file: !664, line: 50, baseType: !665)
!664 = !DIFile(filename: "src/apps/relay/turn_ports.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "11983eef23ed630198ed333562550552")
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "_turnipports", file: !664, line: 49, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "map_rtcp", scope: !650, file: !651, line: 142, baseType: !667, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtcp_map", file: !669, line: 46, baseType: !670)
!669 = !DIFile(filename: "src/server/ns_turn_maps_rtcp.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bedcc1443244c8ca394e26ac35053c7")
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "_rtcp_map", file: !669, line: 45, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bufs", scope: !650, file: !651, line: 143, baseType: !672, size: 128, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list", file: !651, line: 81, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list", file: !651, line: 78, size: 128, elements: !674)
!674 = !{!675, !696}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !673, file: !651, line: 79, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer_list_elem", file: !651, line: 76, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer_list_elem", file: !651, line: 73, size: 524288, elements: !679)
!679 = !{!680, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !678, file: !651, line: 74, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !678, file: !651, line: 75, baseType: !683, size: 524224, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_buffer", file: !684, line: 48, baseType: !685)
!684 = !DIFile(filename: "src/apps/common/stun_buffer.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "cc7948905c033a0fb654060699acf9e2")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_stun_buffer", file: !684, line: 42, size: 524224, elements: !686)
!686 = !{!687, !689, !693, !694, !695}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !685, file: !684, line: 43, baseType: !688, size: 32)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 32, elements: !306)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !685, file: !684, line: 44, baseType: !690, size: 524056, offset: 32)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 524056, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 65507)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !685, file: !684, line: 45, baseType: !338, size: 64, offset: 524096)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !685, file: !684, line: 46, baseType: !275, size: 16, offset: 524160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "coffset", scope: !685, file: !684, line: 47, baseType: !213, size: 8, offset: 524176)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tsz", scope: !673, file: !651, line: 80, baseType: !338, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_ssl23", scope: !650, file: !651, line: 144, baseType: !698, size: 64, offset: 448)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !700, line: 185, baseType: !701)
!700 = !DIFile(filename: "/usr/include/openssl/types.h", directory: "", checksumkind: CSK_MD5, checksum: "44f1236065e4ee65cf4cd545c3e12ab9")
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !700, line: 185, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_0", scope: !650, file: !651, line: 145, baseType: !698, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_1", scope: !650, file: !651, line: 147, baseType: !698, size: 64, offset: 576)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ctx_v1_2", scope: !650, file: !651, line: 149, baseType: !698, size: 64, offset: 640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx", scope: !650, file: !651, line: 153, baseType: !698, size: 64, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dtls_ctx_v1_2", scope: !650, file: !651, line: 156, baseType: !698, size: 64, offset: 768)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "jiffie", scope: !650, file: !651, line: 158, baseType: !231, size: 32, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ev", scope: !650, file: !651, line: 159, baseType: !709, size: 64, offset: 896)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_timer_handle", file: !64, line: 122, baseType: !219)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg", scope: !650, file: !651, line: 160, baseType: !711, size: 524296, offset: 960)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 524296, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 65537)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timer_intervals", scope: !650, file: !651, line: 161, baseType: !715, size: 448, offset: 525280)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 448, elements: !267)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "predef_timers", scope: !650, file: !651, line: 162, baseType: !717, size: 1792, offset: 525760)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 1792, elements: !267)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !719, line: 8, size: 128, elements: !720)
!719 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!720 = !{!721, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !718, file: !719, line: 14, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !216, line: 160, baseType: !353)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !718, file: !719, line: 15, baseType: !724, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !216, line: 162, baseType: !353)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "relay_ifname", scope: !650, file: !651, line: 164, baseType: !726, size: 8200, offset: 527552)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 8200, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 1025)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "default_relays", scope: !650, file: !651, line: 165, baseType: !156, size: 32, offset: 535776)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "relays_number", scope: !650, file: !651, line: 166, baseType: !338, size: 64, offset: 535808)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addr_counter", scope: !650, file: !651, line: 167, baseType: !338, size: 64, offset: 535872)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "relay_addrs", scope: !650, file: !651, line: 168, baseType: !355, size: 64, offset: 535936)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rch", scope: !650, file: !651, line: 169, baseType: !734, size: 64, offset: 536000)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !735, line: 45, baseType: !219)
!735 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!736 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !640, file: !484, line: 68, baseType: !156, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !640, file: !484, line: 69, baseType: !738, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "evconnlistener", file: !740, line: 39, flags: DIFlagFwdDecl)
!740 = !DIFile(filename: "/usr/include/event2/listener.h", directory: "", checksumkind: CSK_MD5, checksum: "a4ebcffd91592cd7652de10d7dd8b0d7")
!741 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !640, file: !484, line: 70, baseType: !363, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !640, file: !484, line: 71, baseType: !363, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "https_in_buf", scope: !640, file: !484, line: 72, baseType: !363, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "https_out_buf", scope: !640, file: !484, line: 73, baseType: !363, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sessions", scope: !640, file: !484, line: 74, baseType: !746, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_map", file: !351, line: 43, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_map", file: !351, line: 42, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "thr", scope: !640, file: !484, line: 75, baseType: !750, size: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !751, line: 27, baseType: !228)
!751 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "cli_addr", scope: !2, file: !179, line: 82, type: !253, isLocal: false, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "web_admin_addr", scope: !2, file: !179, line: 94, type: !253, isLocal: false, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1268, type: !613, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1268, type: !760, isLocal: true, isDefinition: true)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 224, elements: !614)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1272, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 416, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 52)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1285, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 456, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 57)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1211, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 40, elements: !335)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1214, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 48, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 6)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1217, type: !613, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1217, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 192, elements: !599)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1219, type: !786, isLocal: true, isDefinition: true)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 384, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 48)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1223, type: !791, isLocal: true, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 368, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 46)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1232, type: !421, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1243, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 496, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 62)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1156, type: !240, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1180, type: !613, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1185, type: !807, isLocal: true, isDefinition: true)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 16, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 2)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1186, type: !548, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1188, type: !240, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1189, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 32, elements: !306)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "cli_telopts", scope: !2, file: !179, line: 168, type: !819, isLocal: true, isDefinition: true)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 256, elements: !284)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "telnet_telopt_t", file: !122, line: 71, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "telnet_telopt_t", file: !122, line: 357, size: 32, elements: !823)
!823 = !{!824, !826, !827}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "telopt", scope: !822, file: !122, line: 358, baseType: !825, size: 16)
!825 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !822, file: !122, line: 359, baseType: !217, size: 8, offset: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "him", scope: !822, file: !122, line: 360, baseType: !217, size: 8, offset: 24)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1141, type: !240, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !179, line: 961, type: !832, isLocal: true, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 200, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 25)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !179, line: 962, type: !837, isLocal: true, isDefinition: true)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 208, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 26)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !179, line: 970, type: !588, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !179, line: 973, type: !816, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !179, line: 973, type: !773, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !179, line: 973, type: !773, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !179, line: 973, type: !807, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !179, line: 974, type: !776, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !179, line: 978, type: !773, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !179, line: 978, type: !558, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !179, line: 978, type: !773, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !179, line: 979, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 320, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 40)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !179, line: 980, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 232, elements: !626)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !179, line: 986, type: !807, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !179, line: 986, type: !807, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !179, line: 986, type: !773, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !179, line: 990, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 24, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 3)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !179, line: 993, type: !816, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !179, line: 995, type: !816, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !179, line: 999, type: !874, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1003, type: !816, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1006, type: !874, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1009, type: !874, isLocal: true, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1012, type: !816, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1015, type: !816, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1019, type: !630, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1022, type: !807, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1024, type: !572, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1027, type: !402, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1033, type: !816, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1036, type: !874, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1039, type: !874, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1042, type: !816, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1045, type: !874, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1048, type: !816, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1051, type: !874, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1054, type: !773, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1057, type: !776, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1060, type: !773, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1063, type: !776, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !179, line: 1067, type: !240, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !179, line: 120, type: !603, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !179, line: 122, type: !929, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 312, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 39)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !179, line: 124, type: !791, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !179, line: 126, type: !588, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !179, line: 128, type: !620, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !179, line: 130, type: !603, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !179, line: 132, type: !929, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !179, line: 134, type: !944, isLocal: true, isDefinition: true)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 256, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 32)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !179, line: 136, type: !949, isLocal: true, isDefinition: true)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 424, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 53)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !179, line: 137, type: !954, isLocal: true, isDefinition: true)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 440, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 55)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !179, line: 139, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 536, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 67)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !179, line: 140, type: !964, isLocal: true, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 448, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 56)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !179, line: 142, type: !245, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !179, line: 144, type: !971, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 552, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 69)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !179, line: 146, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 632, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 79)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !179, line: 148, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 360, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 45)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !179, line: 150, type: !240, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !179, line: 152, type: !763, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !179, line: 153, type: !954, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !179, line: 154, type: !964, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !179, line: 155, type: !994, isLocal: true, isDefinition: true)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 472, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 59)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !179, line: 157, type: !999, isLocal: true, isDefinition: true)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 376, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 47)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "CLI_HELP_STR", scope: !2, file: !179, line: 118, type: !1004, isLocal: true, isDefinition: true)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 2560, elements: !861)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !179, line: 653, type: !536, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !179, line: 654, type: !1009, isLocal: true, isDefinition: true)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 120, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 15)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !179, line: 659, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 184, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 23)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !179, line: 660, type: !1019, isLocal: true, isDefinition: true)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, elements: !300)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !179, line: 661, type: !548, isLocal: true, isDefinition: true)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !179, line: 662, type: !1024, isLocal: true, isDefinition: true)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 88, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 11)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !179, line: 663, type: !553, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !179, line: 665, type: !240, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !179, line: 666, type: !536, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !179, line: 667, type: !1019, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !179, line: 668, type: !240, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !179, line: 673, type: !526, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !179, line: 680, type: !526, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !179, line: 682, type: !536, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !179, line: 684, type: !266, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !179, line: 687, type: !536, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !179, line: 694, type: !266, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !179, line: 698, type: !588, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !179, line: 699, type: !240, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !179, line: 700, type: !240, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !179, line: 702, type: !266, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !179, line: 705, type: !1019, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(scope: null, file: !179, line: 707, type: !593, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !179, line: 708, type: !593, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !179, line: 709, type: !536, isLocal: true, isDefinition: true)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(scope: null, file: !179, line: 710, type: !593, isLocal: true, isDefinition: true)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !179, line: 712, type: !536, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !179, line: 713, type: !536, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !179, line: 714, type: !536, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !179, line: 716, type: !266, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !179, line: 717, type: !1077, isLocal: true, isDefinition: true)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 144, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 18)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !179, line: 718, type: !1077, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !179, line: 719, type: !1084, isLocal: true, isDefinition: true)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 176, elements: !1085)
!1085 = !{!1086}
!1086 = !DISubrange(count: 22)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !179, line: 721, type: !548, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !179, line: 725, type: !1024, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !179, line: 726, type: !240, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !179, line: 727, type: !553, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !179, line: 731, type: !1024, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !179, line: 734, type: !541, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !179, line: 736, type: !541, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !179, line: 741, type: !558, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !179, line: 742, type: !558, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !179, line: 744, type: !1084, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(scope: null, file: !179, line: 746, type: !536, isLocal: true, isDefinition: true)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(scope: null, file: !179, line: 747, type: !1014, isLocal: true, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(scope: null, file: !179, line: 751, type: !1084, isLocal: true, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !179, line: 753, type: !593, isLocal: true, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !179, line: 754, type: !1014, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !179, line: 767, type: !593, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !179, line: 767, type: !536, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !179, line: 772, type: !558, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !179, line: 777, type: !266, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !179, line: 782, type: !536, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(scope: null, file: !179, line: 787, type: !776, isLocal: true, isDefinition: true)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(scope: null, file: !179, line: 791, type: !536, isLocal: true, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !179, line: 793, type: !874, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !179, line: 795, type: !773, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !179, line: 801, type: !421, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !179, line: 810, type: !266, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !179, line: 813, type: !1077, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !179, line: 817, type: !548, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !179, line: 819, type: !581, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !179, line: 821, type: !1084, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !179, line: 822, type: !1084, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !179, line: 824, type: !620, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !179, line: 828, type: !553, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !179, line: 832, type: !421, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(scope: null, file: !179, line: 833, type: !548, isLocal: true, isDefinition: true)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !179, line: 834, type: !837, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !179, line: 835, type: !1014, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !179, line: 836, type: !1019, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !179, line: 840, type: !837, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !179, line: 841, type: !832, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !179, line: 842, type: !1084, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !179, line: 846, type: !598, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !179, line: 850, type: !999, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !179, line: 853, type: !786, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !179, line: 244, type: !773, isLocal: true, isDefinition: true)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(scope: null, file: !179, line: 245, type: !526, isLocal: true, isDefinition: true)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(scope: null, file: !179, line: 235, type: !874, isLocal: true, isDefinition: true)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !179, line: 236, type: !816, isLocal: true, isDefinition: true)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(scope: null, file: !179, line: 256, type: !776, isLocal: true, isDefinition: true)
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(scope: null, file: !179, line: 257, type: !541, isLocal: true, isDefinition: true)
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
