; ModuleID = '/home/raj/coturn/src/apps/relay/userdb.c'
source_filename = "/home/raj/coturn/src/apps/relay/userdb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_mutex = type { i32, ptr }
%struct._realm_params_t = type { i32, %struct._realm_options_t, %struct._realm_status_t }
%struct._realm_options_t = type { [128 x i8], %struct._perf_options_t }
%struct._perf_options_t = type { i64, i32, i32 }
%struct._realm_status_t = type { i32, ptr }
%struct._secrets_list = type { ptr, i64 }
%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }

!38 = !DIFile(filename: "src/server/ns_turn_server.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6e53554bfe42393e23ac816233e245b8")
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "DONT_FRAGMENT_UNSUPPORTED", value: 0)
!41 = !DIEnumerator(name: "DONT_FRAGMENT_SUPPORTED", value: 1)
!42 = !DIEnumerator(name: "DONT_FRAGMENT_SUPPORT_EMULATED", value: 2)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_TYPE", file: !44, line: 85, baseType: !16, size: 32, elements: !45)
!44 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!46 = !DIEnumerator(name: "UNKNOWN_SOCKET", value: 0)
!47 = !DIEnumerator(name: "TCP_SOCKET", value: 6)
!48 = !DIEnumerator(name: "UDP_SOCKET", value: 17)
!49 = !DIEnumerator(name: "TLS_SOCKET", value: 56)
!50 = !DIEnumerator(name: "SCTP_SOCKET", value: 132)
!51 = !DIEnumerator(name: "TLS_SCTP_SOCKET", value: 133)
!52 = !DIEnumerator(name: "DTLS_SOCKET", value: 250)
!53 = !DIEnumerator(name: "TCP_SOCKET_PROXY", value: 253)
!54 = !DIEnumerator(name: "TENTATIVE_SCTP_SOCKET", value: 254)
!55 = !DIEnumerator(name: "TENTATIVE_TCP_SOCKET", value: 255)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SOCKET_APP_TYPE", file: !44, line: 100, baseType: !16, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66}
!58 = !DIEnumerator(name: "UNKNOWN_APP_SOCKET", value: 0)
!59 = !DIEnumerator(name: "CLIENT_SOCKET", value: 1)
!60 = !DIEnumerator(name: "HTTP_CLIENT_SOCKET", value: 2)
!61 = !DIEnumerator(name: "HTTPS_CLIENT_SOCKET", value: 3)
!62 = !DIEnumerator(name: "RELAY_SOCKET", value: 4)
!63 = !DIEnumerator(name: "RELAY_RTCP_SOCKET", value: 5)
!64 = !DIEnumerator(name: "TCP_CLIENT_DATA_SOCKET", value: 6)
!65 = !DIEnumerator(name: "TCP_RELAY_DATA_SOCKET", value: 7)
!66 = !DIEnumerator(name: "LISTENER_SOCKET", value: 8)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_TC_STATE", file: !68, line: 67, baseType: !16, size: 32, elements: !69)
!68 = !DIFile(filename: "src/server/ns_turn_allocation.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0cb2cf61c9ec5dd3030a6e5a6f8d4af1")
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DIEnumerator(name: "TC_STATE_UNKNOWN", value: 0)
!71 = !DIEnumerator(name: "TC_STATE_CLIENT_TO_PEER_CONNECTING", value: 1)
!72 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTING", value: 2)
!73 = !DIEnumerator(name: "TC_STATE_PEER_CONNECTED", value: 3)
!74 = !DIEnumerator(name: "TC_STATE_READY", value: 4)
!75 = !DIEnumerator(name: "TC_STATE_FAILED", value: 5)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_MESSAGE_TO_RELAY_TYPE", file: !38, line: 69, baseType: !16, size: 32, elements: !77)
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "RMT_UNKNOWN", value: 0)
!79 = !DIEnumerator(name: "RMT_SOCKET", value: 1)
!80 = !DIEnumerator(name: "RMT_CB_SOCKET", value: 2)
!81 = !DIEnumerator(name: "RMT_MOBILE_SOCKET", value: 3)
!82 = !DIEnumerator(name: "RMT_CANCEL_SESSION", value: 4)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ALLOCATION_DEFAULT_ADDRESS_FAMILY", file: !38, line: 79, baseType: !16, size: 32, elements: !84)
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV4", value: 0)
!86 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_IPV6", value: 1)
!87 = !DIEnumerator(name: "ALLOCATION_DEFAULT_ADDRESS_FAMILY_KEEP", value: 2)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_TURNADMIN_COMMAND_TYPE", file: !89, line: 119, baseType: !16, size: 32, elements: !90)
!89 = !DIFile(filename: "src/apps/relay/userdb.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "ef7aa3b34af7515d3cf1275f8bfd0947")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!91 = !DIEnumerator(name: "TA_COMMAND_UNKNOWN", value: 0)
!92 = !DIEnumerator(name: "TA_PRINT_KEY", value: 1)
!93 = !DIEnumerator(name: "TA_UPDATE_USER", value: 2)
!94 = !DIEnumerator(name: "TA_DELETE_USER", value: 3)
!95 = !DIEnumerator(name: "TA_LIST_USERS", value: 4)
!96 = !DIEnumerator(name: "TA_SET_SECRET", value: 5)
!97 = !DIEnumerator(name: "TA_SHOW_SECRET", value: 6)
!98 = !DIEnumerator(name: "TA_DEL_SECRET", value: 7)
!99 = !DIEnumerator(name: "TA_ADD_ORIGIN", value: 8)
!100 = !DIEnumerator(name: "TA_DEL_ORIGIN", value: 9)
!101 = !DIEnumerator(name: "TA_LIST_ORIGINS", value: 10)
!102 = !DIEnumerator(name: "TA_SET_REALM_OPTION", value: 11)
!103 = !DIEnumerator(name: "TA_LIST_REALM_OPTIONS", value: 12)
!104 = !{!105, !108, !111, !112, !113, !148, !149, !153, !157, !159, !7, !164, !107, !165, !133, !16, !170, !201, !206, !134}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_value_type", file: !106, line: 225, baseType: !107)
!106 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_key_type", file: !106, line: 224, baseType: !111)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_params_t", file: !89, line: 55, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_params_t", file: !89, line: 64, size: 1344, elements: !116)
!116 = !{!117, !118, !139}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "is_default_realm", scope: !115, file: !89, line: 66, baseType: !7, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !115, file: !89, line: 68, baseType: !119, size: 1152, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_options_t", file: !44, line: 142, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_options_t", file: !121, line: 53, size: 1152, elements: !122)
!121 = !DIFile(filename: "src/server/ns_turn_session.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "0d3b1381a7fca7a8f35b6ee419f25609")
!122 = !{!123, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !121, line: 55, baseType: !124, size: 1024)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1024, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "perf_options", scope: !120, file: !121, line: 57, baseType: !128, size: 128, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "perf_options_t", file: !121, line: 51, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_perf_options_t", file: !121, line: 45, size: 128, elements: !130)
!130 = !{!131, !135, !138}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "max_bps", scope: !129, file: !121, line: 47, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !23, line: 67, baseType: !134)
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "total_quota", scope: !129, file: !121, line: 48, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !137, line: 105, baseType: !7)
!137 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!138 = !DIDerivedType(tag: DW_TAG_member, name: "user_quota", scope: !129, file: !121, line: 49, baseType: !136, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !115, file: !89, line: 70, baseType: !140, size: 128, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "realm_status_t", file: !89, line: 52, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_realm_status_t", file: !89, line: 57, size: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "total_current_allocs", scope: !141, file: !89, line: 59, baseType: !136, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_counters", scope: !141, file: !89, line: 60, baseType: !145, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map", file: !106, line: 227, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ur_string_map", file: !106, line: 226, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !150, line: 26, baseType: !151)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !152, line: 41, baseType: !7)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_time_t", file: !137, line: 108, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !155, line: 26, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !152, line: 42, baseType: !16)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 46, baseType: !134)
!158 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !155, line: 24, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !152, line: 38, baseType: !163)
!163 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "hmackey_t", file: !23, line: 64, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !172, line: 91, baseType: !173)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 86, size: 448, elements: !174)
!174 = !{!175, !195, !199}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !173, file: !172, line: 88, baseType: !176, size: 448)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !177, line: 23, size: 448, elements: !178)
!177 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_rwlock.h", directory: "", checksumkind: CSK_MD5, checksum: "2034038f4a99ff6cb7b9de3a3e8c2a8e")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !189, !193, !194}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !176, file: !177, line: 25, baseType: !16, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !176, file: !177, line: 26, baseType: !16, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !176, file: !177, line: 27, baseType: !16, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !176, file: !177, line: 28, baseType: !16, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !176, file: !177, line: 29, baseType: !16, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !176, file: !177, line: 30, baseType: !16, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !176, file: !177, line: 32, baseType: !7, size: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !176, file: !177, line: 33, baseType: !7, size: 32, offset: 224)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !176, file: !177, line: 34, baseType: !188, size: 8, offset: 256)
!188 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !176, file: !177, line: 39, baseType: !190, size: 56, offset: 264)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 56, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 7)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !176, file: !177, line: 42, baseType: !134, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !176, file: !177, line: 45, baseType: !16, size: 32, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !173, file: !172, line: 89, baseType: !196, size: 448)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 448, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 56)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !173, file: !172, line: 90, baseType: !200, size: 64)
!200 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !44, line: 159, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !44, line: 154, size: 128, elements: !204)
!204 = !{!205, !281}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !203, file: !44, line: 155, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !44, line: 152, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !44, line: 146, size: 6624, elements: !209)
!209 = !{!210, !214, !218}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !208, file: !44, line: 147, baseType: !211, size: 2056)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 2056, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 257)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !208, file: !44, line: 148, baseType: !215, size: 4104, offset: 2056)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 4104, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 513)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !208, file: !44, line: 149, baseType: !219, size: 448, offset: 6176)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !220, line: 53, baseType: !221)
!220 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 50, size: 448, elements: !222)
!222 = !{!223, !280}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !221, file: !220, line: 51, baseType: !224, size: 224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !220, line: 48, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !220, line: 44, size: 224, elements: !226)
!226 = !{!227, !239, !257}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !225, file: !220, line: 45, baseType: !228, size: 128)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !229, line: 180, size: 128, elements: !230)
!229 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!230 = !{!231, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !228, file: !229, line: 182, baseType: !232, size: 16)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !233, line: 28, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!234 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !228, file: !229, line: 183, baseType: !236, size: 112, offset: 16)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 112, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 14)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !225, file: !220, line: 46, baseType: !240, size: 128)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !241, line: 245, size: 128, elements: !242)
!241 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!242 = !{!243, !244, !248, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !240, file: !241, line: 247, baseType: !232, size: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !240, file: !241, line: 248, baseType: !245, size: 16, offset: 16)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !241, line: 123, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !155, line: 25, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !152, line: 40, baseType: !234)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !240, file: !241, line: 249, baseType: !249, size: 32, offset: 32)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !241, line: 31, size: 32, elements: !250)
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !249, file: !241, line: 33, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !241, line: 30, baseType: !154)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !240, file: !241, line: 252, baseType: !254, size: 64, offset: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 64, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 8)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !225, file: !220, line: 47, baseType: !258, size: 224)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !241, line: 260, size: 224, elements: !259)
!259 = !{!260, !261, !262, !263, !279}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !258, file: !241, line: 262, baseType: !232, size: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !258, file: !241, line: 263, baseType: !245, size: 16, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !258, file: !241, line: 264, baseType: !154, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !258, file: !241, line: 265, baseType: !264, size: 128, offset: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !241, line: 219, size: 128, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !264, file: !241, line: 226, baseType: !267, size: 128)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !264, file: !241, line: 221, size: 128, elements: !268)
!268 = !{!269, !273, !275}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !267, file: !241, line: 223, baseType: !270, size: 128)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 128, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !267, file: !241, line: 224, baseType: !274, size: 128)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 128, elements: !255)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !267, file: !241, line: 225, baseType: !276, size: 128)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 4)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !258, file: !241, line: 266, baseType: !154, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !221, file: !220, line: 52, baseType: !224, size: 224, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !203, file: !44, line: 156, baseType: !157, size: 64, offset: 64)
!282 = !{!283, !290, !293, !298, !303, !308, !313, !318, !323, !328, !330, !335, !340, !345, !350, !353, !358, !363, !366, !369, !374, !379, !386, !0, !393, !395, !397, !402, !407, !409, !414, !419, !424, !429, !431, !433, !435}
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "_default_realm_params", scope: !285, file: !286, line: 95, type: !114, isLocal: true, isDefinition: true)
!285 = distinct !DISubprogram(name: "create_default_realm", scope: !286, file: !286, line: 89, type: !287, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!286 = !DIFile(filename: "src/apps/relay/userdb.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "892ccda1016ad0bc5e7662da91c3ba87")
!287 = !DISubroutineType(types: !288)
!288 = !{null}
!289 = !{}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !286, line: 454, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !277)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !286, line: 465, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 272, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 34)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !286, line: 475, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 280, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 35)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !286, line: 481, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 216, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 27)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !286, line: 492, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 392, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 49)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !286, line: 510, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 192, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 24)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !286, line: 663, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 8, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 1)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !286, line: 719, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 16, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 2)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !286, line: 721, type: !315, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !286, line: 728, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 168, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 21)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !286, line: 734, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 24, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 3)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !286, line: 738, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 176, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 22)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !286, line: 740, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 120, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 15)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !286, line: 930, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !168)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !286, line: 953, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 40, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 5)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !286, line: 965, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 48, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 6)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !286, line: 1189, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !255)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !286, line: 1198, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 56, elements: !191)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !286, line: 1223, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 208, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 26)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !286, line: 1268, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 256, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 32)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "o_to_realm_mutex", scope: !2, file: !286, line: 70, type: !381, isLocal: true, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_mutex", file: !44, line: 60, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_mutex", file: !44, line: 55, size: 128, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !382, file: !44, line: 56, baseType: !154, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !382, file: !44, line: 57, baseType: !107, size: 64, offset: 64)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "realms_list", scope: !2, file: !286, line: 72, type: !388, isLocal: true, isDefinition: true)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "secrets_list_t", file: !89, line: 143, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_secrets_list", file: !89, line: 139, size: 128, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "secrets", scope: !389, file: !89, line: 140, baseType: !148, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !389, file: !89, line: 141, baseType: !157, size: 64, offset: 64)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "o_to_realm", scope: !2, file: !286, line: 71, type: !145, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "default_realm_params_ptr", scope: !2, file: !286, line: 67, type: !113, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !286, line: 244, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 480, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 60)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !286, line: 217, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 472, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 59)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !286, line: 875, type: !365, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !286, line: 876, type: !411, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 88, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 11)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !286, line: 877, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 96, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 12)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !286, line: 226, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 464, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 58)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !286, line: 235, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 496, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 62)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "whitelist_rwlock", scope: !2, file: !286, line: 1074, type: !170, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "blacklist_rwlock", scope: !2, file: !286, line: 1075, type: !170, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "ipwhitelist", scope: !2, file: !286, line: 1081, type: !201, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "ipblacklist", scope: !2, file: !286, line: 1082, type: !201, isLocal: true, isDefinition: true)
!437 = !{i32 7, !"Dwarf Version", i32 5}
!438 = !{i32 2, !"Debug Info Version", i32 3}
!439 = !{i32 1, !"wchar_size", i32 4}
!440 = !{i32 8, !"PIC Level", i32 2}
!441 = !{i32 7, !"PIE Level", i32 2}
!442 = !{i32 7, !"uwtable", i32 2}
!443 = !{i32 7, !"frame-pointer", i32 2}
!444 = !{!"clang version 16.0.0"}
!445 = distinct !DISubprogram(name: "lock_realms", scope: !286, file: !286, line: 74, type: !287, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!446 = !DILocation(line: 75, column: 21, scope: !445)
!447 = !DILocation(line: 75, column: 2, scope: !445)
!448 = !DILocation(line: 76, column: 1, scope: !445)
!449 = distinct !DISubprogram(name: "unlock_realms", scope: !286, file: !286, line: 78, type: !287, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!450 = !DILocation(line: 79, column: 23, scope: !449)
!451 = !DILocation(line: 79, column: 2, scope: !449)
!452 = !DILocation(line: 80, column: 1, scope: !449)
!453 = distinct !DISubprogram(name: "update_o_to_realm", scope: !286, file: !286, line: 82, type: !454, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !145}
!456 = !DILocalVariable(name: "o_to_realm_new", arg: 1, scope: !453, file: !286, line: 82, type: !145)
!457 = !DILocation(line: 82, column: 40, scope: !453)
!458 = !DILocation(line: 83, column: 3, scope: !453)
!459 = !DILocation(line: 84, column: 3, scope: !453)
!460 = !DILocation(line: 85, column: 16, scope: !453)
!461 = !DILocation(line: 85, column: 14, scope: !453)
!462 = !DILocation(line: 86, column: 3, scope: !453)
!463 = !DILocation(line: 87, column: 1, scope: !453)
!464 = !DILocation(line: 91, column: 5, scope: !465)
!465 = distinct !DILexicalBlock(scope: !285, file: !286, line: 91, column: 5)
!466 = !DILocation(line: 91, column: 5, scope: !285)
!467 = !DILocation(line: 92, column: 3, scope: !468)
!468 = distinct !DILexicalBlock(scope: !465, file: !286, line: 91, column: 31)
!469 = !DILocation(line: 106, column: 2, scope: !285)
!470 = !DILocation(line: 107, column: 2, scope: !285)
!471 = !DILocation(line: 108, column: 15, scope: !285)
!472 = !DILocation(line: 108, column: 13, scope: !285)
!473 = !DILocation(line: 109, column: 27, scope: !285)
!474 = !DILocation(line: 110, column: 11, scope: !285)
!475 = !DILocation(line: 110, column: 9, scope: !285)
!476 = !DILocation(line: 111, column: 2, scope: !285)
!477 = !DILocation(line: 112, column: 53, scope: !285)
!478 = !DILocation(line: 112, column: 2, scope: !285)
!479 = !DILocation(line: 112, column: 28, scope: !285)
!480 = !DILocation(line: 112, column: 35, scope: !285)
!481 = !DILocation(line: 112, column: 50, scope: !285)
!482 = !DILocation(line: 113, column: 2, scope: !285)
!483 = !DILocation(line: 114, column: 1, scope: !285)
!484 = distinct !DISubprogram(name: "init_secrets_list", scope: !286, file: !286, line: 251, type: !485, scopeLine: 252, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!488 = !DILocalVariable(name: "sl", arg: 1, scope: !484, file: !286, line: 251, type: !487)
!489 = !DILocation(line: 251, column: 40, scope: !484)
!490 = !DILocation(line: 253, column: 5, scope: !491)
!491 = distinct !DILexicalBlock(scope: !484, file: !286, line: 253, column: 5)
!492 = !DILocation(line: 253, column: 5, scope: !484)
!493 = !DILocation(line: 254, column: 9, scope: !494)
!494 = distinct !DILexicalBlock(scope: !491, file: !286, line: 253, column: 9)
!495 = !DILocation(line: 254, column: 3, scope: !494)
!496 = !DILocation(line: 255, column: 2, scope: !494)
!497 = !DILocation(line: 256, column: 1, scope: !484)
!498 = distinct !DISubprogram(name: "get_default_realm_options", scope: !286, file: !286, line: 116, type: !499, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!502 = !DILocalVariable(name: "ro", arg: 1, scope: !498, file: !286, line: 116, type: !501)
!503 = !DILocation(line: 116, column: 49, scope: !498)
!504 = !DILocation(line: 118, column: 5, scope: !505)
!505 = distinct !DILexicalBlock(scope: !498, file: !286, line: 118, column: 5)
!506 = !DILocation(line: 118, column: 5, scope: !498)
!507 = !DILocation(line: 119, column: 3, scope: !508)
!508 = distinct !DILexicalBlock(scope: !505, file: !286, line: 118, column: 9)
!509 = !DILocation(line: 120, column: 11, scope: !508)
!510 = !DILocation(line: 120, column: 37, scope: !508)
!511 = !DILocation(line: 120, column: 46, scope: !508)
!512 = !DILocation(line: 120, column: 3, scope: !508)
!513 = !DILocation(line: 121, column: 3, scope: !508)
!514 = !DILocation(line: 122, column: 2, scope: !508)
!515 = !DILocation(line: 123, column: 1, scope: !498)
!516 = distinct !DISubprogram(name: "set_default_realm_name", scope: !286, file: !286, line: 125, type: !517, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !111}
!519 = !DILocalVariable(name: "realm", arg: 1, scope: !516, file: !286, line: 125, type: !111)
!520 = !DILocation(line: 125, column: 35, scope: !516)
!521 = !DILocation(line: 126, column: 2, scope: !516)
!522 = !DILocalVariable(name: "value", scope: !516, file: !286, line: 127, type: !105)
!523 = !DILocation(line: 127, column: 27, scope: !516)
!524 = !DILocation(line: 127, column: 61, scope: !516)
!525 = !DILocation(line: 128, column: 2, scope: !516)
!526 = !DILocation(line: 128, column: 2, scope: !527)
!527 = distinct !DILexicalBlock(scope: !528, file: !286, line: 128, column: 2)
!528 = distinct !DILexicalBlock(scope: !516, file: !286, line: 128, column: 2)
!529 = !DILocation(line: 128, column: 2, scope: !528)
!530 = !DILocalVariable(name: "szdst", scope: !531, file: !286, line: 128, type: !157)
!531 = distinct !DILexicalBlock(scope: !532, file: !286, line: 128, column: 2)
!532 = distinct !DILexicalBlock(scope: !533, file: !286, line: 128, column: 2)
!533 = distinct !DILexicalBlock(scope: !527, file: !286, line: 128, column: 2)
!534 = !DILocation(line: 128, column: 2, scope: !531)
!535 = !DILocation(line: 128, column: 2, scope: !533)
!536 = !DILocation(line: 129, column: 20, scope: !516)
!537 = !DILocation(line: 129, column: 52, scope: !516)
!538 = !DILocation(line: 129, column: 78, scope: !516)
!539 = !DILocation(line: 129, column: 86, scope: !516)
!540 = !DILocation(line: 129, column: 92, scope: !516)
!541 = !DILocation(line: 129, column: 2, scope: !516)
!542 = !DILocation(line: 130, column: 36, scope: !516)
!543 = !DILocation(line: 130, column: 2, scope: !516)
!544 = !DILocation(line: 131, column: 2, scope: !516)
!545 = !DILocation(line: 132, column: 1, scope: !516)
!546 = distinct !DISubprogram(name: "add_to_secrets_list", scope: !286, file: !286, line: 291, type: !547, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !487, !108}
!549 = !DILocalVariable(name: "sl", arg: 1, scope: !546, file: !286, line: 291, type: !487)
!550 = !DILocation(line: 291, column: 42, scope: !546)
!551 = !DILocalVariable(name: "elem", arg: 2, scope: !546, file: !286, line: 291, type: !108)
!552 = !DILocation(line: 291, column: 58, scope: !546)
!553 = !DILocation(line: 293, column: 5, scope: !554)
!554 = distinct !DILexicalBlock(scope: !546, file: !286, line: 293, column: 5)
!555 = !DILocation(line: 293, column: 8, scope: !554)
!556 = !DILocation(line: 293, column: 11, scope: !554)
!557 = !DILocation(line: 293, column: 5, scope: !546)
!558 = !DILocation(line: 294, column: 34, scope: !559)
!559 = distinct !DILexicalBlock(scope: !554, file: !286, line: 293, column: 17)
!560 = !DILocation(line: 294, column: 38, scope: !559)
!561 = !DILocation(line: 294, column: 62, scope: !559)
!562 = !DILocation(line: 294, column: 66, scope: !559)
!563 = !DILocation(line: 294, column: 68, scope: !559)
!564 = !DILocation(line: 294, column: 60, scope: !559)
!565 = !DILocation(line: 294, column: 26, scope: !559)
!566 = !DILocation(line: 294, column: 4, scope: !559)
!567 = !DILocation(line: 294, column: 8, scope: !559)
!568 = !DILocation(line: 294, column: 16, scope: !559)
!569 = !DILocation(line: 295, column: 33, scope: !559)
!570 = !DILocation(line: 295, column: 26, scope: !559)
!571 = !DILocation(line: 295, column: 4, scope: !559)
!572 = !DILocation(line: 295, column: 8, scope: !559)
!573 = !DILocation(line: 295, column: 16, scope: !559)
!574 = !DILocation(line: 295, column: 20, scope: !559)
!575 = !DILocation(line: 295, column: 24, scope: !559)
!576 = !DILocation(line: 296, column: 4, scope: !559)
!577 = !DILocation(line: 296, column: 8, scope: !559)
!578 = !DILocation(line: 296, column: 11, scope: !559)
!579 = !DILocation(line: 297, column: 2, scope: !559)
!580 = !DILocation(line: 298, column: 1, scope: !546)
!581 = distinct !DISubprogram(name: "get_realm", scope: !286, file: !286, line: 134, type: !582, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!582 = !DISubroutineType(types: !583)
!583 = !{!113, !111}
!584 = !DILocalVariable(name: "name", arg: 1, scope: !581, file: !286, line: 134, type: !111)
!585 = !DILocation(line: 134, column: 33, scope: !581)
!586 = !DILocation(line: 136, column: 5, scope: !587)
!587 = distinct !DILexicalBlock(scope: !581, file: !286, line: 136, column: 5)
!588 = !DILocation(line: 136, column: 10, scope: !587)
!589 = !DILocation(line: 136, column: 13, scope: !587)
!590 = !DILocation(line: 136, column: 5, scope: !581)
!591 = !DILocation(line: 137, column: 3, scope: !592)
!592 = distinct !DILexicalBlock(scope: !587, file: !286, line: 136, column: 22)
!593 = !DILocalVariable(name: "value", scope: !592, file: !286, line: 138, type: !105)
!594 = !DILocation(line: 138, column: 28, scope: !592)
!595 = !DILocalVariable(name: "key", scope: !592, file: !286, line: 139, type: !112)
!596 = !DILocation(line: 139, column: 26, scope: !592)
!597 = !DILocation(line: 139, column: 56, scope: !592)
!598 = !DILocation(line: 140, column: 25, scope: !599)
!599 = distinct !DILexicalBlock(scope: !592, file: !286, line: 140, column: 7)
!600 = !DILocation(line: 140, column: 33, scope: !599)
!601 = !DILocation(line: 140, column: 7, scope: !599)
!602 = !DILocation(line: 140, column: 7, scope: !592)
!603 = !DILocation(line: 141, column: 4, scope: !604)
!604 = distinct !DILexicalBlock(scope: !599, file: !286, line: 140, column: 47)
!605 = !DILocation(line: 142, column: 28, scope: !604)
!606 = !DILocation(line: 142, column: 4, scope: !604)
!607 = !DILocalVariable(name: "ret", scope: !608, file: !286, line: 144, type: !113)
!608 = distinct !DILexicalBlock(scope: !599, file: !286, line: 143, column: 10)
!609 = !DILocation(line: 144, column: 20, scope: !608)
!610 = !DILocation(line: 144, column: 43, scope: !608)
!611 = !DILocation(line: 145, column: 10, scope: !608)
!612 = !DILocation(line: 145, column: 35, scope: !608)
!613 = !DILocation(line: 145, column: 4, scope: !608)
!614 = !DILocation(line: 146, column: 4, scope: !608)
!615 = !DILocation(line: 146, column: 4, scope: !616)
!616 = distinct !DILexicalBlock(scope: !617, file: !286, line: 146, column: 4)
!617 = distinct !DILexicalBlock(scope: !608, file: !286, line: 146, column: 4)
!618 = !DILocation(line: 146, column: 4, scope: !617)
!619 = !DILocalVariable(name: "szdst", scope: !620, file: !286, line: 146, type: !157)
!620 = distinct !DILexicalBlock(scope: !621, file: !286, line: 146, column: 4)
!621 = distinct !DILexicalBlock(scope: !622, file: !286, line: 146, column: 4)
!622 = distinct !DILexicalBlock(scope: !616, file: !286, line: 146, column: 4)
!623 = !DILocation(line: 146, column: 4, scope: !620)
!624 = !DILocation(line: 146, column: 4, scope: !622)
!625 = !DILocation(line: 147, column: 38, scope: !608)
!626 = !DILocation(line: 147, column: 10, scope: !608)
!627 = !DILocation(line: 148, column: 22, scope: !608)
!628 = !DILocation(line: 148, column: 30, scope: !608)
!629 = !DILocation(line: 148, column: 35, scope: !608)
!630 = !DILocation(line: 148, column: 4, scope: !608)
!631 = !DILocation(line: 149, column: 34, scope: !608)
!632 = !DILocation(line: 149, column: 4, scope: !608)
!633 = !DILocation(line: 149, column: 9, scope: !608)
!634 = !DILocation(line: 149, column: 16, scope: !608)
!635 = !DILocation(line: 149, column: 31, scope: !608)
!636 = !DILocation(line: 150, column: 38, scope: !608)
!637 = !DILocation(line: 150, column: 4, scope: !608)
!638 = !DILocation(line: 151, column: 4, scope: !608)
!639 = !DILocation(line: 152, column: 11, scope: !608)
!640 = !DILocation(line: 152, column: 4, scope: !608)
!641 = !DILocation(line: 156, column: 9, scope: !581)
!642 = !DILocation(line: 156, column: 2, scope: !581)
!643 = !DILocation(line: 157, column: 1, scope: !581)
!644 = distinct !DISubprogram(name: "get_realm_data", scope: !286, file: !286, line: 159, type: !645, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!645 = !DISubroutineType(types: !646)
!646 = !{!7, !111, !113}
!647 = !DILocalVariable(name: "name", arg: 1, scope: !644, file: !286, line: 159, type: !111)
!648 = !DILocation(line: 159, column: 26, scope: !644)
!649 = !DILocalVariable(name: "rp", arg: 2, scope: !644, file: !286, line: 159, type: !113)
!650 = !DILocation(line: 159, column: 48, scope: !644)
!651 = !DILocation(line: 161, column: 2, scope: !644)
!652 = !DILocation(line: 162, column: 18, scope: !644)
!653 = !DILocation(line: 162, column: 8, scope: !644)
!654 = !DILocation(line: 162, column: 24, scope: !644)
!655 = !DILocation(line: 162, column: 2, scope: !644)
!656 = !DILocation(line: 163, column: 2, scope: !644)
!657 = !DILocation(line: 164, column: 2, scope: !644)
!658 = distinct !DISubprogram(name: "get_realm_options_by_origin", scope: !286, file: !286, line: 167, type: !659, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!659 = !DISubroutineType(types: !660)
!660 = !{!7, !111, !501}
!661 = !DILocalVariable(name: "origin", arg: 1, scope: !658, file: !286, line: 167, type: !111)
!662 = !DILocation(line: 167, column: 39, scope: !658)
!663 = !DILocalVariable(name: "ro", arg: 2, scope: !658, file: !286, line: 167, type: !501)
!664 = !DILocation(line: 167, column: 64, scope: !658)
!665 = !DILocalVariable(name: "value", scope: !658, file: !286, line: 169, type: !105)
!666 = !DILocation(line: 169, column: 27, scope: !658)
!667 = !DILocation(line: 170, column: 2, scope: !658)
!668 = !DILocation(line: 171, column: 24, scope: !669)
!669 = distinct !DILexicalBlock(scope: !658, file: !286, line: 171, column: 6)
!670 = !DILocation(line: 171, column: 61, scope: !669)
!671 = !DILocation(line: 171, column: 6, scope: !669)
!672 = !DILocation(line: 171, column: 77, scope: !669)
!673 = !DILocation(line: 171, column: 80, scope: !669)
!674 = !DILocation(line: 171, column: 6, scope: !658)
!675 = !DILocalVariable(name: "realm", scope: !676, file: !286, line: 172, type: !111)
!676 = distinct !DILexicalBlock(scope: !669, file: !286, line: 171, column: 87)
!677 = !DILocation(line: 172, column: 9, scope: !676)
!678 = !DILocation(line: 172, column: 31, scope: !676)
!679 = !DILocation(line: 172, column: 17, scope: !676)
!680 = !DILocation(line: 173, column: 3, scope: !676)
!681 = !DILocalVariable(name: "rp", scope: !676, file: !286, line: 174, type: !114)
!682 = !DILocation(line: 174, column: 18, scope: !676)
!683 = !DILocation(line: 175, column: 18, scope: !676)
!684 = !DILocation(line: 175, column: 3, scope: !676)
!685 = !DILocation(line: 176, column: 14, scope: !676)
!686 = !DILocation(line: 176, column: 23, scope: !676)
!687 = !DILocation(line: 176, column: 3, scope: !676)
!688 = !DILocation(line: 177, column: 8, scope: !676)
!689 = !DILocation(line: 177, column: 3, scope: !676)
!690 = !DILocation(line: 178, column: 3, scope: !676)
!691 = !DILocation(line: 180, column: 3, scope: !692)
!692 = distinct !DILexicalBlock(scope: !669, file: !286, line: 179, column: 9)
!693 = !DILocation(line: 181, column: 29, scope: !692)
!694 = !DILocation(line: 181, column: 3, scope: !692)
!695 = !DILocation(line: 182, column: 3, scope: !692)
!696 = !DILocation(line: 184, column: 1, scope: !658)
!697 = distinct !DISubprogram(name: "get_realm_options_by_name", scope: !286, file: !286, line: 186, type: !698, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !111, !501}
!700 = !DILocalVariable(name: "realm", arg: 1, scope: !697, file: !286, line: 186, type: !111)
!701 = !DILocation(line: 186, column: 38, scope: !697)
!702 = !DILocalVariable(name: "ro", arg: 2, scope: !697, file: !286, line: 186, type: !501)
!703 = !DILocation(line: 186, column: 62, scope: !697)
!704 = !DILocalVariable(name: "rp", scope: !697, file: !286, line: 188, type: !114)
!705 = !DILocation(line: 188, column: 17, scope: !697)
!706 = !DILocation(line: 189, column: 17, scope: !697)
!707 = !DILocation(line: 189, column: 2, scope: !697)
!708 = !DILocation(line: 190, column: 13, scope: !697)
!709 = !DILocation(line: 190, column: 22, scope: !697)
!710 = !DILocation(line: 190, column: 2, scope: !697)
!711 = !DILocation(line: 191, column: 1, scope: !697)
!712 = distinct !DISubprogram(name: "change_total_quota", scope: !286, file: !286, line: 193, type: !713, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!713 = !DISubroutineType(types: !714)
!714 = !{!7, !111, !7}
!715 = !DILocalVariable(name: "realm", arg: 1, scope: !712, file: !286, line: 193, type: !111)
!716 = !DILocation(line: 193, column: 30, scope: !712)
!717 = !DILocalVariable(name: "value", arg: 2, scope: !712, file: !286, line: 193, type: !7)
!718 = !DILocation(line: 193, column: 41, scope: !712)
!719 = !DILocalVariable(name: "ret", scope: !712, file: !286, line: 195, type: !7)
!720 = !DILocation(line: 195, column: 6, scope: !712)
!721 = !DILocation(line: 195, column: 12, scope: !712)
!722 = !DILocation(line: 196, column: 2, scope: !712)
!723 = !DILocalVariable(name: "rp", scope: !712, file: !286, line: 197, type: !113)
!724 = !DILocation(line: 197, column: 18, scope: !712)
!725 = !DILocation(line: 197, column: 33, scope: !712)
!726 = !DILocation(line: 197, column: 23, scope: !712)
!727 = !DILocation(line: 198, column: 41, scope: !712)
!728 = !DILocation(line: 198, column: 2, scope: !712)
!729 = !DILocation(line: 198, column: 6, scope: !712)
!730 = !DILocation(line: 198, column: 14, scope: !712)
!731 = !DILocation(line: 198, column: 27, scope: !712)
!732 = !DILocation(line: 198, column: 39, scope: !712)
!733 = !DILocation(line: 199, column: 2, scope: !712)
!734 = !DILocation(line: 200, column: 9, scope: !712)
!735 = !DILocation(line: 200, column: 2, scope: !712)
!736 = distinct !DISubprogram(name: "change_user_quota", scope: !286, file: !286, line: 203, type: !713, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!737 = !DILocalVariable(name: "realm", arg: 1, scope: !736, file: !286, line: 203, type: !111)
!738 = !DILocation(line: 203, column: 29, scope: !736)
!739 = !DILocalVariable(name: "value", arg: 2, scope: !736, file: !286, line: 203, type: !7)
!740 = !DILocation(line: 203, column: 40, scope: !736)
!741 = !DILocalVariable(name: "ret", scope: !736, file: !286, line: 205, type: !7)
!742 = !DILocation(line: 205, column: 6, scope: !736)
!743 = !DILocation(line: 205, column: 12, scope: !736)
!744 = !DILocation(line: 206, column: 2, scope: !736)
!745 = !DILocalVariable(name: "rp", scope: !736, file: !286, line: 207, type: !113)
!746 = !DILocation(line: 207, column: 18, scope: !736)
!747 = !DILocation(line: 207, column: 33, scope: !736)
!748 = !DILocation(line: 207, column: 23, scope: !736)
!749 = !DILocation(line: 208, column: 40, scope: !736)
!750 = !DILocation(line: 208, column: 2, scope: !736)
!751 = !DILocation(line: 208, column: 6, scope: !736)
!752 = !DILocation(line: 208, column: 14, scope: !736)
!753 = !DILocation(line: 208, column: 27, scope: !736)
!754 = !DILocation(line: 208, column: 38, scope: !736)
!755 = !DILocation(line: 209, column: 2, scope: !736)
!756 = !DILocation(line: 210, column: 9, scope: !736)
!757 = !DILocation(line: 210, column: 2, scope: !736)
!758 = distinct !DISubprogram(name: "clean_secrets_list", scope: !286, file: !286, line: 258, type: !485, scopeLine: 259, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!759 = !DILocalVariable(name: "sl", arg: 1, scope: !758, file: !286, line: 258, type: !487)
!760 = !DILocation(line: 258, column: 41, scope: !758)
!761 = !DILocation(line: 260, column: 5, scope: !762)
!762 = distinct !DILexicalBlock(scope: !758, file: !286, line: 260, column: 5)
!763 = !DILocation(line: 260, column: 5, scope: !758)
!764 = !DILocation(line: 261, column: 6, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !286, line: 261, column: 6)
!766 = distinct !DILexicalBlock(scope: !762, file: !286, line: 260, column: 9)
!767 = !DILocation(line: 261, column: 10, scope: !765)
!768 = !DILocation(line: 261, column: 6, scope: !766)
!769 = !DILocalVariable(name: "i", scope: !770, file: !286, line: 262, type: !157)
!770 = distinct !DILexicalBlock(scope: !765, file: !286, line: 261, column: 19)
!771 = !DILocation(line: 262, column: 11, scope: !770)
!772 = !DILocation(line: 263, column: 10, scope: !773)
!773 = distinct !DILexicalBlock(scope: !770, file: !286, line: 263, column: 4)
!774 = !DILocation(line: 263, column: 8, scope: !773)
!775 = !DILocation(line: 263, column: 14, scope: !776)
!776 = distinct !DILexicalBlock(scope: !773, file: !286, line: 263, column: 4)
!777 = !DILocation(line: 263, column: 16, scope: !776)
!778 = !DILocation(line: 263, column: 20, scope: !776)
!779 = !DILocation(line: 263, column: 15, scope: !776)
!780 = !DILocation(line: 263, column: 4, scope: !773)
!781 = !DILocation(line: 264, column: 8, scope: !782)
!782 = distinct !DILexicalBlock(scope: !783, file: !286, line: 264, column: 8)
!783 = distinct !DILexicalBlock(scope: !776, file: !286, line: 263, column: 28)
!784 = !DILocation(line: 264, column: 12, scope: !782)
!785 = !DILocation(line: 264, column: 20, scope: !782)
!786 = !DILocation(line: 264, column: 8, scope: !783)
!787 = !DILocation(line: 265, column: 11, scope: !788)
!788 = distinct !DILexicalBlock(scope: !782, file: !286, line: 264, column: 24)
!789 = !DILocation(line: 265, column: 15, scope: !788)
!790 = !DILocation(line: 265, column: 23, scope: !788)
!791 = !DILocation(line: 265, column: 6, scope: !788)
!792 = !DILocation(line: 266, column: 5, scope: !788)
!793 = !DILocation(line: 267, column: 4, scope: !783)
!794 = !DILocation(line: 263, column: 23, scope: !776)
!795 = !DILocation(line: 263, column: 4, scope: !776)
!796 = distinct !{!796, !780, !797, !798}
!797 = !DILocation(line: 267, column: 4, scope: !773)
!798 = !{!"llvm.loop.mustprogress"}
!799 = !DILocation(line: 268, column: 9, scope: !770)
!800 = !DILocation(line: 268, column: 13, scope: !770)
!801 = !DILocation(line: 268, column: 4, scope: !770)
!802 = !DILocation(line: 269, column: 4, scope: !770)
!803 = !DILocation(line: 269, column: 8, scope: !770)
!804 = !DILocation(line: 269, column: 16, scope: !770)
!805 = !DILocation(line: 270, column: 4, scope: !770)
!806 = !DILocation(line: 270, column: 8, scope: !770)
!807 = !DILocation(line: 270, column: 11, scope: !770)
!808 = !DILocation(line: 271, column: 3, scope: !770)
!809 = !DILocation(line: 272, column: 2, scope: !766)
!810 = !DILocation(line: 273, column: 1, scope: !758)
!811 = distinct !DISubprogram(name: "get_secrets_list_size", scope: !286, file: !286, line: 275, type: !812, scopeLine: 276, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!812 = !DISubroutineType(types: !813)
!813 = !{!157, !487}
!814 = !DILocalVariable(name: "sl", arg: 1, scope: !811, file: !286, line: 275, type: !487)
!815 = !DILocation(line: 275, column: 46, scope: !811)
!816 = !DILocation(line: 277, column: 5, scope: !817)
!817 = distinct !DILexicalBlock(scope: !811, file: !286, line: 277, column: 5)
!818 = !DILocation(line: 277, column: 8, scope: !817)
!819 = !DILocation(line: 277, column: 11, scope: !817)
!820 = !DILocation(line: 277, column: 15, scope: !817)
!821 = !DILocation(line: 277, column: 5, scope: !811)
!822 = !DILocation(line: 278, column: 10, scope: !823)
!823 = distinct !DILexicalBlock(scope: !817, file: !286, line: 277, column: 24)
!824 = !DILocation(line: 278, column: 14, scope: !823)
!825 = !DILocation(line: 278, column: 3, scope: !823)
!826 = !DILocation(line: 280, column: 2, scope: !811)
!827 = !DILocation(line: 281, column: 1, scope: !811)
!828 = distinct !DISubprogram(name: "get_secrets_list_elem", scope: !286, file: !286, line: 283, type: !829, scopeLine: 284, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!829 = !DISubroutineType(types: !830)
!830 = !{!108, !487, !157}
!831 = !DILocalVariable(name: "sl", arg: 1, scope: !828, file: !286, line: 283, type: !487)
!832 = !DILocation(line: 283, column: 51, scope: !828)
!833 = !DILocalVariable(name: "i", arg: 2, scope: !828, file: !286, line: 283, type: !157)
!834 = !DILocation(line: 283, column: 62, scope: !828)
!835 = !DILocation(line: 285, column: 27, scope: !836)
!836 = distinct !DILexicalBlock(scope: !828, file: !286, line: 285, column: 5)
!837 = !DILocation(line: 285, column: 5, scope: !836)
!838 = !DILocation(line: 285, column: 31, scope: !836)
!839 = !DILocation(line: 285, column: 30, scope: !836)
!840 = !DILocation(line: 285, column: 5, scope: !828)
!841 = !DILocation(line: 286, column: 10, scope: !842)
!842 = distinct !DILexicalBlock(scope: !836, file: !286, line: 285, column: 34)
!843 = !DILocation(line: 286, column: 14, scope: !842)
!844 = !DILocation(line: 286, column: 22, scope: !842)
!845 = !DILocation(line: 286, column: 3, scope: !842)
!846 = !DILocation(line: 288, column: 2, scope: !828)
!847 = !DILocation(line: 289, column: 1, scope: !828)
!848 = distinct !DISubprogram(name: "get_user_key", scope: !286, file: !286, line: 401, type: !849, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !289)
!849 = !DISubroutineType(types: !850)
!850 = !{!7, !7, !851, !851, !164, !164, !164, !852}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_network_buffer_handle", file: !44, line: 124, baseType: !107)
!853 = !DILocalVariable(name: "in_oauth", arg: 1, scope: !848, file: !286, line: 401, type: !7)
!854 = !DILocation(line: 401, column: 22, scope: !848)
!855 = !DILocalVariable(name: "out_oauth", arg: 2, scope: !848, file: !286, line: 401, type: !851)
!856 = !DILocation(line: 401, column: 37, scope: !848)
!857 = !DILocalVariable(name: "max_session_time", arg: 3, scope: !848, file: !286, line: 401, type: !851)
!858 = !DILocation(line: 401, column: 53, scope: !848)
!859 = !DILocalVariable(name: "usname", arg: 4, scope: !848, file: !286, line: 401, type: !164)
!860 = !DILocation(line: 401, column: 80, scope: !848)
!861 = !DILocalVariable(name: "realm", arg: 5, scope: !848, file: !286, line: 401, type: !164)
!862 = !DILocation(line: 401, column: 97, scope: !848)
!863 = !DILocalVariable(name: "key", arg: 6, scope: !848, file: !286, line: 401, type: !164)
!864 = !DILocation(line: 401, column: 114, scope: !848)
!865 = !DILocalVariable(name: "nbh", arg: 7, scope: !848, file: !286, line: 401, type: !852)
!866 = !DILocation(line: 401, column: 145, scope: !848)
!867 = !DILocalVariable(name: "ret", scope: !848, file: !286, line: 403, type: !7)
!868 = !DILocation(line: 403, column: 6, scope: !848)
!869 = !DILocation(line: 405, column: 5, scope: !870)
!870 = distinct !DILexicalBlock(scope: !848, file: !286, line: 405, column: 5)
!871 = !DILocation(line: 405, column: 5, scope: !848)
!872 = !DILocation(line: 406, column: 4, scope: !870)
!873 = !DILocation(line: 406, column: 21, scope: !870)
!874 = !DILocation(line: 406, column: 3, scope: !870)
!875 = !DILocation(line: 408, column: 5, scope: !876)
!876 = distinct !DILexicalBlock(scope: !848, file: !286, line: 408, column: 5)
!877 = !DILocation(line: 408, column: 14, scope: !876)
!878 = !DILocation(line: 408, column: 17, scope: !876)
!879 = !DILocation(line: 408, column: 27, scope: !876)
!880 = !DILocation(line: 408, column: 30, scope: !876)
!881 = !DILocation(line: 408, column: 37, scope: !876)
!882 = !DILocation(line: 408, column: 40, scope: !876)
!883 = !DILocation(line: 408, column: 5, scope: !848)
!884 = !DILocalVariable(name: "sar", scope: !885, file: !286, line: 410, type: !886)
!885 = distinct !DILexicalBlock(scope: !876, file: !286, line: 408, column: 51)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "stun_attr_ref", file: !23, line: 71, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!889 = !DILocation(line: 410, column: 17, scope: !885)
!890 = !DILocation(line: 410, column: 79, scope: !885)
!891 = !DILocation(line: 410, column: 55, scope: !885)
!892 = !DILocation(line: 411, column: 37, scope: !885)
!893 = !DILocation(line: 411, column: 9, scope: !885)
!894 = !DILocation(line: 410, column: 23, scope: !885)
!895 = !DILocation(line: 413, column: 6, scope: !896)
!896 = distinct !DILexicalBlock(scope: !885, file: !286, line: 413, column: 6)
!897 = !DILocation(line: 413, column: 6, scope: !885)
!898 = !DILocalVariable(name: "len", scope: !899, file: !286, line: 415, type: !7)
!899 = distinct !DILexicalBlock(scope: !896, file: !286, line: 413, column: 11)
!900 = !DILocation(line: 415, column: 8, scope: !899)
!901 = !DILocation(line: 415, column: 32, scope: !899)
!902 = !DILocation(line: 415, column: 14, scope: !899)
!903 = !DILocalVariable(name: "value", scope: !899, file: !286, line: 416, type: !159)
!904 = !DILocation(line: 416, column: 19, scope: !899)
!905 = !DILocation(line: 416, column: 47, scope: !899)
!906 = !DILocation(line: 416, column: 27, scope: !899)
!907 = !DILocation(line: 418, column: 5, scope: !899)
!908 = !DILocation(line: 418, column: 15, scope: !899)
!909 = !DILocation(line: 420, column: 7, scope: !910)
!910 = distinct !DILexicalBlock(scope: !899, file: !286, line: 420, column: 7)
!911 = !DILocation(line: 420, column: 10, scope: !910)
!912 = !DILocation(line: 420, column: 13, scope: !910)
!913 = !DILocation(line: 420, column: 16, scope: !910)
!914 = !DILocation(line: 420, column: 7, scope: !899)
!915 = !DILocalVariable(name: "dbd", scope: !916, file: !286, line: 422, type: !917)
!916 = distinct !DILexicalBlock(scope: !910, file: !286, line: 420, column: 23)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_dbdriver_t", file: !920, line: 77, baseType: !921)
!920 = !DIFile(filename: "src/apps/relay/dbdrivers/dbdriver.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "00319dc97026a2c0105cbae0fcb396b3")
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_dbdriver_t", file: !920, line: 50, size: 1664, elements: !922)
!922 = !{!923, !927, !931, !935, !939, !943, !944, !945, !946, !947, !951, !952, !956, !957, !961, !965, !969, !971, !994, !998, !1002, !1006, !1010, !1014, !1015, !1019}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "get_auth_secrets", scope: !921, file: !920, line: 51, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!7, !487, !164}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "get_user_key", scope: !921, file: !920, line: 52, baseType: !928, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!7, !164, !164, !164}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "set_user_key", scope: !921, file: !920, line: 53, baseType: !932, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!7, !164, !164, !108}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "del_user", scope: !921, file: !920, line: 54, baseType: !936, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!7, !164, !164}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "list_users", scope: !921, file: !920, line: 55, baseType: !940, size: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!7, !164, !487, !487}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "list_secrets", scope: !921, file: !920, line: 56, baseType: !940, size: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "del_secret", scope: !921, file: !920, line: 57, baseType: !936, size: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "set_secret", scope: !921, file: !920, line: 58, baseType: !936, size: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "add_origin", scope: !921, file: !920, line: 59, baseType: !936, size: 64, offset: 512)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "del_origin", scope: !921, file: !920, line: 60, baseType: !948, size: 64, offset: 576)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!7, !164}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "list_origins", scope: !921, file: !920, line: 61, baseType: !940, size: 64, offset: 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "set_realm_option_one", scope: !921, file: !920, line: 62, baseType: !953, size: 64, offset: 704)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!7, !164, !134, !108}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "list_realm_options", scope: !921, file: !920, line: 63, baseType: !948, size: 64, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "auth_ping", scope: !921, file: !920, line: 64, baseType: !958, size: 64, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !107}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "get_ip_list", scope: !921, file: !920, line: 65, baseType: !962, size: 64, offset: 896)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!7, !108, !201}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "set_permission_ip", scope: !921, file: !920, line: 66, baseType: !966, size: 64, offset: 960)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!7, !108, !164, !108, !7}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "reread_realms", scope: !921, file: !920, line: 67, baseType: !970, size: 64, offset: 1024)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "set_oauth_key", scope: !921, file: !920, line: 68, baseType: !972, size: 64, offset: 1088)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!7, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data_raw", file: !977, line: 144, baseType: !978)
!977 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data_raw", file: !977, line: 135, size: 4800, elements: !979)
!979 = !{!980, !984, !985, !988, !989, !993}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !978, file: !977, line: 136, baseType: !981, size: 1032)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1032, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 129)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !978, file: !977, line: 137, baseType: !211, size: 2056, offset: 1032)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !978, file: !977, line: 138, baseType: !986, size: 64, offset: 3136)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !155, line: 27, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !152, line: 45, baseType: !134)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !978, file: !977, line: 139, baseType: !154, size: 32, offset: 3200)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !978, file: !977, line: 140, baseType: !990, size: 520, offset: 3232)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 520, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 65)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !978, file: !977, line: 141, baseType: !124, size: 1024, offset: 3752)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "get_oauth_key", scope: !921, file: !920, line: 69, baseType: !995, size: 64, offset: 1152)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!7, !159, !975}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "del_oauth_key", scope: !921, file: !920, line: 70, baseType: !999, size: 64, offset: 1216)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!7, !159}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "list_oauth_keys", scope: !921, file: !920, line: 71, baseType: !1003, size: 64, offset: 1280)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!7, !487, !487, !487, !487, !487}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "get_admin_user", scope: !921, file: !920, line: 72, baseType: !1007, size: 64, offset: 1344)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!7, !159, !164, !164}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "set_admin_user", scope: !921, file: !920, line: 73, baseType: !1011, size: 64, offset: 1408)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!7, !159, !159, !159}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "del_admin_user", scope: !921, file: !920, line: 74, baseType: !999, size: 64, offset: 1472)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "list_admin_users", scope: !921, file: !920, line: 75, baseType: !1016, size: 64, offset: 1536)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!7, !7}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !921, file: !920, line: 76, baseType: !1020, size: 64, offset: 1600)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!1021 = !DILocation(line: 422, column: 29, scope: !916)
!1022 = !DILocation(line: 422, column: 35, scope: !916)
!1023 = !DILocation(line: 424, column: 9, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !916, file: !286, line: 424, column: 9)
!1025 = !DILocation(line: 424, column: 13, scope: !1024)
!1026 = !DILocation(line: 424, column: 16, scope: !1024)
!1027 = !DILocation(line: 424, column: 21, scope: !1024)
!1028 = !DILocation(line: 424, column: 9, scope: !916)
!1029 = !DILocalVariable(name: "rawKey", scope: !1030, file: !286, line: 426, type: !976)
!1030 = distinct !DILexicalBlock(scope: !1024, file: !286, line: 424, column: 36)
!1031 = !DILocation(line: 426, column: 25, scope: !1030)
!1032 = !DILocation(line: 427, column: 6, scope: !1030)
!1033 = !DILocalVariable(name: "gres", scope: !1030, file: !286, line: 429, type: !7)
!1034 = !DILocation(line: 429, column: 10, scope: !1030)
!1035 = !DILocation(line: 429, column: 20, scope: !1030)
!1036 = !DILocation(line: 429, column: 25, scope: !1030)
!1037 = !DILocation(line: 429, column: 41, scope: !1030)
!1038 = !DILocation(line: 429, column: 17, scope: !1030)
!1039 = !DILocation(line: 430, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 430, column: 9)
!1041 = !DILocation(line: 430, column: 13, scope: !1040)
!1042 = !DILocation(line: 430, column: 9, scope: !1030)
!1043 = !DILocation(line: 431, column: 14, scope: !1040)
!1044 = !DILocation(line: 431, column: 7, scope: !1040)
!1045 = !DILocation(line: 433, column: 17, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 433, column: 9)
!1047 = !DILocation(line: 433, column: 10, scope: !1046)
!1048 = !DILocation(line: 433, column: 9, scope: !1030)
!1049 = !DILocation(line: 434, column: 14, scope: !1046)
!1050 = !DILocation(line: 434, column: 7, scope: !1046)
!1051 = !DILocation(line: 436, column: 16, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 436, column: 9)
!1053 = !DILocation(line: 436, column: 9, scope: !1052)
!1054 = !DILocation(line: 436, column: 9, scope: !1030)
!1055 = !DILocation(line: 437, column: 11, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !286, line: 437, column: 10)
!1057 = distinct !DILexicalBlock(scope: !1052, file: !286, line: 436, column: 26)
!1058 = !DILocation(line: 437, column: 10, scope: !1057)
!1059 = !DILocation(line: 438, column: 15, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1056, file: !286, line: 437, column: 109)
!1061 = !DILocation(line: 438, column: 8, scope: !1060)
!1062 = !DILocation(line: 440, column: 6, scope: !1057)
!1063 = !DILocalVariable(name: "okd", scope: !1030, file: !286, line: 442, type: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data", file: !6, line: 221, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data", file: !6, line: 212, size: 3840, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !1065, file: !6, line: 213, baseType: !981, size: 1032)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !1065, file: !6, line: 214, baseType: !211, size: 2056, offset: 1032)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key_size", scope: !1065, file: !6, line: 215, baseType: !157, size: 64, offset: 3136)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1065, file: !6, line: 216, baseType: !153, size: 32, offset: 3200)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !1065, file: !6, line: 217, baseType: !153, size: 32, offset: 3232)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !1065, file: !6, line: 218, baseType: !990, size: 520, offset: 3264)
!1073 = !DILocation(line: 442, column: 21, scope: !1030)
!1074 = !DILocation(line: 443, column: 6, scope: !1030)
!1075 = !DILocation(line: 445, column: 6, scope: !1030)
!1076 = !DILocalVariable(name: "err_msg", scope: !1030, file: !286, line: 447, type: !1077)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 8200, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 1025)
!1080 = !DILocation(line: 447, column: 11, scope: !1030)
!1081 = !DILocalVariable(name: "err_msg_size", scope: !1030, file: !286, line: 448, type: !157)
!1082 = !DILocation(line: 448, column: 13, scope: !1030)
!1083 = !DILocalVariable(name: "okey", scope: !1030, file: !286, line: 450, type: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key", file: !6, line: 236, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key", file: !6, line: 223, size: 7616, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1094, !1095, !1096, !1097}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !1085, file: !6, line: 224, baseType: !981, size: 1032)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !1085, file: !6, line: 225, baseType: !211, size: 2056, offset: 1032)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key_size", scope: !1085, file: !6, line: 226, baseType: !157, size: 64, offset: 3136)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1085, file: !6, line: 227, baseType: !153, size: 32, offset: 3200)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !1085, file: !6, line: 228, baseType: !153, size: 32, offset: 3232)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !1085, file: !6, line: 229, baseType: !1093, size: 32, offset: 3264)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENC_ALG", file: !6, line: 187, baseType: !5)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_key", scope: !1085, file: !6, line: 230, baseType: !211, size: 2056, offset: 3296)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_key_size", scope: !1085, file: !6, line: 231, baseType: !157, size: 64, offset: 5376)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "auth_key", scope: !1085, file: !6, line: 232, baseType: !211, size: 2056, offset: 5440)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "auth_key_size", scope: !1085, file: !6, line: 233, baseType: !157, size: 64, offset: 7552)
!1098 = !DILocation(line: 450, column: 16, scope: !1030)
!1099 = !DILocation(line: 451, column: 6, scope: !1030)
!1100 = !DILocation(line: 453, column: 46, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 453, column: 10)
!1102 = !DILocation(line: 453, column: 55, scope: !1101)
!1103 = !DILocation(line: 453, column: 10, scope: !1101)
!1104 = !DILocation(line: 453, column: 69, scope: !1101)
!1105 = !DILocation(line: 453, column: 10, scope: !1030)
!1106 = !DILocation(line: 454, column: 51, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !286, line: 453, column: 74)
!1108 = !DILocation(line: 454, column: 7, scope: !1107)
!1109 = !DILocation(line: 455, column: 7, scope: !1107)
!1110 = !DILocalVariable(name: "dot", scope: !1030, file: !286, line: 458, type: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_token", file: !6, line: 253, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_token", file: !6, line: 249, size: 3264, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "enc_block", scope: !1112, file: !6, line: 250, baseType: !1115, size: 3264)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_encrypted_block", file: !6, line: 247, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_encrypted_block", file: !6, line: 238, size: 3264, elements: !1117)
!1117 = !{!1118, !1119, !1123, !1124, !1126, !1127}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_length", scope: !1116, file: !6, line: 239, baseType: !246, size: 16)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !1116, file: !6, line: 240, baseType: !1120, size: 2048, offset: 16)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 2048, elements: !1121)
!1121 = !{!1122}
!1122 = !DISubrange(count: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "key_length", scope: !1116, file: !6, line: 241, baseType: !246, size: 16, offset: 2064)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "mac_key", scope: !1116, file: !6, line: 242, baseType: !1125, size: 1024, offset: 2080)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !125)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1116, file: !6, line: 243, baseType: !986, size: 64, offset: 3136)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !1116, file: !6, line: 244, baseType: !154, size: 32, offset: 3200)
!1128 = !DILocation(line: 458, column: 18, scope: !1030)
!1129 = !DILocation(line: 459, column: 6, scope: !1030)
!1130 = !DILocalVariable(name: "etoken", scope: !1030, file: !286, line: 461, type: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "encoded_oauth_token", file: !6, line: 262, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_encoded_oauth_token", file: !6, line: 257, size: 8256, elements: !1133)
!1133 = !{!1134, !1138}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !1132, file: !6, line: 258, baseType: !1135, size: 8192)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 8192, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !6, line: 259, baseType: !157, size: 64, offset: 8192)
!1139 = !DILocation(line: 461, column: 26, scope: !1030)
!1140 = !DILocation(line: 462, column: 6, scope: !1030)
!1141 = !DILocation(line: 464, column: 17, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 464, column: 9)
!1143 = !DILocation(line: 464, column: 9, scope: !1142)
!1144 = !DILocation(line: 464, column: 21, scope: !1142)
!1145 = !DILocation(line: 464, column: 9, scope: !1030)
!1146 = !DILocation(line: 465, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1142, file: !286, line: 464, column: 45)
!1148 = !DILocation(line: 466, column: 7, scope: !1147)
!1149 = !DILocation(line: 468, column: 12, scope: !1030)
!1150 = !DILocation(line: 468, column: 25, scope: !1030)
!1151 = !DILocation(line: 468, column: 18, scope: !1030)
!1152 = !DILocation(line: 468, column: 39, scope: !1030)
!1153 = !DILocation(line: 468, column: 31, scope: !1030)
!1154 = !DILocation(line: 468, column: 6, scope: !1030)
!1155 = !DILocation(line: 469, column: 28, scope: !1030)
!1156 = !DILocation(line: 469, column: 20, scope: !1030)
!1157 = !DILocation(line: 469, column: 13, scope: !1030)
!1158 = !DILocation(line: 469, column: 18, scope: !1030)
!1159 = !DILocalVariable(name: "server_name", scope: !1030, file: !286, line: 471, type: !108)
!1160 = !DILocation(line: 471, column: 18, scope: !1030)
!1161 = !DILocation(line: 472, column: 11, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 472, column: 9)
!1163 = !DILocation(line: 472, column: 23, scope: !1162)
!1164 = !DILocation(line: 472, column: 26, scope: !1162)
!1165 = !DILocation(line: 472, column: 9, scope: !1030)
!1166 = !DILocation(line: 473, column: 28, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1162, file: !286, line: 472, column: 43)
!1168 = !DILocation(line: 473, column: 19, scope: !1167)
!1169 = !DILocation(line: 474, column: 12, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1167, file: !286, line: 474, column: 10)
!1171 = !DILocation(line: 474, column: 24, scope: !1170)
!1172 = !DILocation(line: 474, column: 27, scope: !1170)
!1173 = !DILocation(line: 474, column: 10, scope: !1167)
!1174 = !DILocation(line: 475, column: 8, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1170, file: !286, line: 474, column: 44)
!1176 = !DILocation(line: 476, column: 8, scope: !1175)
!1177 = !DILocation(line: 478, column: 6, scope: !1167)
!1178 = !DILocation(line: 480, column: 47, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 480, column: 10)
!1180 = !DILocation(line: 480, column: 10, scope: !1179)
!1181 = !DILocation(line: 480, column: 81, scope: !1179)
!1182 = !DILocation(line: 480, column: 10, scope: !1030)
!1183 = !DILocation(line: 481, column: 7, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1179, file: !286, line: 480, column: 86)
!1185 = !DILocation(line: 482, column: 7, scope: !1184)
!1186 = !DILocation(line: 485, column: 17, scope: !1030)
!1187 = !DILocation(line: 485, column: 27, scope: !1030)
!1188 = !DILocation(line: 485, column: 13, scope: !1030)
!1189 = !DILocation(line: 485, column: 6, scope: !1030)
!1190 = !DILocation(line: 487, column: 7, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 485, column: 39)
!1192 = !DILocation(line: 490, column: 6, scope: !1191)
!1193 = !DILocation(line: 492, column: 104, scope: !1191)
!1194 = !DILocation(line: 492, column: 114, scope: !1191)
!1195 = !DILocation(line: 492, column: 95, scope: !1191)
!1196 = !DILocation(line: 492, column: 7, scope: !1191)
!1197 = !DILocation(line: 493, column: 7, scope: !1191)
!1198 = !DILocalVariable(name: "pwdtmp", scope: !1030, file: !286, line: 496, type: !1199)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "password_t", file: !23, line: 66, baseType: !1200)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 2056, elements: !212)
!1201 = !DILocation(line: 496, column: 17, scope: !1030)
!1202 = !DILocation(line: 498, column: 33, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1030, file: !286, line: 497, column: 9)
!1204 = !DILocation(line: 498, column: 9, scope: !1203)
!1205 = !DILocation(line: 499, column: 37, scope: !1203)
!1206 = !DILocation(line: 499, column: 9, scope: !1203)
!1207 = !DILocation(line: 500, column: 13, scope: !1203)
!1208 = !DILocation(line: 500, column: 23, scope: !1203)
!1209 = !DILocation(line: 500, column: 9, scope: !1203)
!1210 = !DILocation(line: 501, column: 9, scope: !1203)
!1211 = !DILocation(line: 497, column: 9, scope: !1203)
!1212 = !DILocation(line: 502, column: 25, scope: !1203)
!1213 = !DILocation(line: 497, column: 9, scope: !1030)
!1214 = !DILocalVariable(name: "lifetime", scope: !1215, file: !286, line: 504, type: !153)
!1215 = distinct !DILexicalBlock(scope: !1203, file: !286, line: 502, column: 29)
!1216 = !DILocation(line: 504, column: 19, scope: !1215)
!1217 = !DILocation(line: 504, column: 48, scope: !1215)
!1218 = !DILocation(line: 504, column: 58, scope: !1215)
!1219 = !DILocation(line: 505, column: 10, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1215, file: !286, line: 505, column: 10)
!1221 = !DILocation(line: 505, column: 10, scope: !1215)
!1222 = !DILocalVariable(name: "ts", scope: !1223, file: !286, line: 506, type: !153)
!1223 = distinct !DILexicalBlock(scope: !1220, file: !286, line: 505, column: 20)
!1224 = !DILocation(line: 506, column: 20, scope: !1223)
!1225 = !DILocation(line: 506, column: 43, scope: !1223)
!1226 = !DILocation(line: 506, column: 53, scope: !1223)
!1227 = !DILocation(line: 506, column: 63, scope: !1223)
!1228 = !DILocation(line: 506, column: 25, scope: !1223)
!1229 = !DILocalVariable(name: "to", scope: !1223, file: !286, line: 507, type: !153)
!1230 = !DILocation(line: 507, column: 20, scope: !1223)
!1231 = !DILocation(line: 507, column: 25, scope: !1223)
!1232 = !DILocation(line: 507, column: 30, scope: !1223)
!1233 = !DILocation(line: 507, column: 28, scope: !1223)
!1234 = !DILocation(line: 507, column: 39, scope: !1223)
!1235 = !DILocalVariable(name: "ct", scope: !1223, file: !286, line: 508, type: !153)
!1236 = !DILocation(line: 508, column: 20, scope: !1223)
!1237 = !DILocation(line: 508, column: 25, scope: !1223)
!1238 = !DILocation(line: 509, column: 12, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1223, file: !286, line: 509, column: 11)
!1240 = !DILocation(line: 509, column: 11, scope: !1223)
!1241 = !DILocation(line: 510, column: 9, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1239, file: !286, line: 509, column: 37)
!1243 = !DILocation(line: 511, column: 9, scope: !1242)
!1244 = !DILocation(line: 513, column: 11, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1223, file: !286, line: 513, column: 11)
!1246 = !DILocation(line: 513, column: 11, scope: !1223)
!1247 = !DILocation(line: 514, column: 29, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1245, file: !286, line: 513, column: 29)
!1249 = !DILocation(line: 514, column: 34, scope: !1248)
!1250 = !DILocation(line: 514, column: 32, scope: !1248)
!1251 = !DILocation(line: 514, column: 10, scope: !1248)
!1252 = !DILocation(line: 514, column: 27, scope: !1248)
!1253 = !DILocation(line: 515, column: 8, scope: !1248)
!1254 = !DILocation(line: 516, column: 7, scope: !1223)
!1255 = !DILocation(line: 518, column: 17, scope: !1215)
!1256 = !DILocation(line: 518, column: 27, scope: !1215)
!1257 = !DILocation(line: 518, column: 13, scope: !1215)
!1258 = !DILocation(line: 518, column: 35, scope: !1215)
!1259 = !DILocation(line: 518, column: 43, scope: !1215)
!1260 = !DILocation(line: 518, column: 53, scope: !1215)
!1261 = !DILocation(line: 518, column: 39, scope: !1215)
!1262 = !DILocation(line: 518, column: 7, scope: !1215)
!1263 = !DILocation(line: 520, column: 17, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1215, file: !286, line: 520, column: 10)
!1265 = !DILocation(line: 520, column: 10, scope: !1264)
!1266 = !DILocation(line: 520, column: 10, scope: !1215)
!1267 = !DILocation(line: 521, column: 21, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1264, file: !286, line: 520, column: 27)
!1269 = !DILocation(line: 521, column: 14, scope: !1268)
!1270 = !DILocation(line: 521, column: 27, scope: !1268)
!1271 = !DILocation(line: 521, column: 8, scope: !1268)
!1272 = !DILocation(line: 522, column: 7, scope: !1268)
!1273 = !DILocation(line: 524, column: 11, scope: !1215)
!1274 = !DILocation(line: 525, column: 6, scope: !1215)
!1275 = !DILocation(line: 526, column: 5, scope: !1030)
!1276 = !DILocation(line: 527, column: 4, scope: !916)
!1277 = !DILocation(line: 528, column: 3, scope: !899)
!1278 = !DILocation(line: 529, column: 2, scope: !885)
!1279 = !DILocation(line: 531, column: 5, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !848, file: !286, line: 531, column: 5)
!1281 = !DILocation(line: 531, column: 15, scope: !1280)
!1282 = !DILocation(line: 531, column: 19, scope: !1280)
!1283 = !DILocation(line: 531, column: 18, scope: !1280)
!1284 = !DILocation(line: 531, column: 5, scope: !848)
!1285 = !DILocation(line: 532, column: 10, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1280, file: !286, line: 531, column: 30)
!1287 = !DILocation(line: 532, column: 3, scope: !1286)
!1288 = !DILocation(line: 535, column: 17, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !848, file: !286, line: 535, column: 5)
!1290 = !DILocation(line: 535, column: 5, scope: !1289)
!1291 = !DILocation(line: 535, column: 5, scope: !848)
!1292 = !DILocalVariable(name: "ctime", scope: !1293, file: !286, line: 537, type: !153)
!1293 = distinct !DILexicalBlock(scope: !1289, file: !286, line: 535, column: 49)
!1294 = !DILocation(line: 537, column: 15, scope: !1293)
!1295 = !DILocation(line: 537, column: 37, scope: !1293)
!1296 = !DILocation(line: 537, column: 23, scope: !1293)
!1297 = !DILocalVariable(name: "ts", scope: !1293, file: !286, line: 538, type: !153)
!1298 = !DILocation(line: 538, column: 15, scope: !1293)
!1299 = !DILocalVariable(name: "sl", scope: !1293, file: !286, line: 539, type: !388)
!1300 = !DILocation(line: 539, column: 18, scope: !1293)
!1301 = !DILocalVariable(name: "sll", scope: !1293, file: !286, line: 540, type: !157)
!1302 = !DILocation(line: 540, column: 10, scope: !1293)
!1303 = !DILocation(line: 542, column: 3, scope: !1293)
!1304 = !DILocation(line: 544, column: 28, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1293, file: !286, line: 544, column: 6)
!1306 = !DILocation(line: 544, column: 6, scope: !1305)
!1307 = !DILocation(line: 544, column: 34, scope: !1305)
!1308 = !DILocation(line: 544, column: 6, scope: !1293)
!1309 = !DILocation(line: 545, column: 11, scope: !1305)
!1310 = !DILocation(line: 545, column: 4, scope: !1305)
!1311 = !DILocation(line: 547, column: 38, scope: !1293)
!1312 = !DILocation(line: 547, column: 8, scope: !1293)
!1313 = !DILocation(line: 547, column: 6, scope: !1293)
!1314 = !DILocation(line: 549, column: 7, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1293, file: !286, line: 549, column: 6)
!1316 = !DILocation(line: 549, column: 6, scope: !1293)
!1317 = !DILocalVariable(name: "hmac", scope: !1318, file: !286, line: 551, type: !1125)
!1318 = distinct !DILexicalBlock(scope: !1315, file: !286, line: 549, column: 36)
!1319 = !DILocation(line: 551, column: 12, scope: !1318)
!1320 = !DILocalVariable(name: "hmac_len", scope: !1318, file: !286, line: 552, type: !16)
!1321 = !DILocation(line: 552, column: 17, scope: !1318)
!1322 = !DILocalVariable(name: "pwdtmp", scope: !1318, file: !286, line: 553, type: !1199)
!1323 = !DILocation(line: 553, column: 15, scope: !1318)
!1324 = !DILocation(line: 555, column: 4, scope: !1318)
!1325 = !DILocation(line: 555, column: 12, scope: !1318)
!1326 = !DILocalVariable(name: "sar", scope: !1318, file: !286, line: 557, type: !886)
!1327 = !DILocation(line: 557, column: 18, scope: !1318)
!1328 = !DILocation(line: 557, column: 80, scope: !1318)
!1329 = !DILocation(line: 557, column: 56, scope: !1318)
!1330 = !DILocation(line: 558, column: 36, scope: !1318)
!1331 = !DILocation(line: 558, column: 8, scope: !1318)
!1332 = !DILocation(line: 557, column: 24, scope: !1318)
!1333 = !DILocation(line: 560, column: 9, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1318, file: !286, line: 560, column: 8)
!1335 = !DILocation(line: 560, column: 8, scope: !1318)
!1336 = !DILocation(line: 561, column: 5, scope: !1334)
!1337 = !DILocalVariable(name: "sarlen", scope: !1318, file: !286, line: 563, type: !7)
!1338 = !DILocation(line: 563, column: 8, scope: !1318)
!1339 = !DILocation(line: 563, column: 35, scope: !1318)
!1340 = !DILocation(line: 563, column: 17, scope: !1318)
!1341 = !DILocation(line: 564, column: 11, scope: !1318)
!1342 = !DILocation(line: 564, column: 4, scope: !1318)
!1343 = !DILocation(line: 566, column: 14, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !1318, file: !286, line: 564, column: 19)
!1345 = !DILocation(line: 567, column: 5, scope: !1344)
!1346 = !DILocation(line: 570, column: 4, scope: !1344)
!1347 = !DILocation(line: 572, column: 5, scope: !1344)
!1348 = !DILocation(line: 575, column: 11, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !1318, file: !286, line: 575, column: 4)
!1350 = !DILocation(line: 575, column: 8, scope: !1349)
!1351 = !DILocation(line: 575, column: 14, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1349, file: !286, line: 575, column: 4)
!1353 = !DILocation(line: 575, column: 18, scope: !1352)
!1354 = !DILocation(line: 575, column: 17, scope: !1352)
!1355 = !DILocation(line: 575, column: 4, scope: !1349)
!1356 = !DILocalVariable(name: "secret", scope: !1357, file: !286, line: 577, type: !108)
!1357 = distinct !DILexicalBlock(scope: !1352, file: !286, line: 575, column: 52)
!1358 = !DILocation(line: 577, column: 17, scope: !1357)
!1359 = !DILocation(line: 577, column: 52, scope: !1357)
!1360 = !DILocation(line: 577, column: 26, scope: !1357)
!1361 = !DILocation(line: 579, column: 8, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1357, file: !286, line: 579, column: 8)
!1363 = !DILocation(line: 579, column: 8, scope: !1357)
!1364 = !DILocation(line: 580, column: 29, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1366, file: !286, line: 580, column: 9)
!1366 = distinct !DILexicalBlock(scope: !1362, file: !286, line: 579, column: 16)
!1367 = !DILocation(line: 580, column: 51, scope: !1365)
!1368 = !DILocation(line: 580, column: 37, scope: !1365)
!1369 = !DILocation(line: 580, column: 76, scope: !1365)
!1370 = !DILocation(line: 580, column: 91, scope: !1365)
!1371 = !DILocation(line: 580, column: 84, scope: !1365)
!1372 = !DILocation(line: 580, column: 100, scope: !1365)
!1373 = !DILocation(line: 580, column: 9, scope: !1365)
!1374 = !DILocation(line: 580, column: 133, scope: !1365)
!1375 = !DILocation(line: 580, column: 9, scope: !1366)
!1376 = !DILocalVariable(name: "pwd_length", scope: !1377, file: !286, line: 581, type: !157)
!1377 = distinct !DILexicalBlock(scope: !1365, file: !286, line: 580, column: 138)
!1378 = !DILocation(line: 581, column: 14, scope: !1377)
!1379 = !DILocalVariable(name: "pwd", scope: !1377, file: !286, line: 582, type: !111)
!1380 = !DILocation(line: 582, column: 13, scope: !1377)
!1381 = !DILocation(line: 582, column: 33, scope: !1377)
!1382 = !DILocation(line: 582, column: 38, scope: !1377)
!1383 = !DILocation(line: 582, column: 19, scope: !1377)
