; ModuleID = './src/protocols/pipeline/pull.c'
source_filename = "./src/protocols/pipeline/pull.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }

@nn_pull_socktype_struct = internal global %struct.nn_socktype { i32 1, i32 81, i32 2, ptr @nn_xpull_create, ptr @nn_xpull_ispeer, %struct.nn_list_item { ptr inttoptr (i64 -1 to ptr), ptr inttoptr (i64 -1 to ptr) } }, align 8, !dbg !0
@nn_pull_socktype = dso_local global ptr @nn_pull_socktype_struct, align 8, !dbg !5

declare i32 @nn_xpull_create(ptr noundef, ptr noundef) #0

declare i32 @nn_xpull_ispeer(i32 noundef) #0

attributes #0 = { "frame-pointer"="all" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!102, !103, !104, !105, !106, !107, !108}
!llvm.ident = !{!109}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nn_pull_socktype_struct", scope: !2, file: !7, line: 30, type: !9, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/protocols/pipeline/pull.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2837fa6537b77294e6f839b94e5ca3d3")
!4 = !{!5, !0}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "nn_pull_socktype", scope: !2, file: !7, line: 39, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "./src/protocols/pipeline/pull.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2837fa6537b77294e6f839b94e5ca3d3")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !10, line: 160, size: 384, elements: !11)
!10 = !DIFile(filename: "./src/protocols/pipeline/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!11 = !{!12, !14, !15, !16, !91, !95}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !9, file: !10, line: 163, baseType: !13, size: 32)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !9, file: !10, line: 164, baseType: !13, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !9, file: !10, line: 167, baseType: !13, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !9, file: !10, line: 173, baseType: !17, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DISubroutineType(types: !19)
!19 = !{!13, !20, !21}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !10, line: 123, size: 128, elements: !24)
!24 = !{!25, !88}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !23, file: !10, line: 124, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !10, line: 84, size: 704, elements: !29)
!29 = !{!30, !34, !35, !41, !45, !46, !47, !51, !73, !74, !83}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !28, file: !10, line: 87, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !22}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !28, file: !10, line: 90, baseType: !31, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !28, file: !10, line: 97, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!13, !22, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !10, line: 56, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !28, file: !10, line: 98, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !22, !39}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !28, file: !10, line: 99, baseType: !42, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !28, file: !10, line: 100, baseType: !42, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !28, file: !10, line: 104, baseType: !48, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!13, !22}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !28, file: !10, line: 108, baseType: !52, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!13, !22, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !57, line: 30, size: 512, elements: !58)
!57 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!58 = !{!59, !72}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !56, file: !57, line: 33, baseType: !60, size: 256)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !61, line: 39, size: 256, elements: !62)
!61 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !60, file: !61, line: 40, baseType: !64, size: 256)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 256, elements: !70)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !66, line: 24, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !68, line: 38, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!69 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !{!71}
!71 = !DISubrange(count: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !56, file: !57, line: 36, baseType: !60, size: 256, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !28, file: !10, line: 112, baseType: !52, size: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !28, file: !10, line: 115, baseType: !75, size: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!13, !22, !13, !13, !78, !80}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 46, baseType: !82)
!81 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!82 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !28, file: !10, line: 119, baseType: !84, size: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!13, !22, !13, !13, !20, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !23, file: !10, line: 125, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !10, line: 125, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !9, file: !10, line: 179, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!13, !13}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !9, file: !10, line: 183, baseType: !96, size: 128, offset: 256)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !97, line: 26, size: 128, elements: !98)
!97 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!98 = !{!99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !97, line: 27, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !97, line: 28, baseType: !100, size: 64, offset: 64)
!102 = !{i32 7, !"Dwarf Version", i32 5}
!103 = !{i32 2, !"Debug Info Version", i32 3}
!104 = !{i32 1, !"wchar_size", i32 4}
!105 = !{i32 8, !"PIC Level", i32 2}
!106 = !{i32 7, !"PIE Level", i32 2}
!107 = !{i32 7, !"uwtable", i32 2}
!108 = !{i32 7, !"frame-pointer", i32 2}
!109 = !{!"clang version 16.0.0"}
