; ModuleID = './src/protocols/pipeline/xpull.c'
source_filename = "./src/protocols/pipeline/xpull.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_sockbase_vfptr = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct.nn_socktype = type { i32, i32, i32, ptr, ptr, %struct.nn_list_item }
%struct.nn_list_item = type { ptr, ptr }
%struct.nn_xpull = type { %struct.nn_sockbase, %struct.nn_fq }
%struct.nn_sockbase = type { ptr, ptr }
%struct.nn_fq = type { %struct.nn_priolist }
%struct.nn_priolist = type { [16 x %struct.nn_priolist_slot], i32 }
%struct.nn_priolist_slot = type { %struct.nn_list, ptr }
%struct.nn_list = type { ptr, ptr }
%struct.nn_xpull_data = type { %struct.nn_fq_data }
%struct.nn_fq_data = type { %struct.nn_priolist_data }
%struct.nn_priolist_data = type { ptr, i32, %struct.nn_list_item }

@stderr = external global ptr, align 8
@.str = private unnamed_addr constant [23 x i8] c"Out of memory (%s:%d)\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"./src/protocols/pipeline/xpull.c\00", align 1, !dbg !7
@nn_xpull_sockbase_vfptr = internal constant %struct.nn_sockbase_vfptr { ptr null, ptr @nn_xpull_destroy, ptr @nn_xpull_add, ptr @nn_xpull_rm, ptr @nn_xpull_in, ptr @nn_xpull_out, ptr @nn_xpull_events, ptr null, ptr @nn_xpull_recv, ptr @nn_xpull_setopt, ptr @nn_xpull_getopt }, align 8, !dbg !12

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/protocols/pipeline/xpull.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "d78e73422654b507a2aee98cd42ca399")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 23)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 33)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "nn_xpull_sockbase_vfptr", scope: !14, file: !2, line: 63, type: !26, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !15, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !16, globals: !127, splitDebugInlining: false, nameTableKind: None)
!15 = !DIFile(filename: "src/protocols/pipeline/xpull.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "d78e73422654b507a2aee98cd42ca399")
!16 = !{!17, !126}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_xpull", file: !2, line: 41, size: 3264, elements: !19)
!19 = !{!20, !93}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "sockbase", scope: !18, file: !2, line: 42, baseType: !21, size: 128)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase", file: !22, line: 123, size: 128, elements: !23)
!22 = !DIFile(filename: "./src/protocols/pipeline/../../protocol.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "4a0ba29a278319bd7d1d2ca969fba722")
!23 = !{!24, !90}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !21, file: !22, line: 124, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sockbase_vfptr", file: !22, line: 84, size: 704, elements: !28)
!28 = !{!29, !34, !35, !42, !46, !47, !48, !52, !74, !75, !84}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !27, file: !22, line: 87, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !27, file: !22, line: 90, baseType: !30, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !27, file: !22, line: 97, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !33, !40}
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipe", file: !22, line: 56, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rm", scope: !27, file: !22, line: 98, baseType: !43, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !33, !40}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !27, file: !22, line: 99, baseType: !43, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !27, file: !22, line: 100, baseType: !43, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !27, file: !22, line: 104, baseType: !49, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!39, !33}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !27, file: !22, line: 108, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!39, !33, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !58, line: 30, size: 512, elements: !59)
!58 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!59 = !{!60, !73}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !57, file: !58, line: 33, baseType: !61, size: 256)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !62, line: 39, size: 256, elements: !63)
!62 = !DIFile(filename: "src/utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !61, file: !62, line: 40, baseType: !65, size: 256)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 256, elements: !71)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !67, line: 24, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !69, line: 38, baseType: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !{!72}
!72 = !DISubrange(count: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !57, file: !58, line: 36, baseType: !61, size: 256, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !27, file: !22, line: 112, baseType: !53, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "setopt", scope: !27, file: !22, line: 115, baseType: !76, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!39, !33, !39, !39, !79, !81}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !82, line: 46, baseType: !83)
!82 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!83 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "getopt", scope: !27, file: !22, line: 119, baseType: !85, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!39, !33, !39, !39, !88, !89}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !21, file: !22, line: 125, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !22, line: 125, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fq", scope: !18, file: !2, line: 43, baseType: !94, size: 3136, offset: 128)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fq", file: !95, line: 37, size: 3136, elements: !96)
!95 = !DIFile(filename: "./src/protocols/pipeline/../utils/fq.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "342bacd48eb65b84f809ed6b86c6514c")
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "priolist", scope: !94, file: !95, line: 38, baseType: !98, size: 3136)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist", file: !99, line: 45, size: 3136, elements: !100)
!99 = !DIFile(filename: "./src/protocols/pipeline/../utils/priolist.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "e7a7c69c9c81fe3b1beae760b1a28137")
!100 = !{!101, !125}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !98, file: !99, line: 46, baseType: !102, size: 3072)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 3072, elements: !123)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_slot", file: !99, line: 40, size: 192, elements: !104)
!104 = !{!105, !116}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !103, file: !99, line: 41, baseType: !106, size: 128)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !107, line: 31, size: 128, elements: !108)
!107 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!108 = !{!109, !115}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !106, file: !107, line: 32, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !107, line: 26, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !111, file: !107, line: 27, baseType: !110, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !107, line: 28, baseType: !110, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !106, file: !107, line: 33, baseType: !110, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !103, file: !99, line: 42, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_priolist_data", file: !99, line: 34, size: 256, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !118, file: !99, line: 35, baseType: !40, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !118, file: !99, line: 36, baseType: !39, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !118, file: !99, line: 37, baseType: !111, size: 128, offset: 128)
!123 = !{!124}
!124 = !DISubrange(count: 16)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !98, file: !99, line: 47, baseType: !39, size: 32, offset: 3072)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!127 = !{!0, !7, !128, !12, !146}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "nn_xpull_socktype", scope: !14, file: !2, line: 196, type: !130, isLocal: false, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_socktype", file: !22, line: 160, size: 384, elements: !132)
!132 = !{!133, !134, !135, !136, !141, !145}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !131, file: !22, line: 163, baseType: !39, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !131, file: !22, line: 164, baseType: !39, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !22, line: 167, baseType: !39, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !131, file: !22, line: 173, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!39, !88, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ispeer", scope: !131, file: !22, line: 179, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!39, !39}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !131, file: !22, line: 183, baseType: !111, size: 128, offset: 256)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "nn_xpull_socktype_struct", scope: !14, file: !2, line: 187, type: !131, isLocal: true, isDefinition: true)
!148 = !{i32 7, !"Dwarf Version", i32 5}
!149 = !{i32 2, !"Debug Info Version", i32 3}
!150 = !{i32 1, !"wchar_size", i32 4}
!151 = !{i32 8, !"PIC Level", i32 2}
!152 = !{i32 7, !"PIE Level", i32 2}
!153 = !{i32 7, !"uwtable", i32 2}
!154 = !{i32 7, !"frame-pointer", i32 2}
!155 = !{!"clang version 16.0.0"}
!156 = distinct !DISubprogram(name: "nn_xpull_create", scope: !2, file: !2, line: 170, type: !138, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !157)
!157 = !{}
!158 = !DILocalVariable(name: "hint", arg: 1, scope: !156, file: !2, line: 170, type: !88)
!159 = !DILocation(line: 170, column: 28, scope: !156)
!160 = !DILocalVariable(name: "sockbase", arg: 2, scope: !156, file: !2, line: 170, type: !140)
!161 = !DILocation(line: 170, column: 55, scope: !156)
!162 = !DILocalVariable(name: "self", scope: !156, file: !2, line: 172, type: !17)
!163 = !DILocation(line: 172, column: 22, scope: !156)
!164 = !DILocation(line: 174, column: 12, scope: !156)
!165 = !DILocation(line: 174, column: 10, scope: !156)
!166 = !DILocation(line: 175, column: 5, scope: !156)
!167 = !DILocation(line: 175, column: 5, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !2, line: 175, column: 5)
!169 = distinct !DILexicalBlock(scope: !156, file: !2, line: 175, column: 5)
!170 = !DILocation(line: 175, column: 5, scope: !169)
!171 = !DILocation(line: 175, column: 5, scope: !172)
!172 = distinct !DILexicalBlock(scope: !168, file: !2, line: 175, column: 5)
!173 = !DILocation(line: 176, column: 20, scope: !156)
!174 = !DILocation(line: 176, column: 52, scope: !156)
!175 = !DILocation(line: 176, column: 5, scope: !156)
!176 = !DILocation(line: 177, column: 18, scope: !156)
!177 = !DILocation(line: 177, column: 24, scope: !156)
!178 = !DILocation(line: 177, column: 6, scope: !156)
!179 = !DILocation(line: 177, column: 15, scope: !156)
!180 = !DILocation(line: 179, column: 5, scope: !156)
!181 = distinct !DISubprogram(name: "nn_xpull_init", scope: !2, file: !2, line: 77, type: !182, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !14, retainedNodes: !157)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !17, !25, !88}
!184 = !DILocalVariable(name: "self", arg: 1, scope: !181, file: !2, line: 77, type: !17)
!185 = !DILocation(line: 77, column: 45, scope: !181)
!186 = !DILocalVariable(name: "vfptr", arg: 2, scope: !181, file: !2, line: 78, type: !25)
!187 = !DILocation(line: 78, column: 37, scope: !181)
!188 = !DILocalVariable(name: "hint", arg: 3, scope: !181, file: !2, line: 78, type: !88)
!189 = !DILocation(line: 78, column: 50, scope: !181)
!190 = !DILocation(line: 80, column: 24, scope: !181)
!191 = !DILocation(line: 80, column: 30, scope: !181)
!192 = !DILocation(line: 80, column: 40, scope: !181)
!193 = !DILocation(line: 80, column: 47, scope: !181)
!194 = !DILocation(line: 80, column: 5, scope: !181)
!195 = !DILocation(line: 81, column: 18, scope: !181)
!196 = !DILocation(line: 81, column: 24, scope: !181)
!197 = !DILocation(line: 81, column: 5, scope: !181)
!198 = !DILocation(line: 82, column: 1, scope: !181)
!199 = distinct !DISubprogram(name: "nn_xpull_ispeer", scope: !2, file: !2, line: 182, type: !143, scopeLine: 183, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !14, retainedNodes: !157)
!200 = !DILocalVariable(name: "socktype", arg: 1, scope: !199, file: !2, line: 182, type: !39)
!201 = !DILocation(line: 182, column: 26, scope: !199)
!202 = !DILocation(line: 184, column: 12, scope: !199)
!203 = !DILocation(line: 184, column: 21, scope: !199)
!204 = !DILocation(line: 184, column: 5, scope: !199)
