; ModuleID = '/home/raj/coturn/src/apps/relay/dbdrivers/dbd_redis.c'
source_filename = "/home/raj/coturn/src/apps/relay/dbdrivers/dbd_redis.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_dbdriver_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 45)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 210, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 8)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !14, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 32)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !2, line: 225, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 11)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 21)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 7)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 254, type: !51, isLocal: true, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 39)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "donot_print_connection_success", scope: !56, file: !2, line: 41, type: !74, isLocal: true, isDefinition: true)
!56 = distinct !DICompileUnit(language: DW_LANG_C11, file: !57, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !58, retainedTypes: !82, globals: !223, splitDebugInlining: false, nameTableKind: None)
!57 = !DIFile(filename: "/home/raj/coturn/src/apps/relay/dbdrivers/dbd_redis.c", directory: "/home/raj/coturn/build", checksumkind: CSK_MD5, checksum: "30aa67407455ac8d6473d444ab4ab559")
!58 = !{!59, !67, !72}
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 47, baseType: !61, size: 32, elements: !62)
!60 = !DIFile(filename: "src/apps/common/ns_turn_utils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "74cb4019b1eb9d8e2b879df518b15a25")
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "TURN_LOG_LEVEL_INFO", value: 0)
!64 = !DIEnumerator(name: "TURN_LOG_LEVEL_CONTROL", value: 1)
!65 = !DIEnumerator(name: "TURN_LOG_LEVEL_WARNING", value: 2)
!66 = !DIEnumerator(name: "TURN_LOG_LEVEL_ERROR", value: 3)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "redisConnectionType", file: !68, line: 111, baseType: !61, size: 32, elements: !69)
!68 = !DIFile(filename: "/usr/include/hiredis/hiredis.h", directory: "", checksumkind: CSK_MD5, checksum: "5e1762de74574e650d25f42de25117d4")
!69 = !{!70, !71}
!70 = !DIEnumerator(name: "REDIS_CONN_TCP", value: 0)
!71 = !DIEnumerator(name: "REDIS_CONN_UNIX", value: 1)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SHATYPE", file: !73, line: 160, baseType: !74, size: 32, elements: !75)
!73 = !DIFile(filename: "src/client/ns_turn_msg_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "4d8c44ae9e82b7a50b86805787352690")
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DIEnumerator(name: "SHATYPE_ERROR", value: -1)
!77 = !DIEnumerator(name: "SHATYPE_DEFAULT", value: 0)
!78 = !DIEnumerator(name: "SHATYPE_SHA1", value: 0)
!79 = !DIEnumerator(name: "SHATYPE_SHA256", value: 1)
!80 = !DIEnumerator(name: "SHATYPE_SHA384", value: 2)
!81 = !DIEnumerator(name: "SHATYPE_SHA512", value: 3)
!82 = !{!83, !84, !86, !74, !87, !92, !108, !61, !117, !102, !204, !206, !208, !210, !212, !213, !216, !218}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !88, line: 10, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 160, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!91 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReply", file: !68, line: 96, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReply", file: !68, line: 89, size: 384, elements: !95)
!95 = !{!96, !97, !99, !103, !104, !105}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !68, line: 90, baseType: !74, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !94, file: !68, line: 91, baseType: !98, size: 64, offset: 64)
!98 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !94, file: !68, line: 92, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 46, baseType: !102)
!101 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!102 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !94, file: !68, line: 93, baseType: !86, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !94, file: !68, line: 94, baseType: !100, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !94, file: !68, line: 95, baseType: !106, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ryconninfo", file: !2, line: 57, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Ryconninfo", file: !2, line: 49, size: 256, elements: !111)
!111 = !{!112, !113, !114, !115, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !110, file: !2, line: 50, baseType: !86, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !110, file: !2, line: 51, baseType: !86, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !110, file: !2, line: 52, baseType: !86, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "connect_timeout", scope: !110, file: !2, line: 53, baseType: !61, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !110, file: !2, line: 54, baseType: !61, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisContext", file: !68, line: 138, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisContext", file: !68, line: 117, size: 1664, elements: !120)
!120 = !{!121, !122, !126, !127, !128, !129, !185, !186, !194, !200}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !119, file: !68, line: 118, baseType: !74, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !119, file: !68, line: 119, baseType: !123, size: 1024, offset: 32)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !119, file: !68, line: 120, baseType: !74, size: 32, offset: 1056)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !68, line: 121, baseType: !74, size: 32, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "obuf", scope: !119, file: !68, line: 122, baseType: !86, size: 64, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !119, file: !68, line: 123, baseType: !130, size: 64, offset: 1216)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReader", file: !132, line: 95, baseType: !133)
!132 = !DIFile(filename: "/usr/include/hiredis/read.h", directory: "", checksumkind: CSK_MD5, checksum: "5e2fbb2b7092d07192fd3a67cc71e387")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReader", file: !132, line: 80, size: 4480, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !155, !156, !157, !184}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !133, file: !132, line: 81, baseType: !74, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "errstr", scope: !133, file: !132, line: 82, baseType: !123, size: 1024, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !133, file: !132, line: 84, baseType: !86, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !133, file: !132, line: 85, baseType: !100, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !133, file: !132, line: 86, baseType: !100, size: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "maxbuf", scope: !133, file: !132, line: 87, baseType: !100, size: 64, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rstack", scope: !133, file: !132, line: 89, baseType: !142, size: 2880, offset: 1344)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 2880, elements: !153)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReadTask", file: !132, line: 70, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReadTask", file: !132, line: 63, size: 320, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !152}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !132, line: 64, baseType: !74, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !144, file: !132, line: 65, baseType: !74, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !144, file: !132, line: 66, baseType: !74, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !144, file: !132, line: 67, baseType: !83, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !144, file: !132, line: 68, baseType: !151, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !144, file: !132, line: 69, baseType: !83, size: 64, offset: 256)
!153 = !{!154}
!154 = !DISubrange(count: 9)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ridx", scope: !133, file: !132, line: 90, baseType: !74, size: 32, offset: 4224)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !133, file: !132, line: 91, baseType: !83, size: 64, offset: 4288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !133, file: !132, line: 93, baseType: !158, size: 64, offset: 4352)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "redisReplyObjectFunctions", file: !132, line: 78, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "redisReplyObjectFunctions", file: !132, line: 72, size: 320, elements: !161)
!161 = !{!162, !168, !172, !176, !180}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "createString", scope: !160, file: !132, line: 73, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!83, !166, !86, !100}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "createArray", scope: !160, file: !132, line: 74, baseType: !169, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!83, !166, !74}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "createInteger", scope: !160, file: !132, line: 75, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!83, !166, !98}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "createNil", scope: !160, file: !132, line: 76, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!83, !166}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "freeObject", scope: !160, file: !132, line: 77, baseType: !181, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !83}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "privdata", scope: !133, file: !132, line: 94, baseType: !83, size: 64, offset: 4416)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !119, file: !68, line: 125, baseType: !67, size: 32, offset: 1280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !119, file: !68, line: 126, baseType: !187, size: 64, offset: 1344)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !189, line: 8, size: 128, elements: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !188, file: !189, line: 14, baseType: !89, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !188, file: !189, line: 15, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !90, line: 162, baseType: !91)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !119, file: !68, line: 132, baseType: !195, size: 192, offset: 1408)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !68, line: 128, size: 192, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !195, file: !68, line: 129, baseType: !86, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "source_addr", scope: !195, file: !68, line: 130, baseType: !86, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !195, file: !68, line: 131, baseType: !74, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "unix_sock", scope: !119, file: !68, line: 136, baseType: !201, size: 64, offset: 1600)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !68, line: 134, size: 64, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !201, file: !68, line: 135, baseType: !86, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "redis_context_handle", file: !205, line: 45, baseType: !83)
!205 = !DIFile(filename: "src/apps/common/hiredis_libevent2.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "8bcf7d75479c12c7a6031a30f30ef1f7")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_key_type", file: !207, line: 224, baseType: !86)
!207 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !209, line: 67, baseType: !102)
!209 = !DIFile(filename: "src/client/ns_turn_msg.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "43c56357294df21a547ee0716fe3769d")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !211, line: 105, baseType: !74)
!211 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!212 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !214, line: 27, baseType: !215)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !90, line: 45, baseType: !102)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !214, line: 26, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !90, line: 42, baseType: !61)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !214, line: 24, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !90, line: 38, baseType: !222)
!222 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!223 = !{!0, !7, !12, !17, !22, !27, !29, !34, !39, !44, !49, !224, !229, !234, !236, !241, !246, !248, !250, !253, !255, !257, !259, !261, !266, !268, !270, !272, !277, !279, !281, !283, !285, !290, !292, !294, !54, !299, !488, !493, !498, !501, !503, !508, !510, !515, !520, !525, !527, !529, !531, !536, !541, !543, !545, !550, !555, !557, !559, !561, !563, !568, !573, !575, !577, !579, !581, !583, !585, !590, !592, !597, !599, !601, !603, !605, !607, !609, !614, !616, !618, !620, !622, !624, !626, !628, !633, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !658, !663, !668, !673, !678, !680}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 42)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 2)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !231, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 5)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 3)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 100, type: !238, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !46, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !153)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !46, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !243, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !252, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !238, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 6)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !238, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !252, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 120, type: !252, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 4)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !46, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !46, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !238, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !231, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 16)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 134, type: !24, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !231, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 1)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "driver", scope: !56, file: !2, line: 1361, type: !301, isLocal: true, isDefinition: true)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_dbdriver_t", file: !303, line: 77, baseType: !304)
!303 = !DIFile(filename: "src/apps/relay/dbdrivers/dbdriver.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "00319dc97026a2c0105cbae0fcb396b3")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_dbdriver_t", file: !303, line: 50, size: 1664, elements: !305)
!305 = !{!306, !319, !323, !327, !331, !335, !336, !337, !338, !339, !343, !344, !348, !349, !350, !430, !434, !438, !459, !463, !467, !471, !475, !479, !480, !484}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "get_auth_secrets", scope: !304, file: !303, line: 51, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!74, !310, !318}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "secrets_list_t", file: !312, line: 143, baseType: !313)
!312 = !DIFile(filename: "src/apps/relay/userdb.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "ef7aa3b34af7515d3cf1275f8bfd0947")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_secrets_list", file: !312, line: 139, size: 128, elements: !314)
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "secrets", scope: !313, file: !312, line: 140, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !313, file: !312, line: 141, baseType: !100, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "get_user_key", scope: !304, file: !303, line: 52, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!74, !318, !318, !318}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set_user_key", scope: !304, file: !303, line: 53, baseType: !324, size: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!74, !318, !318, !84}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "del_user", scope: !304, file: !303, line: 54, baseType: !328, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!74, !318, !318}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "list_users", scope: !304, file: !303, line: 55, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!74, !318, !310, !310}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "list_secrets", scope: !304, file: !303, line: 56, baseType: !332, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "del_secret", scope: !304, file: !303, line: 57, baseType: !328, size: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "set_secret", scope: !304, file: !303, line: 58, baseType: !328, size: 64, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "add_origin", scope: !304, file: !303, line: 59, baseType: !328, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "del_origin", scope: !304, file: !303, line: 60, baseType: !340, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!74, !318}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "list_origins", scope: !304, file: !303, line: 61, baseType: !332, size: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "set_realm_option_one", scope: !304, file: !303, line: 62, baseType: !345, size: 64, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!74, !318, !102, !84}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "list_realm_options", scope: !304, file: !303, line: 63, baseType: !340, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "auth_ping", scope: !304, file: !303, line: 64, baseType: !181, size: 64, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "get_ip_list", scope: !304, file: !303, line: 65, baseType: !351, size: 64, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!74, !84, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !356, line: 159, baseType: !357)
!356 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !356, line: 154, size: 128, elements: !358)
!358 = !{!359, !429}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !357, file: !356, line: 155, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !356, line: 152, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !356, line: 146, size: 6624, elements: !363)
!363 = !{!364, !368, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !362, file: !356, line: 147, baseType: !365, size: 2056)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2056, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 257)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !362, file: !356, line: 148, baseType: !369, size: 4104, offset: 2056)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4104, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 513)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !362, file: !356, line: 149, baseType: !373, size: 448, offset: 6176)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !374, line: 53, baseType: !375)
!374 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 50, size: 448, elements: !376)
!376 = !{!377, !428}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !375, file: !374, line: 51, baseType: !378, size: 224)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !374, line: 48, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !374, line: 44, size: 224, elements: !380)
!380 = !{!381, !393, !409}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !379, file: !374, line: 45, baseType: !382, size: 128)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !383, line: 180, size: 128, elements: !384)
!383 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!384 = !{!385, !389}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !382, file: !383, line: 182, baseType: !386, size: 16)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !387, line: 28, baseType: !388)
!387 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!388 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !382, file: !383, line: 183, baseType: !390, size: 112, offset: 16)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 14)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !379, file: !374, line: 46, baseType: !394, size: 128)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !395, line: 245, size: 128, elements: !396)
!395 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!396 = !{!397, !398, !402, !407}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !394, file: !395, line: 247, baseType: !386, size: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !394, file: !395, line: 248, baseType: !399, size: 16, offset: 16)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !395, line: 123, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !214, line: 25, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !90, line: 40, baseType: !388)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !394, file: !395, line: 249, baseType: !403, size: 32, offset: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !395, line: 31, size: 32, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !403, file: !395, line: 33, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !395, line: 30, baseType: !216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !394, file: !395, line: 252, baseType: !408, size: 64, offset: 64)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 64, elements: !25)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !379, file: !374, line: 47, baseType: !410, size: 224)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !395, line: 260, size: 224, elements: !411)
!411 = !{!412, !413, !414, !415, !427}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !410, file: !395, line: 262, baseType: !386, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !410, file: !395, line: 263, baseType: !399, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !410, file: !395, line: 264, baseType: !216, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !410, file: !395, line: 265, baseType: !416, size: 128, offset: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !395, line: 219, size: 128, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !416, file: !395, line: 226, baseType: !419, size: 128)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !395, line: 221, size: 128, elements: !420)
!420 = !{!421, !423, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !419, file: !395, line: 223, baseType: !422, size: 128)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 128, elements: !288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !419, file: !395, line: 224, baseType: !424, size: 128)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 128, elements: !25)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !419, file: !395, line: 225, baseType: !426, size: 128)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 128, elements: !275)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !410, file: !395, line: 266, baseType: !216, size: 32, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !375, file: !374, line: 52, baseType: !378, size: 224, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !357, file: !356, line: 156, baseType: !100, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "set_permission_ip", scope: !304, file: !303, line: 66, baseType: !431, size: 64, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!74, !84, !318, !84, !74}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reread_realms", scope: !304, file: !303, line: 67, baseType: !435, size: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !310}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "set_oauth_key", scope: !304, file: !303, line: 68, baseType: !439, size: 64, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!74, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data_raw", file: !444, line: 144, baseType: !445)
!444 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data_raw", file: !444, line: 135, size: 4800, elements: !446)
!446 = !{!447, !451, !452, !453, !454, !458}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !445, file: !444, line: 136, baseType: !448, size: 1032)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1032, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 129)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !445, file: !444, line: 137, baseType: !365, size: 2056, offset: 1032)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !445, file: !444, line: 138, baseType: !213, size: 64, offset: 3136)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !445, file: !444, line: 139, baseType: !216, size: 32, offset: 3200)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !445, file: !444, line: 140, baseType: !455, size: 520, offset: 3232)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 65)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !445, file: !444, line: 141, baseType: !123, size: 1024, offset: 3752)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "get_oauth_key", scope: !304, file: !303, line: 69, baseType: !460, size: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!74, !218, !442}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "del_oauth_key", scope: !304, file: !303, line: 70, baseType: !464, size: 64, offset: 1216)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!74, !218}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "list_oauth_keys", scope: !304, file: !303, line: 71, baseType: !468, size: 64, offset: 1280)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!74, !310, !310, !310, !310, !310}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "get_admin_user", scope: !304, file: !303, line: 72, baseType: !472, size: 64, offset: 1344)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!74, !218, !318, !318}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "set_admin_user", scope: !304, file: !303, line: 73, baseType: !476, size: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!74, !218, !218, !218}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "del_admin_user", scope: !304, file: !303, line: 74, baseType: !464, size: 64, offset: 1472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "list_admin_users", scope: !304, file: !303, line: 75, baseType: !481, size: 64, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!74, !74}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !304, file: !303, line: 76, baseType: !485, size: 64, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{null}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 30)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 50)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 168, elements: !42)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !2, line: 318, type: !36, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 38)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 433, type: !490, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 444, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 31)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 446, type: !517, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 24)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 504, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 33)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 506, type: !238, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 532, type: !490, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 573, type: !490, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 575, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 29)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 601, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 12)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 610, type: !263, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 624, type: !24, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 711, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 26)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 713, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 25)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 737, type: !538, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 743, type: !274, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 796, type: !533, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 814, type: !533, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 855, type: !565, isLocal: true, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 22)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 870, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 19)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !2, line: 898, type: !570, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !2, line: 921, type: !570, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 937, type: !538, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 958, type: !552, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 960, type: !41, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 983, type: !41, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 985, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 18)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !252, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !2, line: 998, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 13)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !538, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1013, type: !46, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1022, type: !252, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1040, type: !24, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1040, type: !24, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1040, type: !24, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1053, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 20)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1083, type: !231, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 837, type: !522, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 839, type: !522, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1190, type: !24, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1200, type: !538, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1210, type: !36, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 376, type: !41, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !2, line: 517, type: !630, isLocal: true, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 680, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 85)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !547, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !2, line: 478, type: !14, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 480, type: !263, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 482, type: !24, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !14, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !2, line: 486, type: !252, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !2, line: 547, type: !565, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !2, line: 645, type: !565, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !238, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 681, type: !274, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !2, line: 685, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 76)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1233, type: !660, isLocal: true, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 27)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1270, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 46)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1272, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 37)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1287, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 23)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1308, type: !675, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1356, type: !490, isLocal: true, isDefinition: true)
!682 = !{i32 7, !"Dwarf Version", i32 5}
!683 = !{i32 2, !"Debug Info Version", i32 3}
!684 = !{i32 1, !"wchar_size", i32 4}
!685 = !{i32 8, !"PIC Level", i32 2}
!686 = !{i32 7, !"PIE Level", i32 2}
!687 = !{i32 7, !"uwtable", i32 2}
!688 = !{i32 7, !"frame-pointer", i32 2}
!689 = !{!"clang version 16.0.0"}
!690 = distinct !DISubprogram(name: "get_redis_async_connection", scope: !2, file: !2, line: 163, type: !691, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !696)
!691 = !DISubroutineType(types: !692)
!692 = !{!204, !693, !84, !74}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !695, line: 118, flags: DIFlagFwdDecl)
!695 = !DIFile(filename: "/usr/include/event2/bufferevent.h", directory: "", checksumkind: CSK_MD5, checksum: "15bb43c26b2c9058b6c64d44779c7263")
!696 = !{}
!697 = !DILocalVariable(name: "base", arg: 1, scope: !690, file: !2, line: 163, type: !693)
!698 = !DILocation(line: 163, column: 68, scope: !690)
!699 = !DILocalVariable(name: "connection_string", arg: 2, scope: !690, file: !2, line: 163, type: !84)
!700 = !DILocation(line: 163, column: 86, scope: !690)
!701 = !DILocalVariable(name: "delete_keys", arg: 3, scope: !690, file: !2, line: 163, type: !74)
!702 = !DILocation(line: 163, column: 109, scope: !690)
!703 = !DILocalVariable(name: "ret", scope: !690, file: !2, line: 165, type: !204)
!704 = !DILocation(line: 165, column: 23, scope: !690)
!705 = !DILocalVariable(name: "errmsg", scope: !690, file: !2, line: 167, type: !86)
!706 = !DILocation(line: 167, column: 8, scope: !690)
!707 = !DILocation(line: 168, column: 5, scope: !708)
!708 = distinct !DILexicalBlock(scope: !690, file: !2, line: 168, column: 5)
!709 = !DILocation(line: 168, column: 11, scope: !708)
!710 = !DILocation(line: 168, column: 14, scope: !708)
!711 = !DILocation(line: 168, column: 33, scope: !708)
!712 = !DILocation(line: 168, column: 36, scope: !708)
!713 = !DILocation(line: 168, column: 5, scope: !690)
!714 = !DILocalVariable(name: "co", scope: !715, file: !2, line: 169, type: !108)
!715 = distinct !DILexicalBlock(scope: !708, file: !2, line: 168, column: 58)
!716 = !DILocation(line: 169, column: 15, scope: !715)
!717 = !DILocation(line: 169, column: 36, scope: !715)
!718 = !DILocation(line: 169, column: 20, scope: !715)
!719 = !DILocation(line: 170, column: 8, scope: !720)
!720 = distinct !DILexicalBlock(scope: !715, file: !2, line: 170, column: 7)
!721 = !DILocation(line: 170, column: 7, scope: !715)
!722 = !DILocation(line: 171, column: 8, scope: !723)
!723 = distinct !DILexicalBlock(scope: !724, file: !2, line: 171, column: 8)
!724 = distinct !DILexicalBlock(scope: !720, file: !2, line: 170, column: 12)
!725 = !DILocation(line: 171, column: 8, scope: !724)
!726 = !DILocation(line: 172, column: 119, scope: !727)
!727 = distinct !DILexicalBlock(scope: !723, file: !2, line: 171, column: 16)
!728 = !DILocation(line: 172, column: 138, scope: !727)
!729 = !DILocation(line: 172, column: 5, scope: !727)
!730 = !DILocation(line: 173, column: 10, scope: !727)
!731 = !DILocation(line: 173, column: 5, scope: !727)
!732 = !DILocation(line: 174, column: 4, scope: !727)
!733 = !DILocation(line: 175, column: 115, scope: !734)
!734 = distinct !DILexicalBlock(scope: !723, file: !2, line: 174, column: 11)
!735 = !DILocation(line: 175, column: 5, scope: !734)
!736 = !DILocation(line: 177, column: 3, scope: !724)
!737 = !DILocation(line: 177, column: 14, scope: !738)
!738 = distinct !DILexicalBlock(scope: !720, file: !2, line: 177, column: 14)
!739 = !DILocation(line: 177, column: 14, scope: !720)
!740 = !DILocation(line: 178, column: 118, scope: !741)
!741 = distinct !DILexicalBlock(scope: !738, file: !2, line: 177, column: 22)
!742 = !DILocation(line: 178, column: 137, scope: !741)
!743 = !DILocation(line: 178, column: 4, scope: !741)
!744 = !DILocation(line: 179, column: 9, scope: !741)
!745 = !DILocation(line: 179, column: 4, scope: !741)
!746 = !DILocation(line: 180, column: 19, scope: !741)
!747 = !DILocation(line: 180, column: 4, scope: !741)
!748 = !DILocation(line: 181, column: 3, scope: !741)
!749 = !DILocation(line: 183, column: 7, scope: !750)
!750 = distinct !DILexicalBlock(scope: !751, file: !2, line: 183, column: 7)
!751 = distinct !DILexicalBlock(scope: !738, file: !2, line: 181, column: 10)
!752 = !DILocation(line: 183, column: 7, scope: !751)
!753 = !DILocalVariable(name: "rc", scope: !754, file: !2, line: 185, type: !117)
!754 = distinct !DILexicalBlock(scope: !750, file: !2, line: 183, column: 20)
!755 = !DILocation(line: 185, column: 19, scope: !754)
!756 = !DILocalVariable(name: "ip", scope: !754, file: !2, line: 187, type: !757)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 256)
!760 = !DILocation(line: 187, column: 10, scope: !754)
!761 = !DILocalVariable(name: "port", scope: !754, file: !2, line: 188, type: !74)
!762 = !DILocation(line: 188, column: 9, scope: !754)
!763 = !DILocation(line: 189, column: 9, scope: !764)
!764 = distinct !DILexicalBlock(scope: !754, file: !2, line: 189, column: 9)
!765 = !DILocation(line: 189, column: 13, scope: !764)
!766 = !DILocation(line: 189, column: 9, scope: !754)
!767 = !DILocation(line: 190, column: 6, scope: !764)
!768 = !DILocation(line: 190, column: 6, scope: !769)
!769 = distinct !DILexicalBlock(scope: !770, file: !2, line: 190, column: 6)
!770 = distinct !DILexicalBlock(scope: !764, file: !2, line: 190, column: 6)
!771 = !DILocation(line: 190, column: 6, scope: !770)
!772 = !DILocalVariable(name: "szdst", scope: !773, file: !2, line: 190, type: !100)
!773 = distinct !DILexicalBlock(scope: !774, file: !2, line: 190, column: 6)
!774 = distinct !DILexicalBlock(scope: !775, file: !2, line: 190, column: 6)
!775 = distinct !DILexicalBlock(scope: !769, file: !2, line: 190, column: 6)
!776 = !DILocation(line: 190, column: 6, scope: !773)
!777 = !DILocation(line: 190, column: 6, scope: !775)
!778 = !DILocation(line: 191, column: 10, scope: !779)
!779 = distinct !DILexicalBlock(scope: !754, file: !2, line: 191, column: 9)
!780 = !DILocation(line: 191, column: 9, scope: !754)
!781 = !DILocation(line: 192, column: 6, scope: !779)
!782 = !DILocation(line: 192, column: 6, scope: !783)
!783 = distinct !DILexicalBlock(scope: !784, file: !2, line: 192, column: 6)
!784 = distinct !DILexicalBlock(scope: !779, file: !2, line: 192, column: 6)
!785 = !DILocation(line: 192, column: 6, scope: !784)
!786 = !DILocalVariable(name: "szdst", scope: !787, file: !2, line: 192, type: !100)
!787 = distinct !DILexicalBlock(scope: !788, file: !2, line: 192, column: 6)
!788 = distinct !DILexicalBlock(scope: !789, file: !2, line: 192, column: 6)
!789 = distinct !DILexicalBlock(scope: !783, file: !2, line: 192, column: 6)
!790 = !DILocation(line: 192, column: 6, scope: !787)
!791 = !DILocation(line: 192, column: 6, scope: !789)
!792 = !DILocation(line: 194, column: 9, scope: !793)
!793 = distinct !DILexicalBlock(scope: !754, file: !2, line: 194, column: 9)
!794 = !DILocation(line: 194, column: 13, scope: !793)
!795 = !DILocation(line: 194, column: 9, scope: !754)
!796 = !DILocation(line: 195, column: 20, scope: !793)
!797 = !DILocation(line: 195, column: 24, scope: !793)
!798 = !DILocation(line: 195, column: 11, scope: !793)
!799 = !DILocation(line: 195, column: 6, scope: !793)
!800 = !DILocation(line: 197, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !754, file: !2, line: 197, column: 9)
!802 = !DILocation(line: 197, column: 13, scope: !801)
!803 = !DILocation(line: 197, column: 9, scope: !754)
!804 = !DILocalVariable(name: "tv", scope: !805, file: !2, line: 198, type: !188)
!805 = distinct !DILexicalBlock(scope: !801, file: !2, line: 197, column: 30)
!806 = !DILocation(line: 198, column: 21, scope: !805)
!807 = !DILocation(line: 199, column: 9, scope: !805)
!808 = !DILocation(line: 199, column: 17, scope: !805)
!809 = !DILocation(line: 200, column: 28, scope: !805)
!810 = !DILocation(line: 200, column: 32, scope: !805)
!811 = !DILocation(line: 200, column: 18, scope: !805)
!812 = !DILocation(line: 200, column: 9, scope: !805)
!813 = !DILocation(line: 200, column: 16, scope: !805)
!814 = !DILocation(line: 201, column: 35, scope: !805)
!815 = !DILocation(line: 201, column: 39, scope: !805)
!816 = !DILocation(line: 201, column: 11, scope: !805)
!817 = !DILocation(line: 201, column: 9, scope: !805)
!818 = !DILocation(line: 202, column: 5, scope: !805)
!819 = !DILocation(line: 203, column: 24, scope: !820)
!820 = distinct !DILexicalBlock(scope: !801, file: !2, line: 202, column: 12)
!821 = !DILocation(line: 203, column: 28, scope: !820)
!822 = !DILocation(line: 203, column: 11, scope: !820)
!823 = !DILocation(line: 203, column: 9, scope: !820)
!824 = !DILocation(line: 206, column: 10, scope: !825)
!825 = distinct !DILexicalBlock(scope: !754, file: !2, line: 206, column: 9)
!826 = !DILocation(line: 206, column: 9, scope: !754)
!827 = !DILocation(line: 207, column: 6, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !2, line: 206, column: 14)
!829 = !DILocation(line: 208, column: 5, scope: !828)
!830 = !DILocation(line: 209, column: 10, scope: !831)
!831 = distinct !DILexicalBlock(scope: !832, file: !2, line: 209, column: 10)
!832 = distinct !DILexicalBlock(scope: !825, file: !2, line: 208, column: 12)
!833 = !DILocation(line: 209, column: 14, scope: !831)
!834 = !DILocation(line: 209, column: 10, scope: !832)
!835 = !DILocation(line: 210, column: 39, scope: !836)
!836 = distinct !DILexicalBlock(scope: !831, file: !2, line: 209, column: 24)
!837 = !DILocation(line: 210, column: 54, scope: !836)
!838 = !DILocation(line: 210, column: 58, scope: !836)
!839 = !DILocation(line: 210, column: 26, scope: !836)
!840 = !DILocation(line: 210, column: 7, scope: !836)
!841 = !DILocation(line: 211, column: 6, scope: !836)
!842 = !DILocation(line: 212, column: 10, scope: !843)
!843 = distinct !DILexicalBlock(scope: !832, file: !2, line: 212, column: 10)
!844 = !DILocation(line: 212, column: 14, scope: !843)
!845 = !DILocation(line: 212, column: 10, scope: !832)
!846 = !DILocation(line: 213, column: 39, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !2, line: 212, column: 22)
!848 = !DILocation(line: 213, column: 56, scope: !847)
!849 = !DILocation(line: 213, column: 60, scope: !847)
!850 = !DILocation(line: 213, column: 26, scope: !847)
!851 = !DILocation(line: 213, column: 7, scope: !847)
!852 = !DILocation(line: 214, column: 6, scope: !847)
!853 = !DILocalVariable(name: "reply", scope: !854, file: !2, line: 216, type: !92)
!854 = distinct !DILexicalBlock(scope: !832, file: !2, line: 215, column: 6)
!855 = !DILocation(line: 216, column: 19, scope: !854)
!856 = !DILocation(line: 216, column: 53, scope: !854)
!857 = !DILocation(line: 216, column: 40, scope: !854)
!858 = !DILocation(line: 217, column: 10, scope: !859)
!859 = distinct !DILexicalBlock(scope: !854, file: !2, line: 217, column: 10)
!860 = !DILocation(line: 217, column: 10, scope: !854)
!861 = !DILocalVariable(name: "keys", scope: !862, file: !2, line: 218, type: !311)
!862 = distinct !DILexicalBlock(scope: !859, file: !2, line: 217, column: 17)
!863 = !DILocation(line: 218, column: 23, scope: !862)
!864 = !DILocalVariable(name: "isz", scope: !862, file: !2, line: 219, type: !100)
!865 = !DILocation(line: 219, column: 15, scope: !862)
!866 = !DILocalVariable(name: "s", scope: !862, file: !2, line: 220, type: !369)
!867 = !DILocation(line: 220, column: 13, scope: !862)
!868 = !DILocation(line: 222, column: 8, scope: !862)
!869 = !DILocation(line: 224, column: 12, scope: !870)
!870 = distinct !DILexicalBlock(scope: !862, file: !2, line: 224, column: 12)
!871 = !DILocation(line: 224, column: 19, scope: !870)
!872 = !DILocation(line: 224, column: 24, scope: !870)
!873 = !DILocation(line: 224, column: 12, scope: !862)
!874 = !DILocation(line: 225, column: 60, scope: !875)
!875 = distinct !DILexicalBlock(scope: !870, file: !2, line: 224, column: 46)
!876 = !DILocation(line: 225, column: 67, scope: !875)
!877 = !DILocation(line: 225, column: 9, scope: !875)
!878 = !DILocation(line: 226, column: 8, scope: !875)
!879 = !DILocation(line: 226, column: 19, scope: !880)
!880 = distinct !DILexicalBlock(scope: !870, file: !2, line: 226, column: 19)
!881 = !DILocation(line: 226, column: 26, scope: !880)
!882 = !DILocation(line: 226, column: 31, scope: !880)
!883 = !DILocation(line: 226, column: 19, scope: !870)
!884 = !DILocation(line: 227, column: 13, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !2, line: 227, column: 13)
!886 = distinct !DILexicalBlock(scope: !880, file: !2, line: 226, column: 53)
!887 = !DILocation(line: 227, column: 20, scope: !885)
!888 = !DILocation(line: 227, column: 25, scope: !885)
!889 = !DILocation(line: 227, column: 13, scope: !886)
!890 = !DILocation(line: 228, column: 71, scope: !885)
!891 = !DILocation(line: 228, column: 78, scope: !885)
!892 = !DILocation(line: 228, column: 10, scope: !885)
!893 = !DILocation(line: 229, column: 8, scope: !886)
!894 = !DILocalVariable(name: "i", scope: !895, file: !2, line: 230, type: !100)
!895 = distinct !DILexicalBlock(scope: !880, file: !2, line: 229, column: 15)
!896 = !DILocation(line: 230, column: 16, scope: !895)
!897 = !DILocation(line: 231, column: 16, scope: !898)
!898 = distinct !DILexicalBlock(scope: !895, file: !2, line: 231, column: 9)
!899 = !DILocation(line: 231, column: 14, scope: !898)
!900 = !DILocation(line: 231, column: 21, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !2, line: 231, column: 9)
!902 = !DILocation(line: 231, column: 25, scope: !901)
!903 = !DILocation(line: 231, column: 32, scope: !901)
!904 = !DILocation(line: 231, column: 23, scope: !901)
!905 = !DILocation(line: 231, column: 9, scope: !898)
!906 = !DILocation(line: 232, column: 36, scope: !907)
!907 = distinct !DILexicalBlock(scope: !901, file: !2, line: 231, column: 47)
!908 = !DILocation(line: 232, column: 43, scope: !907)
!909 = !DILocation(line: 232, column: 51, scope: !907)
!910 = !DILocation(line: 232, column: 55, scope: !907)
!911 = !DILocation(line: 232, column: 10, scope: !907)
!912 = !DILocation(line: 233, column: 9, scope: !907)
!913 = !DILocation(line: 231, column: 42, scope: !901)
!914 = !DILocation(line: 231, column: 9, scope: !901)
!915 = distinct !{!915, !905, !916, !917}
!916 = !DILocation(line: 233, column: 9, scope: !898)
!917 = !{!"llvm.loop.mustprogress"}
!918 = !DILocation(line: 236, column: 15, scope: !919)
!919 = distinct !DILexicalBlock(scope: !862, file: !2, line: 236, column: 8)
!920 = !DILocation(line: 236, column: 12, scope: !919)
!921 = !DILocation(line: 236, column: 18, scope: !922)
!922 = distinct !DILexicalBlock(scope: !919, file: !2, line: 236, column: 8)
!923 = !DILocation(line: 236, column: 27, scope: !922)
!924 = !DILocation(line: 236, column: 21, scope: !922)
!925 = !DILocation(line: 236, column: 8, scope: !919)
!926 = !DILocation(line: 238, column: 18, scope: !927)
!927 = distinct !DILexicalBlock(scope: !922, file: !2, line: 236, column: 37)
!928 = !DILocation(line: 238, column: 45, scope: !927)
!929 = !DILocation(line: 238, column: 53, scope: !927)
!930 = !DILocation(line: 238, column: 40, scope: !927)
!931 = !DILocation(line: 238, column: 9, scope: !927)
!932 = !DILocation(line: 239, column: 41, scope: !927)
!933 = !DILocation(line: 239, column: 45, scope: !927)
!934 = !DILocation(line: 239, column: 28, scope: !927)
!935 = !DILocation(line: 239, column: 9, scope: !927)
!936 = !DILocation(line: 240, column: 8, scope: !927)
!937 = !DILocation(line: 236, column: 30, scope: !922)
!938 = !DILocation(line: 236, column: 8, scope: !922)
!939 = distinct !{!939, !925, !940, !917}
!940 = !DILocation(line: 240, column: 8, scope: !919)
!941 = !DILocation(line: 242, column: 8, scope: !862)
!942 = !DILocation(line: 244, column: 27, scope: !862)
!943 = !DILocation(line: 244, column: 8, scope: !862)
!944 = !DILocation(line: 245, column: 7, scope: !862)
!945 = !DILocation(line: 247, column: 16, scope: !832)
!946 = !DILocation(line: 247, column: 6, scope: !832)
!947 = !DILocation(line: 249, column: 4, scope: !754)
!948 = !DILocation(line: 251, column: 30, scope: !751)
!949 = !DILocation(line: 251, column: 36, scope: !751)
!950 = !DILocation(line: 251, column: 40, scope: !751)
!951 = !DILocation(line: 251, column: 46, scope: !751)
!952 = !DILocation(line: 251, column: 50, scope: !751)
!953 = !DILocation(line: 251, column: 56, scope: !751)
!954 = !DILocation(line: 251, column: 60, scope: !751)
!955 = !DILocation(line: 251, column: 75, scope: !751)
!956 = !DILocation(line: 251, column: 79, scope: !751)
!957 = !DILocation(line: 251, column: 70, scope: !751)
!958 = !DILocation(line: 251, column: 10, scope: !751)
!959 = !DILocation(line: 251, column: 8, scope: !751)
!960 = !DILocation(line: 253, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !751, file: !2, line: 253, column: 8)
!962 = !DILocation(line: 253, column: 8, scope: !751)
!963 = !DILocation(line: 254, column: 5, scope: !964)
!964 = distinct !DILexicalBlock(scope: !961, file: !2, line: 253, column: 14)
!965 = !DILocation(line: 255, column: 4, scope: !964)
!966 = !DILocation(line: 255, column: 39, scope: !967)
!967 = distinct !DILexicalBlock(scope: !961, file: !2, line: 255, column: 15)
!968 = !DILocation(line: 255, column: 15, scope: !967)
!969 = !DILocation(line: 255, column: 44, scope: !967)
!970 = !DILocation(line: 255, column: 48, scope: !967)
!971 = !DILocation(line: 255, column: 15, scope: !961)
!972 = !DILocation(line: 256, column: 86, scope: !973)
!973 = distinct !DILexicalBlock(scope: !967, file: !2, line: 255, column: 80)
!974 = !DILocation(line: 256, column: 5, scope: !973)
!975 = !DILocation(line: 257, column: 36, scope: !973)
!976 = !DILocation(line: 258, column: 4, scope: !973)
!977 = !DILocation(line: 259, column: 19, scope: !751)
!978 = !DILocation(line: 259, column: 4, scope: !751)
!979 = !DILocation(line: 261, column: 2, scope: !715)
!980 = !DILocation(line: 263, column: 9, scope: !690)
!981 = !DILocation(line: 263, column: 2, scope: !690)
!982 = distinct !DISubprogram(name: "RyconninfoParse", scope: !2, file: !2, line: 68, type: !983, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !56, retainedNodes: !696)
!983 = !DISubroutineType(types: !984)
!984 = !{!108, !84, !316}
!985 = !DILocalVariable(name: "userdb", arg: 1, scope: !982, file: !2, line: 68, type: !84)
!986 = !DILocation(line: 68, column: 48, scope: !982)
!987 = !DILocalVariable(name: "errmsg", arg: 2, scope: !982, file: !2, line: 68, type: !316)
!988 = !DILocation(line: 68, column: 63, scope: !982)
!989 = !DILocalVariable(name: "co", scope: !982, file: !2, line: 69, type: !108)
!990 = !DILocation(line: 69, column: 14, scope: !982)
!991 = !DILocation(line: 69, column: 33, scope: !982)
!992 = !DILocation(line: 70, column: 8, scope: !982)
!993 = !DILocation(line: 70, column: 2, scope: !982)
!994 = !DILocation(line: 71, column: 6, scope: !995)
!995 = distinct !DILexicalBlock(scope: !982, file: !2, line: 71, column: 6)
!996 = !DILocation(line: 71, column: 6, scope: !982)
!997 = !DILocalVariable(name: "s0", scope: !998, file: !2, line: 72, type: !86)
!998 = distinct !DILexicalBlock(scope: !995, file: !2, line: 71, column: 14)
!999 = !DILocation(line: 72, column: 9, scope: !998)
!1000 = !DILocation(line: 72, column: 21, scope: !998)
!1001 = !DILocation(line: 72, column: 14, scope: !998)
!1002 = !DILocalVariable(name: "s", scope: !998, file: !2, line: 73, type: !86)
!1003 = !DILocation(line: 73, column: 9, scope: !998)
!1004 = !DILocation(line: 73, column: 13, scope: !998)
!1005 = !DILocation(line: 75, column: 3, scope: !998)
!1006 = !DILocation(line: 75, column: 10, scope: !998)
!1007 = !DILocation(line: 75, column: 12, scope: !998)
!1008 = !DILocation(line: 75, column: 16, scope: !998)
!1009 = !DILocation(line: 75, column: 15, scope: !998)
!1010 = !DILocation(line: 0, scope: !998)
!1011 = !DILocation(line: 77, column: 4, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !998, file: !2, line: 75, column: 19)
!1013 = !DILocation(line: 77, column: 12, scope: !1012)
!1014 = !DILocation(line: 77, column: 11, scope: !1012)
!1015 = !DILocation(line: 77, column: 14, scope: !1012)
!1016 = !DILocation(line: 77, column: 19, scope: !1012)
!1017 = !DILocation(line: 77, column: 18, scope: !1012)
!1018 = !DILocation(line: 77, column: 21, scope: !1012)
!1019 = !DILocation(line: 0, scope: !1012)
!1020 = !DILocation(line: 78, column: 5, scope: !1012)
!1021 = distinct !{!1021, !1011, !1022, !917}
!1022 = !DILocation(line: 78, column: 7, scope: !1012)
!1023 = !DILocalVariable(name: "snext", scope: !1012, file: !2, line: 79, type: !86)
!1024 = !DILocation(line: 79, column: 10, scope: !1012)
!1025 = !DILocation(line: 79, column: 25, scope: !1012)
!1026 = !DILocation(line: 79, column: 18, scope: !1012)
!1027 = !DILocation(line: 80, column: 8, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 80, column: 8)
!1029 = !DILocation(line: 80, column: 8, scope: !1012)
!1030 = !DILocation(line: 81, column: 6, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 80, column: 15)
!1032 = !DILocation(line: 81, column: 12, scope: !1031)
!1033 = !DILocation(line: 82, column: 5, scope: !1031)
!1034 = !DILocation(line: 83, column: 4, scope: !1031)
!1035 = !DILocalVariable(name: "seq", scope: !1012, file: !2, line: 85, type: !86)
!1036 = !DILocation(line: 85, column: 10, scope: !1012)
!1037 = !DILocation(line: 85, column: 23, scope: !1012)
!1038 = !DILocation(line: 85, column: 16, scope: !1012)
!1039 = !DILocation(line: 86, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 86, column: 8)
!1041 = !DILocation(line: 86, column: 8, scope: !1012)
!1042 = !DILocation(line: 87, column: 20, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 86, column: 14)
!1044 = !DILocation(line: 87, column: 5, scope: !1043)
!1045 = !DILocation(line: 88, column: 8, scope: !1043)
!1046 = !DILocation(line: 89, column: 9, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1043, file: !2, line: 89, column: 9)
!1048 = !DILocation(line: 89, column: 9, scope: !1043)
!1049 = !DILocation(line: 90, column: 23, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 89, column: 17)
!1051 = !DILocation(line: 90, column: 16, scope: !1050)
!1052 = !DILocation(line: 90, column: 7, scope: !1050)
!1053 = !DILocation(line: 90, column: 14, scope: !1050)
!1054 = !DILocation(line: 91, column: 5, scope: !1050)
!1055 = !DILocation(line: 92, column: 5, scope: !1043)
!1056 = !DILocation(line: 95, column: 5, scope: !1012)
!1057 = !DILocation(line: 95, column: 9, scope: !1012)
!1058 = !DILocation(line: 96, column: 16, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 96, column: 8)
!1060 = !DILocation(line: 96, column: 9, scope: !1059)
!1061 = !DILocation(line: 96, column: 8, scope: !1012)
!1062 = !DILocation(line: 97, column: 23, scope: !1059)
!1063 = !DILocation(line: 97, column: 27, scope: !1059)
!1064 = !DILocation(line: 97, column: 16, scope: !1059)
!1065 = !DILocation(line: 97, column: 5, scope: !1059)
!1066 = !DILocation(line: 97, column: 9, scope: !1059)
!1067 = !DILocation(line: 97, column: 14, scope: !1059)
!1068 = !DILocation(line: 98, column: 21, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 98, column: 13)
!1070 = !DILocation(line: 98, column: 14, scope: !1069)
!1071 = !DILocation(line: 98, column: 13, scope: !1059)
!1072 = !DILocation(line: 99, column: 23, scope: !1069)
!1073 = !DILocation(line: 99, column: 27, scope: !1069)
!1074 = !DILocation(line: 99, column: 16, scope: !1069)
!1075 = !DILocation(line: 99, column: 5, scope: !1069)
!1076 = !DILocation(line: 99, column: 9, scope: !1069)
!1077 = !DILocation(line: 99, column: 14, scope: !1069)
!1078 = !DILocation(line: 100, column: 21, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 100, column: 13)
!1080 = !DILocation(line: 100, column: 14, scope: !1079)
!1081 = !DILocation(line: 100, column: 13, scope: !1069)
!1082 = !DILocation(line: 101, column: 23, scope: !1079)
!1083 = !DILocation(line: 101, column: 27, scope: !1079)
!1084 = !DILocation(line: 101, column: 16, scope: !1079)
!1085 = !DILocation(line: 101, column: 5, scope: !1079)
!1086 = !DILocation(line: 101, column: 9, scope: !1079)
!1087 = !DILocation(line: 101, column: 14, scope: !1079)
!1088 = !DILocation(line: 102, column: 21, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 102, column: 13)
!1090 = !DILocation(line: 102, column: 14, scope: !1089)
!1091 = !DILocation(line: 102, column: 13, scope: !1079)
!1092 = !DILocation(line: 103, column: 23, scope: !1089)
!1093 = !DILocation(line: 103, column: 27, scope: !1089)
!1094 = !DILocation(line: 103, column: 16, scope: !1089)
!1095 = !DILocation(line: 103, column: 5, scope: !1089)
!1096 = !DILocation(line: 103, column: 9, scope: !1089)
!1097 = !DILocation(line: 103, column: 14, scope: !1089)
!1098 = !DILocation(line: 104, column: 21, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1089, file: !2, line: 104, column: 13)
!1100 = !DILocation(line: 104, column: 14, scope: !1099)
!1101 = !DILocation(line: 104, column: 13, scope: !1089)
!1102 = !DILocation(line: 105, column: 23, scope: !1099)
!1103 = !DILocation(line: 105, column: 27, scope: !1099)
!1104 = !DILocation(line: 105, column: 16, scope: !1099)
!1105 = !DILocation(line: 105, column: 5, scope: !1099)
!1106 = !DILocation(line: 105, column: 9, scope: !1099)
!1107 = !DILocation(line: 105, column: 14, scope: !1099)
!1108 = !DILocation(line: 106, column: 21, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1099, file: !2, line: 106, column: 13)
!1110 = !DILocation(line: 106, column: 14, scope: !1109)
!1111 = !DILocation(line: 106, column: 13, scope: !1099)
!1112 = !DILocation(line: 107, column: 25, scope: !1109)
!1113 = !DILocation(line: 107, column: 29, scope: !1109)
!1114 = !DILocation(line: 107, column: 18, scope: !1109)
!1115 = !DILocation(line: 107, column: 5, scope: !1109)
!1116 = !DILocation(line: 107, column: 9, scope: !1109)
!1117 = !DILocation(line: 107, column: 16, scope: !1109)
!1118 = !DILocation(line: 108, column: 21, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1109, file: !2, line: 108, column: 13)
!1120 = !DILocation(line: 108, column: 14, scope: !1119)
!1121 = !DILocation(line: 108, column: 13, scope: !1109)
!1122 = !DILocation(line: 109, column: 25, scope: !1119)
!1123 = !DILocation(line: 109, column: 29, scope: !1119)
!1124 = !DILocation(line: 109, column: 18, scope: !1119)
!1125 = !DILocation(line: 109, column: 5, scope: !1119)
!1126 = !DILocation(line: 109, column: 9, scope: !1119)
!1127 = !DILocation(line: 109, column: 16, scope: !1119)
!1128 = !DILocation(line: 110, column: 21, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 110, column: 13)
!1130 = !DILocation(line: 110, column: 14, scope: !1129)
!1131 = !DILocation(line: 110, column: 13, scope: !1119)
!1132 = !DILocation(line: 111, column: 25, scope: !1129)
!1133 = !DILocation(line: 111, column: 29, scope: !1129)
!1134 = !DILocation(line: 111, column: 18, scope: !1129)
!1135 = !DILocation(line: 111, column: 5, scope: !1129)
!1136 = !DILocation(line: 111, column: 9, scope: !1129)
!1137 = !DILocation(line: 111, column: 16, scope: !1129)
!1138 = !DILocation(line: 112, column: 21, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1129, file: !2, line: 112, column: 13)
!1140 = !DILocation(line: 112, column: 14, scope: !1139)
!1141 = !DILocation(line: 112, column: 13, scope: !1129)
!1142 = !DILocation(line: 114, column: 21, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1139, file: !2, line: 114, column: 13)
!1144 = !DILocation(line: 114, column: 14, scope: !1143)
!1145 = !DILocation(line: 114, column: 13, scope: !1139)
!1146 = !DILocation(line: 116, column: 21, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1143, file: !2, line: 116, column: 13)
!1148 = !DILocation(line: 116, column: 14, scope: !1147)
!1149 = !DILocation(line: 116, column: 13, scope: !1143)
!1150 = !DILocation(line: 118, column: 21, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 118, column: 13)
!1152 = !DILocation(line: 118, column: 14, scope: !1151)
!1153 = !DILocation(line: 118, column: 13, scope: !1147)
!1154 = !DILocation(line: 120, column: 21, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !2, line: 120, column: 13)
!1156 = !DILocation(line: 120, column: 14, scope: !1155)
!1157 = !DILocation(line: 120, column: 13, scope: !1151)
!1158 = !DILocation(line: 121, column: 27, scope: !1155)
!1159 = !DILocation(line: 121, column: 31, scope: !1155)
!1160 = !DILocation(line: 121, column: 20, scope: !1155)
!1161 = !DILocation(line: 121, column: 5, scope: !1155)
!1162 = !DILocation(line: 121, column: 9, scope: !1155)
!1163 = !DILocation(line: 121, column: 18, scope: !1155)
!1164 = !DILocation(line: 122, column: 21, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 122, column: 13)
!1166 = !DILocation(line: 122, column: 14, scope: !1165)
!1167 = !DILocation(line: 122, column: 13, scope: !1155)
!1168 = !DILocation(line: 123, column: 27, scope: !1165)
!1169 = !DILocation(line: 123, column: 31, scope: !1165)
!1170 = !DILocation(line: 123, column: 20, scope: !1165)
!1171 = !DILocation(line: 123, column: 5, scope: !1165)
!1172 = !DILocation(line: 123, column: 9, scope: !1165)
!1173 = !DILocation(line: 123, column: 18, scope: !1165)
!1174 = !DILocation(line: 124, column: 21, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1165, file: !2, line: 124, column: 13)
!1176 = !DILocation(line: 124, column: 14, scope: !1175)
!1177 = !DILocation(line: 124, column: 13, scope: !1165)
!1178 = !DILocation(line: 125, column: 27, scope: !1175)
!1179 = !DILocation(line: 125, column: 31, scope: !1175)
!1180 = !DILocation(line: 125, column: 20, scope: !1175)
!1181 = !DILocation(line: 125, column: 5, scope: !1175)
!1182 = !DILocation(line: 125, column: 9, scope: !1175)
!1183 = !DILocation(line: 125, column: 18, scope: !1175)
!1184 = !DILocation(line: 126, column: 21, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 126, column: 13)
!1186 = !DILocation(line: 126, column: 14, scope: !1185)
!1187 = !DILocation(line: 126, column: 13, scope: !1175)
!1188 = !DILocation(line: 127, column: 27, scope: !1185)
!1189 = !DILocation(line: 127, column: 31, scope: !1185)
!1190 = !DILocation(line: 127, column: 20, scope: !1185)
!1191 = !DILocation(line: 127, column: 5, scope: !1185)
!1192 = !DILocation(line: 127, column: 9, scope: !1185)
!1193 = !DILocation(line: 127, column: 18, scope: !1185)
!1194 = !DILocation(line: 128, column: 21, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1185, file: !2, line: 128, column: 13)
!1196 = !DILocation(line: 128, column: 14, scope: !1195)
!1197 = !DILocation(line: 128, column: 13, scope: !1185)
!1198 = !DILocation(line: 129, column: 36, scope: !1195)
!1199 = !DILocation(line: 129, column: 40, scope: !1195)
!1200 = !DILocation(line: 129, column: 31, scope: !1195)
!1201 = !DILocation(line: 129, column: 5, scope: !1195)
!1202 = !DILocation(line: 129, column: 9, scope: !1195)
!1203 = !DILocation(line: 129, column: 14, scope: !1195)
!1204 = !DILocation(line: 130, column: 21, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 130, column: 13)
!1206 = !DILocation(line: 130, column: 14, scope: !1205)
!1207 = !DILocation(line: 130, column: 13, scope: !1195)
!1208 = !DILocation(line: 131, column: 36, scope: !1205)
!1209 = !DILocation(line: 131, column: 40, scope: !1205)
!1210 = !DILocation(line: 131, column: 31, scope: !1205)
!1211 = !DILocation(line: 131, column: 5, scope: !1205)
!1212 = !DILocation(line: 131, column: 9, scope: !1205)
!1213 = !DILocation(line: 131, column: 14, scope: !1205)
!1214 = !DILocation(line: 132, column: 21, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 132, column: 13)
!1216 = !DILocation(line: 132, column: 14, scope: !1215)
!1217 = !DILocation(line: 132, column: 13, scope: !1205)
!1218 = !DILocation(line: 133, column: 47, scope: !1215)
!1219 = !DILocation(line: 133, column: 51, scope: !1215)
!1220 = !DILocation(line: 133, column: 42, scope: !1215)
!1221 = !DILocation(line: 133, column: 5, scope: !1215)
!1222 = !DILocation(line: 133, column: 9, scope: !1215)
!1223 = !DILocation(line: 133, column: 25, scope: !1215)
!1224 = !DILocation(line: 134, column: 21, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1215, file: !2, line: 134, column: 13)
!1226 = !DILocation(line: 134, column: 14, scope: !1225)
!1227 = !DILocation(line: 134, column: 13, scope: !1215)
!1228 = !DILocation(line: 135, column: 47, scope: !1225)
!1229 = !DILocation(line: 135, column: 51, scope: !1225)
!1230 = !DILocation(line: 135, column: 42, scope: !1225)
!1231 = !DILocation(line: 135, column: 5, scope: !1225)
!1232 = !DILocation(line: 135, column: 9, scope: !1225)
!1233 = !DILocation(line: 135, column: 25, scope: !1225)
!1234 = !DILocation(line: 137, column: 20, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1225, file: !2, line: 136, column: 9)
!1236 = !DILocation(line: 137, column: 5, scope: !1235)
!1237 = !DILocation(line: 138, column: 8, scope: !1235)
!1238 = !DILocation(line: 139, column: 9, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1235, file: !2, line: 139, column: 9)
!1240 = !DILocation(line: 139, column: 9, scope: !1235)
!1241 = !DILocation(line: 140, column: 23, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1239, file: !2, line: 139, column: 17)
!1243 = !DILocation(line: 140, column: 16, scope: !1242)
!1244 = !DILocation(line: 140, column: 7, scope: !1242)
!1245 = !DILocation(line: 140, column: 14, scope: !1242)
!1246 = !DILocation(line: 141, column: 5, scope: !1242)
!1247 = !DILocation(line: 142, column: 5, scope: !1235)
!1248 = !DILocation(line: 145, column: 8, scope: !1012)
!1249 = !DILocation(line: 145, column: 6, scope: !1012)
!1250 = distinct !{!1250, !1005, !1251, !917}
!1251 = !DILocation(line: 146, column: 3, scope: !998)
!1252 = !DILocation(line: 148, column: 8, scope: !998)
!1253 = !DILocation(line: 148, column: 3, scope: !998)
!1254 = !DILocation(line: 149, column: 2, scope: !998)
!1255 = !DILocation(line: 151, column: 5, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !982, file: !2, line: 151, column: 5)
!1257 = !DILocation(line: 151, column: 5, scope: !982)
!1258 = !DILocation(line: 152, column: 8, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1260, file: !2, line: 152, column: 6)
!1260 = distinct !DILexicalBlock(scope: !1256, file: !2, line: 151, column: 9)
!1261 = !DILocation(line: 152, column: 12, scope: !1259)
!1262 = !DILocation(line: 152, column: 7, scope: !1259)
!1263 = !DILocation(line: 152, column: 6, scope: !1260)
!1264 = !DILocation(line: 153, column: 15, scope: !1259)
!1265 = !DILocation(line: 153, column: 4, scope: !1259)
!1266 = !DILocation(line: 153, column: 8, scope: !1259)
!1267 = !DILocation(line: 153, column: 14, scope: !1259)
!1268 = !DILocation(line: 154, column: 8, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1260, file: !2, line: 154, column: 6)
!1270 = !DILocation(line: 154, column: 12, scope: !1269)
!1271 = !DILocation(line: 154, column: 7, scope: !1269)
!1272 = !DILocation(line: 154, column: 6, scope: !1260)
!1273 = !DILocation(line: 155, column: 13, scope: !1269)
!1274 = !DILocation(line: 155, column: 4, scope: !1269)
!1275 = !DILocation(line: 155, column: 8, scope: !1269)
!1276 = !DILocation(line: 155, column: 12, scope: !1269)
!1277 = !DILocation(line: 156, column: 8, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1260, file: !2, line: 156, column: 6)
!1279 = !DILocation(line: 156, column: 12, scope: !1278)
!1280 = !DILocation(line: 156, column: 7, scope: !1278)
!1281 = !DILocation(line: 156, column: 6, scope: !1260)
!1282 = !DILocation(line: 157, column: 17, scope: !1278)
!1283 = !DILocation(line: 157, column: 4, scope: !1278)
!1284 = !DILocation(line: 157, column: 8, scope: !1278)
!1285 = !DILocation(line: 157, column: 16, scope: !1278)
!1286 = !DILocation(line: 158, column: 2, scope: !1260)
!1287 = !DILocation(line: 160, column: 9, scope: !982)
!1288 = !DILocation(line: 160, column: 2, scope: !982)
!1289 = distinct !DISubprogram(name: "RyconninfoFree", scope: !2, file: !2, line: 59, type: !1290, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !56, retainedNodes: !696)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{null, !108}
!1292 = !DILocalVariable(name: "co", arg: 1, scope: !1289, file: !2, line: 59, type: !108)
!1293 = !DILocation(line: 59, column: 40, scope: !1289)
!1294 = !DILocation(line: 60, column: 5, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1289, file: !2, line: 60, column: 5)
!1296 = !DILocation(line: 60, column: 5, scope: !1289)
!1297 = !DILocation(line: 61, column: 6, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1299, file: !2, line: 61, column: 6)
!1299 = distinct !DILexicalBlock(scope: !1295, file: !2, line: 60, column: 9)
!1300 = !DILocation(line: 61, column: 10, scope: !1298)
!1301 = !DILocation(line: 61, column: 6, scope: !1299)
!1302 = !DILocation(line: 61, column: 21, scope: !1298)
!1303 = !DILocation(line: 61, column: 25, scope: !1298)
!1304 = !DILocation(line: 61, column: 16, scope: !1298)
!1305 = !DILocation(line: 62, column: 6, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1299, file: !2, line: 62, column: 6)
!1307 = !DILocation(line: 62, column: 10, scope: !1306)
!1308 = !DILocation(line: 62, column: 6, scope: !1299)
!1309 = !DILocation(line: 62, column: 23, scope: !1306)
!1310 = !DILocation(line: 62, column: 27, scope: !1306)
!1311 = !DILocation(line: 62, column: 18, scope: !1306)
!1312 = !DILocation(line: 63, column: 6, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1299, file: !2, line: 63, column: 6)
!1314 = !DILocation(line: 63, column: 10, scope: !1313)
!1315 = !DILocation(line: 63, column: 6, scope: !1299)
!1316 = !DILocation(line: 63, column: 25, scope: !1313)
!1317 = !DILocation(line: 63, column: 29, scope: !1313)
!1318 = !DILocation(line: 63, column: 20, scope: !1313)
!1319 = !DILocation(line: 64, column: 9, scope: !1299)
!1320 = !DILocation(line: 64, column: 3, scope: !1299)
!1321 = !DILocation(line: 65, column: 2, scope: !1299)
!1322 = !DILocation(line: 66, column: 1, scope: !1289)
!1323 = distinct !DISubprogram(name: "turnFreeRedisReply", scope: !2, file: !2, line: 43, type: !182, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !56, retainedNodes: !696)
!1324 = !DILocalVariable(name: "reply", arg: 1, scope: !1323, file: !2, line: 43, type: !83)
!1325 = !DILocation(line: 43, column: 38, scope: !1323)
!1326 = !DILocation(line: 44, column: 5, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1323, file: !2, line: 44, column: 5)
!1328 = !DILocation(line: 44, column: 5, scope: !1323)
!1329 = !DILocation(line: 45, column: 19, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1327, file: !2, line: 44, column: 12)
!1331 = !DILocation(line: 45, column: 3, scope: !1330)
!1332 = !DILocation(line: 46, column: 2, scope: !1330)
!1333 = !DILocation(line: 47, column: 1, scope: !1323)
!1334 = distinct !DISubprogram(name: "get_redis_dbdriver", scope: !2, file: !2, line: 1390, type: !1335, scopeLine: 1390, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !56, retainedNodes: !696)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!1337}
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!1338 = !DILocation(line: 1391, column: 3, scope: !1334)
!1339 = distinct !DISubprogram(name: "redis_get_auth_secrets", scope: !2, file: !2, line: 400, type: !308, scopeLine: 401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !56, retainedNodes: !696)
!1340 = !DILocalVariable(name: "sl", arg: 1, scope: !1339, file: !2, line: 400, type: !310)
!1341 = !DILocation(line: 400, column: 51, scope: !1339)
!1342 = !DILocalVariable(name: "realm", arg: 2, scope: !1339, file: !2, line: 400, type: !318)
!1343 = !DILocation(line: 400, column: 64, scope: !1339)
!1344 = !DILocalVariable(name: "ret", scope: !1339, file: !2, line: 402, type: !74)
!1345 = !DILocation(line: 402, column: 6, scope: !1339)
!1346 = !DILocalVariable(name: "rc", scope: !1339, file: !2, line: 403, type: !117)
!1347 = !DILocation(line: 403, column: 16, scope: !1339)
!1348 = !DILocation(line: 403, column: 21, scope: !1339)
!1349 = !DILocation(line: 404, column: 6, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1339, file: !2, line: 404, column: 6)
!1351 = !DILocation(line: 404, column: 6, scope: !1339)
!1352 = !DILocalVariable(name: "reply", scope: !1353, file: !2, line: 405, type: !92)
!1353 = distinct !DILexicalBlock(scope: !1350, file: !2, line: 404, column: 10)
!1354 = !DILocation(line: 405, column: 15, scope: !1353)
!1355 = !DILocation(line: 405, column: 50, scope: !1353)
!1356 = !DILocation(line: 405, column: 95, scope: !1353)
!1357 = !DILocation(line: 405, column: 37, scope: !1353)
!1358 = !DILocation(line: 406, column: 7, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1353, file: !2, line: 406, column: 7)
!1360 = !DILocation(line: 406, column: 7, scope: !1353)
