; ModuleID = '/home/raj/coturn/src/apps/relay/dbdrivers/dbd_mysql.c'
source_filename = "/home/raj/coturn/src/apps/relay/dbdrivers/dbd_mysql.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_dbdriver_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

!65 = !DIEnumerator(name: "MYSQL_OPT_COMPRESS", value: 1)
!66 = !DIEnumerator(name: "MYSQL_OPT_NAMED_PIPE", value: 2)
!67 = !DIEnumerator(name: "MYSQL_INIT_COMMAND", value: 3)
!68 = !DIEnumerator(name: "MYSQL_READ_DEFAULT_FILE", value: 4)
!69 = !DIEnumerator(name: "MYSQL_READ_DEFAULT_GROUP", value: 5)
!70 = !DIEnumerator(name: "MYSQL_SET_CHARSET_DIR", value: 6)
!71 = !DIEnumerator(name: "MYSQL_SET_CHARSET_NAME", value: 7)
!72 = !DIEnumerator(name: "MYSQL_OPT_LOCAL_INFILE", value: 8)
!73 = !DIEnumerator(name: "MYSQL_OPT_PROTOCOL", value: 9)
!74 = !DIEnumerator(name: "MYSQL_SHARED_MEMORY_BASE_NAME", value: 10)
!75 = !DIEnumerator(name: "MYSQL_OPT_READ_TIMEOUT", value: 11)
!76 = !DIEnumerator(name: "MYSQL_OPT_WRITE_TIMEOUT", value: 12)
!77 = !DIEnumerator(name: "MYSQL_OPT_USE_RESULT", value: 13)
!78 = !DIEnumerator(name: "MYSQL_REPORT_DATA_TRUNCATION", value: 14)
!79 = !DIEnumerator(name: "MYSQL_OPT_RECONNECT", value: 15)
!80 = !DIEnumerator(name: "MYSQL_PLUGIN_DIR", value: 16)
!81 = !DIEnumerator(name: "MYSQL_DEFAULT_AUTH", value: 17)
!82 = !DIEnumerator(name: "MYSQL_OPT_BIND", value: 18)
!83 = !DIEnumerator(name: "MYSQL_OPT_SSL_KEY", value: 19)
!84 = !DIEnumerator(name: "MYSQL_OPT_SSL_CERT", value: 20)
!85 = !DIEnumerator(name: "MYSQL_OPT_SSL_CA", value: 21)
!86 = !DIEnumerator(name: "MYSQL_OPT_SSL_CAPATH", value: 22)
!87 = !DIEnumerator(name: "MYSQL_OPT_SSL_CIPHER", value: 23)
!88 = !DIEnumerator(name: "MYSQL_OPT_SSL_CRL", value: 24)
!89 = !DIEnumerator(name: "MYSQL_OPT_SSL_CRLPATH", value: 25)
!90 = !DIEnumerator(name: "MYSQL_OPT_CONNECT_ATTR_RESET", value: 26)
!91 = !DIEnumerator(name: "MYSQL_OPT_CONNECT_ATTR_ADD", value: 27)
!92 = !DIEnumerator(name: "MYSQL_OPT_CONNECT_ATTR_DELETE", value: 28)
!93 = !DIEnumerator(name: "MYSQL_SERVER_PUBLIC_KEY", value: 29)
!94 = !DIEnumerator(name: "MYSQL_ENABLE_CLEARTEXT_PLUGIN", value: 30)
!95 = !DIEnumerator(name: "MYSQL_OPT_CAN_HANDLE_EXPIRED_PASSWORDS", value: 31)
!96 = !DIEnumerator(name: "MYSQL_OPT_MAX_ALLOWED_PACKET", value: 32)
!97 = !DIEnumerator(name: "MYSQL_OPT_NET_BUFFER_LENGTH", value: 33)
!98 = !DIEnumerator(name: "MYSQL_OPT_TLS_VERSION", value: 34)
!99 = !DIEnumerator(name: "MYSQL_OPT_SSL_MODE", value: 35)
!100 = !DIEnumerator(name: "MYSQL_OPT_GET_SERVER_PUBLIC_KEY", value: 36)
!101 = !DIEnumerator(name: "MYSQL_OPT_RETRY_COUNT", value: 37)
!102 = !DIEnumerator(name: "MYSQL_OPT_OPTIONAL_RESULTSET_METADATA", value: 38)
!103 = !DIEnumerator(name: "MYSQL_OPT_SSL_FIPS_MODE", value: 39)
!104 = !DIEnumerator(name: "MYSQL_OPT_TLS_CIPHERSUITES", value: 40)
!105 = !DIEnumerator(name: "MYSQL_OPT_COMPRESSION_ALGORITHMS", value: 41)
!106 = !DIEnumerator(name: "MYSQL_OPT_ZSTD_COMPRESSION_LEVEL", value: 42)
!107 = !DIEnumerator(name: "MYSQL_OPT_LOAD_DATA_LOCAL_DIR", value: 43)
!108 = !DIEnumerator(name: "MYSQL_OPT_USER_PASSWORD", value: 44)
!109 = !DIEnumerator(name: "MYSQL_OPT_SSL_SESSION_DATA", value: 45)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SHATYPE", file: !111, line: 160, baseType: !112, size: 32, elements: !113)
!111 = !DIFile(filename: "src/client/ns_turn_msg_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "4d8c44ae9e82b7a50b86805787352690")
!112 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!113 = !{!114, !115, !116, !117, !118, !119}
!114 = !DIEnumerator(name: "SHATYPE_ERROR", value: -1)
!115 = !DIEnumerator(name: "SHATYPE_DEFAULT", value: 0)
!116 = !DIEnumerator(name: "SHATYPE_SHA1", value: 0)
!117 = !DIEnumerator(name: "SHATYPE_SHA256", value: 1)
!118 = !DIEnumerator(name: "SHATYPE_SHA384", value: 2)
!119 = !DIEnumerator(name: "SHATYPE_SHA512", value: 3)
!120 = !{!121, !132, !134, !318, !7, !112, !152, !277, !335, !337, !338, !340, !342, !224, !343}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "block128_f", file: !122, line: 25, baseType: !123)
!122 = !DIFile(filename: "/usr/include/openssl/modes.h", directory: "", checksumkind: CSK_MD5, checksum: "4d7254b8c0e88f21372dfaf8e30599a1")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126, !129, !130}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL", file: !44, line: 337, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL", file: !44, line: 299, size: 9280, elements: !137)
!137 = !{!138, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !220, !223, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !292, !293, !294, !295, !296, !300, !310, !314, !315, !317}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "net", scope: !136, file: !44, line: 300, baseType: !139, size: 5312)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET", file: !51, line: 947, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NET", file: !51, line: 914, size: 5312, elements: !141)
!141 = !{!142, !145, !146, !147, !148, !149, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !166, !167, !168, !170, !171, !172, !176, !180}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "vio", scope: !140, file: !51, line: 915, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vio", file: !51, line: 894, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !140, file: !51, line: 916, baseType: !129, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "buff_end", scope: !140, file: !51, line: 916, baseType: !129, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !140, file: !51, line: 916, baseType: !129, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !140, file: !51, line: 916, baseType: !129, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !140, file: !51, line: 917, baseType: !150, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_socket", file: !44, line: 65, baseType: !112)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "remain_in_buf", scope: !140, file: !51, line: 923, baseType: !152, size: 64, offset: 384)
!152 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !140, file: !51, line: 923, baseType: !152, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "buf_length", scope: !140, file: !51, line: 923, baseType: !152, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "where_b", scope: !140, file: !51, line: 923, baseType: !152, size: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet", scope: !140, file: !51, line: 924, baseType: !152, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !140, file: !51, line: 924, baseType: !152, size: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_nr", scope: !140, file: !51, line: 925, baseType: !7, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "compress_pkt_nr", scope: !140, file: !51, line: 925, baseType: !7, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "write_timeout", scope: !140, file: !51, line: 926, baseType: !7, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !140, file: !51, line: 926, baseType: !7, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !140, file: !51, line: 926, baseType: !7, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fcntl", scope: !140, file: !51, line: 927, baseType: !112, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "return_status", scope: !140, file: !51, line: 928, baseType: !165, size: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reading_or_writing", scope: !140, file: !51, line: 929, baseType: !128, size: 8, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "save_char", scope: !140, file: !51, line: 930, baseType: !128, size: 8, offset: 1032)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !140, file: !51, line: 931, baseType: !169, size: 8, offset: 1040)
!169 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last_errno", scope: !140, file: !51, line: 932, baseType: !7, size: 32, offset: 1056)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !140, file: !51, line: 933, baseType: !128, size: 8, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !140, file: !51, line: 935, baseType: !173, size: 4096, offset: 1096)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 4096, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sqlstate", scope: !140, file: !51, line: 937, baseType: !177, size: 48, offset: 5192)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 48, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 6)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !140, file: !51, line: 946, baseType: !181, size: 64, offset: 5248)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "connector_fd", scope: !136, file: !44, line: 301, baseType: !129, size: 64, offset: 5312)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !136, file: !44, line: 302, baseType: !132, size: 64, offset: 5376)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !136, file: !44, line: 302, baseType: !132, size: 64, offset: 5440)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "passwd", scope: !136, file: !44, line: 302, baseType: !132, size: 64, offset: 5504)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !136, file: !44, line: 302, baseType: !132, size: 64, offset: 5568)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "server_version", scope: !136, file: !44, line: 302, baseType: !132, size: 64, offset: 5632)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "host_info", scope: !136, file: !44, line: 302, baseType: !132, size: 64, offset: 5696)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !136, file: !44, line: 303, baseType: !132, size: 64, offset: 5760)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !136, file: !44, line: 303, baseType: !132, size: 64, offset: 5824)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !136, file: !44, line: 304, baseType: !192, size: 64, offset: 5888)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "CHARSET_INFO", file: !44, line: 304, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !136, file: !44, line: 305, baseType: !195, size: 64, offset: 5952)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_FIELD", file: !44, line: 143, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_FIELD", file: !44, line: 121, size: 1024, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !44, line: 122, baseType: !132, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "org_name", scope: !197, file: !44, line: 123, baseType: !132, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !197, file: !44, line: 124, baseType: !132, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "org_table", scope: !197, file: !44, line: 125, baseType: !132, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !197, file: !44, line: 126, baseType: !132, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "catalog", scope: !197, file: !44, line: 127, baseType: !132, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !197, file: !44, line: 128, baseType: !132, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !197, file: !44, line: 129, baseType: !152, size: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !197, file: !44, line: 130, baseType: !152, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name_length", scope: !197, file: !44, line: 131, baseType: !7, size: 32, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "org_name_length", scope: !197, file: !44, line: 132, baseType: !7, size: 32, offset: 608)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "table_length", scope: !197, file: !44, line: 133, baseType: !7, size: 32, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "org_table_length", scope: !197, file: !44, line: 134, baseType: !7, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "db_length", scope: !197, file: !44, line: 135, baseType: !7, size: 32, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "catalog_length", scope: !197, file: !44, line: 136, baseType: !7, size: 32, offset: 736)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "def_length", scope: !197, file: !44, line: 137, baseType: !7, size: 32, offset: 768)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !44, line: 138, baseType: !7, size: 32, offset: 800)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "decimals", scope: !197, file: !44, line: 139, baseType: !7, size: 32, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "charsetnr", scope: !197, file: !44, line: 140, baseType: !7, size: 32, offset: 864)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !44, line: 141, baseType: !5, size: 32, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !197, file: !44, line: 142, baseType: !181, size: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "field_alloc", scope: !136, file: !44, line: 306, baseType: !221, size: 64, offset: 6016)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_ROOT", file: !44, line: 161, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "affected_rows", scope: !136, file: !44, line: 307, baseType: !224, size: 64, offset: 6080)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !225, line: 27, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !227, line: 45, baseType: !152)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "insert_id", scope: !136, file: !44, line: 308, baseType: !224, size: 64, offset: 6144)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "extra_info", scope: !136, file: !44, line: 309, baseType: !224, size: 64, offset: 6208)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !136, file: !44, line: 310, baseType: !152, size: 64, offset: 6272)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !136, file: !44, line: 311, baseType: !152, size: 64, offset: 6336)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !136, file: !44, line: 312, baseType: !7, size: 32, offset: 6400)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "client_flag", scope: !136, file: !44, line: 313, baseType: !152, size: 64, offset: 6464)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "server_capabilities", scope: !136, file: !44, line: 313, baseType: !152, size: 64, offset: 6528)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !136, file: !44, line: 314, baseType: !7, size: 32, offset: 6592)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !136, file: !44, line: 315, baseType: !7, size: 32, offset: 6624)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "server_status", scope: !136, file: !44, line: 316, baseType: !7, size: 32, offset: 6656)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "server_language", scope: !136, file: !44, line: 317, baseType: !7, size: 32, offset: 6688)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "warning_count", scope: !136, file: !44, line: 318, baseType: !7, size: 32, offset: 6720)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !136, file: !44, line: 319, baseType: !241, size: 1920, offset: 6784)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "st_mysql_options", file: !44, line: 225, size: 1920, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !279, !283, !287, !288, !289}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "connect_timeout", scope: !241, file: !44, line: 226, baseType: !7, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !241, file: !44, line: 226, baseType: !7, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "write_timeout", scope: !241, file: !44, line: 226, baseType: !7, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !241, file: !44, line: 227, baseType: !7, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !241, file: !44, line: 227, baseType: !7, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "client_flag", scope: !241, file: !44, line: 228, baseType: !152, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !241, file: !44, line: 229, baseType: !132, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !241, file: !44, line: 229, baseType: !132, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !241, file: !44, line: 229, baseType: !132, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !241, file: !44, line: 229, baseType: !132, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !241, file: !44, line: 229, baseType: !132, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "init_commands", scope: !241, file: !44, line: 230, baseType: !255, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "Init_commands_array", file: !44, line: 230, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "my_cnf_file", scope: !241, file: !44, line: 231, baseType: !132, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "my_cnf_group", scope: !241, file: !44, line: 231, baseType: !132, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "charset_dir", scope: !241, file: !44, line: 231, baseType: !132, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "charset_name", scope: !241, file: !44, line: 231, baseType: !132, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_key", scope: !241, file: !44, line: 232, baseType: !132, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_cert", scope: !241, file: !44, line: 233, baseType: !132, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ca", scope: !241, file: !44, line: 234, baseType: !132, size: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_capath", scope: !241, file: !44, line: 235, baseType: !132, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_cipher", scope: !241, file: !44, line: 236, baseType: !132, size: 64, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "shared_memory_base_name", scope: !241, file: !44, line: 237, baseType: !132, size: 64, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "max_allowed_packet", scope: !241, file: !44, line: 238, baseType: !152, size: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !241, file: !44, line: 239, baseType: !169, size: 8, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "named_pipe", scope: !241, file: !44, line: 239, baseType: !169, size: 8, offset: 1352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bind_address", scope: !241, file: !44, line: 243, baseType: !132, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "report_data_truncation", scope: !241, file: !44, line: 245, baseType: !169, size: 8, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_init", scope: !241, file: !44, line: 248, baseType: !273, size: 64, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!112, !276, !277, !181}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_read", scope: !241, file: !44, line: 249, baseType: !280, size: 64, offset: 1600)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!112, !181, !132, !7}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_end", scope: !241, file: !44, line: 250, baseType: !284, size: 64, offset: 1664)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !181}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_error", scope: !241, file: !44, line: 251, baseType: !280, size: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "local_infile_userdata", scope: !241, file: !44, line: 252, baseType: !181, size: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !241, file: !44, line: 253, baseType: !290, size: 64, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "st_mysql_options_extention", file: !44, line: 223, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !136, file: !44, line: 320, baseType: !43, size: 32, offset: 8704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "resultset_metadata", scope: !136, file: !44, line: 321, baseType: !50, size: 32, offset: 8736)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !136, file: !44, line: 322, baseType: !169, size: 8, offset: 8768)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect", scope: !136, file: !44, line: 323, baseType: !169, size: 8, offset: 8776)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "scramble", scope: !136, file: !44, line: 326, baseType: !297, size: 168, offset: 8784)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 168, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 21)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "stmts", scope: !136, file: !44, line: 328, baseType: !301, size: 64, offset: 8960)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIST", file: !303, line: 39, baseType: !304)
!303 = !DIFile(filename: "/usr/include/mysql/my_list.h", directory: "", checksumkind: CSK_MD5, checksum: "2c916b19e4f514cea577a95404bf2fb6")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LIST", file: !303, line: 36, size: 192, elements: !305)
!305 = !{!306, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !303, line: 37, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !303, line: 37, baseType: !307, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !303, line: 38, baseType: !181, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !136, file: !44, line: 329, baseType: !311, size: 64, offset: 9024)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_METHODS", file: !44, line: 296, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "thd", scope: !136, file: !44, line: 330, baseType: !181, size: 64, offset: 9088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "unbuffered_fetch_owner", scope: !136, file: !44, line: 335, baseType: !316, size: 64, offset: 9152)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !136, file: !44, line: 336, baseType: !181, size: 64, offset: 9216)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "Myconninfo", file: !320, line: 60, baseType: !321)
!320 = !DIFile(filename: "src/apps/relay/dbdrivers/dbd_mysql.c", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "e7f291ca284da95292c85ab7d47216ff")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Myconninfo", file: !320, line: 43, size: 704, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !321, file: !320, line: 44, baseType: !132, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dbname", scope: !321, file: !320, line: 45, baseType: !132, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !321, file: !320, line: 46, baseType: !132, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !321, file: !320, line: 47, baseType: !132, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !321, file: !320, line: 48, baseType: !7, size: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "connect_timeout", scope: !321, file: !320, line: 49, baseType: !7, size: 32, offset: 288)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "read_timeout", scope: !321, file: !320, line: 50, baseType: !7, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !321, file: !320, line: 52, baseType: !132, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ca", scope: !321, file: !320, line: 53, baseType: !132, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !321, file: !320, line: 54, baseType: !132, size: 64, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "capath", scope: !321, file: !320, line: 55, baseType: !132, size: 64, offset: 576)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !321, file: !320, line: 56, baseType: !132, size: 64, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_value_type", file: !336, line: 225, baseType: !181)
!336 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_key_type", file: !336, line: 224, baseType: !132)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !339, line: 67, baseType: !152)
!339 = !DIFile(filename: "src/client/ns_turn_msg.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "43c56357294df21a547ee0716fe3769d")
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !341, line: 105, baseType: !112)
!341 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!342 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !225, line: 26, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !227, line: 42, baseType: !7)
!345 = !{!0, !346, !351, !356, !361, !366, !368, !373, !378, !383, !388, !393, !398, !403, !408, !410, !415, !420, !422, !427, !432, !434, !436, !438, !440, !442, !444, !446, !448, !453, !455, !457, !459, !461, !466, !471, !476, !478, !480, !482, !484, !486, !491, !493, !495, !497, !499, !501, !506, !511, !513, !518, !523, !528, !533, !538, !543, !545, !550, !555, !557, !562, !564, !566, !568, !570, !572, !574, !579, !584, !589, !591, !593, !598, !600, !605, !610, !615, !620, !625, !630, !632, !637, !642, !728, !733, !735, !740, !742, !744, !746, !748, !750, !752, !754, !759, !764, !769, !774, !779, !781, !786, !788, !790, !792, !797, !799, !801, !803, !805, !807, !812, !814}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !320, line: 307, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 376, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 47)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !320, line: 310, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 344, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 43)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !320, line: 242, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 592, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 74)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !320, line: 245, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 560, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 70)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !320, line: 252, type: !353, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !320, line: 257, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 312, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 39)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !320, line: 273, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 432, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 54)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !320, line: 277, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 32)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !320, line: 281, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 264, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 33)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !320, line: 283, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 280, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 35)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !320, line: 284, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 184, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 23)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !320, line: 287, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 216, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 27)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !320, line: 115, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 16, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 2)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !320, line: 121, type: !405, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !320, line: 132, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 40, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 5)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !320, line: 134, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 24, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 3)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !320, line: 136, type: !412, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !320, line: 138, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 56, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 7)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !320, line: 140, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 72, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 9)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !320, line: 142, type: !424, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !320, line: 144, type: !417, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !320, line: 146, type: !429, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !320, line: 148, type: !412, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !320, line: 150, type: !177, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !320, line: 152, type: !412, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !320, line: 154, type: !429, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !320, line: 156, type: !429, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !320, line: 158, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 32, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 4)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !320, line: 160, type: !424, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !320, line: 162, type: !424, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !320, line: 164, type: !412, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !320, line: 166, type: !405, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !320, line: 168, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 16)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !320, line: 170, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 8)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !320, line: 172, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 104, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 13)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !320, line: 174, type: !450, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !320, line: 176, type: !468, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !320, line: 178, type: !417, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !320, line: 180, type: !424, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !320, line: 182, type: !424, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !320, line: 184, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 88, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 11)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !320, line: 186, type: !412, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !320, line: 188, type: !429, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !320, line: 190, type: !424, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !320, line: 192, type: !488, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !320, line: 211, type: !405, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !320, line: 213, type: !503, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 80, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 10)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !320, line: 215, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 1)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "donot_print_connection_success", scope: !2, file: !320, line: 41, type: !112, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !320, line: 349, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 512, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 64)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !320, line: 358, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 408, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 51)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !320, line: 366, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 464, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 58)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !320, line: 372, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 192, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 24)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !320, line: 528, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 552, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 69)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !320, line: 533, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 544, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 68)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !320, line: 538, type: !520, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !320, line: 576, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 448, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 56)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !320, line: 579, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 328, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 41)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !320, line: 614, type: !540, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !320, line: 616, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 456, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 57)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !320, line: 644, type: !468, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !320, line: 668, type: !540, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !320, line: 670, type: !559, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !320, line: 727, type: !552, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !320, line: 729, type: !547, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !320, line: 742, type: !547, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !320, line: 747, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 424, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 53)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !320, line: 792, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 528, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 66)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !320, line: 797, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 320, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 40)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !320, line: 811, type: !520, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !320, line: 816, type: !370, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !320, line: 838, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 632, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 79)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !320, line: 840, type: !540, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !320, line: 870, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 12)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !320, line: 891, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 480, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 60)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !320, line: 895, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 576, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 72)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !320, line: 900, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 368, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 46)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !320, line: 917, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 656, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 82)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !320, line: 919, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 520, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 65)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !320, line: 937, type: !488, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !320, line: 956, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 240, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 30)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !320, line: 976, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 304, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 38)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "wrong_table_reported", scope: !644, file: !320, line: 980, type: !112, isLocal: true, isDefinition: true)
!644 = distinct !DISubprogram(name: "mysql_get_ip_list", scope: !320, file: !320, line: 971, type: !645, scopeLine: 971, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !727)
!645 = !DISubroutineType(types: !646)
!646 = !{!112, !277, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !649, line: 159, baseType: !650)
!649 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !649, line: 154, size: 128, elements: !651)
!651 = !{!652, !724}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !650, file: !649, line: 155, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !649, line: 152, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !649, line: 146, size: 6624, elements: !656)
!656 = !{!657, !661, !665}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !655, file: !649, line: 147, baseType: !658, size: 2056)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 2056, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 257)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !655, file: !649, line: 148, baseType: !662, size: 4104, offset: 2056)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 4104, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 513)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !655, file: !649, line: 149, baseType: !666, size: 448, offset: 6176)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !667, line: 53, baseType: !668)
!667 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 50, size: 448, elements: !669)
!669 = !{!670, !723}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !668, file: !667, line: 51, baseType: !671, size: 224)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !667, line: 48, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !667, line: 44, size: 224, elements: !673)
!673 = !{!674, !686, !702}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !672, file: !667, line: 45, baseType: !675, size: 128)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !676, line: 180, size: 128, elements: !677)
!676 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!677 = !{!678, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !675, file: !676, line: 182, baseType: !679, size: 16)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !680, line: 28, baseType: !681)
!680 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!681 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !675, file: !676, line: 183, baseType: !683, size: 112, offset: 16)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 112, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 14)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !672, file: !667, line: 46, baseType: !687, size: 128)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !688, line: 245, size: 128, elements: !689)
!688 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!689 = !{!690, !691, !695, !700}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !687, file: !688, line: 247, baseType: !679, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !687, file: !688, line: 248, baseType: !692, size: 16, offset: 16)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !688, line: 123, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !225, line: 25, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !227, line: 40, baseType: !681)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !687, file: !688, line: 249, baseType: !696, size: 32, offset: 32)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !688, line: 31, size: 32, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !696, file: !688, line: 33, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !688, line: 30, baseType: !343)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !687, file: !688, line: 252, baseType: !701, size: 64, offset: 64)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 64, elements: !469)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !672, file: !667, line: 47, baseType: !703, size: 224)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !688, line: 260, size: 224, elements: !704)
!704 = !{!705, !706, !707, !708, !722}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !703, file: !688, line: 262, baseType: !679, size: 16)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !703, file: !688, line: 263, baseType: !692, size: 16, offset: 16)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !703, file: !688, line: 264, baseType: !343, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !703, file: !688, line: 265, baseType: !709, size: 128, offset: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !688, line: 219, size: 128, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !709, file: !688, line: 226, baseType: !712, size: 128)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !709, file: !688, line: 221, size: 128, elements: !713)
!713 = !{!714, !718, !720}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !712, file: !688, line: 223, baseType: !715, size: 128)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 128, elements: !464)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !225, line: 24, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !227, line: 38, baseType: !128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !712, file: !688, line: 224, baseType: !719, size: 128)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 128, elements: !469)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !712, file: !688, line: 225, baseType: !721, size: 128)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 128, elements: !451)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !703, file: !688, line: 266, baseType: !343, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !668, file: !667, line: 52, baseType: !671, size: 224, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !650, file: !649, line: 156, baseType: !725, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !726, line: 46, baseType: !152)
!726 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!727 = !{}
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !320, line: 983, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1216, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 152)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !320, line: 985, type: !390, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !320, line: 770, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 504, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 63)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !320, line: 772, type: !525, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !320, line: 778, type: !348, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1028, type: !617, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1093, type: !617, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1120, type: !468, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1122, type: !602, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1124, type: !488, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1127, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 208, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 26)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !320, line: 551, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 864, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 108)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !320, line: 556, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 832, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 104)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !320, line: 560, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 52)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !320, line: 393, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 640, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 80)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !320, line: 592, type: !370, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !320, line: 595, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 336, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 42)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !320, line: 449, type: !622, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !320, line: 496, type: !412, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !320, line: 501, type: !450, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !320, line: 505, type: !794, isLocal: true, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 608, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 76)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1153, type: !375, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1186, type: !540, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1191, type: !737, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1210, type: !370, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1213, type: !353, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1228, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 440, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 55)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1250, type: !450, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !320, line: 1270, type: !634, isLocal: true, isDefinition: true)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_dbdriver_t", file: !818, line: 77, baseType: !819)
!818 = !DIFile(filename: "src/apps/relay/dbdrivers/dbdriver.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "00319dc97026a2c0105cbae0fcb396b3")
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_dbdriver_t", file: !818, line: 50, size: 1664, elements: !820)
!820 = !{!821, !834, !838, !842, !846, !850, !851, !852, !853, !854, !858, !859, !863, !864, !865, !867, !871, !875, !896, !902, !906, !910, !914, !918, !919, !923}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "get_auth_secrets", scope: !819, file: !818, line: 51, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!112, !825, !833}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "secrets_list_t", file: !827, line: 143, baseType: !828)
!827 = !DIFile(filename: "src/apps/relay/userdb.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "ef7aa3b34af7515d3cf1275f8bfd0947")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_secrets_list", file: !827, line: 139, size: 128, elements: !829)
!829 = !{!830, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "secrets", scope: !828, file: !827, line: 140, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !828, file: !827, line: 141, baseType: !725, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "get_user_key", scope: !819, file: !818, line: 52, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!112, !833, !833, !833}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "set_user_key", scope: !819, file: !818, line: 53, baseType: !839, size: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!112, !833, !833, !277}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "del_user", scope: !819, file: !818, line: 54, baseType: !843, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!112, !833, !833}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "list_users", scope: !819, file: !818, line: 55, baseType: !847, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!112, !833, !825, !825}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "list_secrets", scope: !819, file: !818, line: 56, baseType: !847, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "del_secret", scope: !819, file: !818, line: 57, baseType: !843, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "set_secret", scope: !819, file: !818, line: 58, baseType: !843, size: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "add_origin", scope: !819, file: !818, line: 59, baseType: !843, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "del_origin", scope: !819, file: !818, line: 60, baseType: !855, size: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!112, !833}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "list_origins", scope: !819, file: !818, line: 61, baseType: !847, size: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "set_realm_option_one", scope: !819, file: !818, line: 62, baseType: !860, size: 64, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!112, !833, !152, !277}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "list_realm_options", scope: !819, file: !818, line: 63, baseType: !855, size: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "auth_ping", scope: !819, file: !818, line: 64, baseType: !284, size: 64, offset: 832)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "get_ip_list", scope: !819, file: !818, line: 65, baseType: !866, size: 64, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "set_permission_ip", scope: !819, file: !818, line: 66, baseType: !868, size: 64, offset: 960)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!112, !277, !833, !277, !112}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "reread_realms", scope: !819, file: !818, line: 67, baseType: !872, size: 64, offset: 1024)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !825}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "set_oauth_key", scope: !819, file: !818, line: 68, baseType: !876, size: 64, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!112, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data_raw", file: !881, line: 144, baseType: !882)
!881 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data_raw", file: !881, line: 135, size: 4800, elements: !883)
!883 = !{!884, !888, !889, !890, !891, !892}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !882, file: !881, line: 136, baseType: !885, size: 1032)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1032, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 129)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !882, file: !881, line: 137, baseType: !658, size: 2056, offset: 1032)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !882, file: !881, line: 138, baseType: !224, size: 64, offset: 3136)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !882, file: !881, line: 139, baseType: !343, size: 32, offset: 3200)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !882, file: !881, line: 140, baseType: !627, size: 520, offset: 3232)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !882, file: !881, line: 141, baseType: !893, size: 1024, offset: 3752)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1024, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "get_oauth_key", scope: !819, file: !818, line: 69, baseType: !897, size: 64, offset: 1152)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!112, !900, !879}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "del_oauth_key", scope: !819, file: !818, line: 70, baseType: !903, size: 64, offset: 1216)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!112, !900}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "list_oauth_keys", scope: !819, file: !818, line: 71, baseType: !907, size: 64, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!112, !825, !825, !825, !825, !825}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "get_admin_user", scope: !819, file: !818, line: 72, baseType: !911, size: 64, offset: 1344)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!112, !900, !833, !833}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "set_admin_user", scope: !819, file: !818, line: 73, baseType: !915, size: 64, offset: 1408)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!112, !900, !900, !900}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "del_admin_user", scope: !819, file: !818, line: 74, baseType: !903, size: 64, offset: 1472)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "list_admin_users", scope: !819, file: !818, line: 75, baseType: !920, size: 64, offset: 1536)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!112, !112}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !819, file: !818, line: 76, baseType: !924, size: 64, offset: 1600)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null}
!927 = !{i32 7, !"Dwarf Version", i32 5}
!928 = !{i32 2, !"Debug Info Version", i32 3}
!929 = !{i32 1, !"wchar_size", i32 4}
!930 = !{i32 8, !"PIC Level", i32 2}
!931 = !{i32 7, !"PIE Level", i32 2}
!932 = !{i32 7, !"uwtable", i32 2}
!933 = !{i32 7, !"frame-pointer", i32 2}
!934 = !{!"clang version 16.0.0"}
!935 = distinct !DISubprogram(name: "decryptPassword", scope: !320, file: !320, line: 77, type: !936, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !727)
!936 = !DISubroutineType(types: !937)
!937 = !{!132, !132, !126}
!938 = !DILocalVariable(name: "in", arg: 1, scope: !935, file: !320, line: 77, type: !132)
!939 = !DILocation(line: 77, column: 29, scope: !935)
!940 = !DILocalVariable(name: "mykey", arg: 2, scope: !935, file: !320, line: 77, type: !126)
!941 = !DILocation(line: 77, column: 54, scope: !935)
!942 = !DILocalVariable(name: "out", scope: !935, file: !320, line: 79, type: !132)
!943 = !DILocation(line: 79, column: 8, scope: !935)
!944 = !DILocalVariable(name: "iv", scope: !935, file: !320, line: 80, type: !701)
!945 = !DILocation(line: 80, column: 16, scope: !935)
!946 = !DILocalVariable(name: "key", scope: !935, file: !320, line: 81, type: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AES_KEY", file: !948, line: 45, baseType: !949)
!948 = !DIFile(filename: "/usr/include/openssl/aes.h", directory: "", checksumkind: CSK_MD5, checksum: "c985bf41b08156ada84e9c536811221a")
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aes_key_st", file: !948, line: 37, size: 1952, elements: !950)
!950 = !{!951, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "rd_key", scope: !949, file: !948, line: 41, baseType: !952, size: 1920)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1920, elements: !608)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rounds", scope: !949, file: !948, line: 43, baseType: !112, size: 32, offset: 1920)
!954 = !DILocation(line: 81, column: 10, scope: !935)
!955 = !DILocalVariable(name: "outdata", scope: !935, file: !320, line: 82, type: !956)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 256)
!959 = !DILocation(line: 82, column: 16, scope: !935)
!960 = !DILocation(line: 83, column: 22, scope: !935)
!961 = !DILocation(line: 83, column: 2, scope: !935)
!962 = !DILocalVariable(name: "newTotalSize", scope: !935, file: !320, line: 84, type: !112)
!963 = !DILocation(line: 84, column: 6, scope: !935)
!964 = !DILocation(line: 84, column: 35, scope: !935)
!965 = !DILocation(line: 84, column: 19, scope: !935)
!966 = !DILocalVariable(name: "bytes_to_decode", scope: !935, file: !320, line: 85, type: !112)
!967 = !DILocation(line: 85, column: 6, scope: !935)
!968 = !DILocation(line: 85, column: 31, scope: !935)
!969 = !DILocation(line: 85, column: 24, scope: !935)
!970 = !DILocalVariable(name: "encryptedText", scope: !935, file: !320, line: 86, type: !129)
!971 = !DILocation(line: 86, column: 17, scope: !935)
!972 = !DILocation(line: 86, column: 46, scope: !935)
!973 = !DILocation(line: 86, column: 50, scope: !935)
!974 = !DILocation(line: 86, column: 33, scope: !935)
!975 = !DILocalVariable(name: "last", scope: !935, file: !320, line: 87, type: !976)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 1024)
!979 = !DILocation(line: 87, column: 7, scope: !935)
!980 = !DILocalVariable(name: "state", scope: !935, file: !320, line: 88, type: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_state", file: !982, line: 394, size: 288, elements: !983)
!982 = !DIFile(filename: "src/apps/relay/dbdrivers/../mainrelay.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1acca21bed3a1df5ba7170d81a649a58")
!983 = !{!984, !986, !987}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ivec", scope: !981, file: !982, line: 395, baseType: !985, size: 128)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, elements: !464)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !981, file: !982, line: 396, baseType: !7, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ecount", scope: !981, file: !982, line: 397, baseType: !985, size: 128, offset: 160)
!988 = !DILocation(line: 88, column: 19, scope: !935)
!989 = !DILocation(line: 89, column: 19, scope: !935)
!990 = !DILocation(line: 89, column: 2, scope: !935)
!991 = !DILocation(line: 90, column: 2, scope: !935)
!992 = !DILocation(line: 93, column: 24, scope: !935)
!993 = !DILocation(line: 93, column: 39, scope: !935)
!994 = !DILocation(line: 93, column: 48, scope: !935)
!995 = !DILocation(line: 93, column: 74, scope: !935)
!996 = !DILocation(line: 93, column: 68, scope: !935)
!997 = !DILocation(line: 93, column: 86, scope: !935)
!998 = !DILocation(line: 93, column: 80, scope: !935)
!999 = !DILocation(line: 93, column: 101, scope: !935)
!1000 = !DILocation(line: 93, column: 2, scope: !935)
!1001 = !DILocation(line: 98, column: 9, scope: !935)
!1002 = !DILocation(line: 98, column: 21, scope: !935)
!1003 = !DILocation(line: 98, column: 2, scope: !935)
!1004 = !DILocation(line: 99, column: 40, scope: !935)
!1005 = !DILocation(line: 99, column: 33, scope: !935)
!1006 = !DILocation(line: 99, column: 32, scope: !935)
!1007 = !DILocation(line: 99, column: 13, scope: !935)
!1008 = !DILocation(line: 99, column: 5, scope: !935)
!1009 = !DILocation(line: 100, column: 9, scope: !935)
!1010 = !DILocation(line: 100, column: 13, scope: !935)
!1011 = !DILocation(line: 100, column: 2, scope: !935)
!1012 = !DILocation(line: 101, column: 9, scope: !935)
!1013 = !DILocation(line: 101, column: 2, scope: !935)
!1014 = distinct !DISubprogram(name: "get_mysql_dbdriver", scope: !320, file: !320, line: 1304, type: !1015, scopeLine: 1304, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !727)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!1018 = !DILocation(line: 1305, column: 3, scope: !1014)
!1019 = distinct !DISubprogram(name: "mysql_get_auth_secrets", scope: !320, file: !320, line: 302, type: !823, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !727)
!1020 = !DILocalVariable(name: "sl", arg: 1, scope: !1019, file: !320, line: 302, type: !825)
!1021 = !DILocation(line: 302, column: 51, scope: !1019)
!1022 = !DILocalVariable(name: "realm", arg: 2, scope: !1019, file: !320, line: 302, type: !833)
!1023 = !DILocation(line: 302, column: 64, scope: !1019)
!1024 = !DILocalVariable(name: "ret", scope: !1019, file: !320, line: 303, type: !112)
!1025 = !DILocation(line: 303, column: 7, scope: !1019)
!1026 = !DILocalVariable(name: "myc", scope: !1019, file: !320, line: 304, type: !134)
!1027 = !DILocation(line: 304, column: 10, scope: !1019)
!1028 = !DILocation(line: 304, column: 16, scope: !1019)
!1029 = !DILocation(line: 305, column: 5, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1019, file: !320, line: 305, column: 5)
!1031 = !DILocation(line: 305, column: 5, scope: !1019)
!1032 = !DILocalVariable(name: "statement", scope: !1033, file: !320, line: 306, type: !1034)
!1033 = distinct !DILexicalBlock(scope: !1030, file: !320, line: 305, column: 10)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8200, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 1025)
!1037 = !DILocation(line: 306, column: 8, scope: !1033)
!1038 = !DILocation(line: 307, column: 12, scope: !1033)
!1039 = !DILocation(line: 307, column: 91, scope: !1033)
!1040 = !DILocation(line: 307, column: 3, scope: !1033)
!1041 = !DILocalVariable(name: "res", scope: !1033, file: !320, line: 308, type: !112)
!1042 = !DILocation(line: 308, column: 7, scope: !1033)
!1043 = !DILocation(line: 308, column: 25, scope: !1033)
!1044 = !DILocation(line: 308, column: 30, scope: !1033)
!1045 = !DILocation(line: 308, column: 13, scope: !1033)
!1046 = !DILocation(line: 309, column: 6, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1033, file: !320, line: 309, column: 6)
!1048 = !DILocation(line: 309, column: 6, scope: !1033)
!1049 = !DILocation(line: 310, column: 98, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !320, line: 309, column: 11)
!1051 = !DILocation(line: 310, column: 86, scope: !1050)
!1052 = !DILocation(line: 310, column: 4, scope: !1050)
!1053 = !DILocation(line: 311, column: 3, scope: !1050)
!1054 = !DILocalVariable(name: "mres", scope: !1055, file: !320, line: 312, type: !1056)
!1055 = distinct !DILexicalBlock(scope: !1047, file: !320, line: 311, column: 10)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_RES", file: !44, line: 356, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_RES", file: !44, line: 339, size: 832, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1079, !1080, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "row_count", scope: !1058, file: !44, line: 340, baseType: !224, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !1058, file: !44, line: 341, baseType: !195, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1058, file: !44, line: 342, baseType: !1063, size: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_DATA", file: !44, line: 163, size: 256, elements: !1065)
!1065 = !{!1066, !1076, !1077, !1078}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1064, file: !44, line: 164, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_ROWS", file: !44, line: 157, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MYSQL_ROWS", file: !44, line: 153, size: 192, elements: !1070)
!1070 = !{!1071, !1073, !1075}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1069, file: !44, line: 154, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1069, file: !44, line: 155, baseType: !1074, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "MYSQL_ROW", file: !44, line: 145, baseType: !831)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1069, file: !44, line: 156, baseType: !152, size: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1064, file: !44, line: 165, baseType: !221, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1064, file: !44, line: 166, baseType: !224, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !1064, file: !44, line: 167, baseType: !7, size: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "data_cursor", scope: !1058, file: !44, line: 343, baseType: !1067, size: 64, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !1058, file: !44, line: 344, baseType: !1081, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1058, file: !44, line: 345, baseType: !134, size: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !1058, file: !44, line: 346, baseType: !311, size: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "row", scope: !1058, file: !44, line: 347, baseType: !1074, size: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "current_row", scope: !1058, file: !44, line: 348, baseType: !1074, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "field_alloc", scope: !1058, file: !44, line: 349, baseType: !221, size: 64, offset: 576)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !1058, file: !44, line: 350, baseType: !7, size: 32, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "current_field", scope: !1058, file: !44, line: 350, baseType: !7, size: 32, offset: 672)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !1058, file: !44, line: 351, baseType: !169, size: 8, offset: 704)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "unbuffered_fetch_cancelled", scope: !1058, file: !44, line: 353, baseType: !169, size: 8, offset: 712)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1058, file: !44, line: 354, baseType: !50, size: 32, offset: 736)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "extension", scope: !1058, file: !44, line: 355, baseType: !181, size: 64, offset: 768)
!1093 = !DILocation(line: 312, column: 15, scope: !1055)
!1094 = !DILocation(line: 312, column: 41, scope: !1055)
!1095 = !DILocation(line: 312, column: 22, scope: !1055)
!1096 = !DILocation(line: 313, column: 8, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1055, file: !320, line: 313, column: 7)
!1098 = !DILocation(line: 313, column: 7, scope: !1055)
!1099 = !DILocation(line: 314, column: 99, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1097, file: !320, line: 313, column: 14)
!1101 = !DILocation(line: 314, column: 87, scope: !1100)
!1102 = !DILocation(line: 314, column: 5, scope: !1100)
!1103 = !DILocation(line: 315, column: 4, scope: !1100)
!1104 = !DILocation(line: 315, column: 32, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1097, file: !320, line: 315, column: 14)
!1106 = !DILocation(line: 315, column: 14, scope: !1105)
!1107 = !DILocation(line: 315, column: 36, scope: !1105)
!1108 = !DILocation(line: 315, column: 14, scope: !1097)
!1109 = !DILocation(line: 316, column: 5, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1105, file: !320, line: 315, column: 41)
!1111 = !DILocalVariable(name: "row", scope: !1112, file: !320, line: 317, type: !1074)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !320, line: 316, column: 13)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !320, line: 316, column: 5)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !320, line: 316, column: 5)
!1115 = !DILocation(line: 317, column: 16, scope: !1112)
!1116 = !DILocation(line: 317, column: 38, scope: !1112)
!1117 = !DILocation(line: 317, column: 22, scope: !1112)
!1118 = !DILocation(line: 318, column: 10, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1112, file: !320, line: 318, column: 9)
!1120 = !DILocation(line: 318, column: 9, scope: !1112)
!1121 = !DILocation(line: 319, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1119, file: !320, line: 318, column: 15)
!1123 = !DILocation(line: 321, column: 10, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !320, line: 321, column: 10)
!1125 = distinct !DILexicalBlock(scope: !1119, file: !320, line: 320, column: 13)
!1126 = !DILocation(line: 321, column: 10, scope: !1125)
!1127 = !DILocalVariable(name: "lengths", scope: !1128, file: !320, line: 322, type: !1081)
!1128 = distinct !DILexicalBlock(scope: !1124, file: !320, line: 321, column: 18)
!1129 = !DILocation(line: 322, column: 23, scope: !1128)
!1130 = !DILocation(line: 322, column: 53, scope: !1128)
!1131 = !DILocation(line: 322, column: 33, scope: !1128)
!1132 = !DILocation(line: 323, column: 11, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1128, file: !320, line: 323, column: 11)
!1134 = !DILocation(line: 323, column: 11, scope: !1128)
!1135 = !DILocalVariable(name: "sz", scope: !1136, file: !320, line: 324, type: !725)
!1136 = distinct !DILexicalBlock(scope: !1133, file: !320, line: 323, column: 20)
!1137 = !DILocation(line: 324, column: 16, scope: !1136)
!1138 = !DILocation(line: 324, column: 21, scope: !1136)
!1139 = !DILocalVariable(name: "auth_secret", scope: !1136, file: !320, line: 325, type: !1034)
!1140 = !DILocation(line: 325, column: 14, scope: !1136)
!1141 = !DILocation(line: 326, column: 15, scope: !1136)
!1142 = !DILocation(line: 326, column: 22, scope: !1136)
!1143 = !DILocation(line: 326, column: 34, scope: !1136)
!1144 = !DILocation(line: 326, column: 9, scope: !1136)
!1145 = !DILocation(line: 327, column: 21, scope: !1136)
!1146 = !DILocation(line: 327, column: 9, scope: !1136)
!1147 = !DILocation(line: 327, column: 24, scope: !1136)
!1148 = !DILocation(line: 328, column: 29, scope: !1136)
!1149 = !DILocation(line: 328, column: 32, scope: !1136)
!1150 = !DILocation(line: 328, column: 9, scope: !1136)
!1151 = !DILocation(line: 329, column: 8, scope: !1136)
!1152 = !DILocation(line: 330, column: 7, scope: !1128)
!1153 = !DILocation(line: 316, column: 5, scope: !1113)
!1154 = distinct !{!1154, !1155, !1156}
!1155 = !DILocation(line: 316, column: 5, scope: !1114)
!1156 = !DILocation(line: 332, column: 5, scope: !1114)
!1157 = !DILocation(line: 333, column: 9, scope: !1110)
!1158 = !DILocation(line: 334, column: 4, scope: !1110)
!1159 = !DILocation(line: 336, column: 7, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1055, file: !320, line: 336, column: 7)
!1161 = !DILocation(line: 336, column: 7, scope: !1055)
!1162 = !DILocation(line: 337, column: 23, scope: !1160)
!1163 = !DILocation(line: 337, column: 5, scope: !1160)
!1164 = !DILocation(line: 339, column: 2, scope: !1033)
!1165 = !DILocation(line: 340, column: 10, scope: !1019)
!1166 = !DILocation(line: 340, column: 3, scope: !1019)
!1167 = distinct !DISubprogram(name: "mysql_get_user_key", scope: !320, file: !320, line: 343, type: !836, scopeLine: 343, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !727)
!1168 = !DILocalVariable(name: "usname", arg: 1, scope: !1167, file: !320, line: 343, type: !833)
!1169 = !DILocation(line: 343, column: 40, scope: !1167)
!1170 = !DILocalVariable(name: "realm", arg: 2, scope: !1167, file: !320, line: 343, type: !833)
!1171 = !DILocation(line: 343, column: 57, scope: !1167)
!1172 = !DILocalVariable(name: "key", arg: 3, scope: !1167, file: !320, line: 343, type: !833)
!1173 = !DILocation(line: 343, column: 74, scope: !1167)
!1174 = !DILocalVariable(name: "ret", scope: !1167, file: !320, line: 344, type: !112)
!1175 = !DILocation(line: 344, column: 7, scope: !1167)
!1176 = !DILocalVariable(name: "myc", scope: !1167, file: !320, line: 345, type: !134)
!1177 = !DILocation(line: 345, column: 10, scope: !1167)
!1178 = !DILocation(line: 345, column: 16, scope: !1167)
!1179 = !DILocation(line: 346, column: 5, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1167, file: !320, line: 346, column: 5)
!1181 = !DILocation(line: 346, column: 5, scope: !1167)
!1182 = !DILocalVariable(name: "statement", scope: !1183, file: !320, line: 347, type: !1034)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !320, line: 346, column: 10)
!1184 = !DILocation(line: 347, column: 8, scope: !1183)
!1185 = !DILocation(line: 349, column: 12, scope: !1183)
!1186 = !DILocation(line: 349, column: 106, scope: !1183)
!1187 = !DILocation(line: 349, column: 113, scope: !1183)
!1188 = !DILocation(line: 349, column: 3, scope: !1183)
!1189 = !DILocalVariable(name: "res", scope: !1183, file: !320, line: 350, type: !112)
!1190 = !DILocation(line: 350, column: 7, scope: !1183)
!1191 = !DILocation(line: 350, column: 25, scope: !1183)
!1192 = !DILocation(line: 350, column: 30, scope: !1183)
!1193 = !DILocation(line: 350, column: 13, scope: !1183)
!1194 = !DILocation(line: 351, column: 6, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1183, file: !320, line: 351, column: 6)
!1196 = !DILocation(line: 351, column: 6, scope: !1183)
!1197 = !DILocation(line: 352, column: 98, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1195, file: !320, line: 351, column: 11)
!1199 = !DILocation(line: 352, column: 86, scope: !1198)
!1200 = !DILocation(line: 352, column: 4, scope: !1198)
!1201 = !DILocation(line: 353, column: 3, scope: !1198)
!1202 = !DILocalVariable(name: "mres", scope: !1203, file: !320, line: 354, type: !1056)
!1203 = distinct !DILexicalBlock(scope: !1195, file: !320, line: 353, column: 10)
!1204 = !DILocation(line: 354, column: 15, scope: !1203)
!1205 = !DILocation(line: 354, column: 41, scope: !1203)
!1206 = !DILocation(line: 354, column: 22, scope: !1203)
!1207 = !DILocation(line: 355, column: 8, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1203, file: !320, line: 355, column: 7)
!1209 = !DILocation(line: 355, column: 7, scope: !1203)
!1210 = !DILocation(line: 356, column: 99, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1208, file: !320, line: 355, column: 14)
!1212 = !DILocation(line: 356, column: 87, scope: !1211)
!1213 = !DILocation(line: 356, column: 5, scope: !1211)
!1214 = !DILocation(line: 357, column: 4, scope: !1211)
!1215 = !DILocation(line: 357, column: 32, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1208, file: !320, line: 357, column: 14)
!1217 = !DILocation(line: 357, column: 14, scope: !1216)
!1218 = !DILocation(line: 357, column: 36, scope: !1216)
!1219 = !DILocation(line: 357, column: 14, scope: !1208)
!1220 = !DILocation(line: 358, column: 95, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1216, file: !320, line: 357, column: 41)
!1222 = !DILocation(line: 358, column: 5, scope: !1221)
!1223 = !DILocation(line: 359, column: 4, scope: !1221)
!1224 = !DILocalVariable(name: "row", scope: !1225, file: !320, line: 360, type: !1074)
!1225 = distinct !DILexicalBlock(scope: !1216, file: !320, line: 359, column: 11)
!1226 = !DILocation(line: 360, column: 15, scope: !1225)
!1227 = !DILocation(line: 360, column: 37, scope: !1225)
!1228 = !DILocation(line: 360, column: 21, scope: !1225)
!1229 = !DILocation(line: 361, column: 8, scope: !1230)
