; ModuleID = '/home/raj/coturn/src/apps/relay/dbdrivers/dbd_mongo.c'
source_filename = "/home/raj/coturn/src/apps/relay/dbdrivers/dbd_mongo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_dbdriver_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

!29 = !DIEnumerator(name: "TURN_LOG_LEVEL_CONTROL", value: 1)
!30 = !DIEnumerator(name: "TURN_LOG_LEVEL_WARNING", value: 2)
!31 = !DIEnumerator(name: "TURN_LOG_LEVEL_ERROR", value: 3)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 235, baseType: !14, size: 32, elements: !34)
!33 = !DIFile(filename: "/usr/include/libbson-1.0/bson/bson-types.h", directory: "", checksumkind: CSK_MD5, checksum: "89ccd18b278677e3f25297a8c3171624")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!35 = !DIEnumerator(name: "BSON_TYPE_EOD", value: 0)
!36 = !DIEnumerator(name: "BSON_TYPE_DOUBLE", value: 1)
!37 = !DIEnumerator(name: "BSON_TYPE_UTF8", value: 2)
!38 = !DIEnumerator(name: "BSON_TYPE_DOCUMENT", value: 3)
!39 = !DIEnumerator(name: "BSON_TYPE_ARRAY", value: 4)
!40 = !DIEnumerator(name: "BSON_TYPE_BINARY", value: 5)
!41 = !DIEnumerator(name: "BSON_TYPE_UNDEFINED", value: 6)
!42 = !DIEnumerator(name: "BSON_TYPE_OID", value: 7)
!43 = !DIEnumerator(name: "BSON_TYPE_BOOL", value: 8)
!44 = !DIEnumerator(name: "BSON_TYPE_DATE_TIME", value: 9)
!45 = !DIEnumerator(name: "BSON_TYPE_NULL", value: 10)
!46 = !DIEnumerator(name: "BSON_TYPE_REGEX", value: 11)
!47 = !DIEnumerator(name: "BSON_TYPE_DBPOINTER", value: 12)
!48 = !DIEnumerator(name: "BSON_TYPE_CODE", value: 13)
!49 = !DIEnumerator(name: "BSON_TYPE_SYMBOL", value: 14)
!50 = !DIEnumerator(name: "BSON_TYPE_CODEWSCOPE", value: 15)
!51 = !DIEnumerator(name: "BSON_TYPE_INT32", value: 16)
!52 = !DIEnumerator(name: "BSON_TYPE_TIMESTAMP", value: 17)
!53 = !DIEnumerator(name: "BSON_TYPE_INT64", value: 18)
!54 = !DIEnumerator(name: "BSON_TYPE_DECIMAL128", value: 19)
!55 = !DIEnumerator(name: "BSON_TYPE_MAXKEY", value: 127)
!56 = !DIEnumerator(name: "BSON_TYPE_MINKEY", value: 255)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 267, baseType: !14, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "BSON_SUBTYPE_BINARY", value: 0)
!60 = !DIEnumerator(name: "BSON_SUBTYPE_FUNCTION", value: 1)
!61 = !DIEnumerator(name: "BSON_SUBTYPE_BINARY_DEPRECATED", value: 2)
!62 = !DIEnumerator(name: "BSON_SUBTYPE_UUID_DEPRECATED", value: 3)
!63 = !DIEnumerator(name: "BSON_SUBTYPE_UUID", value: 4)
!64 = !DIEnumerator(name: "BSON_SUBTYPE_MD5", value: 5)
!65 = !DIEnumerator(name: "BSON_SUBTYPE_ENCRYPTED", value: 6)
!66 = !DIEnumerator(name: "BSON_SUBTYPE_COLUMN", value: 7)
!67 = !DIEnumerator(name: "BSON_SUBTYPE_USER", value: 128)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 48, baseType: !14, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/libmongoc-1.0/mongoc/mongoc-log.h", directory: "", checksumkind: CSK_MD5, checksum: "1c741c1aed2b563cacb6bced8e97d0b0")
!70 = !{!71, !72, !73, !74, !75, !76, !77}
!71 = !DIEnumerator(name: "MONGOC_LOG_LEVEL_ERROR", value: 0)
!72 = !DIEnumerator(name: "MONGOC_LOG_LEVEL_CRITICAL", value: 1)
!73 = !DIEnumerator(name: "MONGOC_LOG_LEVEL_WARNING", value: 2)
!74 = !DIEnumerator(name: "MONGOC_LOG_LEVEL_MESSAGE", value: 3)
!75 = !DIEnumerator(name: "MONGOC_LOG_LEVEL_INFO", value: 4)
!76 = !DIEnumerator(name: "MONGOC_LOG_LEVEL_DEBUG", value: 5)
!77 = !DIEnumerator(name: "MONGOC_LOG_LEVEL_TRACE", value: 6)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_SHATYPE", file: !79, line: 160, baseType: !80, size: 32, elements: !81)
!79 = !DIFile(filename: "src/client/ns_turn_msg_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "4d8c44ae9e82b7a50b86805787352690")
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !{!82, !83, !84, !85, !86, !87}
!82 = !DIEnumerator(name: "SHATYPE_ERROR", value: -1)
!83 = !DIEnumerator(name: "SHATYPE_DEFAULT", value: 0)
!84 = !DIEnumerator(name: "SHATYPE_SHA1", value: 0)
!85 = !DIEnumerator(name: "SHATYPE_SHA256", value: 1)
!86 = !DIEnumerator(name: "SHATYPE_SHA384", value: 2)
!87 = !DIEnumerator(name: "SHATYPE_SHA512", value: 3)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 137, baseType: !14, size: 32, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "MONGOC_UPDATE_NONE", value: 0)
!91 = !DIEnumerator(name: "MONGOC_UPDATE_UPSERT", value: 1)
!92 = !DIEnumerator(name: "MONGOC_UPDATE_MULTI_UPDATE", value: 2)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 39, baseType: !14, size: 32, elements: !94)
!94 = !{!95, !96}
!95 = !DIEnumerator(name: "MONGOC_DELETE_NONE", value: 0)
!96 = !DIEnumerator(name: "MONGOC_DELETE_SINGLE_REMOVE", value: 1)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 67, baseType: !14, size: 32, elements: !98)
!98 = !{!99, !100}
!99 = !DIEnumerator(name: "MONGOC_INSERT_NONE", value: 0)
!100 = !DIEnumerator(name: "MONGOC_INSERT_CONTINUE_ON_ERROR", value: 1)
!101 = !{!80, !102, !104, !120, !121, !122, !126, !128, !129, !133, !135, !137, !140, !142, !132}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "MONGO", file: !2, line: 49, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MONGO", file: !2, line: 43, size: 192, elements: !107)
!107 = !{!108, !113, !119}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "uri", scope: !106, file: !2, line: 44, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_uri_t", file: !111, line: 95, baseType: !112)
!111 = !DIFile(filename: "/usr/include/libmongoc-1.0/mongoc/mongoc-uri.h", directory: "", checksumkind: CSK_MD5, checksum: "ec8a82d2d8c002b1517fee400464e7cc")
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_uri_t", file: !111, line: 95, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !106, file: !2, line: 45, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_client_t", file: !116, line: 75, baseType: !117)
!116 = !DIFile(filename: "/usr/include/libmongoc-1.0/mongoc/mongoc-client.h", directory: "", checksumkind: CSK_MD5, checksum: "a1b1212bb6ae352f4d6cd67651bf4990")
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_client_t", file: !118, line: 25, flags: DIFlagFwdDecl)
!118 = !DIFile(filename: "/usr/include/libmongoc-1.0/mongoc/mongoc-client-side-encryption.h", directory: "", checksumkind: CSK_MD5, checksum: "b5be0a43bc59dc23fea512cd25d3fbf7")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "database", scope: !106, file: !2, line: 46, baseType: !102, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !123, line: 26, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !125, line: 41, baseType: !80)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_value_type", file: !127, line: 225, baseType: !120)
!127 = !DIFile(filename: "src/server/ns_turn_maps.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "1d968a8e0fbb011891961d10535e1104")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ur_string_map_key_type", file: !127, line: 224, baseType: !121)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !130, line: 27, baseType: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !125, line: 45, baseType: !132)
!132 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "band_limit_t", file: !134, line: 67, baseType: !132)
!134 = !DIFile(filename: "src/client/ns_turn_msg.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "43c56357294df21a547ee0716fe3769d")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "vint", file: !136, line: 105, baseType: !80)
!136 = !DIFile(filename: "src/ns_turn_defs.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "126e9c9d0b914de7fdf6162f77453397")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !123, line: 27, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !125, line: 44, baseType: !139)
!139 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !130, line: 26, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !125, line: 42, baseType: !14)
!142 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!143 = !{!0, !7, !144, !352, !357, !362, !364, !369, !374, !379, !384, !389, !394, !397, !402, !404, !407, !412, !417, !422, !427, !432, !437, !442, !447, !452, !454, !456, !461, !463, !468, !470, !475, !480, !482, !484, !486, !488, !490, !495, !497, !499, !501, !503, !505, !510, !512, !514, !516, !518, !520, !522, !527, !529, !531, !533, !535, !540, !542, !544, !546, !548, !550}
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "driver", scope: !9, file: !2, line: 1365, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_dbdriver_t", file: !148, line: 77, baseType: !149)
!148 = !DIFile(filename: "src/apps/relay/dbdrivers/dbdriver.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "00319dc97026a2c0105cbae0fcb396b3")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_dbdriver_t", file: !148, line: 50, size: 1664, elements: !150)
!150 = !{!151, !169, !173, !177, !181, !185, !186, !187, !188, !189, !193, !194, !198, !199, !203, !289, !293, !297, !321, !327, !331, !335, !339, !343, !344, !348}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "get_auth_secrets", scope: !149, file: !148, line: 51, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!80, !155, !165}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "secrets_list_t", file: !157, line: 143, baseType: !158)
!157 = !DIFile(filename: "src/apps/relay/userdb.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "ef7aa3b34af7515d3cf1275f8bfd0947")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_secrets_list", file: !157, line: 139, size: 128, elements: !159)
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "secrets", scope: !158, file: !157, line: 140, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !158, file: !157, line: 141, baseType: !163, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !164, line: 46, baseType: !132)
!164 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !130, line: 24, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !125, line: 38, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "get_user_key", scope: !149, file: !148, line: 52, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!80, !165, !165, !165}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "set_user_key", scope: !149, file: !148, line: 53, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!80, !165, !165, !102}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "del_user", scope: !149, file: !148, line: 54, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!80, !165, !165}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "list_users", scope: !149, file: !148, line: 55, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!80, !165, !155, !155}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "list_secrets", scope: !149, file: !148, line: 56, baseType: !182, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "del_secret", scope: !149, file: !148, line: 57, baseType: !178, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "set_secret", scope: !149, file: !148, line: 58, baseType: !178, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "add_origin", scope: !149, file: !148, line: 59, baseType: !178, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "del_origin", scope: !149, file: !148, line: 60, baseType: !190, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!80, !165}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "list_origins", scope: !149, file: !148, line: 61, baseType: !182, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "set_realm_option_one", scope: !149, file: !148, line: 62, baseType: !195, size: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!80, !165, !132, !102}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "list_realm_options", scope: !149, file: !148, line: 63, baseType: !190, size: 64, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "auth_ping", scope: !149, file: !148, line: 64, baseType: !200, size: 64, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !120}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "get_ip_list", scope: !149, file: !148, line: 65, baseType: !204, size: 64, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!80, !102, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !209, line: 159, baseType: !210)
!209 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !209, line: 154, size: 128, elements: !211)
!211 = !{!212, !288}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !210, file: !209, line: 155, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !209, line: 152, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !209, line: 146, size: 6624, elements: !216)
!216 = !{!217, !221, !225}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !215, file: !209, line: 147, baseType: !218, size: 2056)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2056, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 257)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !215, file: !209, line: 148, baseType: !222, size: 4104, offset: 2056)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4104, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 513)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !215, file: !209, line: 149, baseType: !226, size: 448, offset: 6176)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !227, line: 53, baseType: !228)
!227 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 50, size: 448, elements: !229)
!229 = !{!230, !287}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !228, file: !227, line: 51, baseType: !231, size: 224)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !227, line: 48, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !227, line: 44, size: 224, elements: !233)
!233 = !{!234, !246, !264}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !232, file: !227, line: 45, baseType: !235, size: 128)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !236, line: 180, size: 128, elements: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!237 = !{!238, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !235, file: !236, line: 182, baseType: !239, size: 16)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !240, line: 28, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!241 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !235, file: !236, line: 183, baseType: !243, size: 112, offset: 16)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 14)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !232, file: !227, line: 46, baseType: !247, size: 128)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !248, line: 245, size: 128, elements: !249)
!248 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!249 = !{!250, !251, !255, !260}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !247, file: !248, line: 247, baseType: !239, size: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !247, file: !248, line: 248, baseType: !252, size: 16, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !248, line: 123, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !130, line: 25, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !125, line: 40, baseType: !241)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !247, file: !248, line: 249, baseType: !256, size: 32, offset: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !248, line: 31, size: 32, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !256, file: !248, line: 33, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !248, line: 30, baseType: !140)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !247, file: !248, line: 252, baseType: !261, size: 64, offset: 64)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !232, file: !227, line: 47, baseType: !265, size: 224)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !248, line: 260, size: 224, elements: !266)
!266 = !{!267, !268, !269, !270, !286}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !265, file: !248, line: 262, baseType: !239, size: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !265, file: !248, line: 263, baseType: !252, size: 16, offset: 16)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !265, file: !248, line: 264, baseType: !140, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !265, file: !248, line: 265, baseType: !271, size: 128, offset: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !248, line: 219, size: 128, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !271, file: !248, line: 226, baseType: !274, size: 128)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !271, file: !248, line: 221, size: 128, elements: !275)
!275 = !{!276, !280, !282}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !274, file: !248, line: 223, baseType: !277, size: 128)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 128, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !274, file: !248, line: 224, baseType: !281, size: 128)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 128, elements: !262)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !274, file: !248, line: 225, baseType: !283, size: 128)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 4)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !265, file: !248, line: 266, baseType: !140, size: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !228, file: !227, line: 52, baseType: !231, size: 224, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !210, file: !209, line: 156, baseType: !163, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "set_permission_ip", scope: !149, file: !148, line: 66, baseType: !290, size: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!80, !102, !165, !102, !80}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reread_realms", scope: !149, file: !148, line: 67, baseType: !294, size: 64, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !155}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "set_oauth_key", scope: !149, file: !148, line: 68, baseType: !298, size: 64, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!80, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data_raw", file: !303, line: 144, baseType: !304)
!303 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data_raw", file: !303, line: 135, size: 4800, elements: !305)
!305 = !{!306, !310, !311, !312, !313, !317}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !304, file: !303, line: 136, baseType: !307, size: 1032)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1032, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 129)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !304, file: !303, line: 137, baseType: !218, size: 2056, offset: 1032)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !304, file: !303, line: 138, baseType: !129, size: 64, offset: 3136)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !304, file: !303, line: 139, baseType: !140, size: 32, offset: 3200)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !304, file: !303, line: 140, baseType: !314, size: 520, offset: 3232)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 65)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !304, file: !303, line: 141, baseType: !318, size: 1024, offset: 3752)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1024, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "get_oauth_key", scope: !149, file: !148, line: 69, baseType: !322, size: 64, offset: 1152)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!80, !325, !301}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "del_oauth_key", scope: !149, file: !148, line: 70, baseType: !328, size: 64, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!80, !325}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "list_oauth_keys", scope: !149, file: !148, line: 71, baseType: !332, size: 64, offset: 1280)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!80, !155, !155, !155, !155, !155}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "get_admin_user", scope: !149, file: !148, line: 72, baseType: !336, size: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!80, !325, !165, !165}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "set_admin_user", scope: !149, file: !148, line: 73, baseType: !340, size: 64, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!80, !325, !325, !325}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "del_admin_user", scope: !149, file: !148, line: 74, baseType: !328, size: 64, offset: 1472)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "list_admin_users", scope: !149, file: !148, line: 75, baseType: !345, size: 64, offset: 1536)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!80, !80}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !149, file: !148, line: 76, baseType: !349, size: 64, offset: 1600)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 12)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 6)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !359, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 49)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 39)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 141, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 42)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 544, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 68)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 38)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 25)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !284)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 192, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 13)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !3, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !2, line: 204, type: !406, isLocal: true, isDefinition: true)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !262)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 50)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 58)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 24)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 47)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 382, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 37)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 9)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 431, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 7)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 448, type: !444, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 40)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !449, isLocal: true, isDefinition: true)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 1)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !2, line: 473, type: !406, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 684, type: !366, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !2, line: 753, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 10)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !2, line: 754, type: !439, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 758, type: !465, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 51)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !2, line: 780, type: !359, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !2, line: 785, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 35)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !2, line: 827, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 43)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !2, line: 856, type: !354, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !2, line: 886, type: !434, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !2, line: 890, type: !3, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !2, line: 894, type: !439, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !2, line: 932, type: !406, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !2, line: 965, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 11)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !2, line: 997, type: !492, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !2, line: 727, type: !477, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1164, type: !406, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1166, type: !354, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1168, type: !492, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1172, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 26)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !458, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !2, line: 344, type: !396, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !458, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !406, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !458, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 353, type: !434, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 358, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 48)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !424, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !386, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 554, type: !3, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !2, line: 559, type: !396, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 563, type: !537, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 76)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1193, type: !492, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1208, type: !434, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1216, type: !524, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1259, type: !366, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1283, type: !371, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1360, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 32)
!555 = !{i32 7, !"Dwarf Version", i32 5}
!556 = !{i32 2, !"Debug Info Version", i32 3}
!557 = !{i32 1, !"wchar_size", i32 4}
!558 = !{i32 8, !"PIC Level", i32 2}
!559 = !{i32 7, !"PIE Level", i32 2}
!560 = !{i32 7, !"uwtable", i32 2}
!561 = !{i32 7, !"frame-pointer", i32 2}
!562 = !{!"clang version 16.0.0"}
!563 = distinct !DISubprogram(name: "get_mongo_dbdriver", scope: !2, file: !2, line: 1394, type: !564, scopeLine: 1394, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !567)
!564 = !DISubroutineType(types: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!567 = !{}
!568 = !DILocation(line: 1395, column: 3, scope: !563)
!569 = distinct !DISubprogram(name: "mongo_get_auth_secrets", scope: !2, file: !2, line: 149, type: !153, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!570 = !DILocalVariable(name: "sl", arg: 1, scope: !569, file: !2, line: 149, type: !155)
!571 = !DILocation(line: 149, column: 51, scope: !569)
!572 = !DILocalVariable(name: "realm", arg: 2, scope: !569, file: !2, line: 149, type: !165)
!573 = !DILocation(line: 149, column: 64, scope: !569)
!574 = !DILocalVariable(name: "collection", scope: !569, file: !2, line: 150, type: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_collection_t", file: !577, line: 38, baseType: !578)
!577 = !DIFile(filename: "/usr/include/libmongoc-1.0/mongoc/mongoc-collection.h", directory: "", checksumkind: CSK_MD5, checksum: "2cea9224f2c11ca0048d3faf871f3e43")
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_collection_t", file: !577, line: 38, flags: DIFlagFwdDecl)
!579 = !DILocation(line: 150, column: 25, scope: !569)
!580 = !DILocation(line: 150, column: 38, scope: !569)
!581 = !DILocation(line: 152, column: 6, scope: !582)
!582 = distinct !DILexicalBlock(scope: !569, file: !2, line: 152, column: 5)
!583 = !DILocation(line: 152, column: 5, scope: !569)
!584 = !DILocation(line: 153, column: 5, scope: !582)
!585 = !DILocalVariable(name: "query", scope: !569, file: !2, line: 155, type: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_t", file: !33, line: 138, baseType: !587, align: 1024)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bson_t", file: !33, line: 134, size: 1024, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !33, line: 135, baseType: !140, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !587, file: !33, line: 136, baseType: !140, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !587, file: !33, line: 137, baseType: !592, size: 960, offset: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 960, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 120)
!595 = !DILocation(line: 155, column: 10, scope: !569)
!596 = !DILocation(line: 156, column: 3, scope: !569)
!597 = !DILocation(line: 157, column: 3, scope: !569)
!598 = !DILocalVariable(name: "fields", scope: !569, file: !2, line: 159, type: !586)
!599 = !DILocation(line: 159, column: 10, scope: !569)
!600 = !DILocation(line: 160, column: 3, scope: !569)
!601 = !DILocation(line: 161, column: 3, scope: !569)
!602 = !DILocalVariable(name: "cursor", scope: !569, file: !2, line: 163, type: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "mongoc_cursor_t", file: !605, line: 30, baseType: !606)
!605 = !DIFile(filename: "/usr/include/libmongoc-1.0/mongoc/mongoc-cursor.h", directory: "", checksumkind: CSK_MD5, checksum: "ab02e4cb247e4dedbf49e30b4b02e193")
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mongoc_cursor_t", file: !605, line: 30, flags: DIFlagFwdDecl)
!607 = !DILocation(line: 163, column: 21, scope: !569)
!608 = !DILocation(line: 164, column: 35, scope: !569)
!609 = !DILocation(line: 164, column: 12, scope: !569)
!610 = !DILocation(line: 164, column: 10, scope: !569)
!611 = !DILocalVariable(name: "ret", scope: !569, file: !2, line: 166, type: !80)
!612 = !DILocation(line: 166, column: 7, scope: !569)
!613 = !DILocation(line: 168, column: 8, scope: !614)
!614 = distinct !DILexicalBlock(scope: !569, file: !2, line: 168, column: 7)
!615 = !DILocation(line: 168, column: 7, scope: !569)
!616 = !DILocation(line: 169, column: 3, scope: !617)
!617 = distinct !DILexicalBlock(scope: !614, file: !2, line: 168, column: 16)
!618 = !DILocation(line: 170, column: 3, scope: !617)
!619 = !DILocalVariable(name: "item", scope: !620, file: !2, line: 171, type: !621)
!620 = distinct !DILexicalBlock(scope: !614, file: !2, line: 170, column: 10)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!623 = !DILocation(line: 171, column: 20, scope: !620)
!624 = !DILocalVariable(name: "length", scope: !620, file: !2, line: 172, type: !140)
!625 = !DILocation(line: 172, column: 14, scope: !620)
!626 = !DILocalVariable(name: "iter", scope: !620, file: !2, line: 173, type: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_iter_t", file: !33, line: 376, baseType: !628, align: 1024)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 363, size: 640, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !628, file: !33, line: 364, baseType: !325, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !628, file: !33, line: 365, baseType: !140, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !628, file: !33, line: 366, baseType: !140, size: 32, offset: 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !628, file: !33, line: 367, baseType: !140, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !628, file: !33, line: 368, baseType: !140, size: 32, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !628, file: !33, line: 369, baseType: !140, size: 32, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !628, file: !33, line: 370, baseType: !140, size: 32, offset: 224)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !628, file: !33, line: 371, baseType: !140, size: 32, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !628, file: !33, line: 372, baseType: !140, size: 32, offset: 288)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next_off", scope: !628, file: !33, line: 373, baseType: !140, size: 32, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "err_off", scope: !628, file: !33, line: 374, baseType: !140, size: 32, offset: 352)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !628, file: !33, line: 375, baseType: !642, size: 256, align: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_value_t", file: !33, line: 348, baseType: !643, align: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_bson_value_t", file: !33, line: 295, size: 256, elements: !644)
!644 = !{!645, !647, !648}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "value_type", scope: !643, file: !33, line: 296, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_type_t", file: !33, line: 258, baseType: !32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !643, file: !33, line: 297, baseType: !122, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !643, file: !33, line: 347, baseType: !649, size: 192, offset: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !643, file: !33, line: 298, size: 192, elements: !650)
!650 = !{!651, !657, !658, !659, !663, !665, !667, !668, !673, !678, !683, !690, !695, !701, !706, !713, !718}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "v_oid", scope: !649, file: !33, line: 299, baseType: !652, size: 96)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_oid_t", file: !33, line: 179, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 177, size: 96, elements: !654)
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !653, file: !33, line: 178, baseType: !656, size: 96)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 96, elements: !355)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !649, file: !33, line: 300, baseType: !137, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "v_int32", scope: !649, file: !33, line: 301, baseType: !122, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "v_int8", scope: !649, file: !33, line: 302, baseType: !660, size: 8)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !123, line: 24, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !125, line: 37, baseType: !662)
!662 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "v_double", scope: !649, file: !33, line: 303, baseType: !664, size: 64)
!664 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "v_bool", scope: !649, file: !33, line: 304, baseType: !666, size: 8)
!666 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "v_datetime", scope: !649, file: !33, line: 305, baseType: !137, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "v_timestamp", scope: !649, file: !33, line: 309, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 306, size: 64, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !669, file: !33, line: 307, baseType: !140, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "increment", scope: !669, file: !33, line: 308, baseType: !140, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "v_utf8", scope: !649, file: !33, line: 313, baseType: !674, size: 128)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 310, size: 128, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !674, file: !33, line: 311, baseType: !121, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !674, file: !33, line: 312, baseType: !140, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "v_doc", scope: !649, file: !33, line: 317, baseType: !679, size: 128)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 314, size: 128, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !679, file: !33, line: 315, baseType: !165, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !679, file: !33, line: 316, baseType: !140, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !649, file: !33, line: 322, baseType: !684, size: 128)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 318, size: 128, elements: !685)
!685 = !{!686, !687, !688}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !684, file: !33, line: 319, baseType: !165, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !684, file: !33, line: 320, baseType: !140, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !684, file: !33, line: 321, baseType: !689, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_subtype_t", file: !33, line: 277, baseType: !57)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "v_regex", scope: !649, file: !33, line: 326, baseType: !691, size: 128)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 323, size: 128, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "regex", scope: !691, file: !33, line: 324, baseType: !121, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !691, file: !33, line: 325, baseType: !121, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "v_dbpointer", scope: !649, file: !33, line: 331, baseType: !696, size: 192)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 327, size: 192, elements: !697)
!697 = !{!698, !699, !700}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "collection", scope: !696, file: !33, line: 328, baseType: !121, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "collection_len", scope: !696, file: !33, line: 329, baseType: !140, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !696, file: !33, line: 330, baseType: !652, size: 96, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "v_code", scope: !649, file: !33, line: 335, baseType: !702, size: 128)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 332, size: 128, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !702, file: !33, line: 333, baseType: !121, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !702, file: !33, line: 334, baseType: !140, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "v_codewscope", scope: !649, file: !33, line: 341, baseType: !707, size: 192)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 336, size: 192, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !707, file: !33, line: 337, baseType: !121, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "scope_data", scope: !707, file: !33, line: 338, baseType: !165, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !707, file: !33, line: 339, baseType: !140, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scope_len", scope: !707, file: !33, line: 340, baseType: !140, size: 32, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !649, file: !33, line: 345, baseType: !714, size: 128)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !33, line: 342, size: 128, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !714, file: !33, line: 343, baseType: !121, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !714, file: !33, line: 344, baseType: !140, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "v_decimal128", scope: !649, file: !33, line: 346, baseType: !719, size: 128)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "bson_decimal128_t", file: !33, line: 203, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 195, size: 128, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !720, file: !33, line: 197, baseType: !129, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !720, file: !33, line: 198, baseType: !129, size: 64, offset: 64)
!724 = !DILocation(line: 173, column: 17, scope: !620)
!725 = !DILocalVariable(name: "value", scope: !620, file: !2, line: 174, type: !102)
!726 = !DILocation(line: 174, column: 18, scope: !620)
!727 = !DILocation(line: 175, column: 5, scope: !620)
!728 = !DILocation(line: 175, column: 30, scope: !620)
!729 = !DILocation(line: 175, column: 11, scope: !620)
!730 = !DILocation(line: 176, column: 32, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !2, line: 176, column: 10)
!732 = distinct !DILexicalBlock(scope: !620, file: !2, line: 175, column: 46)
!733 = !DILocation(line: 176, column: 10, scope: !731)
!734 = !DILocation(line: 176, column: 38, scope: !731)
!735 = !DILocation(line: 176, column: 41, scope: !731)
!736 = !DILocation(line: 176, column: 72, scope: !731)
!737 = !DILocation(line: 176, column: 75, scope: !731)
!738 = !DILocation(line: 176, column: 10, scope: !732)
!739 = !DILocation(line: 177, column: 17, scope: !740)
!740 = distinct !DILexicalBlock(scope: !731, file: !2, line: 176, column: 104)
!741 = !DILocation(line: 177, column: 15, scope: !740)
!742 = !DILocation(line: 178, column: 25, scope: !740)
!743 = !DILocation(line: 178, column: 29, scope: !740)
!744 = !DILocation(line: 178, column: 5, scope: !740)
!745 = !DILocation(line: 179, column: 7, scope: !740)
!746 = distinct !{!746, !727, !747, !748}
!747 = !DILocation(line: 180, column: 5, scope: !620)
!748 = !{!"llvm.loop.mustprogress"}
!749 = !DILocation(line: 181, column: 27, scope: !620)
!750 = !DILocation(line: 181, column: 5, scope: !620)
!751 = !DILocation(line: 182, column: 9, scope: !620)
!752 = !DILocation(line: 185, column: 29, scope: !569)
!753 = !DILocation(line: 185, column: 3, scope: !569)
!754 = !DILocation(line: 186, column: 3, scope: !569)
!755 = !DILocation(line: 187, column: 3, scope: !569)
!756 = !DILocation(line: 188, column: 10, scope: !569)
!757 = !DILocation(line: 188, column: 3, scope: !569)
!758 = !DILocation(line: 189, column: 1, scope: !569)
!759 = distinct !DISubprogram(name: "mongo_get_user_key", scope: !2, file: !2, line: 191, type: !171, scopeLine: 191, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!760 = !DILocalVariable(name: "usname", arg: 1, scope: !759, file: !2, line: 191, type: !165)
!761 = !DILocation(line: 191, column: 40, scope: !759)
!762 = !DILocalVariable(name: "realm", arg: 2, scope: !759, file: !2, line: 191, type: !165)
!763 = !DILocation(line: 191, column: 57, scope: !759)
!764 = !DILocalVariable(name: "key", arg: 3, scope: !759, file: !2, line: 191, type: !165)
!765 = !DILocation(line: 191, column: 74, scope: !759)
!766 = !DILocalVariable(name: "collection", scope: !759, file: !2, line: 192, type: !575)
!767 = !DILocation(line: 192, column: 25, scope: !759)
!768 = !DILocation(line: 192, column: 38, scope: !759)
!769 = !DILocation(line: 194, column: 6, scope: !770)
!770 = distinct !DILexicalBlock(scope: !759, file: !2, line: 194, column: 5)
!771 = !DILocation(line: 194, column: 5, scope: !759)
!772 = !DILocation(line: 195, column: 5, scope: !770)
!773 = !DILocalVariable(name: "query", scope: !759, file: !2, line: 197, type: !586)
!774 = !DILocation(line: 197, column: 10, scope: !759)
!775 = !DILocation(line: 198, column: 3, scope: !759)
!776 = !DILocation(line: 199, column: 3, scope: !759)
!777 = !DILocation(line: 200, column: 3, scope: !759)
!778 = !DILocalVariable(name: "fields", scope: !759, file: !2, line: 202, type: !586)
!779 = !DILocation(line: 202, column: 10, scope: !759)
!780 = !DILocation(line: 203, column: 3, scope: !759)
!781 = !DILocation(line: 204, column: 3, scope: !759)
!782 = !DILocalVariable(name: "cursor", scope: !759, file: !2, line: 206, type: !603)
!783 = !DILocation(line: 206, column: 21, scope: !759)
!784 = !DILocation(line: 207, column: 35, scope: !759)
!785 = !DILocation(line: 207, column: 12, scope: !759)
!786 = !DILocation(line: 207, column: 10, scope: !759)
!787 = !DILocalVariable(name: "ret", scope: !759, file: !2, line: 209, type: !80)
!788 = !DILocation(line: 209, column: 7, scope: !759)
!789 = !DILocation(line: 211, column: 8, scope: !790)
!790 = distinct !DILexicalBlock(scope: !759, file: !2, line: 211, column: 7)
!791 = !DILocation(line: 211, column: 7, scope: !759)
!792 = !DILocation(line: 212, column: 3, scope: !793)
!793 = distinct !DILexicalBlock(scope: !790, file: !2, line: 211, column: 16)
!794 = !DILocation(line: 213, column: 3, scope: !793)
!795 = !DILocalVariable(name: "item", scope: !796, file: !2, line: 214, type: !621)
!796 = distinct !DILexicalBlock(scope: !790, file: !2, line: 213, column: 10)
!797 = !DILocation(line: 214, column: 20, scope: !796)
!798 = !DILocalVariable(name: "length", scope: !796, file: !2, line: 215, type: !140)
!799 = !DILocation(line: 215, column: 14, scope: !796)
!800 = !DILocalVariable(name: "iter", scope: !796, file: !2, line: 216, type: !627)
!801 = !DILocation(line: 216, column: 17, scope: !796)
!802 = !DILocalVariable(name: "value", scope: !796, file: !2, line: 217, type: !102)
!803 = !DILocation(line: 217, column: 18, scope: !796)
!804 = !DILocation(line: 218, column: 28, scope: !805)
!805 = distinct !DILexicalBlock(scope: !796, file: !2, line: 218, column: 9)
!806 = !DILocation(line: 218, column: 9, scope: !805)
!807 = !DILocation(line: 218, column: 9, scope: !796)
!808 = !DILocation(line: 219, column: 32, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !2, line: 219, column: 10)
!810 = distinct !DILexicalBlock(scope: !805, file: !2, line: 218, column: 44)
!811 = !DILocation(line: 219, column: 10, scope: !809)
!812 = !DILocation(line: 219, column: 38, scope: !809)
!813 = !DILocation(line: 219, column: 41, scope: !809)
!814 = !DILocation(line: 219, column: 74, scope: !809)
!815 = !DILocation(line: 219, column: 77, scope: !809)
!816 = !DILocation(line: 219, column: 10, scope: !810)
!817 = !DILocation(line: 220, column: 17, scope: !818)
!818 = distinct !DILexicalBlock(scope: !809, file: !2, line: 219, column: 106)
!819 = !DILocation(line: 220, column: 15, scope: !818)
!820 = !DILocalVariable(name: "sz", scope: !818, file: !2, line: 221, type: !163)
!821 = !DILocation(line: 221, column: 12, scope: !818)
!822 = !DILocation(line: 221, column: 17, scope: !818)
!823 = !DILocation(line: 221, column: 51, scope: !818)
!824 = !DILocation(line: 222, column: 8, scope: !825)
!825 = distinct !DILexicalBlock(scope: !818, file: !2, line: 222, column: 8)
!826 = !DILocation(line: 222, column: 17, scope: !825)
!827 = !DILocation(line: 222, column: 15, scope: !825)
!828 = !DILocation(line: 222, column: 8, scope: !818)
!829 = !DILocation(line: 223, column: 109, scope: !830)
!830 = distinct !DILexicalBlock(scope: !825, file: !2, line: 222, column: 21)
!831 = !DILocation(line: 223, column: 122, scope: !830)
!832 = !DILocation(line: 223, column: 117, scope: !830)
!833 = !DILocation(line: 223, column: 126, scope: !830)
!834 = !DILocation(line: 223, column: 6, scope: !830)
!835 = !DILocation(line: 224, column: 5, scope: !830)
!836 = !DILocalVariable(name: "kval", scope: !837, file: !2, line: 225, type: !307)
!837 = distinct !DILexicalBlock(scope: !825, file: !2, line: 224, column: 12)
!838 = !DILocation(line: 225, column: 11, scope: !837)
!839 = !DILocation(line: 226, column: 12, scope: !837)
!840 = !DILocation(line: 226, column: 19, scope: !837)
!841 = !DILocation(line: 226, column: 25, scope: !837)
!842 = !DILocation(line: 226, column: 6, scope: !837)
!843 = !DILocation(line: 227, column: 11, scope: !837)
!844 = !DILocation(line: 227, column: 6, scope: !837)
!845 = !DILocation(line: 227, column: 15, scope: !837)
!846 = !DILocation(line: 228, column: 38, scope: !847)
!847 = distinct !DILexicalBlock(scope: !837, file: !2, line: 228, column: 9)
!848 = !DILocation(line: 228, column: 44, scope: !847)
!849 = !DILocation(line: 228, column: 49, scope: !847)
!850 = !DILocation(line: 228, column: 52, scope: !847)
!851 = !DILocation(line: 228, column: 9, scope: !847)
!852 = !DILocation(line: 228, column: 57, scope: !847)
!853 = !DILocation(line: 228, column: 9, scope: !837)
!854 = !DILocation(line: 229, column: 71, scope: !855)
!855 = distinct !DILexicalBlock(scope: !847, file: !2, line: 228, column: 62)
!856 = !DILocation(line: 229, column: 77, scope: !855)
!857 = !DILocation(line: 229, column: 7, scope: !855)
!858 = !DILocation(line: 230, column: 6, scope: !855)
!859 = !DILocation(line: 231, column: 11, scope: !860)
!860 = distinct !DILexicalBlock(scope: !847, file: !2, line: 230, column: 13)
!861 = !DILocation(line: 234, column: 7, scope: !818)
!862 = !DILocation(line: 235, column: 5, scope: !810)
!863 = !DILocation(line: 236, column: 27, scope: !796)
!864 = !DILocation(line: 236, column: 5, scope: !796)
!865 = !DILocation(line: 238, column: 29, scope: !759)
!866 = !DILocation(line: 238, column: 3, scope: !759)
!867 = !DILocation(line: 239, column: 3, scope: !759)
!868 = !DILocation(line: 240, column: 3, scope: !759)
!869 = !DILocation(line: 241, column: 10, scope: !759)
!870 = !DILocation(line: 241, column: 3, scope: !759)
!871 = !DILocation(line: 242, column: 1, scope: !759)
!872 = distinct !DISubprogram(name: "mongo_set_user_key", scope: !2, file: !2, line: 305, type: !175, scopeLine: 305, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!873 = !DILocalVariable(name: "usname", arg: 1, scope: !872, file: !2, line: 305, type: !165)
!874 = !DILocation(line: 305, column: 40, scope: !872)
!875 = !DILocalVariable(name: "realm", arg: 2, scope: !872, file: !2, line: 305, type: !165)
!876 = !DILocation(line: 305, column: 57, scope: !872)
!877 = !DILocalVariable(name: "key", arg: 3, scope: !872, file: !2, line: 305, type: !102)
!878 = !DILocation(line: 305, column: 76, scope: !872)
!879 = !DILocalVariable(name: "collection", scope: !872, file: !2, line: 306, type: !575)
!880 = !DILocation(line: 306, column: 25, scope: !872)
!881 = !DILocation(line: 306, column: 38, scope: !872)
!882 = !DILocation(line: 308, column: 6, scope: !883)
!883 = distinct !DILexicalBlock(scope: !872, file: !2, line: 308, column: 5)
!884 = !DILocation(line: 308, column: 5, scope: !872)
!885 = !DILocation(line: 309, column: 5, scope: !883)
!886 = !DILocalVariable(name: "query", scope: !872, file: !2, line: 311, type: !586)
!887 = !DILocation(line: 311, column: 10, scope: !872)
!888 = !DILocation(line: 312, column: 3, scope: !872)
!889 = !DILocation(line: 313, column: 3, scope: !872)
!890 = !DILocation(line: 314, column: 3, scope: !872)
!891 = !DILocalVariable(name: "doc", scope: !872, file: !2, line: 316, type: !586)
!892 = !DILocation(line: 316, column: 10, scope: !872)
!893 = !DILocation(line: 317, column: 3, scope: !872)
!894 = !DILocation(line: 318, column: 3, scope: !872)
!895 = !DILocation(line: 319, column: 3, scope: !872)
!896 = !DILocation(line: 320, column: 3, scope: !872)
!897 = !DILocalVariable(name: "ret", scope: !872, file: !2, line: 322, type: !80)
!898 = !DILocation(line: 322, column: 7, scope: !872)
!899 = !DILocation(line: 324, column: 33, scope: !900)
!900 = distinct !DILexicalBlock(scope: !872, file: !2, line: 324, column: 7)
!901 = !DILocation(line: 324, column: 8, scope: !900)
!902 = !DILocation(line: 324, column: 7, scope: !872)
!903 = !DILocation(line: 325, column: 5, scope: !904)
!904 = distinct !DILexicalBlock(scope: !900, file: !2, line: 324, column: 94)
!905 = !DILocation(line: 326, column: 3, scope: !904)
!906 = !DILocation(line: 327, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !900, file: !2, line: 326, column: 10)
!908 = !DILocation(line: 329, column: 29, scope: !872)
!909 = !DILocation(line: 329, column: 3, scope: !872)
!910 = !DILocation(line: 330, column: 3, scope: !872)
!911 = !DILocation(line: 331, column: 3, scope: !872)
!912 = !DILocation(line: 332, column: 10, scope: !872)
!913 = !DILocation(line: 332, column: 3, scope: !872)
!914 = !DILocation(line: 333, column: 1, scope: !872)
!915 = distinct !DISubprogram(name: "mongo_del_user", scope: !2, file: !2, line: 368, type: !179, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!916 = !DILocalVariable(name: "usname", arg: 1, scope: !915, file: !2, line: 368, type: !165)
!917 = !DILocation(line: 368, column: 36, scope: !915)
!918 = !DILocalVariable(name: "realm", arg: 2, scope: !915, file: !2, line: 368, type: !165)
!919 = !DILocation(line: 368, column: 53, scope: !915)
!920 = !DILocalVariable(name: "collection", scope: !915, file: !2, line: 369, type: !575)
!921 = !DILocation(line: 369, column: 25, scope: !915)
!922 = !DILocation(line: 369, column: 38, scope: !915)
!923 = !DILocation(line: 371, column: 6, scope: !924)
!924 = distinct !DILexicalBlock(scope: !915, file: !2, line: 371, column: 5)
!925 = !DILocation(line: 371, column: 5, scope: !915)
!926 = !DILocation(line: 372, column: 5, scope: !924)
!927 = !DILocalVariable(name: "query", scope: !915, file: !2, line: 374, type: !586)
!928 = !DILocation(line: 374, column: 10, scope: !915)
!929 = !DILocation(line: 375, column: 3, scope: !915)
!930 = !DILocation(line: 376, column: 3, scope: !915)
!931 = !DILocation(line: 377, column: 3, scope: !915)
!932 = !DILocalVariable(name: "ret", scope: !915, file: !2, line: 379, type: !80)
!933 = !DILocation(line: 379, column: 7, scope: !915)
!934 = !DILocation(line: 381, column: 33, scope: !935)
!935 = distinct !DILexicalBlock(scope: !915, file: !2, line: 381, column: 7)
!936 = !DILocation(line: 381, column: 8, scope: !935)
!937 = !DILocation(line: 381, column: 7, scope: !915)
!938 = !DILocation(line: 382, column: 5, scope: !939)
!939 = distinct !DILexicalBlock(scope: !935, file: !2, line: 381, column: 95)
!940 = !DILocation(line: 383, column: 3, scope: !939)
!941 = !DILocation(line: 384, column: 9, scope: !942)
!942 = distinct !DILexicalBlock(scope: !935, file: !2, line: 383, column: 10)
!943 = !DILocation(line: 386, column: 29, scope: !915)
!944 = !DILocation(line: 386, column: 3, scope: !915)
!945 = !DILocation(line: 387, column: 3, scope: !915)
!946 = !DILocation(line: 388, column: 10, scope: !915)
!947 = !DILocation(line: 388, column: 3, scope: !915)
!948 = !DILocation(line: 389, column: 1, scope: !915)
!949 = distinct !DISubprogram(name: "mongo_list_users", scope: !2, file: !2, line: 414, type: !183, scopeLine: 415, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!950 = !DILocalVariable(name: "realm", arg: 1, scope: !949, file: !2, line: 414, type: !165)
!951 = !DILocation(line: 414, column: 38, scope: !949)
!952 = !DILocalVariable(name: "users", arg: 2, scope: !949, file: !2, line: 414, type: !155)
!953 = !DILocation(line: 414, column: 61, scope: !949)
!954 = !DILocalVariable(name: "realms", arg: 3, scope: !949, file: !2, line: 414, type: !155)
!955 = !DILocation(line: 414, column: 84, scope: !949)
!956 = !DILocalVariable(name: "collection_name", scope: !949, file: !2, line: 416, type: !102)
!957 = !DILocation(line: 416, column: 16, scope: !949)
!958 = !DILocalVariable(name: "collection", scope: !949, file: !2, line: 417, type: !575)
!959 = !DILocation(line: 417, column: 25, scope: !949)
!960 = !DILocation(line: 417, column: 59, scope: !949)
!961 = !DILocation(line: 417, column: 38, scope: !949)
!962 = !DILocalVariable(name: "realm0", scope: !949, file: !2, line: 419, type: !963)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 1024, elements: !319)
!964 = !DILocation(line: 419, column: 11, scope: !949)
!965 = !DILocation(line: 420, column: 7, scope: !966)
!966 = distinct !DILexicalBlock(scope: !949, file: !2, line: 420, column: 6)
!967 = !DILocation(line: 420, column: 6, scope: !949)
!968 = !DILocation(line: 420, column: 20, scope: !966)
!969 = !DILocation(line: 420, column: 19, scope: !966)
!970 = !DILocation(line: 420, column: 14, scope: !966)
!971 = !DILocation(line: 422, column: 7, scope: !972)
!972 = distinct !DILexicalBlock(scope: !949, file: !2, line: 422, column: 6)
!973 = !DILocation(line: 422, column: 6, scope: !949)
!974 = !DILocation(line: 423, column: 5, scope: !972)
!975 = !DILocalVariable(name: "query", scope: !949, file: !2, line: 425, type: !586)
!976 = !DILocation(line: 425, column: 10, scope: !949)
!977 = !DILocalVariable(name: "child", scope: !949, file: !2, line: 425, type: !586)
!978 = !DILocation(line: 425, column: 17, scope: !949)
!979 = !DILocation(line: 426, column: 3, scope: !949)
!980 = !DILocation(line: 427, column: 3, scope: !949)
!981 = !DILocation(line: 428, column: 3, scope: !949)
!982 = !DILocation(line: 429, column: 3, scope: !949)
!983 = !DILocation(line: 430, column: 3, scope: !949)
!984 = !DILocation(line: 431, column: 3, scope: !949)
!985 = !DILocation(line: 432, column: 7, scope: !986)
!986 = distinct !DILexicalBlock(scope: !949, file: !2, line: 432, column: 7)
!987 = !DILocation(line: 432, column: 13, scope: !986)
!988 = !DILocation(line: 432, column: 16, scope: !986)
!989 = !DILocation(line: 432, column: 7, scope: !949)
!990 = !DILocation(line: 433, column: 5, scope: !991)
!991 = distinct !DILexicalBlock(scope: !986, file: !2, line: 432, column: 26)
!992 = !DILocation(line: 434, column: 3, scope: !991)
!993 = !DILocation(line: 435, column: 3, scope: !949)
!994 = !DILocalVariable(name: "fields", scope: !949, file: !2, line: 437, type: !586)
!995 = !DILocation(line: 437, column: 10, scope: !949)
!996 = !DILocation(line: 438, column: 3, scope: !949)
!997 = !DILocation(line: 439, column: 3, scope: !949)
!998 = !DILocation(line: 440, column: 3, scope: !949)
!999 = !DILocalVariable(name: "cursor", scope: !949, file: !2, line: 442, type: !603)
!1000 = !DILocation(line: 442, column: 21, scope: !949)
!1001 = !DILocation(line: 443, column: 35, scope: !949)
!1002 = !DILocation(line: 443, column: 12, scope: !949)
!1003 = !DILocation(line: 443, column: 10, scope: !949)
!1004 = !DILocalVariable(name: "ret", scope: !949, file: !2, line: 445, type: !80)
!1005 = !DILocation(line: 445, column: 7, scope: !949)
!1006 = !DILocation(line: 447, column: 8, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !949, file: !2, line: 447, column: 7)
!1008 = !DILocation(line: 447, column: 7, scope: !949)
!1009 = !DILocation(line: 448, column: 83, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 447, column: 16)
!1011 = !DILocation(line: 448, column: 3, scope: !1010)
!1012 = !DILocation(line: 449, column: 3, scope: !1010)
!1013 = !DILocalVariable(name: "item", scope: !1014, file: !2, line: 450, type: !621)
!1014 = distinct !DILexicalBlock(scope: !1007, file: !2, line: 449, column: 10)
!1015 = !DILocation(line: 450, column: 20, scope: !1014)
!1016 = !DILocalVariable(name: "length", scope: !1014, file: !2, line: 451, type: !140)
!1017 = !DILocation(line: 451, column: 14, scope: !1014)
!1018 = !DILocalVariable(name: "iter", scope: !1014, file: !2, line: 452, type: !627)
!1019 = !DILocation(line: 452, column: 17, scope: !1014)
!1020 = !DILocalVariable(name: "iter_realm", scope: !1014, file: !2, line: 453, type: !627)
!1021 = !DILocation(line: 453, column: 17, scope: !1014)
!1022 = !DILocalVariable(name: "value", scope: !1014, file: !2, line: 454, type: !102)
!1023 = !DILocation(line: 454, column: 18, scope: !1014)
!1024 = !DILocation(line: 455, column: 5, scope: !1014)
!1025 = !DILocation(line: 455, column: 31, scope: !1014)
!1026 = !DILocation(line: 455, column: 12, scope: !1014)
!1027 = !DILocation(line: 456, column: 32, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 456, column: 10)
!1029 = distinct !DILexicalBlock(scope: !1014, file: !2, line: 455, column: 47)
!1030 = !DILocation(line: 456, column: 10, scope: !1028)
!1031 = !DILocation(line: 456, column: 38, scope: !1028)
!1032 = !DILocation(line: 456, column: 41, scope: !1028)
!1033 = !DILocation(line: 456, column: 71, scope: !1028)
!1034 = !DILocation(line: 456, column: 74, scope: !1028)
!1035 = !DILocation(line: 456, column: 10, scope: !1029)
!1036 = !DILocation(line: 457, column: 15, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1028, file: !2, line: 456, column: 103)
!1038 = !DILocation(line: 457, column: 13, scope: !1037)
!1039 = !DILocation(line: 458, column: 11, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1037, file: !2, line: 458, column: 11)
!1041 = !DILocation(line: 458, column: 11, scope: !1037)
!1042 = !DILocalVariable(name: "rval", scope: !1043, file: !2, line: 459, type: !102)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 458, column: 19)
!1044 = !DILocation(line: 459, column: 23, scope: !1043)
!1045 = !DILocation(line: 460, column: 40, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1043, file: !2, line: 460, column: 12)
!1047 = !DILocation(line: 460, column: 12, scope: !1046)
!1048 = !DILocation(line: 460, column: 46, scope: !1046)
!1049 = !DILocation(line: 460, column: 49, scope: !1046)
!1050 = !DILocation(line: 460, column: 86, scope: !1046)
!1051 = !DILocation(line: 460, column: 89, scope: !1046)
!1052 = !DILocation(line: 460, column: 12, scope: !1043)
!1053 = !DILocation(line: 461, column: 16, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1046, file: !2, line: 460, column: 124)
!1055 = !DILocation(line: 461, column: 14, scope: !1054)
!1056 = !DILocation(line: 462, column: 8, scope: !1054)
!1057 = !DILocation(line: 463, column: 11, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1043, file: !2, line: 463, column: 11)
!1059 = !DILocation(line: 463, column: 11, scope: !1043)
!1060 = !DILocation(line: 464, column: 29, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1058, file: !2, line: 463, column: 18)
!1062 = !DILocation(line: 464, column: 35, scope: !1061)
!1063 = !DILocation(line: 464, column: 9, scope: !1061)
!1064 = !DILocation(line: 465, column: 12, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !2, line: 465, column: 12)
!1066 = !DILocation(line: 465, column: 12, scope: !1061)
!1067 = !DILocation(line: 466, column: 13, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 466, column: 13)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !2, line: 465, column: 20)
!1070 = !DILocation(line: 466, column: 18, scope: !1068)
!1071 = !DILocation(line: 466, column: 22, scope: !1068)
!1072 = !DILocation(line: 466, column: 21, scope: !1068)
!1073 = !DILocation(line: 466, column: 13, scope: !1069)
!1074 = !DILocation(line: 467, column: 31, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1068, file: !2, line: 466, column: 28)
!1076 = !DILocation(line: 467, column: 38, scope: !1075)
!1077 = !DILocation(line: 467, column: 11, scope: !1075)
!1078 = !DILocation(line: 468, column: 10, scope: !1075)
!1079 = !DILocation(line: 469, column: 31, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1068, file: !2, line: 468, column: 17)
!1081 = !DILocation(line: 469, column: 45, scope: !1080)
!1082 = !DILocation(line: 469, column: 11, scope: !1080)
!1083 = !DILocation(line: 471, column: 9, scope: !1069)
!1084 = !DILocation(line: 472, column: 8, scope: !1061)
!1085 = !DILocation(line: 473, column: 28, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1058, file: !2, line: 472, column: 15)
!1087 = !DILocation(line: 473, column: 35, scope: !1086)
!1088 = !DILocation(line: 473, column: 9, scope: !1086)
!1089 = !DILocation(line: 475, column: 7, scope: !1043)
!1090 = !DILocation(line: 476, column: 6, scope: !1037)
!1091 = distinct !{!1091, !1024, !1092, !748}
!1092 = !DILocation(line: 477, column: 5, scope: !1014)
!1093 = !DILocation(line: 478, column: 27, scope: !1014)
!1094 = !DILocation(line: 478, column: 5, scope: !1014)
!1095 = !DILocation(line: 479, column: 9, scope: !1014)
!1096 = !DILocation(line: 481, column: 29, scope: !949)
!1097 = !DILocation(line: 481, column: 3, scope: !949)
!1098 = !DILocation(line: 482, column: 3, scope: !949)
!1099 = !DILocation(line: 483, column: 3, scope: !949)
!1100 = !DILocation(line: 484, column: 10, scope: !949)
!1101 = !DILocation(line: 484, column: 3, scope: !949)
!1102 = !DILocation(line: 485, column: 1, scope: !949)
!1103 = distinct !DISubprogram(name: "mongo_list_secrets", scope: !2, file: !2, line: 577, type: !183, scopeLine: 578, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!1104 = !DILocalVariable(name: "realm", arg: 1, scope: !1103, file: !2, line: 577, type: !165)
!1105 = !DILocation(line: 577, column: 40, scope: !1103)
!1106 = !DILocalVariable(name: "secrets", arg: 2, scope: !1103, file: !2, line: 577, type: !155)
!1107 = !DILocation(line: 577, column: 63, scope: !1103)
!1108 = !DILocalVariable(name: "realms", arg: 3, scope: !1103, file: !2, line: 577, type: !155)
!1109 = !DILocation(line: 577, column: 88, scope: !1103)
!1110 = !DILocalVariable(name: "collection", scope: !1103, file: !2, line: 579, type: !575)
!1111 = !DILocation(line: 579, column: 24, scope: !1103)
!1112 = !DILocation(line: 579, column: 37, scope: !1103)
!1113 = !DILocalVariable(name: "realm0", scope: !1103, file: !2, line: 581, type: !963)
!1114 = !DILocation(line: 581, column: 10, scope: !1103)
!1115 = !DILocation(line: 582, column: 6, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 582, column: 5)
!1117 = !DILocation(line: 582, column: 5, scope: !1103)
!1118 = !DILocation(line: 582, column: 19, scope: !1116)
!1119 = !DILocation(line: 582, column: 18, scope: !1116)
!1120 = !DILocation(line: 582, column: 13, scope: !1116)
!1121 = !DILocation(line: 584, column: 6, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 584, column: 5)
!1123 = !DILocation(line: 584, column: 5, scope: !1103)
!1124 = !DILocation(line: 585, column: 3, scope: !1122)
!1125 = !DILocalVariable(name: "query", scope: !1103, file: !2, line: 587, type: !586)
!1126 = !DILocation(line: 587, column: 9, scope: !1103)
!1127 = !DILocalVariable(name: "child", scope: !1103, file: !2, line: 587, type: !586)
!1128 = !DILocation(line: 587, column: 16, scope: !1103)
!1129 = !DILocation(line: 588, column: 2, scope: !1103)
!1130 = !DILocation(line: 589, column: 2, scope: !1103)
!1131 = !DILocation(line: 590, column: 2, scope: !1103)
!1132 = !DILocation(line: 591, column: 2, scope: !1103)
!1133 = !DILocation(line: 592, column: 2, scope: !1103)
!1134 = !DILocation(line: 593, column: 2, scope: !1103)
!1135 = !DILocation(line: 594, column: 6, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 594, column: 6)
!1137 = !DILocation(line: 594, column: 12, scope: !1136)
!1138 = !DILocation(line: 594, column: 15, scope: !1136)
!1139 = !DILocation(line: 594, column: 6, scope: !1103)
!1140 = !DILocation(line: 595, column: 3, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 594, column: 25)
!1142 = !DILocation(line: 596, column: 2, scope: !1141)
!1143 = !DILocation(line: 597, column: 2, scope: !1103)
!1144 = !DILocalVariable(name: "fields", scope: !1103, file: !2, line: 599, type: !586)
!1145 = !DILocation(line: 599, column: 9, scope: !1103)
!1146 = !DILocation(line: 600, column: 2, scope: !1103)
!1147 = !DILocation(line: 601, column: 2, scope: !1103)
!1148 = !DILocation(line: 602, column: 2, scope: !1103)
!1149 = !DILocalVariable(name: "cursor", scope: !1103, file: !2, line: 604, type: !603)
!1150 = !DILocation(line: 604, column: 20, scope: !1103)
!1151 = !DILocation(line: 605, column: 34, scope: !1103)
!1152 = !DILocation(line: 605, column: 11, scope: !1103)
!1153 = !DILocation(line: 605, column: 9, scope: !1103)
!1154 = !DILocalVariable(name: "ret", scope: !1103, file: !2, line: 607, type: !80)
!1155 = !DILocation(line: 607, column: 6, scope: !1103)
!1156 = !DILocation(line: 609, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 609, column: 6)
!1158 = !DILocation(line: 609, column: 6, scope: !1103)
!1159 = !DILocation(line: 610, column: 3, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1157, file: !2, line: 609, column: 15)
!1161 = !DILocation(line: 611, column: 2, scope: !1160)
!1162 = !DILocalVariable(name: "item", scope: !1163, file: !2, line: 612, type: !621)
!1163 = distinct !DILexicalBlock(scope: !1157, file: !2, line: 611, column: 9)
!1164 = !DILocation(line: 612, column: 18, scope: !1163)
!1165 = !DILocalVariable(name: "length", scope: !1163, file: !2, line: 613, type: !140)
!1166 = !DILocation(line: 613, column: 12, scope: !1163)
!1167 = !DILocalVariable(name: "iter", scope: !1163, file: !2, line: 614, type: !627)
!1168 = !DILocation(line: 614, column: 15, scope: !1163)
!1169 = !DILocalVariable(name: "iter_realm", scope: !1163, file: !2, line: 615, type: !627)
!1170 = !DILocation(line: 615, column: 18, scope: !1163)
!1171 = !DILocalVariable(name: "value", scope: !1163, file: !2, line: 616, type: !102)
!1172 = !DILocation(line: 616, column: 16, scope: !1163)
!1173 = !DILocation(line: 617, column: 3, scope: !1163)
!1174 = !DILocation(line: 617, column: 29, scope: !1163)
!1175 = !DILocation(line: 617, column: 10, scope: !1163)
!1176 = !DILocation(line: 618, column: 30, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !2, line: 618, column: 8)
!1178 = distinct !DILexicalBlock(scope: !1163, file: !2, line: 617, column: 45)
!1179 = !DILocation(line: 618, column: 8, scope: !1177)
!1180 = !DILocation(line: 618, column: 36, scope: !1177)
!1181 = !DILocation(line: 618, column: 39, scope: !1177)
!1182 = !DILocation(line: 618, column: 70, scope: !1177)
!1183 = !DILocation(line: 618, column: 73, scope: !1177)
!1184 = !DILocation(line: 618, column: 8, scope: !1178)
!1185 = !DILocation(line: 619, column: 13, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 618, column: 102)
!1187 = !DILocation(line: 619, column: 11, scope: !1186)
!1188 = !DILocation(line: 620, column: 9, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1186, file: !2, line: 620, column: 9)
!1190 = !DILocation(line: 620, column: 9, scope: !1186)
!1191 = !DILocalVariable(name: "rval", scope: !1192, file: !2, line: 621, type: !102)
!1192 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 620, column: 17)
!1193 = !DILocation(line: 621, column: 18, scope: !1192)
!1194 = !DILocation(line: 622, column: 38, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 622, column: 10)
!1196 = !DILocation(line: 622, column: 10, scope: !1195)
!1197 = !DILocation(line: 622, column: 44, scope: !1195)
!1198 = !DILocation(line: 622, column: 47, scope: !1195)
!1199 = !DILocation(line: 622, column: 84, scope: !1195)
!1200 = !DILocation(line: 622, column: 87, scope: !1195)
!1201 = !DILocation(line: 622, column: 10, scope: !1192)
!1202 = !DILocation(line: 623, column: 14, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 622, column: 122)
!1204 = !DILocation(line: 623, column: 12, scope: !1203)
!1205 = !DILocation(line: 624, column: 6, scope: !1203)
!1206 = !DILocation(line: 625, column: 9, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 625, column: 9)
!1208 = !DILocation(line: 625, column: 9, scope: !1192)
!1209 = !DILocation(line: 626, column: 27, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1207, file: !2, line: 625, column: 18)
!1211 = !DILocation(line: 626, column: 35, scope: !1210)
!1212 = !DILocation(line: 626, column: 7, scope: !1210)
!1213 = !DILocation(line: 627, column: 13, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1210, file: !2, line: 627, column: 13)
!1215 = !DILocation(line: 627, column: 13, scope: !1210)
!1216 = !DILocation(line: 628, column: 14, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !2, line: 628, column: 14)
!1218 = distinct !DILexicalBlock(scope: !1214, file: !2, line: 627, column: 21)
!1219 = !DILocation(line: 628, column: 19, scope: !1217)
!1220 = !DILocation(line: 628, column: 23, scope: !1217)
!1221 = !DILocation(line: 628, column: 22, scope: !1217)
!1222 = !DILocation(line: 628, column: 14, scope: !1218)
!1223 = !DILocation(line: 629, column: 32, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1217, file: !2, line: 628, column: 29)
!1225 = !DILocation(line: 629, column: 39, scope: !1224)
!1226 = !DILocation(line: 629, column: 12, scope: !1224)
!1227 = !DILocation(line: 630, column: 11, scope: !1224)
!1228 = !DILocation(line: 631, column: 32, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1217, file: !2, line: 630, column: 18)
!1230 = !DILocation(line: 631, column: 46, scope: !1229)
!1231 = !DILocation(line: 631, column: 12, scope: !1229)
!1232 = !DILocation(line: 633, column: 10, scope: !1218)
!1233 = !DILocation(line: 634, column: 6, scope: !1210)
!1234 = !DILocation(line: 635, column: 26, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1207, file: !2, line: 634, column: 13)
!1236 = !DILocation(line: 635, column: 33, scope: !1235)
!1237 = !DILocation(line: 635, column: 7, scope: !1235)
!1238 = !DILocation(line: 637, column: 5, scope: !1192)
!1239 = !DILocation(line: 638, column: 4, scope: !1186)
!1240 = distinct !{!1240, !1173, !1241, !748}
!1241 = !DILocation(line: 639, column: 3, scope: !1163)
!1242 = !DILocation(line: 640, column: 25, scope: !1163)
!1243 = !DILocation(line: 640, column: 3, scope: !1163)
!1244 = !DILocation(line: 641, column: 7, scope: !1163)
!1245 = !DILocation(line: 643, column: 28, scope: !1103)
!1246 = !DILocation(line: 643, column: 2, scope: !1103)
!1247 = !DILocation(line: 644, column: 2, scope: !1103)
!1248 = !DILocation(line: 645, column: 2, scope: !1103)
!1249 = !DILocation(line: 646, column: 9, scope: !1103)
!1250 = !DILocation(line: 646, column: 2, scope: !1103)
!1251 = !DILocation(line: 647, column: 1, scope: !1103)
!1252 = distinct !DISubprogram(name: "mongo_del_secret", scope: !2, file: !2, line: 649, type: !179, scopeLine: 649, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!1253 = !DILocalVariable(name: "secret", arg: 1, scope: !1252, file: !2, line: 649, type: !165)
!1254 = !DILocation(line: 649, column: 38, scope: !1252)
!1255 = !DILocalVariable(name: "realm", arg: 2, scope: !1252, file: !2, line: 649, type: !165)
!1256 = !DILocation(line: 649, column: 55, scope: !1252)
!1257 = !DILocalVariable(name: "collection", scope: !1252, file: !2, line: 650, type: !575)
!1258 = !DILocation(line: 650, column: 25, scope: !1252)
!1259 = !DILocation(line: 650, column: 38, scope: !1252)
!1260 = !DILocation(line: 652, column: 6, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1252, file: !2, line: 652, column: 5)
!1262 = !DILocation(line: 652, column: 5, scope: !1252)
!1263 = !DILocation(line: 653, column: 5, scope: !1261)
!1264 = !DILocalVariable(name: "query", scope: !1252, file: !2, line: 655, type: !586)
!1265 = !DILocation(line: 655, column: 10, scope: !1252)
!1266 = !DILocation(line: 656, column: 3, scope: !1252)
!1267 = !DILocation(line: 657, column: 3, scope: !1252)
!1268 = !DILocation(line: 658, column: 5, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1252, file: !2, line: 658, column: 5)
!1270 = !DILocation(line: 658, column: 12, scope: !1269)
!1271 = !DILocation(line: 658, column: 16, scope: !1269)
!1272 = !DILocation(line: 658, column: 25, scope: !1269)
!1273 = !DILocation(line: 658, column: 5, scope: !1252)
!1274 = !DILocation(line: 659, column: 5, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1269, file: !2, line: 658, column: 31)
!1276 = !DILocation(line: 660, column: 3, scope: !1275)
!1277 = !DILocation(line: 662, column: 28, scope: !1252)
!1278 = !DILocation(line: 662, column: 3, scope: !1252)
!1279 = !DILocation(line: 663, column: 29, scope: !1252)
!1280 = !DILocation(line: 663, column: 3, scope: !1252)
!1281 = !DILocation(line: 664, column: 3, scope: !1252)
!1282 = !DILocation(line: 665, column: 3, scope: !1252)
!1283 = !DILocation(line: 666, column: 1, scope: !1252)
!1284 = distinct !DISubprogram(name: "mongo_set_secret", scope: !2, file: !2, line: 668, type: !179, scopeLine: 668, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!1285 = !DILocalVariable(name: "secret", arg: 1, scope: !1284, file: !2, line: 668, type: !165)
!1286 = !DILocation(line: 668, column: 38, scope: !1284)
!1287 = !DILocalVariable(name: "realm", arg: 2, scope: !1284, file: !2, line: 668, type: !165)
!1288 = !DILocation(line: 668, column: 55, scope: !1284)
!1289 = !DILocalVariable(name: "collection", scope: !1284, file: !2, line: 669, type: !575)
!1290 = !DILocation(line: 669, column: 25, scope: !1284)
!1291 = !DILocation(line: 669, column: 38, scope: !1284)
!1292 = !DILocation(line: 671, column: 6, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1284, file: !2, line: 671, column: 5)
!1294 = !DILocation(line: 671, column: 5, scope: !1284)
!1295 = !DILocation(line: 672, column: 5, scope: !1293)
!1296 = !DILocalVariable(name: "query", scope: !1284, file: !2, line: 674, type: !586)
!1297 = !DILocation(line: 674, column: 10, scope: !1284)
!1298 = !DILocation(line: 675, column: 3, scope: !1284)
!1299 = !DILocation(line: 676, column: 3, scope: !1284)
!1300 = !DILocation(line: 677, column: 3, scope: !1284)
!1301 = !DILocalVariable(name: "res", scope: !1284, file: !2, line: 679, type: !80)
!1302 = !DILocation(line: 679, column: 7, scope: !1284)
!1303 = !DILocation(line: 679, column: 38, scope: !1284)
!1304 = !DILocation(line: 679, column: 13, scope: !1284)
!1305 = !DILocation(line: 680, column: 29, scope: !1284)
!1306 = !DILocation(line: 680, column: 3, scope: !1284)
!1307 = !DILocation(line: 681, column: 3, scope: !1284)
!1308 = !DILocation(line: 683, column: 8, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1284, file: !2, line: 683, column: 7)
!1310 = !DILocation(line: 683, column: 7, scope: !1284)
!1311 = !DILocation(line: 684, column: 5, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1309, file: !2, line: 683, column: 13)
!1313 = !DILocation(line: 685, column: 5, scope: !1312)
!1314 = !DILocation(line: 687, column: 5, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1309, file: !2, line: 686, column: 10)
!1316 = !DILocation(line: 689, column: 1, scope: !1284)
!1317 = distinct !DISubprogram(name: "mongo_add_origin", scope: !2, file: !2, line: 737, type: !179, scopeLine: 738, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !567)
!1318 = !DILocalVariable(name: "origin", arg: 1, scope: !1317, file: !2, line: 737, type: !165)
!1319 = !DILocation(line: 737, column: 38, scope: !1317)
!1320 = !DILocalVariable(name: "realm", arg: 2, scope: !1317, file: !2, line: 737, type: !165)
!1321 = !DILocation(line: 737, column: 55, scope: !1317)
!1322 = !DILocalVariable(name: "collection", scope: !1317, file: !2, line: 739, type: !575)
!1323 = !DILocation(line: 739, column: 24, scope: !1317)
!1324 = !DILocation(line: 739, column: 37, scope: !1317)
!1325 = !DILocation(line: 741, column: 6, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1317, file: !2, line: 741, column: 5)
!1327 = !DILocation(line: 741, column: 5, scope: !1317)
!1328 = !DILocation(line: 742, column: 3, scope: !1326)
!1329 = !DILocalVariable(name: "ret", scope: !1317, file: !2, line: 744, type: !80)
!1330 = !DILocation(line: 744, column: 6, scope: !1317)
!1331 = !DILocalVariable(name: "realm0", scope: !1317, file: !2, line: 746, type: !963)
!1332 = !DILocation(line: 746, column: 10, scope: !1317)
!1333 = !DILocation(line: 747, column: 6, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1317, file: !2, line: 747, column: 5)
!1335 = !DILocation(line: 747, column: 5, scope: !1317)
!1336 = !DILocation(line: 747, column: 19, scope: !1334)
!1337 = !DILocation(line: 747, column: 18, scope: !1334)
!1338 = !DILocation(line: 747, column: 13, scope: !1334)
!1339 = !DILocalVariable(name: "query", scope: !1317, file: !2, line: 749, type: !586)
!1340 = !DILocation(line: 749, column: 9, scope: !1317)
!1341 = !DILocalVariable(name: "doc", scope: !1317, file: !2, line: 749, type: !586)
!1342 = !DILocation(line: 749, column: 16, scope: !1317)
