; ModuleID = '/home/raj/coturn/src/apps/relay/dbdrivers/dbd_sqlite.c'
source_filename = "/home/raj/coturn/src/apps/relay/dbdrivers/dbd_sqlite.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._turn_dbdriver_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%struct._turn_params_ = type { ptr, ptr, ptr, ptr, ptr, ptr, i32, [1025 x i8], [33 x i8], [1025 x i8], [1025 x i8], [1025 x i8], [513 x i8], [1025 x i8], i32, i32, i32, i32, i32, ptr, %union.pthread_mutex_t, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1025 x i8], [1025 x i8], i32, %struct.listener_server, %struct._ip_range_list, %struct._ip_range_list, i32, [4 x ptr], i16, i16, i32, i32, i32, [1025 x i8], i64, ptr, i32, ptr, i8, i8, [1025 x i8], [1025 x i8], i32, %struct._turn_server_addrs_list, i32, %struct._turn_server_addrs_list, %struct._turn_server_addrs_list, i32, i32, i32, i32, i32, i32, i8, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, i32, i32, i32, %struct._default_users_db_t, i64, [1025 x i8], [1025 x i8], i32, i32, i32, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { ptr, ptr }

!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2256, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 282)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(scope: null, file: !58, line: 197, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 272, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 34)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !58, line: 128, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 40, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 5)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !58, line: 132, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 392, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 49)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !58, line: 136, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 360, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 45)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !58, line: 109, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 584, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 73)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !58, line: 114, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 448, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 56)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !58, line: 154, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 984, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 123)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !58, line: 155, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 832, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 104)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(scope: null, file: !58, line: 156, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 912, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 114)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !58, line: 157, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 904, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 113)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !58, line: 158, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 768, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 96)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !58, line: 159, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1000, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 125)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !58, line: 160, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1584, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 198)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !58, line: 161, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 848, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 106)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "donot_print_connection_success", scope: !2, file: !58, line: 122, type: !15, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "rc_mutex", scope: !2, file: !58, line: 47, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !147, line: 72, baseType: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !147, line: 67, size: 320, elements: !149)
!149 = !{!150, !170, !174}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !148, file: !147, line: 69, baseType: !151, size: 320)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !152, line: 22, size: 320, elements: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!153 = !{!154, !155, !156, !157, !158, !159, !161, !162}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !151, file: !152, line: 24, baseType: !15, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !151, file: !152, line: 25, baseType: !7, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !151, file: !152, line: 26, baseType: !15, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !151, file: !152, line: 28, baseType: !7, size: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !151, file: !152, line: 32, baseType: !15, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !151, file: !152, line: 34, baseType: !160, size: 16, offset: 160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !151, file: !152, line: 35, baseType: !160, size: 16, offset: 176)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !151, file: !152, line: 36, baseType: !163, size: 128, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !164, line: 55, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !164, line: 51, size: 128, elements: !166)
!166 = !{!167, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !165, file: !164, line: 53, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !165, file: !164, line: 54, baseType: !168, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !148, file: !147, line: 70, baseType: !171, size: 320)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 320, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 40)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !148, file: !147, line: 71, baseType: !175, size: 64)
!175 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "write_thread", scope: !2, file: !58, line: 52, type: !178, isLocal: true, isDefinition: true)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !147, line: 27, baseType: !41)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "read_threads", scope: !2, file: !58, line: 50, type: !15, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "write_level", scope: !2, file: !58, line: 51, type: !15, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "rc_cond", scope: !2, file: !58, line: 48, type: !185, isLocal: true, isDefinition: true)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !147, line: 80, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !147, line: 75, size: 384, elements: !187)
!187 = !{!188, !211, !215}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !186, file: !147, line: 77, baseType: !189, size: 384)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_cond_s", file: !164, line: 94, size: 384, elements: !190)
!190 = !{!191, !202, !203, !207, !208, !209, !210}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__wseq", scope: !189, file: !164, line: 96, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__atomic_wide_counter", file: !193, line: 33, baseType: !194)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h", directory: "", checksumkind: CSK_MD5, checksum: "2708e6e61e266abad2d765ccef838dbe")
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !193, line: 25, size: 64, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__value64", scope: !194, file: !193, line: 27, baseType: !48, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__value32", scope: !194, file: !193, line: 32, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !193, line: 28, size: 64, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__low", scope: !198, file: !193, line: 30, baseType: !7, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__high", scope: !198, file: !193, line: 31, baseType: !7, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_start", scope: !189, file: !164, line: 97, baseType: !192, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__g_refs", scope: !189, file: !164, line: 98, baseType: !204, size: 64, offset: 128)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 2)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__g_size", scope: !189, file: !164, line: 99, baseType: !204, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__g1_orig_size", scope: !189, file: !164, line: 100, baseType: !7, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__wrefs", scope: !189, file: !164, line: 101, baseType: !7, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__g_signals", scope: !189, file: !164, line: 102, baseType: !204, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !186, file: !147, line: 78, baseType: !212, size: 384)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 384, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !186, file: !147, line: 79, baseType: !216, size: 64)
!216 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !58, line: 265, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 64)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !58, line: 275, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 24)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !58, line: 424, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 640, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 80)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !58, line: 485, type: !99, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !58, line: 549, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 536, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 67)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !58, line: 551, type: !99, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !58, line: 576, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 8)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !58, line: 611, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 544, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 68)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !58, line: 613, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 456, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 57)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !58, line: 674, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 328, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 41)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !58, line: 676, type: !99, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !58, line: 705, type: !236, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !58, line: 733, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 616, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 77)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !58, line: 761, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 408, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 51)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !58, line: 795, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 632, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 79)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !58, line: 797, type: !248, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !58, line: 822, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 96, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 12)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !58, line: 855, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 664, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 83)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !58, line: 885, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 656, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 82)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !58, line: 887, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 520, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 65)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !58, line: 904, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 88, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 11)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !58, line: 940, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 304, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 38)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !58, line: 997, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 504, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 63)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !58, line: 999, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 552, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 69)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1007, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 336, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 42)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1024, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 368, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 46)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1097, type: !329, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1109, type: !243, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1111, type: !284, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1113, type: !304, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1116, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 208, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 26)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !58, line: 455, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 952, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 119)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !58, line: 302, type: !229, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !58, line: 515, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 312, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 39)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !58, line: 347, type: !294, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !58, line: 374, type: !79, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !58, line: 379, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 4)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !58, line: 383, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 528, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 66)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1154, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 432, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 54)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1197, type: !277, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1224, type: !354, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1253, type: !373, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1271, type: !363, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !58, line: 1303, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 248, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 31)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "turn_dbdriver_t", file: !391, line: 77, baseType: !392)
!391 = !DIFile(filename: "src/apps/relay/dbdrivers/dbdriver.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "00319dc97026a2c0105cbae0fcb396b3")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_turn_dbdriver_t", file: !391, line: 50, size: 1664, elements: !393)
!393 = !{!394, !411, !415, !419, !423, !427, !428, !429, !430, !431, !435, !436, !440, !441, !446, !528, !532, !536, !557, !563, !567, !571, !575, !579, !580, !584}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "get_auth_secrets", scope: !392, file: !391, line: 51, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!15, !398, !407}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "secrets_list_t", file: !14, line: 143, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_secrets_list", file: !14, line: 139, size: 128, elements: !401)
!401 = !{!402, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "secrets", scope: !400, file: !14, line: 140, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !400, file: !14, line: 141, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !406, line: 46, baseType: !41)
!406 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 24, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !52, line: 38, baseType: !410)
!410 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "get_user_key", scope: !392, file: !391, line: 52, baseType: !412, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!15, !407, !407, !407}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "set_user_key", scope: !392, file: !391, line: 53, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!15, !407, !407, !33}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "del_user", scope: !392, file: !391, line: 54, baseType: !420, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!15, !407, !407}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "list_users", scope: !392, file: !391, line: 55, baseType: !424, size: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!15, !407, !398, !398}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "list_secrets", scope: !392, file: !391, line: 56, baseType: !424, size: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "del_secret", scope: !392, file: !391, line: 57, baseType: !420, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "set_secret", scope: !392, file: !391, line: 58, baseType: !420, size: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "add_origin", scope: !392, file: !391, line: 59, baseType: !420, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "del_origin", scope: !392, file: !391, line: 60, baseType: !432, size: 64, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!15, !407}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "list_origins", scope: !392, file: !391, line: 61, baseType: !424, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "set_realm_option_one", scope: !392, file: !391, line: 62, baseType: !437, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!15, !407, !41, !33}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "list_realm_options", scope: !392, file: !391, line: 63, baseType: !432, size: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "auth_ping", scope: !392, file: !391, line: 64, baseType: !442, size: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "get_ip_list", scope: !392, file: !391, line: 65, baseType: !447, size: 64, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!15, !33, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_list_t", file: !452, line: 159, baseType: !453)
!452 = !DIFile(filename: "src/server/ns_turn_ioalib.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "c6bb568b11ce41f25b29a4464aa685c5")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range_list", file: !452, line: 154, size: 128, elements: !454)
!454 = !{!455, !527}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !453, file: !452, line: 155, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_range_t", file: !452, line: 152, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_range", file: !452, line: 146, size: 6624, elements: !459)
!459 = !{!460, !464, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !458, file: !452, line: 147, baseType: !461, size: 2056)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2056, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 257)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !458, file: !452, line: 148, baseType: !465, size: 4104, offset: 2056)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 4104, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 513)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !458, file: !452, line: 149, baseType: !469, size: 448, offset: 6176)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr_range", file: !470, line: 53, baseType: !471)
!470 = !DIFile(filename: "src/client/ns_turn_ioaddr.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "6bb7c107d1e7937049c12f6d0dffd94c")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !470, line: 50, size: 448, elements: !472)
!472 = !{!473, !526}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !471, file: !470, line: 51, baseType: !474, size: 224)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ioa_addr", file: !470, line: 48, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !470, line: 44, size: 224, elements: !476)
!476 = !{!477, !489, !505}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !475, file: !470, line: 45, baseType: !478, size: 128)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !479, line: 180, size: 128, elements: !480)
!479 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!480 = !{!481, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !478, file: !479, line: 182, baseType: !482, size: 16)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !483, line: 28, baseType: !484)
!483 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!484 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !478, file: !479, line: 183, baseType: !486, size: 112, offset: 16)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 112, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 14)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "s4", scope: !475, file: !470, line: 46, baseType: !490, size: 128)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !491, line: 245, size: 128, elements: !492)
!491 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "eb6560f10d4cfe9f30fea2c92b9da0fd")
!492 = !{!493, !494, !498, !503}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !490, file: !491, line: 247, baseType: !482, size: 16)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !490, file: !491, line: 248, baseType: !495, size: 16, offset: 16)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !491, line: 123, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !50, line: 25, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !52, line: 40, baseType: !484)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !490, file: !491, line: 249, baseType: !499, size: 32, offset: 32)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !491, line: 31, size: 32, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !499, file: !491, line: 33, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !491, line: 30, baseType: !53)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !490, file: !491, line: 252, baseType: !504, size: 64, offset: 64)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 64, elements: !244)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "s6", scope: !475, file: !470, line: 47, baseType: !506, size: 224)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !491, line: 260, size: 224, elements: !507)
!507 = !{!508, !509, !510, !511, !525}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !506, file: !491, line: 262, baseType: !482, size: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !506, file: !491, line: 263, baseType: !495, size: 16, offset: 16)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !506, file: !491, line: 264, baseType: !53, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !506, file: !491, line: 265, baseType: !512, size: 128, offset: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !491, line: 219, size: 128, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !512, file: !491, line: 226, baseType: !515, size: 128)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !512, file: !491, line: 221, size: 128, elements: !516)
!516 = !{!517, !521, !523}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !515, file: !491, line: 223, baseType: !518, size: 128)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 128, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 16)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !515, file: !491, line: 224, baseType: !522, size: 128)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 128, elements: !244)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !515, file: !491, line: 225, baseType: !524, size: 128)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !364)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !506, file: !491, line: 266, baseType: !53, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !471, file: !470, line: 52, baseType: !474, size: 224, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ranges_number", scope: !453, file: !452, line: 156, baseType: !405, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "set_permission_ip", scope: !392, file: !391, line: 66, baseType: !529, size: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!15, !33, !407, !33, !15}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reread_realms", scope: !392, file: !391, line: 67, baseType: !533, size: 64, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !398}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "set_oauth_key", scope: !392, file: !391, line: 68, baseType: !537, size: 64, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!15, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "oauth_key_data_raw", file: !542, line: 144, baseType: !543)
!542 = !DIFile(filename: "src/apps/common/apputils.h", directory: "/home/raj/coturn", checksumkind: CSK_MD5, checksum: "5f4d9112d5c1617ebc273618c0760b4a")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oauth_key_data_raw", file: !542, line: 135, size: 4800, elements: !544)
!544 = !{!545, !549, !550, !551, !552, !553}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "kid", scope: !543, file: !542, line: 136, baseType: !546, size: 1032)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1032, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 129)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ikm_key", scope: !543, file: !542, line: 137, baseType: !461, size: 2056, offset: 1032)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !543, file: !542, line: 138, baseType: !49, size: 64, offset: 3136)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !543, file: !542, line: 139, baseType: !53, size: 32, offset: 3200)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "as_rs_alg", scope: !543, file: !542, line: 140, baseType: !299, size: 520, offset: 3232)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "realm", scope: !543, file: !542, line: 141, baseType: !554, size: 1024, offset: 3752)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "get_oauth_key", scope: !392, file: !391, line: 69, baseType: !558, size: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!15, !561, !540}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "del_oauth_key", scope: !392, file: !391, line: 70, baseType: !564, size: 64, offset: 1216)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!15, !561}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "list_oauth_keys", scope: !392, file: !391, line: 71, baseType: !568, size: 64, offset: 1280)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!15, !398, !398, !398, !398, !398}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "get_admin_user", scope: !392, file: !391, line: 72, baseType: !572, size: 64, offset: 1344)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!15, !561, !407, !407}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "set_admin_user", scope: !392, file: !391, line: 73, baseType: !576, size: 64, offset: 1408)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!15, !561, !561, !561}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "del_admin_user", scope: !392, file: !391, line: 74, baseType: !564, size: 64, offset: 1472)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "list_admin_users", scope: !392, file: !391, line: 75, baseType: !581, size: 64, offset: 1536)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!15, !15}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !392, file: !391, line: 76, baseType: !585, size: 64, offset: 1600)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null}
!588 = !{i32 7, !"Dwarf Version", i32 5}
!589 = !{i32 2, !"Debug Info Version", i32 3}
!590 = !{i32 1, !"wchar_size", i32 4}
!591 = !{i32 8, !"PIC Level", i32 2}
!592 = !{i32 7, !"PIE Level", i32 2}
!593 = !{i32 7, !"uwtable", i32 2}
!594 = !{i32 7, !"frame-pointer", i32 2}
!595 = !{!"clang version 16.0.0"}
!596 = distinct !DISubprogram(name: "get_sqlite_dbdriver", scope: !58, file: !58, line: 1339, type: !597, scopeLine: 1339, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !600)
!597 = !DISubroutineType(types: !598)
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!600 = !{}
!601 = !DILocation(line: 1340, column: 2, scope: !596)
!602 = distinct !DISubprogram(name: "sqlite_get_auth_secrets", scope: !58, file: !58, line: 210, type: !396, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!603 = !DILocalVariable(name: "sl", arg: 1, scope: !602, file: !58, line: 210, type: !398)
!604 = !DILocation(line: 210, column: 52, scope: !602)
!605 = !DILocalVariable(name: "realm", arg: 2, scope: !602, file: !58, line: 210, type: !407)
!606 = !DILocation(line: 210, column: 65, scope: !602)
!607 = !DILocalVariable(name: "ret", scope: !602, file: !58, line: 212, type: !15)
!608 = !DILocation(line: 212, column: 6, scope: !602)
!609 = !DILocalVariable(name: "sqliteconnection", scope: !602, file: !58, line: 213, type: !36)
!610 = !DILocation(line: 213, column: 11, scope: !602)
!611 = !DILocation(line: 213, column: 30, scope: !602)
!612 = !DILocation(line: 214, column: 6, scope: !613)
!613 = distinct !DILexicalBlock(scope: !602, file: !58, line: 214, column: 6)
!614 = !DILocation(line: 214, column: 6, scope: !602)
!615 = !DILocalVariable(name: "statement", scope: !616, file: !58, line: 215, type: !617)
!616 = distinct !DILexicalBlock(scope: !613, file: !58, line: 214, column: 24)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8200, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 1025)
!620 = !DILocation(line: 215, column: 8, scope: !616)
!621 = !DILocalVariable(name: "st", scope: !616, file: !58, line: 216, type: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !38, line: 3892, baseType: !624)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !38, line: 3892, flags: DIFlagFwdDecl)
!625 = !DILocation(line: 216, column: 17, scope: !616)
!626 = !DILocalVariable(name: "rc", scope: !616, file: !58, line: 217, type: !15)
!627 = !DILocation(line: 217, column: 7, scope: !616)
!628 = !DILocation(line: 218, column: 12, scope: !616)
!629 = !DILocation(line: 218, column: 96, scope: !616)
!630 = !DILocation(line: 218, column: 3, scope: !616)
!631 = !DILocation(line: 220, column: 3, scope: !616)
!632 = !DILocation(line: 222, column: 29, scope: !633)
!633 = distinct !DILexicalBlock(scope: !616, file: !58, line: 222, column: 7)
!634 = !DILocation(line: 222, column: 47, scope: !633)
!635 = !DILocation(line: 222, column: 13, scope: !633)
!636 = !DILocation(line: 222, column: 11, scope: !633)
!637 = !DILocation(line: 222, column: 71, scope: !633)
!638 = !DILocation(line: 222, column: 7, scope: !616)
!639 = !DILocalVariable(name: "ctotal", scope: !640, file: !58, line: 224, type: !15)
!640 = distinct !DILexicalBlock(scope: !633, file: !58, line: 222, column: 85)
!641 = !DILocation(line: 224, column: 8, scope: !640)
!642 = !DILocation(line: 224, column: 38, scope: !640)
!643 = !DILocation(line: 224, column: 17, scope: !640)
!644 = !DILocation(line: 225, column: 8, scope: !640)
!645 = !DILocation(line: 227, column: 4, scope: !640)
!646 = !DILocation(line: 227, column: 11, scope: !640)
!647 = !DILocation(line: 227, column: 18, scope: !640)
!648 = !DILocalVariable(name: "res", scope: !649, file: !58, line: 229, type: !15)
!649 = distinct !DILexicalBlock(scope: !640, file: !58, line: 227, column: 23)
!650 = !DILocation(line: 229, column: 9, scope: !649)
!651 = !DILocation(line: 229, column: 28, scope: !649)
!652 = !DILocation(line: 229, column: 15, scope: !649)
!653 = !DILocation(line: 230, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !649, file: !58, line: 230, column: 9)
!655 = !DILocation(line: 230, column: 13, scope: !654)
!656 = !DILocation(line: 230, column: 9, scope: !649)
!657 = !DILocalVariable(name: "type", scope: !658, file: !58, line: 232, type: !15)
!658 = distinct !DILexicalBlock(scope: !654, file: !58, line: 230, column: 28)
!659 = !DILocation(line: 232, column: 10, scope: !658)
!660 = !DILocation(line: 232, column: 37, scope: !658)
!661 = !DILocation(line: 232, column: 17, scope: !658)
!662 = !DILocation(line: 233, column: 10, scope: !663)
!663 = distinct !DILexicalBlock(scope: !658, file: !58, line: 233, column: 10)
!664 = !DILocation(line: 233, column: 15, scope: !663)
!665 = !DILocation(line: 233, column: 10, scope: !658)
!666 = !DILocation(line: 234, column: 27, scope: !663)
!667 = !DILocation(line: 234, column: 65, scope: !663)
!668 = !DILocation(line: 234, column: 45, scope: !663)
!669 = !DILocation(line: 234, column: 7, scope: !663)
!670 = !DILocation(line: 236, column: 5, scope: !658)
!671 = !DILocation(line: 236, column: 16, scope: !672)
!672 = distinct !DILexicalBlock(scope: !654, file: !58, line: 236, column: 16)
!673 = !DILocation(line: 236, column: 20, scope: !672)
!674 = !DILocation(line: 236, column: 16, scope: !654)
!675 = !DILocation(line: 237, column: 6, scope: !676)
!676 = distinct !DILexicalBlock(scope: !672, file: !58, line: 236, column: 36)
!677 = !DILocalVariable(name: "errmsg", scope: !678, file: !58, line: 239, type: !33)
!678 = distinct !DILexicalBlock(scope: !672, file: !58, line: 238, column: 12)
!679 = !DILocation(line: 239, column: 18, scope: !678)
!680 = !DILocation(line: 239, column: 42, scope: !678)
!681 = !DILocation(line: 239, column: 27, scope: !678)
!682 = !DILocation(line: 240, column: 90, scope: !678)
!683 = !DILocation(line: 240, column: 6, scope: !678)
!684 = !DILocation(line: 241, column: 10, scope: !678)
!685 = !DILocation(line: 242, column: 6, scope: !678)
!686 = distinct !{!686, !645, !687, !688}
!687 = !DILocation(line: 244, column: 4, scope: !640)
!688 = !{!"llvm.loop.mustprogress"}
!689 = !DILocation(line: 245, column: 3, scope: !640)
!690 = !DILocalVariable(name: "errmsg", scope: !691, file: !58, line: 246, type: !33)
!691 = distinct !DILexicalBlock(scope: !633, file: !58, line: 245, column: 10)
!692 = !DILocation(line: 246, column: 16, scope: !691)
!693 = !DILocation(line: 246, column: 40, scope: !691)
!694 = !DILocation(line: 246, column: 25, scope: !691)
!695 = !DILocation(line: 247, column: 88, scope: !691)
!696 = !DILocation(line: 247, column: 4, scope: !691)
!697 = !DILocation(line: 249, column: 20, scope: !616)
!698 = !DILocation(line: 249, column: 3, scope: !616)
!699 = !DILocation(line: 251, column: 3, scope: !616)
!700 = !DILocation(line: 252, column: 2, scope: !616)
!701 = !DILocation(line: 253, column: 9, scope: !602)
!702 = !DILocation(line: 253, column: 2, scope: !602)
!703 = distinct !DISubprogram(name: "sqlite_get_user_key", scope: !58, file: !58, line: 256, type: !413, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!704 = !DILocalVariable(name: "usname", arg: 1, scope: !703, file: !58, line: 256, type: !407)
!705 = !DILocation(line: 256, column: 41, scope: !703)
!706 = !DILocalVariable(name: "realm", arg: 2, scope: !703, file: !58, line: 256, type: !407)
!707 = !DILocation(line: 256, column: 58, scope: !703)
!708 = !DILocalVariable(name: "key", arg: 3, scope: !703, file: !58, line: 256, type: !407)
!709 = !DILocation(line: 256, column: 75, scope: !703)
!710 = !DILocalVariable(name: "ret", scope: !703, file: !58, line: 258, type: !15)
!711 = !DILocation(line: 258, column: 6, scope: !703)
!712 = !DILocalVariable(name: "sqliteconnection", scope: !703, file: !58, line: 259, type: !36)
!713 = !DILocation(line: 259, column: 11, scope: !703)
!714 = !DILocation(line: 259, column: 30, scope: !703)
!715 = !DILocation(line: 260, column: 6, scope: !716)
!716 = distinct !DILexicalBlock(scope: !703, file: !58, line: 260, column: 6)
!717 = !DILocation(line: 260, column: 6, scope: !703)
!718 = !DILocalVariable(name: "statement", scope: !719, file: !58, line: 261, type: !617)
!719 = distinct !DILexicalBlock(scope: !716, file: !58, line: 260, column: 24)
!720 = !DILocation(line: 261, column: 8, scope: !719)
!721 = !DILocalVariable(name: "st", scope: !719, file: !58, line: 262, type: !622)
!722 = !DILocation(line: 262, column: 17, scope: !719)
!723 = !DILocalVariable(name: "rc", scope: !719, file: !58, line: 263, type: !15)
!724 = !DILocation(line: 263, column: 7, scope: !719)
!725 = !DILocation(line: 265, column: 12, scope: !719)
!726 = !DILocation(line: 265, column: 109, scope: !719)
!727 = !DILocation(line: 265, column: 117, scope: !719)
!728 = !DILocation(line: 265, column: 3, scope: !719)
!729 = !DILocation(line: 267, column: 3, scope: !719)
!730 = !DILocation(line: 269, column: 29, scope: !731)
!731 = distinct !DILexicalBlock(scope: !719, file: !58, line: 269, column: 7)
!732 = !DILocation(line: 269, column: 47, scope: !731)
!733 = !DILocation(line: 269, column: 13, scope: !731)
!734 = !DILocation(line: 269, column: 11, scope: !731)
!735 = !DILocation(line: 269, column: 71, scope: !731)
!736 = !DILocation(line: 269, column: 7, scope: !719)
!737 = !DILocalVariable(name: "res", scope: !738, file: !58, line: 270, type: !15)
!738 = distinct !DILexicalBlock(scope: !731, file: !58, line: 269, column: 85)
!739 = !DILocation(line: 270, column: 8, scope: !738)
!740 = !DILocation(line: 270, column: 27, scope: !738)
!741 = !DILocation(line: 270, column: 14, scope: !738)
!742 = !DILocation(line: 271, column: 8, scope: !743)
!743 = distinct !DILexicalBlock(scope: !738, file: !58, line: 271, column: 8)
!744 = !DILocation(line: 271, column: 12, scope: !743)
!745 = !DILocation(line: 271, column: 8, scope: !738)
!746 = !DILocalVariable(name: "kval", scope: !747, file: !58, line: 272, type: !40)
!747 = distinct !DILexicalBlock(scope: !743, file: !58, line: 271, column: 27)
!748 = !DILocation(line: 272, column: 11, scope: !747)
!749 = !DILocation(line: 272, column: 59, scope: !747)
!750 = !DILocation(line: 272, column: 39, scope: !747)
!751 = !DILocation(line: 272, column: 18, scope: !747)
!752 = !DILocalVariable(name: "sz", scope: !747, file: !58, line: 273, type: !405)
!753 = !DILocation(line: 273, column: 12, scope: !747)
!754 = !DILocation(line: 273, column: 17, scope: !747)
!755 = !DILocation(line: 274, column: 38, scope: !756)
!756 = distinct !DILexicalBlock(scope: !747, file: !58, line: 274, column: 9)
!757 = !DILocation(line: 274, column: 44, scope: !756)
!758 = !DILocation(line: 274, column: 49, scope: !756)
!759 = !DILocation(line: 274, column: 9, scope: !756)
!760 = !DILocation(line: 274, column: 53, scope: !756)
!761 = !DILocation(line: 274, column: 9, scope: !747)
!762 = !DILocation(line: 275, column: 70, scope: !763)
!763 = distinct !DILexicalBlock(scope: !756, file: !58, line: 274, column: 58)
!764 = !DILocation(line: 275, column: 76, scope: !763)
!765 = !DILocation(line: 275, column: 6, scope: !763)
!766 = !DILocation(line: 276, column: 5, scope: !763)
!767 = !DILocation(line: 277, column: 10, scope: !768)
!768 = distinct !DILexicalBlock(scope: !756, file: !58, line: 276, column: 12)
!769 = !DILocation(line: 279, column: 10, scope: !747)
!770 = !DILocation(line: 279, column: 5, scope: !747)
!771 = !DILocation(line: 280, column: 4, scope: !747)
!772 = !DILocation(line: 281, column: 3, scope: !738)
!773 = !DILocalVariable(name: "errmsg", scope: !774, file: !58, line: 282, type: !33)
!774 = distinct !DILexicalBlock(scope: !731, file: !58, line: 281, column: 10)
!775 = !DILocation(line: 282, column: 16, scope: !774)
!776 = !DILocation(line: 282, column: 40, scope: !774)
!777 = !DILocation(line: 282, column: 25, scope: !774)
!778 = !DILocation(line: 283, column: 88, scope: !774)
!779 = !DILocation(line: 283, column: 4, scope: !774)
!780 = !DILocation(line: 286, column: 20, scope: !719)
!781 = !DILocation(line: 286, column: 3, scope: !719)
!782 = !DILocation(line: 288, column: 3, scope: !719)
!783 = !DILocation(line: 289, column: 2, scope: !719)
!784 = !DILocation(line: 290, column: 9, scope: !703)
!785 = !DILocation(line: 290, column: 2, scope: !703)
!786 = distinct !DISubprogram(name: "sqlite_set_user_key", scope: !58, file: !58, line: 410, type: !417, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!787 = !DILocalVariable(name: "usname", arg: 1, scope: !786, file: !58, line: 410, type: !407)
!788 = !DILocation(line: 410, column: 41, scope: !786)
!789 = !DILocalVariable(name: "realm", arg: 2, scope: !786, file: !58, line: 410, type: !407)
!790 = !DILocation(line: 410, column: 58, scope: !786)
!791 = !DILocalVariable(name: "key", arg: 3, scope: !786, file: !58, line: 410, type: !33)
!792 = !DILocation(line: 410, column: 77, scope: !786)
!793 = !DILocalVariable(name: "ret", scope: !786, file: !58, line: 412, type: !15)
!794 = !DILocation(line: 412, column: 6, scope: !786)
!795 = !DILocalVariable(name: "statement", scope: !786, file: !58, line: 413, type: !617)
!796 = !DILocation(line: 413, column: 7, scope: !786)
!797 = !DILocalVariable(name: "st", scope: !786, file: !58, line: 414, type: !622)
!798 = !DILocation(line: 414, column: 16, scope: !786)
!799 = !DILocalVariable(name: "rc", scope: !786, file: !58, line: 415, type: !15)
!800 = !DILocation(line: 415, column: 6, scope: !786)
!801 = !DILocation(line: 417, column: 32, scope: !786)
!802 = !DILocalVariable(name: "sqliteconnection", scope: !786, file: !58, line: 419, type: !36)
!803 = !DILocation(line: 419, column: 11, scope: !786)
!804 = !DILocation(line: 419, column: 30, scope: !786)
!805 = !DILocation(line: 420, column: 6, scope: !806)
!806 = distinct !DILexicalBlock(scope: !786, file: !58, line: 420, column: 6)
!807 = !DILocation(line: 420, column: 6, scope: !786)
!808 = !DILocation(line: 422, column: 3, scope: !809)
!809 = distinct !DILexicalBlock(scope: !806, file: !58, line: 420, column: 24)
!810 = !DILocation(line: 424, column: 12, scope: !809)
!811 = !DILocation(line: 424, column: 125, scope: !809)
!812 = !DILocation(line: 424, column: 132, scope: !809)
!813 = !DILocation(line: 424, column: 140, scope: !809)
!814 = !DILocation(line: 424, column: 3, scope: !809)
!815 = !DILocation(line: 426, column: 29, scope: !816)
!816 = distinct !DILexicalBlock(scope: !809, file: !58, line: 426, column: 7)
!817 = !DILocation(line: 426, column: 47, scope: !816)
!818 = !DILocation(line: 426, column: 13, scope: !816)
!819 = !DILocation(line: 426, column: 11, scope: !816)
!820 = !DILocation(line: 426, column: 71, scope: !816)
!821 = !DILocation(line: 426, column: 7, scope: !809)
!822 = !DILocation(line: 427, column: 17, scope: !823)
!823 = distinct !DILexicalBlock(scope: !816, file: !58, line: 426, column: 85)
!824 = !DILocation(line: 427, column: 4, scope: !823)
!825 = !DILocation(line: 428, column: 8, scope: !823)
!826 = !DILocation(line: 429, column: 3, scope: !823)
!827 = !DILocalVariable(name: "errmsg", scope: !828, file: !58, line: 430, type: !33)
!828 = distinct !DILexicalBlock(scope: !816, file: !58, line: 429, column: 10)
!829 = !DILocation(line: 430, column: 16, scope: !828)
!830 = !DILocation(line: 430, column: 40, scope: !828)
!831 = !DILocation(line: 430, column: 25, scope: !828)
!832 = !DILocation(line: 431, column: 88, scope: !828)
!833 = !DILocation(line: 431, column: 4, scope: !828)
!834 = !DILocation(line: 433, column: 20, scope: !809)
!835 = !DILocation(line: 433, column: 3, scope: !809)
!836 = !DILocation(line: 435, column: 3, scope: !809)
!837 = !DILocation(line: 436, column: 2, scope: !809)
!838 = !DILocation(line: 437, column: 9, scope: !786)
!839 = !DILocation(line: 437, column: 2, scope: !786)
!840 = distinct !DISubprogram(name: "sqlite_del_user", scope: !58, file: !58, line: 474, type: !421, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!841 = !DILocalVariable(name: "usname", arg: 1, scope: !840, file: !58, line: 474, type: !407)
!842 = !DILocation(line: 474, column: 37, scope: !840)
!843 = !DILocalVariable(name: "realm", arg: 2, scope: !840, file: !58, line: 474, type: !407)
!844 = !DILocation(line: 474, column: 54, scope: !840)
!845 = !DILocalVariable(name: "ret", scope: !840, file: !58, line: 476, type: !15)
!846 = !DILocation(line: 476, column: 6, scope: !840)
!847 = !DILocalVariable(name: "statement", scope: !840, file: !58, line: 477, type: !617)
!848 = !DILocation(line: 477, column: 7, scope: !840)
!849 = !DILocalVariable(name: "st", scope: !840, file: !58, line: 478, type: !622)
!850 = !DILocation(line: 478, column: 16, scope: !840)
!851 = !DILocalVariable(name: "rc", scope: !840, file: !58, line: 479, type: !15)
!852 = !DILocation(line: 479, column: 6, scope: !840)
!853 = !DILocation(line: 481, column: 32, scope: !840)
!854 = !DILocalVariable(name: "sqliteconnection", scope: !840, file: !58, line: 483, type: !36)
!855 = !DILocation(line: 483, column: 11, scope: !840)
!856 = !DILocation(line: 483, column: 30, scope: !840)
!857 = !DILocation(line: 484, column: 6, scope: !858)
!858 = distinct !DILexicalBlock(scope: !840, file: !58, line: 484, column: 6)
!859 = !DILocation(line: 484, column: 6, scope: !840)
!860 = !DILocation(line: 485, column: 12, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !58, line: 484, column: 24)
!862 = !DILocation(line: 485, column: 101, scope: !861)
!863 = !DILocation(line: 485, column: 109, scope: !861)
!864 = !DILocation(line: 485, column: 3, scope: !861)
!865 = !DILocation(line: 487, column: 3, scope: !861)
!866 = !DILocation(line: 489, column: 29, scope: !867)
!867 = distinct !DILexicalBlock(scope: !861, file: !58, line: 489, column: 7)
!868 = !DILocation(line: 489, column: 47, scope: !867)
!869 = !DILocation(line: 489, column: 13, scope: !867)
!870 = !DILocation(line: 489, column: 11, scope: !867)
!871 = !DILocation(line: 489, column: 71, scope: !867)
!872 = !DILocation(line: 489, column: 7, scope: !861)
!873 = !DILocation(line: 490, column: 17, scope: !874)
!874 = distinct !DILexicalBlock(scope: !867, file: !58, line: 489, column: 85)
!875 = !DILocation(line: 490, column: 4, scope: !874)
!876 = !DILocation(line: 491, column: 8, scope: !874)
!877 = !DILocation(line: 492, column: 3, scope: !874)
!878 = !DILocalVariable(name: "errmsg", scope: !879, file: !58, line: 493, type: !33)
!879 = distinct !DILexicalBlock(scope: !867, file: !58, line: 492, column: 10)
!880 = !DILocation(line: 493, column: 16, scope: !879)
!881 = !DILocation(line: 493, column: 40, scope: !879)
!882 = !DILocation(line: 493, column: 25, scope: !879)
!883 = !DILocation(line: 494, column: 88, scope: !879)
!884 = !DILocation(line: 494, column: 4, scope: !879)
!885 = !DILocation(line: 496, column: 20, scope: !861)
!886 = !DILocation(line: 496, column: 3, scope: !861)
!887 = !DILocation(line: 498, column: 3, scope: !861)
!888 = !DILocation(line: 499, column: 2, scope: !861)
!889 = !DILocation(line: 500, column: 9, scope: !840)
!890 = !DILocation(line: 500, column: 2, scope: !840)
!891 = distinct !DISubprogram(name: "sqlite_list_users", scope: !58, file: !58, line: 534, type: !425, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!892 = !DILocalVariable(name: "realm", arg: 1, scope: !891, file: !58, line: 534, type: !407)
!893 = !DILocation(line: 534, column: 39, scope: !891)
!894 = !DILocalVariable(name: "users", arg: 2, scope: !891, file: !58, line: 534, type: !398)
!895 = !DILocation(line: 534, column: 62, scope: !891)
!896 = !DILocalVariable(name: "realms", arg: 3, scope: !891, file: !58, line: 534, type: !398)
!897 = !DILocation(line: 534, column: 85, scope: !891)
!898 = !DILocalVariable(name: "ret", scope: !891, file: !58, line: 536, type: !15)
!899 = !DILocation(line: 536, column: 6, scope: !891)
!900 = !DILocalVariable(name: "statement", scope: !891, file: !58, line: 537, type: !617)
!901 = !DILocation(line: 537, column: 7, scope: !891)
!902 = !DILocalVariable(name: "st", scope: !891, file: !58, line: 538, type: !622)
!903 = !DILocation(line: 538, column: 16, scope: !891)
!904 = !DILocalVariable(name: "rc", scope: !891, file: !58, line: 539, type: !15)
!905 = !DILocation(line: 539, column: 6, scope: !891)
!906 = !DILocalVariable(name: "realm0", scope: !891, file: !58, line: 541, type: !907)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 1024, elements: !555)
!908 = !DILocation(line: 541, column: 10, scope: !891)
!909 = !DILocation(line: 542, column: 6, scope: !910)
!910 = distinct !DILexicalBlock(scope: !891, file: !58, line: 542, column: 5)
!911 = !DILocation(line: 542, column: 5, scope: !891)
!912 = !DILocation(line: 542, column: 19, scope: !910)
!913 = !DILocation(line: 542, column: 18, scope: !910)
!914 = !DILocation(line: 542, column: 13, scope: !910)
!915 = !DILocation(line: 544, column: 32, scope: !891)
!916 = !DILocalVariable(name: "sqliteconnection", scope: !891, file: !58, line: 546, type: !36)
!917 = !DILocation(line: 546, column: 11, scope: !891)
!918 = !DILocation(line: 546, column: 30, scope: !891)
!919 = !DILocation(line: 547, column: 6, scope: !920)
!920 = distinct !DILexicalBlock(scope: !891, file: !58, line: 547, column: 6)
!921 = !DILocation(line: 547, column: 6, scope: !891)
!922 = !DILocation(line: 548, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !58, line: 548, column: 7)
!924 = distinct !DILexicalBlock(scope: !920, file: !58, line: 547, column: 24)
!925 = !DILocation(line: 548, column: 7, scope: !924)
!926 = !DILocation(line: 549, column: 13, scope: !927)
!927 = distinct !DILexicalBlock(scope: !923, file: !58, line: 548, column: 17)
!928 = !DILocation(line: 549, column: 113, scope: !927)
!929 = !DILocation(line: 549, column: 4, scope: !927)
!930 = !DILocation(line: 550, column: 3, scope: !927)
!931 = !DILocation(line: 551, column: 13, scope: !932)
!932 = distinct !DILexicalBlock(scope: !923, file: !58, line: 550, column: 10)
!933 = !DILocation(line: 551, column: 4, scope: !932)
!934 = !DILocation(line: 554, column: 3, scope: !924)
!935 = !DILocation(line: 556, column: 29, scope: !936)
!936 = distinct !DILexicalBlock(scope: !924, file: !58, line: 556, column: 7)
!937 = !DILocation(line: 556, column: 47, scope: !936)
!938 = !DILocation(line: 556, column: 13, scope: !936)
!939 = !DILocation(line: 556, column: 11, scope: !936)
!940 = !DILocation(line: 556, column: 71, scope: !936)
!941 = !DILocation(line: 556, column: 7, scope: !924)
!942 = !DILocation(line: 558, column: 8, scope: !943)
!943 = distinct !DILexicalBlock(scope: !936, file: !58, line: 556, column: 85)
!944 = !DILocation(line: 559, column: 4, scope: !943)
!945 = !DILocalVariable(name: "res", scope: !946, file: !58, line: 560, type: !15)
!946 = distinct !DILexicalBlock(scope: !943, file: !58, line: 559, column: 14)
!947 = !DILocation(line: 560, column: 9, scope: !946)
!948 = !DILocation(line: 560, column: 28, scope: !946)
!949 = !DILocation(line: 560, column: 15, scope: !946)
!950 = !DILocation(line: 561, column: 9, scope: !951)
!951 = distinct !DILexicalBlock(scope: !946, file: !58, line: 561, column: 9)
!952 = !DILocation(line: 561, column: 13, scope: !951)
!953 = !DILocation(line: 561, column: 9, scope: !946)
!954 = !DILocalVariable(name: "kval", scope: !955, file: !58, line: 563, type: !33)
!955 = distinct !DILexicalBlock(scope: !951, file: !58, line: 561, column: 28)
!956 = !DILocation(line: 563, column: 18, scope: !955)
!957 = !DILocation(line: 563, column: 59, scope: !955)
!958 = !DILocation(line: 563, column: 39, scope: !955)
!959 = !DILocalVariable(name: "rval", scope: !955, file: !58, line: 564, type: !33)
!960 = !DILocation(line: 564, column: 18, scope: !955)
!961 = !DILocation(line: 564, column: 59, scope: !955)
!962 = !DILocation(line: 564, column: 39, scope: !955)
!963 = !DILocation(line: 566, column: 9, scope: !964)
!964 = distinct !DILexicalBlock(scope: !955, file: !58, line: 566, column: 9)
!965 = !DILocation(line: 566, column: 9, scope: !955)
!966 = !DILocation(line: 567, column: 27, scope: !967)
!967 = distinct !DILexicalBlock(scope: !964, file: !58, line: 566, column: 16)
!968 = !DILocation(line: 567, column: 33, scope: !967)
!969 = !DILocation(line: 567, column: 7, scope: !967)
!970 = !DILocation(line: 568, column: 10, scope: !971)
!971 = distinct !DILexicalBlock(scope: !967, file: !58, line: 568, column: 10)
!972 = !DILocation(line: 568, column: 10, scope: !967)
!973 = !DILocation(line: 569, column: 11, scope: !974)
!974 = distinct !DILexicalBlock(scope: !975, file: !58, line: 569, column: 11)
!975 = distinct !DILexicalBlock(scope: !971, file: !58, line: 568, column: 18)
!976 = !DILocation(line: 569, column: 16, scope: !974)
!977 = !DILocation(line: 569, column: 20, scope: !974)
!978 = !DILocation(line: 569, column: 19, scope: !974)
!979 = !DILocation(line: 569, column: 11, scope: !975)
!980 = !DILocation(line: 570, column: 29, scope: !981)
!981 = distinct !DILexicalBlock(scope: !974, file: !58, line: 569, column: 26)
!982 = !DILocation(line: 570, column: 36, scope: !981)
!983 = !DILocation(line: 570, column: 9, scope: !981)
!984 = !DILocation(line: 571, column: 8, scope: !981)
!985 = !DILocation(line: 572, column: 29, scope: !986)
!986 = distinct !DILexicalBlock(scope: !974, file: !58, line: 571, column: 15)
!987 = !DILocation(line: 572, column: 43, scope: !986)
!988 = !DILocation(line: 572, column: 9, scope: !986)
!989 = !DILocation(line: 574, column: 7, scope: !975)
!990 = !DILocation(line: 575, column: 6, scope: !967)
!991 = !DILocation(line: 576, column: 26, scope: !992)
!992 = distinct !DILexicalBlock(scope: !964, file: !58, line: 575, column: 13)
!993 = !DILocation(line: 576, column: 32, scope: !992)
!994 = !DILocation(line: 576, column: 7, scope: !992)
!995 = !DILocation(line: 579, column: 5, scope: !955)
!996 = !DILocation(line: 579, column: 16, scope: !997)
!997 = distinct !DILexicalBlock(scope: !951, file: !58, line: 579, column: 16)
!998 = !DILocation(line: 579, column: 20, scope: !997)
!999 = !DILocation(line: 579, column: 16, scope: !951)
!1000 = !DILocation(line: 580, column: 6, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !997, file: !58, line: 579, column: 36)
!1002 = !DILocalVariable(name: "errmsg", scope: !1003, file: !58, line: 582, type: !33)
!1003 = distinct !DILexicalBlock(scope: !997, file: !58, line: 581, column: 12)
!1004 = !DILocation(line: 582, column: 18, scope: !1003)
!1005 = !DILocation(line: 582, column: 42, scope: !1003)
!1006 = !DILocation(line: 582, column: 27, scope: !1003)
!1007 = !DILocation(line: 583, column: 90, scope: !1003)
!1008 = !DILocation(line: 583, column: 6, scope: !1003)
!1009 = !DILocation(line: 584, column: 10, scope: !1003)
!1010 = !DILocation(line: 585, column: 6, scope: !1003)
!1011 = distinct !{!1011, !944, !1012}
!1012 = !DILocation(line: 587, column: 4, scope: !943)
!1013 = !DILocation(line: 588, column: 3, scope: !943)
!1014 = !DILocalVariable(name: "errmsg", scope: !1015, file: !58, line: 589, type: !33)
!1015 = distinct !DILexicalBlock(scope: !936, file: !58, line: 588, column: 10)
!1016 = !DILocation(line: 589, column: 16, scope: !1015)
!1017 = !DILocation(line: 589, column: 40, scope: !1015)
!1018 = !DILocation(line: 589, column: 25, scope: !1015)
!1019 = !DILocation(line: 590, column: 88, scope: !1015)
!1020 = !DILocation(line: 590, column: 4, scope: !1015)
!1021 = !DILocation(line: 592, column: 20, scope: !924)
!1022 = !DILocation(line: 592, column: 3, scope: !924)
!1023 = !DILocation(line: 594, column: 3, scope: !924)
!1024 = !DILocation(line: 595, column: 2, scope: !924)
!1025 = !DILocation(line: 596, column: 9, scope: !891)
!1026 = !DILocation(line: 596, column: 2, scope: !891)
!1027 = distinct !DISubprogram(name: "sqlite_list_secrets", scope: !58, file: !58, line: 599, type: !425, scopeLine: 600, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!1028 = !DILocalVariable(name: "realm", arg: 1, scope: !1027, file: !58, line: 599, type: !407)
!1029 = !DILocation(line: 599, column: 41, scope: !1027)
!1030 = !DILocalVariable(name: "secrets", arg: 2, scope: !1027, file: !58, line: 599, type: !398)
!1031 = !DILocation(line: 599, column: 64, scope: !1027)
!1032 = !DILocalVariable(name: "realms", arg: 3, scope: !1027, file: !58, line: 599, type: !398)
!1033 = !DILocation(line: 599, column: 89, scope: !1027)
!1034 = !DILocalVariable(name: "ret", scope: !1027, file: !58, line: 601, type: !15)
!1035 = !DILocation(line: 601, column: 6, scope: !1027)
!1036 = !DILocalVariable(name: "statement", scope: !1027, file: !58, line: 602, type: !617)
!1037 = !DILocation(line: 602, column: 7, scope: !1027)
!1038 = !DILocalVariable(name: "realm0", scope: !1027, file: !58, line: 604, type: !907)
!1039 = !DILocation(line: 604, column: 10, scope: !1027)
!1040 = !DILocation(line: 605, column: 6, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1027, file: !58, line: 605, column: 5)
!1042 = !DILocation(line: 605, column: 5, scope: !1027)
!1043 = !DILocation(line: 605, column: 19, scope: !1041)
!1044 = !DILocation(line: 605, column: 18, scope: !1041)
!1045 = !DILocation(line: 605, column: 13, scope: !1041)
!1046 = !DILocalVariable(name: "st", scope: !1027, file: !58, line: 607, type: !622)
!1047 = !DILocation(line: 607, column: 16, scope: !1027)
!1048 = !DILocalVariable(name: "rc", scope: !1027, file: !58, line: 608, type: !15)
!1049 = !DILocation(line: 608, column: 6, scope: !1027)
!1050 = !DILocation(line: 610, column: 6, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1027, file: !58, line: 610, column: 6)
!1052 = !DILocation(line: 610, column: 6, scope: !1027)
!1053 = !DILocation(line: 611, column: 12, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1051, file: !58, line: 610, column: 16)
!1055 = !DILocation(line: 611, column: 113, scope: !1054)
!1056 = !DILocation(line: 611, column: 3, scope: !1054)
!1057 = !DILocation(line: 612, column: 2, scope: !1054)
!1058 = !DILocation(line: 613, column: 12, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1051, file: !58, line: 612, column: 9)
!1060 = !DILocation(line: 613, column: 3, scope: !1059)
!1061 = !DILocation(line: 616, column: 32, scope: !1027)
!1062 = !DILocalVariable(name: "sqliteconnection", scope: !1027, file: !58, line: 618, type: !36)
!1063 = !DILocation(line: 618, column: 11, scope: !1027)
!1064 = !DILocation(line: 618, column: 30, scope: !1027)
!1065 = !DILocation(line: 619, column: 5, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1027, file: !58, line: 619, column: 5)
!1067 = !DILocation(line: 619, column: 5, scope: !1027)
!1068 = !DILocation(line: 621, column: 3, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1066, file: !58, line: 619, column: 23)
!1070 = !DILocation(line: 623, column: 29, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1069, file: !58, line: 623, column: 7)
!1072 = !DILocation(line: 623, column: 47, scope: !1071)
!1073 = !DILocation(line: 623, column: 13, scope: !1071)
!1074 = !DILocation(line: 623, column: 11, scope: !1071)
!1075 = !DILocation(line: 623, column: 71, scope: !1071)
!1076 = !DILocation(line: 623, column: 7, scope: !1069)
!1077 = !DILocalVariable(name: "res", scope: !1078, file: !58, line: 625, type: !15)
!1078 = distinct !DILexicalBlock(scope: !1071, file: !58, line: 623, column: 85)
!1079 = !DILocation(line: 625, column: 8, scope: !1078)
!1080 = !DILocation(line: 626, column: 4, scope: !1078)
!1081 = !DILocation(line: 627, column: 24, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !58, line: 626, column: 13)
!1083 = !DILocation(line: 627, column: 11, scope: !1082)
!1084 = !DILocation(line: 627, column: 9, scope: !1082)
!1085 = !DILocation(line: 628, column: 9, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1082, file: !58, line: 628, column: 9)
!1087 = !DILocation(line: 628, column: 13, scope: !1086)
!1088 = !DILocation(line: 628, column: 9, scope: !1082)
!1089 = !DILocation(line: 629, column: 10, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1086, file: !58, line: 628, column: 28)
!1091 = !DILocalVariable(name: "kval", scope: !1090, file: !58, line: 630, type: !33)
!1092 = !DILocation(line: 630, column: 18, scope: !1090)
!1093 = !DILocation(line: 630, column: 59, scope: !1090)
!1094 = !DILocation(line: 630, column: 39, scope: !1090)
!1095 = !DILocation(line: 631, column: 9, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1090, file: !58, line: 631, column: 9)
!1097 = !DILocation(line: 631, column: 9, scope: !1090)
!1098 = !DILocalVariable(name: "rval", scope: !1099, file: !58, line: 632, type: !33)
!1099 = distinct !DILexicalBlock(scope: !1096, file: !58, line: 631, column: 15)
!1100 = !DILocation(line: 632, column: 19, scope: !1099)
!1101 = !DILocation(line: 632, column: 60, scope: !1099)
!1102 = !DILocation(line: 632, column: 40, scope: !1099)
!1103 = !DILocation(line: 633, column: 10, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1099, file: !58, line: 633, column: 10)
!1105 = !DILocation(line: 633, column: 10, scope: !1099)
!1106 = !DILocation(line: 634, column: 28, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1104, file: !58, line: 633, column: 19)
!1108 = !DILocation(line: 634, column: 36, scope: !1107)
!1109 = !DILocation(line: 634, column: 8, scope: !1107)
!1110 = !DILocation(line: 635, column: 11, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1107, file: !58, line: 635, column: 11)
!1112 = !DILocation(line: 635, column: 11, scope: !1107)
!1113 = !DILocation(line: 636, column: 12, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !58, line: 636, column: 12)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !58, line: 635, column: 19)
!1116 = !DILocation(line: 636, column: 17, scope: !1114)
!1117 = !DILocation(line: 636, column: 21, scope: !1114)
!1118 = !DILocation(line: 636, column: 20, scope: !1114)
!1119 = !DILocation(line: 636, column: 12, scope: !1115)
!1120 = !DILocation(line: 637, column: 30, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1114, file: !58, line: 636, column: 27)
!1122 = !DILocation(line: 637, column: 37, scope: !1121)
!1123 = !DILocation(line: 637, column: 10, scope: !1121)
!1124 = !DILocation(line: 638, column: 9, scope: !1121)
!1125 = !DILocation(line: 639, column: 30, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1114, file: !58, line: 638, column: 16)
!1127 = !DILocation(line: 639, column: 44, scope: !1126)
!1128 = !DILocation(line: 639, column: 10, scope: !1126)
!1129 = !DILocation(line: 641, column: 8, scope: !1115)
!1130 = !DILocation(line: 642, column: 7, scope: !1107)
!1131 = !DILocation(line: 643, column: 26, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1104, file: !58, line: 642, column: 14)
!1133 = !DILocation(line: 643, column: 31, scope: !1132)
!1134 = !DILocation(line: 643, column: 8, scope: !1132)
!1135 = !DILocation(line: 645, column: 6, scope: !1099)
!1136 = !DILocation(line: 646, column: 5, scope: !1090)
!1137 = !DILocation(line: 646, column: 16, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1086, file: !58, line: 646, column: 16)
!1139 = !DILocation(line: 646, column: 20, scope: !1138)
!1140 = !DILocation(line: 646, column: 16, scope: !1086)
!1141 = !DILocation(line: 647, column: 6, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1138, file: !58, line: 646, column: 36)
!1143 = !DILocalVariable(name: "errmsg", scope: !1144, file: !58, line: 649, type: !33)
!1144 = distinct !DILexicalBlock(scope: !1138, file: !58, line: 648, column: 12)
!1145 = !DILocation(line: 649, column: 18, scope: !1144)
!1146 = !DILocation(line: 649, column: 42, scope: !1144)
!1147 = !DILocation(line: 649, column: 27, scope: !1144)
!1148 = !DILocation(line: 650, column: 90, scope: !1144)
!1149 = !DILocation(line: 650, column: 6, scope: !1144)
!1150 = !DILocation(line: 651, column: 10, scope: !1144)
!1151 = !DILocation(line: 652, column: 6, scope: !1144)
!1152 = distinct !{!1152, !1080, !1153}
!1153 = !DILocation(line: 654, column: 4, scope: !1078)
!1154 = !DILocation(line: 655, column: 3, scope: !1078)
!1155 = !DILocation(line: 656, column: 20, scope: !1069)
!1156 = !DILocation(line: 656, column: 3, scope: !1069)
!1157 = !DILocation(line: 658, column: 3, scope: !1069)
!1158 = !DILocation(line: 659, column: 2, scope: !1069)
!1159 = !DILocation(line: 660, column: 9, scope: !1027)
!1160 = !DILocation(line: 660, column: 2, scope: !1027)
!1161 = distinct !DISubprogram(name: "sqlite_del_secret", scope: !58, file: !58, line: 663, type: !421, scopeLine: 664, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!1162 = !DILocalVariable(name: "secret", arg: 1, scope: !1161, file: !58, line: 663, type: !407)
!1163 = !DILocation(line: 663, column: 39, scope: !1161)
!1164 = !DILocalVariable(name: "realm", arg: 2, scope: !1161, file: !58, line: 663, type: !407)
!1165 = !DILocation(line: 663, column: 56, scope: !1161)
!1166 = !DILocalVariable(name: "ret", scope: !1161, file: !58, line: 665, type: !15)
!1167 = !DILocation(line: 665, column: 6, scope: !1161)
!1168 = !DILocation(line: 666, column: 32, scope: !1161)
!1169 = !DILocalVariable(name: "statement", scope: !1161, file: !58, line: 667, type: !617)
!1170 = !DILocation(line: 667, column: 7, scope: !1161)
!1171 = !DILocalVariable(name: "st", scope: !1161, file: !58, line: 668, type: !622)
!1172 = !DILocation(line: 668, column: 16, scope: !1161)
!1173 = !DILocalVariable(name: "rc", scope: !1161, file: !58, line: 669, type: !15)
!1174 = !DILocation(line: 669, column: 6, scope: !1161)
!1175 = !DILocalVariable(name: "sqliteconnection", scope: !1161, file: !58, line: 671, type: !36)
!1176 = !DILocation(line: 671, column: 11, scope: !1161)
!1177 = !DILocation(line: 671, column: 30, scope: !1161)
!1178 = !DILocation(line: 672, column: 6, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1161, file: !58, line: 672, column: 6)
!1180 = !DILocation(line: 672, column: 6, scope: !1161)
!1181 = !DILocation(line: 673, column: 7, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !58, line: 673, column: 6)
!1183 = distinct !DILexicalBlock(scope: !1179, file: !58, line: 672, column: 24)
!1184 = !DILocation(line: 673, column: 14, scope: !1182)
!1185 = !DILocation(line: 673, column: 18, scope: !1182)
!1186 = !DILocation(line: 673, column: 27, scope: !1182)
!1187 = !DILocation(line: 673, column: 6, scope: !1183)
!1188 = !DILocation(line: 674, column: 14, scope: !1182)
!1189 = !DILocation(line: 674, column: 85, scope: !1182)
!1190 = !DILocation(line: 674, column: 5, scope: !1182)
!1191 = !DILocation(line: 676, column: 14, scope: !1182)
!1192 = !DILocation(line: 676, column: 100, scope: !1182)
!1193 = !DILocation(line: 676, column: 107, scope: !1182)
!1194 = !DILocation(line: 676, column: 5, scope: !1182)
!1195 = !DILocation(line: 678, column: 3, scope: !1183)
!1196 = !DILocation(line: 680, column: 29, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1183, file: !58, line: 680, column: 7)
!1198 = !DILocation(line: 680, column: 47, scope: !1197)
!1199 = !DILocation(line: 680, column: 13, scope: !1197)
!1200 = !DILocation(line: 680, column: 11, scope: !1197)
!1201 = !DILocation(line: 680, column: 71, scope: !1197)
!1202 = !DILocation(line: 680, column: 7, scope: !1183)
!1203 = !DILocation(line: 681, column: 17, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1197, file: !58, line: 680, column: 85)
!1205 = !DILocation(line: 681, column: 4, scope: !1204)
!1206 = !DILocation(line: 682, column: 8, scope: !1204)
!1207 = !DILocation(line: 683, column: 3, scope: !1204)
!1208 = !DILocalVariable(name: "errmsg", scope: !1209, file: !58, line: 684, type: !33)
!1209 = distinct !DILexicalBlock(scope: !1197, file: !58, line: 683, column: 10)
!1210 = !DILocation(line: 684, column: 16, scope: !1209)
!1211 = !DILocation(line: 684, column: 40, scope: !1209)
!1212 = !DILocation(line: 684, column: 25, scope: !1209)
!1213 = !DILocation(line: 685, column: 88, scope: !1209)
!1214 = !DILocation(line: 685, column: 4, scope: !1209)
!1215 = !DILocation(line: 687, column: 20, scope: !1183)
!1216 = !DILocation(line: 687, column: 3, scope: !1183)
!1217 = !DILocation(line: 689, column: 3, scope: !1183)
!1218 = !DILocation(line: 690, column: 2, scope: !1183)
!1219 = !DILocation(line: 691, column: 9, scope: !1161)
!1220 = !DILocation(line: 691, column: 2, scope: !1161)
!1221 = distinct !DISubprogram(name: "sqlite_set_secret", scope: !58, file: !58, line: 694, type: !421, scopeLine: 695, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!1222 = !DILocalVariable(name: "secret", arg: 1, scope: !1221, file: !58, line: 694, type: !407)
!1223 = !DILocation(line: 694, column: 39, scope: !1221)
!1224 = !DILocalVariable(name: "realm", arg: 2, scope: !1221, file: !58, line: 694, type: !407)
!1225 = !DILocation(line: 694, column: 56, scope: !1221)
!1226 = !DILocalVariable(name: "ret", scope: !1221, file: !58, line: 696, type: !15)
!1227 = !DILocation(line: 696, column: 6, scope: !1221)
!1228 = !DILocation(line: 697, column: 33, scope: !1221)
!1229 = !DILocalVariable(name: "statement", scope: !1221, file: !58, line: 698, type: !617)
!1230 = !DILocation(line: 698, column: 7, scope: !1221)
!1231 = !DILocalVariable(name: "st", scope: !1221, file: !58, line: 699, type: !622)
!1232 = !DILocation(line: 699, column: 16, scope: !1221)
!1233 = !DILocalVariable(name: "rc", scope: !1221, file: !58, line: 700, type: !15)
!1234 = !DILocation(line: 700, column: 6, scope: !1221)
!1235 = !DILocalVariable(name: "sqliteconnection", scope: !1221, file: !58, line: 702, type: !36)
!1236 = !DILocation(line: 702, column: 11, scope: !1221)
!1237 = !DILocation(line: 702, column: 30, scope: !1221)
!1238 = !DILocation(line: 703, column: 6, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1221, file: !58, line: 703, column: 6)
!1240 = !DILocation(line: 703, column: 6, scope: !1221)
!1241 = !DILocation(line: 705, column: 13, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1239, file: !58, line: 703, column: 24)
!1243 = !DILocation(line: 705, column: 110, scope: !1242)
!1244 = !DILocation(line: 705, column: 116, scope: !1242)
!1245 = !DILocation(line: 705, column: 4, scope: !1242)
!1246 = !DILocation(line: 707, column: 4, scope: !1242)
!1247 = !DILocation(line: 709, column: 30, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1242, file: !58, line: 709, column: 8)
!1249 = !DILocation(line: 709, column: 48, scope: !1248)
!1250 = !DILocation(line: 709, column: 14, scope: !1248)
!1251 = !DILocation(line: 709, column: 12, scope: !1248)
!1252 = !DILocation(line: 709, column: 72, scope: !1248)
!1253 = !DILocation(line: 709, column: 8, scope: !1242)
!1254 = !DILocation(line: 710, column: 17, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1248, file: !58, line: 709, column: 86)
!1256 = !DILocation(line: 710, column: 4, scope: !1255)
!1257 = !DILocation(line: 711, column: 8, scope: !1255)
!1258 = !DILocation(line: 712, column: 3, scope: !1255)
!1259 = !DILocalVariable(name: "errmsg", scope: !1260, file: !58, line: 713, type: !33)
!1260 = distinct !DILexicalBlock(scope: !1248, file: !58, line: 712, column: 10)
!1261 = !DILocation(line: 713, column: 16, scope: !1260)
!1262 = !DILocation(line: 713, column: 40, scope: !1260)
!1263 = !DILocation(line: 713, column: 25, scope: !1260)
!1264 = !DILocation(line: 714, column: 88, scope: !1260)
!1265 = !DILocation(line: 714, column: 4, scope: !1260)
!1266 = !DILocation(line: 716, column: 20, scope: !1242)
!1267 = !DILocation(line: 716, column: 3, scope: !1242)
!1268 = !DILocation(line: 718, column: 3, scope: !1242)
!1269 = !DILocation(line: 719, column: 2, scope: !1242)
!1270 = !DILocation(line: 720, column: 9, scope: !1221)
!1271 = !DILocation(line: 720, column: 2, scope: !1221)
!1272 = distinct !DISubprogram(name: "sqlite_add_origin", scope: !58, file: !58, line: 723, type: !421, scopeLine: 724, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!1273 = !DILocalVariable(name: "origin", arg: 1, scope: !1272, file: !58, line: 723, type: !407)
!1274 = !DILocation(line: 723, column: 39, scope: !1272)
!1275 = !DILocalVariable(name: "realm", arg: 2, scope: !1272, file: !58, line: 723, type: !407)
!1276 = !DILocation(line: 723, column: 56, scope: !1272)
!1277 = !DILocalVariable(name: "ret", scope: !1272, file: !58, line: 725, type: !15)
!1278 = !DILocation(line: 725, column: 6, scope: !1272)
!1279 = !DILocalVariable(name: "statement", scope: !1272, file: !58, line: 726, type: !617)
!1280 = !DILocation(line: 726, column: 7, scope: !1272)
!1281 = !DILocalVariable(name: "st", scope: !1272, file: !58, line: 727, type: !622)
!1282 = !DILocation(line: 727, column: 16, scope: !1272)
!1283 = !DILocalVariable(name: "rc", scope: !1272, file: !58, line: 728, type: !15)
!1284 = !DILocation(line: 728, column: 6, scope: !1272)
!1285 = !DILocation(line: 729, column: 32, scope: !1272)
!1286 = !DILocalVariable(name: "sqliteconnection", scope: !1272, file: !58, line: 731, type: !36)
!1287 = !DILocation(line: 731, column: 11, scope: !1272)
!1288 = !DILocation(line: 731, column: 30, scope: !1272)
!1289 = !DILocation(line: 732, column: 5, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1272, file: !58, line: 732, column: 5)
!1291 = !DILocation(line: 732, column: 5, scope: !1272)
!1292 = !DILocation(line: 733, column: 12, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1290, file: !58, line: 732, column: 23)
!1294 = !DILocation(line: 733, column: 119, scope: !1293)
!1295 = !DILocation(line: 733, column: 126, scope: !1293)
!1296 = !DILocation(line: 733, column: 3, scope: !1293)
!1297 = !DILocation(line: 735, column: 3, scope: !1293)
!1298 = !DILocation(line: 737, column: 29, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1293, file: !58, line: 737, column: 7)
!1300 = !DILocation(line: 737, column: 47, scope: !1299)
!1301 = !DILocation(line: 737, column: 13, scope: !1299)
!1302 = !DILocation(line: 737, column: 11, scope: !1299)
!1303 = !DILocation(line: 737, column: 71, scope: !1299)
!1304 = !DILocation(line: 737, column: 7, scope: !1293)
!1305 = !DILocation(line: 738, column: 17, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1299, file: !58, line: 737, column: 85)
!1307 = !DILocation(line: 738, column: 4, scope: !1306)
!1308 = !DILocation(line: 739, column: 8, scope: !1306)
!1309 = !DILocation(line: 740, column: 3, scope: !1306)
!1310 = !DILocalVariable(name: "errmsg", scope: !1311, file: !58, line: 741, type: !33)
!1311 = distinct !DILexicalBlock(scope: !1299, file: !58, line: 740, column: 10)
!1312 = !DILocation(line: 741, column: 16, scope: !1311)
!1313 = !DILocation(line: 741, column: 40, scope: !1311)
!1314 = !DILocation(line: 741, column: 25, scope: !1311)
!1315 = !DILocation(line: 742, column: 88, scope: !1311)
!1316 = !DILocation(line: 742, column: 4, scope: !1311)
!1317 = !DILocation(line: 744, column: 20, scope: !1293)
!1318 = !DILocation(line: 744, column: 3, scope: !1293)
!1319 = !DILocation(line: 746, column: 3, scope: !1293)
!1320 = !DILocation(line: 747, column: 2, scope: !1293)
!1321 = !DILocation(line: 748, column: 9, scope: !1272)
!1322 = !DILocation(line: 748, column: 2, scope: !1272)
!1323 = distinct !DISubprogram(name: "sqlite_del_origin", scope: !58, file: !58, line: 751, type: !433, scopeLine: 752, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!1324 = !DILocalVariable(name: "origin", arg: 1, scope: !1323, file: !58, line: 751, type: !407)
!1325 = !DILocation(line: 751, column: 39, scope: !1323)
!1326 = !DILocalVariable(name: "ret", scope: !1323, file: !58, line: 753, type: !15)
!1327 = !DILocation(line: 753, column: 6, scope: !1323)
!1328 = !DILocalVariable(name: "statement", scope: !1323, file: !58, line: 754, type: !617)
!1329 = !DILocation(line: 754, column: 7, scope: !1323)
!1330 = !DILocalVariable(name: "st", scope: !1323, file: !58, line: 755, type: !622)
!1331 = !DILocation(line: 755, column: 16, scope: !1323)
!1332 = !DILocalVariable(name: "rc", scope: !1323, file: !58, line: 756, type: !15)
!1333 = !DILocation(line: 756, column: 6, scope: !1323)
!1334 = !DILocation(line: 757, column: 32, scope: !1323)
!1335 = !DILocalVariable(name: "sqliteconnection", scope: !1323, file: !58, line: 759, type: !36)
!1336 = !DILocation(line: 759, column: 11, scope: !1323)
!1337 = !DILocation(line: 759, column: 30, scope: !1323)
!1338 = !DILocation(line: 760, column: 5, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1323, file: !58, line: 760, column: 5)
!1340 = !DILocation(line: 760, column: 5, scope: !1323)
!1341 = !DILocation(line: 761, column: 12, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1339, file: !58, line: 760, column: 23)
!1343 = !DILocation(line: 761, column: 93, scope: !1342)
!1344 = !DILocation(line: 761, column: 3, scope: !1342)
!1345 = !DILocation(line: 763, column: 3, scope: !1342)
!1346 = !DILocation(line: 765, column: 29, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1342, file: !58, line: 765, column: 7)
!1348 = !DILocation(line: 765, column: 47, scope: !1347)
!1349 = !DILocation(line: 765, column: 13, scope: !1347)
!1350 = !DILocation(line: 765, column: 11, scope: !1347)
!1351 = !DILocation(line: 765, column: 71, scope: !1347)
!1352 = !DILocation(line: 765, column: 7, scope: !1342)
!1353 = !DILocation(line: 766, column: 17, scope: !1354)
!1354 = distinct !DILexicalBlock(scope: !1347, file: !58, line: 765, column: 85)
!1355 = !DILocation(line: 766, column: 4, scope: !1354)
!1356 = !DILocation(line: 767, column: 8, scope: !1354)
!1357 = !DILocation(line: 768, column: 3, scope: !1354)
!1358 = !DILocalVariable(name: "errmsg", scope: !1359, file: !58, line: 769, type: !33)
!1359 = distinct !DILexicalBlock(scope: !1347, file: !58, line: 768, column: 10)
!1360 = !DILocation(line: 769, column: 16, scope: !1359)
!1361 = !DILocation(line: 769, column: 40, scope: !1359)
!1362 = !DILocation(line: 769, column: 25, scope: !1359)
!1363 = !DILocation(line: 770, column: 88, scope: !1359)
!1364 = !DILocation(line: 770, column: 4, scope: !1359)
!1365 = !DILocation(line: 772, column: 20, scope: !1342)
!1366 = !DILocation(line: 772, column: 3, scope: !1342)
!1367 = !DILocation(line: 774, column: 3, scope: !1342)
!1368 = !DILocation(line: 775, column: 2, scope: !1342)
!1369 = !DILocation(line: 776, column: 9, scope: !1323)
!1370 = !DILocation(line: 776, column: 2, scope: !1323)
!1371 = distinct !DISubprogram(name: "sqlite_list_origins", scope: !58, file: !58, line: 779, type: !425, scopeLine: 780, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !600)
!1372 = !DILocalVariable(name: "realm", arg: 1, scope: !1371, file: !58, line: 779, type: !407)
!1373 = !DILocation(line: 779, column: 41, scope: !1371)
!1374 = !DILocalVariable(name: "origins", arg: 2, scope: !1371, file: !58, line: 779, type: !398)
!1375 = !DILocation(line: 779, column: 64, scope: !1371)
!1376 = !DILocalVariable(name: "realms", arg: 3, scope: !1371, file: !58, line: 779, type: !398)
!1377 = !DILocation(line: 779, column: 89, scope: !1371)
!1378 = !DILocalVariable(name: "ret", scope: !1371, file: !58, line: 781, type: !15)
!1379 = !DILocation(line: 781, column: 6, scope: !1371)
!1380 = !DILocalVariable(name: "realm0", scope: !1371, file: !58, line: 783, type: !907)
!1381 = !DILocation(line: 783, column: 10, scope: !1371)
!1382 = !DILocation(line: 784, column: 6, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1371, file: !58, line: 784, column: 5)
!1384 = !DILocation(line: 784, column: 5, scope: !1371)
!1385 = !DILocation(line: 784, column: 19, scope: !1383)
!1386 = !DILocation(line: 784, column: 18, scope: !1383)
!1387 = !DILocation(line: 784, column: 13, scope: !1383)
!1388 = !DILocation(line: 786, column: 33, scope: !1371)
!1389 = !DILocalVariable(name: "st", scope: !1371, file: !58, line: 788, type: !622)
!1390 = !DILocation(line: 788, column: 16, scope: !1371)
!1391 = !DILocalVariable(name: "rc", scope: !1371, file: !58, line: 789, type: !15)
!1392 = !DILocation(line: 789, column: 6, scope: !1371)
!1393 = !DILocalVariable(name: "sqliteconnection", scope: !1371, file: !58, line: 791, type: !36)
!1394 = !DILocation(line: 791, column: 11, scope: !1371)
!1395 = !DILocation(line: 791, column: 30, scope: !1371)
!1396 = !DILocation(line: 792, column: 6, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1371, file: !58, line: 792, column: 6)
!1398 = !DILocation(line: 792, column: 6, scope: !1371)
!1399 = !DILocalVariable(name: "statement", scope: !1400, file: !58, line: 793, type: !617)
!1400 = distinct !DILexicalBlock(scope: !1397, file: !58, line: 792, column: 24)
!1401 = !DILocation(line: 793, column: 8, scope: !1400)
!1402 = !DILocation(line: 794, column: 7, scope: !1403)
!1403 = distinct !DILexicalBlock(scope: !1400, file: !58, line: 794, column: 7)
!1404 = !DILocation(line: 794, column: 13, scope: !1403)
!1405 = !DILocation(line: 794, column: 16, scope: !1403)
!1406 = !DILocation(line: 794, column: 7, scope: !1400)
!1407 = !DILocation(line: 795, column: 13, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1403, file: !58, line: 794, column: 26)
!1409 = !DILocation(line: 795, column: 125, scope: !1408)
!1410 = !DILocation(line: 795, column: 4, scope: !1408)
!1411 = !DILocation(line: 796, column: 3, scope: !1408)
!1412 = !DILocation(line: 797, column: 13, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1403, file: !58, line: 796, column: 10)
!1414 = !DILocation(line: 797, column: 4, scope: !1413)
!1415 = !DILocation(line: 800, column: 3, scope: !1400)
!1416 = !DILocation(line: 802, column: 29, scope: !1417)
!1417 = distinct !DILexicalBlock(scope: !1400, file: !58, line: 802, column: 7)
!1418 = !DILocation(line: 802, column: 47, scope: !1417)
!1419 = !DILocation(line: 802, column: 13, scope: !1417)
!1420 = !DILocation(line: 802, column: 11, scope: !1417)
!1421 = !DILocation(line: 802, column: 71, scope: !1417)
!1422 = !DILocation(line: 802, column: 7, scope: !1400)
!1423 = !DILocation(line: 804, column: 8, scope: !1424)
!1424 = distinct !DILexicalBlock(scope: !1417, file: !58, line: 802, column: 85)
!1425 = !DILocation(line: 805, column: 4, scope: !1424)
!1426 = !DILocalVariable(name: "res", scope: !1427, file: !58, line: 806, type: !15)
!1427 = distinct !DILexicalBlock(scope: !1424, file: !58, line: 805, column: 14)
!1428 = !DILocation(line: 806, column: 9, scope: !1427)
!1429 = !DILocation(line: 806, column: 28, scope: !1427)
!1430 = !DILocation(line: 806, column: 15, scope: !1427)
!1431 = !DILocation(line: 807, column: 9, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1427, file: !58, line: 807, column: 9)
!1433 = !DILocation(line: 807, column: 13, scope: !1432)
!1434 = !DILocation(line: 807, column: 9, scope: !1427)
!1435 = !DILocalVariable(name: "kval", scope: !1436, file: !58, line: 809, type: !33)
!1436 = distinct !DILexicalBlock(scope: !1432, file: !58, line: 807, column: 28)
!1437 = !DILocation(line: 809, column: 18, scope: !1436)
!1438 = !DILocation(line: 809, column: 59, scope: !1436)
!1439 = !DILocation(line: 809, column: 39, scope: !1436)
!1440 = !DILocalVariable(name: "rval", scope: !1436, file: !58, line: 810, type: !33)
!1441 = !DILocation(line: 810, column: 18, scope: !1436)
!1442 = !DILocation(line: 810, column: 59, scope: !1436)
!1443 = !DILocation(line: 810, column: 39, scope: !1436)
!1444 = !DILocation(line: 812, column: 9, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1436, file: !58, line: 812, column: 9)
!1446 = !DILocation(line: 812, column: 9, scope: !1436)
!1447 = !DILocation(line: 813, column: 27, scope: !1448)
!1448 = distinct !DILexicalBlock(scope: !1445, file: !58, line: 812, column: 18)
!1449 = !DILocation(line: 813, column: 35, scope: !1448)
!1450 = !DILocation(line: 813, column: 7, scope: !1448)
!1451 = !DILocation(line: 814, column: 10, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1448, file: !58, line: 814, column: 10)
!1453 = !DILocation(line: 814, column: 10, scope: !1448)
!1454 = !DILocation(line: 815, column: 11, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1456, file: !58, line: 815, column: 11)
!1456 = distinct !DILexicalBlock(scope: !1452, file: !58, line: 814, column: 18)
!1457 = !DILocation(line: 815, column: 16, scope: !1455)
!1458 = !DILocation(line: 815, column: 20, scope: !1455)
