; ModuleID = './src/transports/ipc/aipc.c'
source_filename = "./src/transports/ipc/aipc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nn_aipc = type { %struct.nn_fsm, i32, %struct.nn_usock, ptr, %struct.nn_fsm_owner, %struct.nn_sipc, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_list_item }
%struct.nn_fsm = type { ptr, i32, i32, ptr, ptr, ptr, %struct.nn_fsm_event }
%struct.nn_usock = type { %struct.nn_fsm, i32, ptr, i32, %struct.nn_worker_fd, %struct.anon, %struct.anon.0, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_worker_task, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, %struct.nn_fsm_event, ptr }
%struct.nn_worker_fd = type { ptr, %struct.nn_poller_hndl }
%struct.nn_poller_hndl = type { i32 }
%struct.anon = type { ptr, i64, ptr, i64, i64 }
%struct.anon.0 = type { %struct.msghdr, [3 x %struct.iovec] }
%struct.msghdr = type { ptr, i32, ptr, i64, ptr, i64, i32 }
%struct.iovec = type { ptr, i64 }
%struct.nn_worker_task = type { ptr, %struct.nn_queue_item }
%struct.nn_queue_item = type { ptr }
%struct.nn_fsm_owner = type { i32, ptr }
%struct.nn_sipc = type { %struct.nn_fsm, i32, ptr, %struct.nn_streamhdr, %struct.nn_fsm_owner, %struct.nn_pipebase, i32, [9 x i8], %struct.nn_msg, i32, [9 x i8], %struct.nn_msg, %struct.nn_fsm_event }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "./src/transports/ipc/aipc.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "106d58cc4c17654080de296b0a0a6267")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 30)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 34)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 28)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 25)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 2)
!27 = distinct !DICompileUnit(language: DW_LANG_C11, file: !28, producer: "clang version 16.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !356, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "src/transports/ipc/aipc.c", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "106d58cc4c17654080de296b0a0a6267")
!29 = !{!30, !355}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_aipc", file: !32, line: 46, size: 12928, elements: !33)
!32 = !DIFile(filename: "./src/transports/ipc/aipc.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fade8dd90daf78b2e059775b2affb261")
!33 = !{!34, !66, !67, !255, !256, !261, !352, !353, !354}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !31, file: !32, line: 49, baseType: !35, size: 640)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm", file: !36, line: 66, size: 640, elements: !37)
!36 = !DIFile(filename: "src/aio/fsm.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ac09c7fbcc685fa852831b867c0bcf1a")
!37 = !{!38, !46, !47, !48, !49, !50, !53}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !35, file: !36, line: 67, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_fsm_fn", file: !36, line: 58, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43, !44, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !35, file: !36, line: 68, baseType: !44, size: 32, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !35, file: !36, line: 69, baseType: !44, size: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !35, file: !36, line: 70, baseType: !45, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !35, file: !36, line: 71, baseType: !43, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !35, file: !36, line: 72, baseType: !51, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ctx", file: !36, line: 30, flags: DIFlagFwdDecl)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !35, file: !36, line: 73, baseType: !54, size: 320, offset: 320)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_event", file: !36, line: 34, size: 320, elements: !55)
!55 = !{!56, !57, !58, !59, !60}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !54, file: !36, line: 35, baseType: !43, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !54, file: !36, line: 36, baseType: !44, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "srcptr", scope: !54, file: !36, line: 37, baseType: !45, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !36, line: 38, baseType: !44, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !54, file: !36, line: 39, baseType: !61, size: 64, offset: 256)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue_item", file: !62, line: 33, size: 64, elements: !63)
!62 = !DIFile(filename: "src/aio/../utils/queue.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "caacb10382cb7490d9578205cd63745e")
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !62, line: 34, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !31, file: !32, line: 50, baseType: !44, size: 32, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !31, file: !32, line: 53, baseType: !68, size: 4224, offset: 704)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_usock", file: !69, line: 29, size: 4224, elements: !70)
!69 = !DIFile(filename: "src/aio/usock_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "31b785bc46a858e5ba003f912abaeac8")
!70 = !{!71, !72, !73, !193, !194, !199, !213, !239, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !68, file: !69, line: 32, baseType: !35, size: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !68, file: !69, line: 33, baseType: !44, size: 32, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !68, file: !69, line: 36, baseType: !74, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker", file: !76, line: 53, size: 1408, elements: !77)
!76 = !DIFile(filename: "src/aio/worker_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "fa8a45294d4b5fad11057b21636a83f1")
!77 = !{!78, !114, !119, !120, !126, !153, !154, !180}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !75, file: !76, line: 54, baseType: !79, size: 320)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_mutex", file: !80, line: 32, size: 320, elements: !81)
!80 = !DIFile(filename: "src/aio/../utils/mutex.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "ab0c52cd45f66eb2dc338be2fc47cd53")
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !79, file: !80, line: 36, baseType: !83, size: 320)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !84, line: 72, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "", checksumkind: CSK_MD5, checksum: "735e3bf264ff9d8f5d95898b1692fbdb")
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !84, line: 67, size: 320, elements: !86)
!86 = !{!87, !108, !112}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !85, file: !84, line: 69, baseType: !88, size: 320)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !89, line: 22, size: 320, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "", checksumkind: CSK_MD5, checksum: "584baedd80e6041b81caae7f496091c0")
!90 = !{!91, !92, !94, !95, !96, !97, !99, !100}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !88, file: !89, line: 24, baseType: !44, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !88, file: !89, line: 25, baseType: !93, size: 32, offset: 32)
!93 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !88, file: !89, line: 26, baseType: !44, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !88, file: !89, line: 28, baseType: !93, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !88, file: !89, line: 32, baseType: !44, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !88, file: !89, line: 34, baseType: !98, size: 16, offset: 160)
!98 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !88, file: !89, line: 35, baseType: !98, size: 16, offset: 176)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !88, file: !89, line: 36, baseType: !101, size: 128, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !102, line: 55, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "", checksumkind: CSK_MD5, checksum: "04c81e86d34dad9c99ad006d32e47a0d")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !102, line: 51, size: 128, elements: !104)
!104 = !{!105, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !103, file: !102, line: 53, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !103, file: !102, line: 54, baseType: !106, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !85, file: !84, line: 70, baseType: !109, size: 320)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 40)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !85, file: !84, line: 71, baseType: !113, size: 64)
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !75, file: !76, line: 55, baseType: !115, size: 128, offset: 320)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_queue", file: !62, line: 37, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !62, line: 38, baseType: !65, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !115, file: !62, line: 39, baseType: !65, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !75, file: !76, line: 56, baseType: !61, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "efd", scope: !75, file: !76, line: 57, baseType: !121, size: 64, offset: 512)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_efd", file: !122, line: 25, size: 64, elements: !123)
!122 = !DIFile(filename: "src/aio/../utils/efd_pipe.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "1c08f4b50eadadd7c2f017e0160a8607")
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !121, file: !122, line: 26, baseType: !44, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !121, file: !122, line: 27, baseType: !44, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !75, file: !76, line: 58, baseType: !127, size: 320, offset: 576)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller", file: !128, line: 31, size: 320, elements: !129)
!128 = !DIFile(filename: "src/aio/poller_poll.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "8331c67183aee395093a221094b46a77")
!129 = !{!130, !131, !132, !133, !141, !152}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !127, file: !128, line: 34, baseType: !44, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !127, file: !128, line: 37, baseType: !44, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !127, file: !128, line: 40, baseType: !44, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pollset", scope: !127, file: !128, line: 43, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !136, line: 36, size: 64, elements: !137)
!136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "", checksumkind: CSK_MD5, checksum: "8fae87e980509ab4e228a56ef7f0a295")
!137 = !{!138, !139, !140}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !135, file: !136, line: 38, baseType: !44, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !135, file: !136, line: 39, baseType: !98, size: 16, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !135, file: !136, line: 40, baseType: !98, size: 16, offset: 48)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "hndls", scope: !127, file: !128, line: 52, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_hndls_item", file: !128, line: 48, size: 128, elements: !144)
!144 = !{!145, !150, !151}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !143, file: !128, line: 49, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_poller_hndl", file: !128, line: 27, size: 32, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !147, file: !128, line: 28, baseType: !44, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !143, file: !128, line: 50, baseType: !44, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !128, line: 51, baseType: !44, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !127, file: !128, line: 55, baseType: !44, size: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "efd_hndl", scope: !75, file: !76, line: 59, baseType: !147, size: 32, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "timerset", scope: !75, file: !76, line: 60, baseType: !155, size: 256, offset: 960)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset", file: !156, line: 37, size: 256, elements: !157)
!156 = !DIFile(filename: "src/aio/timerset.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "52e8c17e3b1e67716e0e1d199e372b86")
!157 = !{!158, !169}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !155, file: !156, line: 38, baseType: !159, size: 128)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_clock", file: !160, line: 31, size: 128, elements: !161)
!160 = !DIFile(filename: "src/aio/../utils/clock.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "3b1dd450fb044b73356270322fc96dfd")
!161 = !{!162, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "last_tsc", scope: !159, file: !160, line: 33, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !164, line: 27, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !166, line: 45, baseType: !167)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!167 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !159, file: !160, line: 34, baseType: !163, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "timeouts", scope: !155, file: !156, line: 39, baseType: !170, size: 128, offset: 128)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list", file: !171, line: 31, size: 128, elements: !172)
!171 = !DIFile(filename: "src/utils/list.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "54c9ac337e41c4f709e57b7be8c51978")
!172 = !{!173, !179}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !170, file: !171, line: 32, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_list_item", file: !171, line: 26, size: 128, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !171, line: 27, baseType: !174, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !175, file: !171, line: 28, baseType: !174, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !170, file: !171, line: 33, baseType: !174, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !75, file: !76, line: 61, baseType: !181, size: 192, offset: 1216)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_thread", file: !182, line: 25, size: 192, elements: !183)
!182 = !DIFile(filename: "src/aio/../utils/thread_posix.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "a50c09fdec8abf14a2a4c221d123dfb2")
!183 = !{!184, !190, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "routine", scope: !181, file: !182, line: 27, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "nn_thread_routine", file: !187, line: 28, baseType: !188)
!187 = !DIFile(filename: "src/aio/../utils/thread.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "90314d20f13144524299a0a943222bab")
!188 = !DISubroutineType(types: !189)
!189 = !{null, !45}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !181, file: !182, line: 28, baseType: !45, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !181, file: !182, line: 29, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !84, line: 27, baseType: !167)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !68, file: !69, line: 39, baseType: !44, size: 32, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "wfd", scope: !68, file: !69, line: 40, baseType: !195, size: 128, offset: 832)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_fd", file: !76, line: 40, size: 128, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !195, file: !76, line: 41, baseType: !43, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !195, file: !76, line: 42, baseType: !147, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !68, file: !69, line: 59, baseType: !200, size: 320, offset: 960)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !69, line: 43, size: 320, elements: !201)
!201 = !{!202, !207, !210, !211, !212}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !200, file: !69, line: 46, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !164, line: 24, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !166, line: 38, baseType: !206)
!206 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !200, file: !69, line: 47, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !209, line: 46, baseType: !167)
!209 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !200, file: !69, line: 50, baseType: !203, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "batch_len", scope: !200, file: !69, line: 53, baseType: !208, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "batch_pos", scope: !200, file: !69, line: 58, baseType: !208, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !68, file: !69, line: 69, baseType: !214, size: 832, offset: 1280)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !69, line: 62, size: 832, elements: !215)
!215 = !{!216, !235}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !214, file: !69, line: 65, baseType: !217, size: 448)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !218, line: 259, size: 448, elements: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!219 = !{!220, !221, !224, !231, !232, !233, !234}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !217, file: !218, line: 261, baseType: !45, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !217, file: !218, line: 262, baseType: !222, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !218, line: 33, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !166, line: 210, baseType: !93)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !217, file: !218, line: 264, baseType: !225, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !227, line: 26, size: 128, elements: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !226, file: !227, line: 28, baseType: !45, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !226, file: !227, line: 29, baseType: !208, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !217, file: !218, line: 265, baseType: !208, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !217, file: !218, line: 267, baseType: !45, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !217, file: !218, line: 268, baseType: !208, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !217, file: !218, line: 273, baseType: !44, size: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !214, file: !69, line: 68, baseType: !236, size: 384, offset: 448)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 384, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "task_connecting", scope: !68, file: !69, line: 72, baseType: !240, size: 128, offset: 2112)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_task", file: !76, line: 48, size: 128, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !240, file: !76, line: 49, baseType: !43, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !240, file: !76, line: 50, baseType: !61, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "task_connected", scope: !68, file: !69, line: 73, baseType: !240, size: 128, offset: 2240)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "task_accept", scope: !68, file: !69, line: 74, baseType: !240, size: 128, offset: 2368)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "task_send", scope: !68, file: !69, line: 75, baseType: !240, size: 128, offset: 2496)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "task_recv", scope: !68, file: !69, line: 76, baseType: !240, size: 128, offset: 2624)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "task_stop", scope: !68, file: !69, line: 77, baseType: !240, size: 128, offset: 2752)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "event_established", scope: !68, file: !69, line: 80, baseType: !54, size: 320, offset: 2880)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "event_sent", scope: !68, file: !69, line: 81, baseType: !54, size: 320, offset: 3200)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "event_received", scope: !68, file: !69, line: 82, baseType: !54, size: 320, offset: 3520)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "event_error", scope: !68, file: !69, line: 83, baseType: !54, size: 320, offset: 3840)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "asock", scope: !68, file: !69, line: 87, baseType: !254, size: 64, offset: 4160)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !31, file: !32, line: 56, baseType: !254, size: 64, offset: 4928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "listener_owner", scope: !31, file: !32, line: 57, baseType: !257, size: 128, offset: 4992)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_fsm_owner", file: !36, line: 61, size: 128, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !257, file: !36, line: 62, baseType: !44, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !257, file: !36, line: 63, baseType: !43, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sipc", scope: !31, file: !32, line: 60, baseType: !262, size: 7040, offset: 5120)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sipc", file: !263, line: 43, size: 7040, elements: !264)
!263 = !DIFile(filename: "./src/transports/ipc/sipc.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "c72c01549df9f1b312112846109e9bf8")
!264 = !{!265, !266, !267, !268, !340, !341, !342, !343, !347, !348, !349, !350, !351}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !262, file: !263, line: 46, baseType: !35, size: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !263, line: 47, baseType: !44, size: 32, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !262, file: !263, line: 50, baseType: !254, size: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "streamhdr", scope: !262, file: !263, line: 53, baseType: !269, size: 3008, offset: 768)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_streamhdr", file: !270, line: 41, size: 3008, elements: !271)
!270 = !DIFile(filename: "./src/transports/ipc/../utils/streamhdr.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "7d060aeed02236eba444409cfc4451d2")
!271 = !{!272, !273, !274, !295, !296, !297, !335, !339}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !269, file: !270, line: 44, baseType: !35, size: 640)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !270, line: 45, baseType: !44, size: 32, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !269, file: !270, line: 48, baseType: !275, size: 1664, offset: 704)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timer", file: !276, line: 32, size: 1664, elements: !277)
!276 = !DIFile(filename: "./src/transports/ipc/../utils/../../aio/timer.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "36b8c8892aa99fc49b85b12a9caf893a")
!277 = !{!278, !279, !280, !281, !282, !292, !293, !294}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !275, file: !276, line: 33, baseType: !35, size: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !275, file: !276, line: 34, baseType: !44, size: 32, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "start_task", scope: !275, file: !276, line: 35, baseType: !240, size: 128, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "stop_task", scope: !275, file: !276, line: 36, baseType: !240, size: 128, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "wtimer", scope: !275, file: !276, line: 37, baseType: !283, size: 256, offset: 960)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_worker_timer", file: !284, line: 37, size: 256, elements: !285)
!284 = !DIFile(filename: "src/aio/worker.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "2b691693adce9b61547df7808f294867")
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !283, file: !284, line: 38, baseType: !43, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "hndl", scope: !283, file: !284, line: 39, baseType: !288, size: 192, offset: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_timerset_hndl", file: !156, line: 32, size: 192, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !288, file: !156, line: 33, baseType: !175, size: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !288, file: !156, line: 34, baseType: !163, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !275, file: !276, line: 38, baseType: !54, size: 320, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "worker", scope: !275, file: !276, line: 39, baseType: !74, size: 64, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !275, file: !276, line: 40, baseType: !44, size: 32, offset: 1600)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "usock", scope: !269, file: !270, line: 51, baseType: !254, size: 64, offset: 2368)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "usock_owner", scope: !269, file: !270, line: 54, baseType: !257, size: 128, offset: 2432)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !269, file: !270, line: 57, baseType: !298, size: 64, offset: 2560)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase", file: !300, line: 147, size: 1536, elements: !301)
!300 = !DIFile(filename: "./src/transports/ipc/../../transport.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "cc9abeba51635c30594998f6bd55506c")
!301 = !{!302, !303, !326, !327, !328, !329, !332, !333, !334}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fsm", scope: !299, file: !300, line: 148, baseType: !35, size: 640)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !299, file: !300, line: 149, baseType: !304, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_pipebase_vfptr", file: !300, line: 134, size: 128, elements: !307)
!307 = !{!308, !325}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !306, file: !300, line: 138, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!44, !298, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_msg", file: !314, line: 30, size: 512, elements: !315)
!314 = !DIFile(filename: "src/utils/msg.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "b32a3194aed1e6732d55383f32b5e850")
!315 = !{!316, !324}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !313, file: !314, line: 33, baseType: !317, size: 256)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_chunkref", file: !318, line: 39, size: 256, elements: !319)
!318 = !DIFile(filename: "src/aio/../utils/chunkref.h", directory: "/home/raj/FineDB/lib/nanomsg", checksumkind: CSK_MD5, checksum: "bea9f00d23cbdc1ae3f7acb7d04706f5")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !317, file: !318, line: 40, baseType: !321, size: 256)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 256, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !313, file: !314, line: 36, baseType: !317, size: 256, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !306, file: !300, line: 142, baseType: !309, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !299, file: !300, line: 150, baseType: !204, size: 8, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !299, file: !300, line: 151, baseType: !204, size: 8, offset: 712)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !299, file: !300, line: 152, baseType: !204, size: 8, offset: 720)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !299, file: !300, line: 153, baseType: !330, size: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_sock", file: !300, line: 39, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !300, line: 154, baseType: !45, size: 64, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !299, file: !300, line: 155, baseType: !54, size: 320, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !299, file: !300, line: 156, baseType: !54, size: 320, offset: 1216)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "protohdr", scope: !269, file: !270, line: 60, baseType: !336, size: 64, offset: 2624)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !269, file: !270, line: 63, baseType: !54, size: 320, offset: 2688)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "usock_owner", scope: !262, file: !263, line: 56, baseType: !257, size: 128, offset: 3776)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pipebase", scope: !262, file: !263, line: 59, baseType: !299, size: 1536, offset: 3904)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "instate", scope: !262, file: !263, line: 62, baseType: !44, size: 32, offset: 5440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "inhdr", scope: !262, file: !263, line: 65, baseType: !344, size: 72, offset: 5472)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 72, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 9)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "inmsg", scope: !262, file: !263, line: 68, baseType: !313, size: 512, offset: 5544)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "outstate", scope: !262, file: !263, line: 71, baseType: !44, size: 32, offset: 6080)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "outhdr", scope: !262, file: !263, line: 74, baseType: !344, size: 72, offset: 6112)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "outmsg", scope: !262, file: !263, line: 77, baseType: !313, size: 512, offset: 6184)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !262, file: !263, line: 80, baseType: !54, size: 320, offset: 6720)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "accepted", scope: !31, file: !32, line: 63, baseType: !54, size: 320, offset: 12160)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !31, file: !32, line: 64, baseType: !54, size: 320, offset: 12480)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !31, file: !32, line: 67, baseType: !175, size: 128, offset: 12800)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!356 = !{!0, !7, !12, !17, !22}
!357 = !{i32 7, !"Dwarf Version", i32 5}
!358 = !{i32 2, !"Debug Info Version", i32 3}
!359 = !{i32 1, !"wchar_size", i32 4}
!360 = !{i32 8, !"PIC Level", i32 2}
!361 = !{i32 7, !"PIE Level", i32 2}
!362 = !{i32 7, !"uwtable", i32 2}
!363 = !{i32 7, !"frame-pointer", i32 2}
!364 = !{!"clang version 16.0.0"}
!365 = distinct !DISubprogram(name: "nn_aipc_init", scope: !2, file: !2, line: 46, type: !366, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !27, retainedNodes: !384)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !30, !44, !368, !43}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase", file: !300, line: 81, size: 128, elements: !370)
!370 = !{!371, !381}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vfptr", scope: !369, file: !300, line: 82, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nn_epbase_vfptr", file: !300, line: 70, size: 128, elements: !375)
!375 = !{!376, !380}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !374, file: !300, line: 75, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !368}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !374, file: !300, line: 78, baseType: !377, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ep", scope: !369, file: !300, line: 83, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "nn_ep", file: !300, line: 83, flags: DIFlagFwdDecl)
!384 = !{}
!385 = !DILocalVariable(name: "self", arg: 1, scope: !365, file: !2, line: 46, type: !30)
!386 = !DILocation(line: 46, column: 36, scope: !365)
!387 = !DILocalVariable(name: "src", arg: 2, scope: !365, file: !2, line: 46, type: !44)
!388 = !DILocation(line: 46, column: 46, scope: !365)
!389 = !DILocalVariable(name: "epbase", arg: 3, scope: !365, file: !2, line: 47, type: !368)
!390 = !DILocation(line: 47, column: 23, scope: !365)
!391 = !DILocalVariable(name: "owner", arg: 4, scope: !365, file: !2, line: 47, type: !43)
!392 = !DILocation(line: 47, column: 46, scope: !365)
!393 = !DILocation(line: 49, column: 19, scope: !365)
!394 = !DILocation(line: 49, column: 25, scope: !365)
!395 = !DILocation(line: 49, column: 47, scope: !365)
!396 = !DILocation(line: 49, column: 52, scope: !365)
!397 = !DILocation(line: 49, column: 58, scope: !365)
!398 = !DILocation(line: 49, column: 5, scope: !365)
!399 = !DILocation(line: 50, column: 5, scope: !365)
!400 = !DILocation(line: 50, column: 11, scope: !365)
!401 = !DILocation(line: 50, column: 17, scope: !365)
!402 = !DILocation(line: 51, column: 21, scope: !365)
!403 = !DILocation(line: 51, column: 27, scope: !365)
!404 = !DILocation(line: 51, column: 54, scope: !365)
!405 = !DILocation(line: 51, column: 60, scope: !365)
!406 = !DILocation(line: 51, column: 5, scope: !365)
!407 = !DILocation(line: 52, column: 5, scope: !365)
!408 = !DILocation(line: 52, column: 11, scope: !365)
!409 = !DILocation(line: 52, column: 20, scope: !365)
!410 = !DILocation(line: 53, column: 5, scope: !365)
!411 = !DILocation(line: 53, column: 11, scope: !365)
!412 = !DILocation(line: 53, column: 26, scope: !365)
!413 = !DILocation(line: 53, column: 30, scope: !365)
!414 = !DILocation(line: 54, column: 5, scope: !365)
!415 = !DILocation(line: 54, column: 11, scope: !365)
!416 = !DILocation(line: 54, column: 26, scope: !365)
!417 = !DILocation(line: 54, column: 30, scope: !365)
!418 = !DILocation(line: 55, column: 20, scope: !365)
!419 = !DILocation(line: 55, column: 26, scope: !365)
!420 = !DILocation(line: 55, column: 50, scope: !365)
!421 = !DILocation(line: 55, column: 59, scope: !365)
!422 = !DILocation(line: 55, column: 65, scope: !365)
!423 = !DILocation(line: 55, column: 5, scope: !365)
!424 = !DILocation(line: 56, column: 25, scope: !365)
!425 = !DILocation(line: 56, column: 31, scope: !365)
!426 = !DILocation(line: 56, column: 5, scope: !365)
!427 = !DILocation(line: 57, column: 25, scope: !365)
!428 = !DILocation(line: 57, column: 31, scope: !365)
!429 = !DILocation(line: 57, column: 5, scope: !365)
!430 = !DILocation(line: 58, column: 25, scope: !365)
!431 = !DILocation(line: 58, column: 31, scope: !365)
!432 = !DILocation(line: 58, column: 5, scope: !365)
!433 = !DILocation(line: 59, column: 1, scope: !365)
!434 = distinct !DISubprogram(name: "nn_aipc_handler", scope: !2, file: !2, line: 97, type: !41, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !27, retainedNodes: !384)
!435 = !DILocalVariable(name: "self", arg: 1, scope: !434, file: !2, line: 97, type: !43)
!436 = !DILocation(line: 97, column: 45, scope: !434)
!437 = !DILocalVariable(name: "src", arg: 2, scope: !434, file: !2, line: 97, type: !44)
!438 = !DILocation(line: 97, column: 55, scope: !434)
!439 = !DILocalVariable(name: "type", arg: 3, scope: !434, file: !2, line: 97, type: !44)
!440 = !DILocation(line: 97, column: 64, scope: !434)
!441 = !DILocalVariable(name: "srcptr", arg: 4, scope: !434, file: !2, line: 98, type: !45)
!442 = !DILocation(line: 98, column: 11, scope: !434)
!443 = !DILocalVariable(name: "aipc", scope: !434, file: !2, line: 100, type: !30)
