; ModuleID = '/home/raj/transmission/libtransmission/jsonsl.c'
source_filename = "/home/raj/transmission/libtransmission/jsonsl.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.jsonsl_st = type { i32, i32, i64, ptr, ptr, ptr, ptr, i32, ptr, i32, i32, i32, i32, i32, ptr, i32, i32, %struct.anon, ptr, i32, i8, i8, i32, i32, i64, ptr, ptr, [1 x %struct.jsonsl_state_st] }
%struct.anon = type { i32 }
%struct.jsonsl_state_st = type { i32, i32, i64, i64, i32, i64, i32, i32, ptr }
%struct.jsonsl_jpr_component_st = type { ptr, i64, i64, i32, i16 }
%struct.jsonsl_jpr_st = type { ptr, i64, i32, ptr, ptr, i64 }

@.str = private unnamed_addr constant [5 x i8] c"true\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"false\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [5 x i8] c"null\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"SUCCESS\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [17 x i8] c"GARBAGE_TRAILING\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [17 x i8] c"SPECIAL_EXPECTED\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [19 x i8] c"SPECIAL_INCOMPLETE\00", align 1, !dbg !26
@.str.7 = private unnamed_addr constant [12 x i8] c"STRAY_TOKEN\00", align 1, !dbg !31
@.str.8 = private unnamed_addr constant [14 x i8] c"MISSING_TOKEN\00", align 1, !dbg !36

!161 = !DIEnumerator(name: "JSONSL_ERROR_KEY_OUTSIDE_OBJECT", value: 8)
!162 = !DIEnumerator(name: "JSONSL_ERROR_STRING_OUTSIDE_CONTAINER", value: 9)
!163 = !DIEnumerator(name: "JSONSL_ERROR_FOUND_NULL_BYTE", value: 10)
!164 = !DIEnumerator(name: "JSONSL_ERROR_LEVELS_EXCEEDED", value: 11)
!165 = !DIEnumerator(name: "JSONSL_ERROR_BRACKET_MISMATCH", value: 12)
!166 = !DIEnumerator(name: "JSONSL_ERROR_HKEY_EXPECTED", value: 13)
!167 = !DIEnumerator(name: "JSONSL_ERROR_WEIRD_WHITESPACE", value: 14)
!168 = !DIEnumerator(name: "JSONSL_ERROR_UESCAPE_TOOSHORT", value: 15)
!169 = !DIEnumerator(name: "JSONSL_ERROR_ESCAPE_INVALID", value: 16)
!170 = !DIEnumerator(name: "JSONSL_ERROR_TRAILING_COMMA", value: 17)
!171 = !DIEnumerator(name: "JSONSL_ERROR_INVALID_NUMBER", value: 18)
!172 = !DIEnumerator(name: "JSONSL_ERROR_VALUE_EXPECTED", value: 19)
!173 = !DIEnumerator(name: "JSONSL_ERROR_PERCENT_BADHEX", value: 20)
!174 = !DIEnumerator(name: "JSONSL_ERROR_JPR_BADPATH", value: 21)
!175 = !DIEnumerator(name: "JSONSL_ERROR_JPR_DUPSLASH", value: 22)
!176 = !DIEnumerator(name: "JSONSL_ERROR_JPR_NOROOT", value: 23)
!177 = !DIEnumerator(name: "JSONSL_ERROR_ENOMEM", value: 24)
!178 = !DIEnumerator(name: "JSONSL_ERROR_INVALID_CODEPOINT", value: 25)
!179 = !DIEnumerator(name: "JSONSL_ERROR_GENERIC", value: 26)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 750, baseType: !181, size: 32, elements: !182)
!181 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!182 = !{!183, !184, !185, !186, !187, !188}
!183 = !DIEnumerator(name: "JSONSL_PATH_STRING", value: 1)
!184 = !DIEnumerator(name: "JSONSL_PATH_WILDCARD", value: 2)
!185 = !DIEnumerator(name: "JSONSL_PATH_NUMERIC", value: 3)
!186 = !DIEnumerator(name: "JSONSL_PATH_ROOT", value: 4)
!187 = !DIEnumerator(name: "JSONSL_PATH_INVALID", value: -1)
!188 = !DIEnumerator(name: "JSONSL_PATH_NONE", value: 0)
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 131, baseType: !144, size: 32, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198}
!191 = !DIEnumerator(name: "JSONSL_T_STRING", value: 16776994)
!192 = !DIEnumerator(name: "JSONSL_T_HKEY", value: 16776995)
!193 = !DIEnumerator(name: "JSONSL_T_OBJECT", value: 123)
!194 = !DIEnumerator(name: "JSONSL_T_LIST", value: 91)
!195 = !DIEnumerator(name: "JSONSL_T_SPECIAL", value: 94)
!196 = !DIEnumerator(name: "JSONSL_T_UESCAPE", value: 117)
!197 = !DIEnumerator(name: "JSONSL_T_UNKNOWN", value: 63)
!198 = !DIEnumerator(name: "JSONSL_T_ROOT", value: 0)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 159, baseType: !144, size: 32, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!201 = !DIEnumerator(name: "JSONSL_SPECIALf_NONE", value: 0)
!202 = !DIEnumerator(name: "JSONSL_SPECIALf_SIGNED", value: 1)
!203 = !DIEnumerator(name: "JSONSL_SPECIALf_UNSIGNED", value: 2)
!204 = !DIEnumerator(name: "JSONSL_SPECIALf_TRUE", value: 4)
!205 = !DIEnumerator(name: "JSONSL_SPECIALf_FALSE", value: 8)
!206 = !DIEnumerator(name: "JSONSL_SPECIALf_NULL", value: 16)
!207 = !DIEnumerator(name: "JSONSL_SPECIALf_FLOAT", value: 32)
!208 = !DIEnumerator(name: "JSONSL_SPECIALf_EXPONENT", value: 64)
!209 = !DIEnumerator(name: "JSONSL_SPECIALf_NONASCII", value: 128)
!210 = !DIEnumerator(name: "JSONSL_SPECIALf_NAN", value: 256)
!211 = !DIEnumerator(name: "JSONSL_SPECIALf_INF", value: 512)
!212 = !DIEnumerator(name: "JSONSL_SPECIALf_UNKNOWN", value: 1024)
!213 = !DIEnumerator(name: "JSONSL_SPECIALf_ZERO", value: 2050)
!214 = !DIEnumerator(name: "JSONSL_SPECIALf_DASH", value: 4096)
!215 = !DIEnumerator(name: "JSONSL_SPECIALf_POS_INF", value: 512)
!216 = !DIEnumerator(name: "JSONSL_SPECIALf_NEG_INF", value: 513)
!217 = !DIEnumerator(name: "JSONSL_SPECIALf_NUMERIC", value: 3)
!218 = !DIEnumerator(name: "JSONSL_SPECIALf_BOOLEAN", value: 12)
!219 = !DIEnumerator(name: "JSONSL_SPECIALf_NUMNOINT", value: 864)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 46, baseType: !144, size: 32, elements: !222)
!221 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!223 = !DIEnumerator(name: "_ISupper", value: 256)
!224 = !DIEnumerator(name: "_ISlower", value: 512)
!225 = !DIEnumerator(name: "_ISalpha", value: 1024)
!226 = !DIEnumerator(name: "_ISdigit", value: 2048)
!227 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!228 = !DIEnumerator(name: "_ISspace", value: 8192)
!229 = !DIEnumerator(name: "_ISprint", value: 16384)
!230 = !DIEnumerator(name: "_ISgraph", value: 32768)
!231 = !DIEnumerator(name: "_ISblank", value: 1)
!232 = !DIEnumerator(name: "_IScntrl", value: 2)
!233 = !DIEnumerator(name: "_ISpunct", value: 4)
!234 = !DIEnumerator(name: "_ISalnum", value: 8)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 740, baseType: !181, size: 32, elements: !236)
!236 = !{!237, !238, !239, !240, !241}
!237 = !DIEnumerator(name: "JSONSL_MATCH_COMPLETE", value: 1)
!238 = !DIEnumerator(name: "JSONSL_MATCH_POSSIBLE", value: 0)
!239 = !DIEnumerator(name: "JSONSL_MATCH_NOMATCH", value: -1)
!240 = !DIEnumerator(name: "JSONSL_MATCH_TYPE_MISMATCH", value: -2)
!241 = !DIEnumerator(name: "JSONSL_MATCH_UNKNOWN", value: -1)
!242 = !{!243, !144, !338, !320, !289, !181, !341, !279, !316, !312, !310, !333, !249, !342, !344, !346, !340, !348, !4}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jsonsl_st", file: !143, line: 463, size: 1728, elements: !245)
!245 = !{!246, !247, !248, !252, !256, !280, !281, !282, !283, !290, !291, !292, !293, !294, !295, !296, !297, !298, !302, !303, !304, !305, !306, !307, !308, !309, !332, !334}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !244, file: !143, line: 467, baseType: !144, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "stopfl", scope: !244, file: !143, line: 470, baseType: !144, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !244, file: !143, line: 476, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 46, baseType: !251)
!250 = !DIFile(filename: "SVF/llvm-16.0.0.obj/lib/clang/16/include/stddef.h", directory: "/home/raj", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!251 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !244, file: !143, line: 479, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_char_t", file: !143, line: 32, baseType: !4)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "action_callback_PUSH", scope: !244, file: !143, line: 482, baseType: !257, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_stack_callback", file: !143, line: 432, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261, !262, !263, !253}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_t", file: !143, line: 102, baseType: !243)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_action_t", file: !143, line: 205, baseType: !142)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jsonsl_state_st", file: !143, line: 285, size: 448, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !276, !277, !278}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !143, line: 289, baseType: !144, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "special_flags", scope: !264, file: !143, line: 292, baseType: !144, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pos_begin", scope: !264, file: !143, line: 305, baseType: !249, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pos_cur", scope: !264, file: !143, line: 309, baseType: !249, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !264, file: !143, line: 316, baseType: !144, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !264, file: !143, line: 330, baseType: !272, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !273, line: 27, baseType: !274)
!273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !275, line: 45, baseType: !251)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_callback", scope: !264, file: !143, line: 341, baseType: !181, size: 32, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nescapes", scope: !264, file: !143, line: 349, baseType: !144, size: 32, offset: 352)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !143, line: 369, baseType: !279, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "action_callback_POP", scope: !244, file: !143, line: 485, baseType: !257, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "action_callback", scope: !244, file: !143, line: 488, baseType: !257, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "max_callback_level", scope: !244, file: !143, line: 496, baseType: !144, size: 32, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "error_callback", scope: !244, file: !143, line: 499, baseType: !284, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_error_callback", file: !143, line: 457, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!181, !261, !288, !263, !289}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_error_t", file: !143, line: 272, baseType: !151)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "call_SPECIAL", scope: !244, file: !143, line: 512, baseType: !181, size: 32, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "call_OBJECT", scope: !244, file: !143, line: 513, baseType: !181, size: 32, offset: 544)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "call_LIST", scope: !244, file: !143, line: 514, baseType: !181, size: 32, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "call_STRING", scope: !244, file: !143, line: 515, baseType: !181, size: 32, offset: 608)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "call_HKEY", scope: !244, file: !143, line: 516, baseType: !181, size: 32, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "action_callback_UESCAPE", scope: !244, file: !143, line: 531, baseType: !257, size: 64, offset: 704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "call_UESCAPE", scope: !244, file: !143, line: 534, baseType: !181, size: 32, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "return_UESCAPE", scope: !244, file: !143, line: 539, baseType: !181, size: 32, offset: 800)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !244, file: !143, line: 544, baseType: !299, size: 32, offset: 832)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !244, file: !143, line: 542, size: 32, elements: !300)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "allow_trailing_comma", scope: !299, file: !143, line: 543, baseType: !181, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !143, line: 547, baseType: !279, size: 64, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "in_escape", scope: !244, file: !143, line: 551, baseType: !181, size: 32, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "expecting", scope: !244, file: !143, line: 552, baseType: !4, size: 8, offset: 992)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tok_last", scope: !244, file: !143, line: 553, baseType: !4, size: 8, offset: 1000)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "can_insert", scope: !244, file: !143, line: 554, baseType: !181, size: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "levels_max", scope: !244, file: !143, line: 555, baseType: !144, size: 32, offset: 1056)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "jpr_count", scope: !244, file: !143, line: 558, baseType: !249, size: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "jprs", scope: !244, file: !143, line: 559, baseType: !310, size: 64, offset: 1152)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_jpr_t", file: !143, line: 104, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jsonsl_jpr_st", file: !143, line: 780, size: 384, elements: !314)
!314 = !{!315, !327, !328, !329, !330, !331}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "components", scope: !313, file: !143, line: 782, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jsonsl_jpr_component_st", file: !143, line: 761, size: 256, elements: !318)
!318 = !{!319, !321, !322, !323, !325}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pstr", scope: !317, file: !143, line: 763, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !317, file: !143, line: 765, baseType: !251, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !317, file: !143, line: 767, baseType: !249, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ptype", scope: !317, file: !143, line: 769, baseType: !324, size: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_jpr_type_t", file: !143, line: 759, baseType: !180)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "is_arridx", scope: !317, file: !143, line: 774, baseType: !326, size: 16, offset: 224)
!326 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ncomponents", scope: !313, file: !143, line: 783, baseType: !249, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "match_type", scope: !313, file: !143, line: 787, baseType: !144, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "basestr", scope: !313, file: !143, line: 790, baseType: !320, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !313, file: !143, line: 793, baseType: !320, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "norig", scope: !313, file: !143, line: 794, baseType: !249, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "jpr_root", scope: !244, file: !143, line: 562, baseType: !333, size: 64, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !244, file: !143, line: 571, baseType: !335, size: 448, offset: 1280)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 448, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 1)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsonsl_uchar_t", file: !143, line: 33, baseType: !340)
!340 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!341 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !250, line: 35, baseType: !347)
!347 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !273, line: 25, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !275, line: 40, baseType: !341)
!350 = !{!0, !7, !12, !14, !19, !24, !26, !31, !36, !41, !43, !48, !50, !55, !60, !62, !64, !66, !68, !70, !75, !77, !79, !81, !83, !85, !90, !95, !100, !105, !107, !109, !111, !113, !115, !117, !119, !121, !126, !128, !130, !132, !137, !351, !356, !361, !364, !367, !369}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 795, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 2)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "Escape_Equivs", scope: !139, file: !2, line: 1607, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 2048, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 256)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "Special_Table", scope: !139, file: !2, line: 1453, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 4096, elements: !359)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "Special_Endings", scope: !139, file: !2, line: 1491, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 8192, elements: !359)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "Allowed_Whitespace", scope: !139, file: !2, line: 1523, type: !366, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "Allowed_Escapes", scope: !139, file: !2, line: 1577, type: !366, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 8192, elements: !359)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!373 = !{i32 7, !"Dwarf Version", i32 5}
!374 = !{i32 2, !"Debug Info Version", i32 3}
!375 = !{i32 1, !"wchar_size", i32 4}
!376 = !{i32 8, !"PIC Level", i32 2}
!377 = !{i32 7, !"PIE Level", i32 2}
!378 = !{i32 7, !"uwtable", i32 2}
!379 = !{i32 7, !"frame-pointer", i32 2}
!380 = !{!"clang version 16.0.0"}
!381 = distinct !DISubprogram(name: "jsonsl_dump_global_metrics", scope: !2, file: !2, line: 80, type: !382, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !139, retainedNodes: !384)
!382 = !DISubroutineType(types: !383)
!383 = !{null}
!384 = !{}
!385 = !DILocation(line: 80, column: 41, scope: !381)
